<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <div class="warning">
      <UiText preset="small" color="accent">
        Если вы не умеет воспринимать юмор, обидчивы или зависимы от мнений
        незнакомцев, пожалуйста, не читайте все что ниже.
      </UiText>

      <UiText preset="small" color="accent">
        Ненормативная лексика и сексуальные темы, оскорбление чувств всех
        причастных. Но весело и остроумно. Соблюдена авторская орфография и
        пунктуация.
      </UiText>
    </div>

    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Люркмор"
          subtitle="2 минуты"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Селютин"
          subtitle="4 минуты"
          target-content-id="tab-2"
        />

        <VariousTab
          title="Эльвира Фея"
          subtitle="2 минуты"
          target-content-id="tab-3"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText color="accent">
            <i>
              интеллектуальный сноб, мизантроп, нерд, кудере, хикки, тонкий
              тролль, эксперт с мировым именем, тру-гот, патологоанатом
            </i>
          </UiText>

          <UiText preset="large" color="role">
            Лирик с ампутированными эмоциями и духовностью, прокачанными
            интеллектом и работоспособностью. Никогда и ничем не бывает доволен.
            Мрачный, пессимистически настроенный, язвительный тип.
          </UiText>

          <UiText color="role">
            Циничный до умиления, он только и высматривает, к чему бы
            придраться. Хотя при всём его негативизме, по натуре своей человек
            очень мягкий.
          </UiText>

          <UiText>
            Фраза «А я ведь говорил!» — это про Критика. Склонность к
            критиканству вызвана перманентным недомоганием, но порция бодрящих
            пиздюлей творит с Критиками чудеса — выдёргивает их из бездны
            анальной оккупации, отчего они начинают троллить более тонко
            (особенно если Политик докажет всем, что в этом нет ничего плохого).
          </UiText>

          <UiText preset="large" color="role">
            Считает себя самым умным и искренне обижается, если кто-то не
            согласен с этим неоспоримым фактом. Патологически недоверчив.
          </UiText>

          <UiText>
            Людишек не понимает и, как следствие, игнорирует. Жопу от дивана
            отрывает только после пинков Политика. Тем не менее, обычно находит
            себе какой-то мелкий гешефт, позволяющий относительно безбедно жить
            ничего особо не делая.
          </UiText>

          <UiText>
            Тащемто, Критики считаются интеллектуальными вампирами для всех
            энергетических доноров этического склада. Есть мнение, что чуть
            менее, чем все статьи Уютненького пишут именно они. Без
            комментариев.
          </UiText>

          <UiText>
            Часто интересуется всякими ужасами типа экспериментов доктора
            Менгеле и обожает запугивать остальных своими познаниями в этой
            области. Чувство юмора либо чересчур абстрактное, либо чёрное. В
            любом случае, каждый Критик считает себя остроумным человеком, но
            порою неоправданно. Таких уважительно величают мудаками.
          </UiText>

          <UiText>
            Соционики уверяют, что Критик — коллективный социотип Кетая, Чехии,
            Финляндии, Эстонии и Армении.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">Бочка меда</UiText>
          <UiText preset="large" color="role">
            При хорошей информированности годятся в качестве детектора
            неприятностей, предохранителей для чересчур резвых товарищей и
            предупреждения последствий закона Мёрфи вообще. Предупредят,
            конечно, но если им нет гарантий выгоды в той или иной форме, сами
            вряд ли будут что-то делать.
          </UiText>
          <UiText color="role">
            И умные люди же! Причём этот ум подходит для извлечении профита в
            реальной жизни, а не только для логических построений, в отличии от
            Аналитиков.
          </UiText>
          <UiText preset="small" color="accent">Ложка дегтя</UiText>
          <UiText preset="large" color="accent">
            Могут разом убить любое хорошее настроение и убедить вас в том, что
            вы — унылое говно, ничего не стоящее.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="large" color="role">
            Скрытный алкоголик, но умный, когда трезв. Потенциальный наркоман.
          </UiText>

          <UiText>
            Боится жизни. Пытается манипулировать миром, не слезая с дивана, и
            думает, что ему это удаëтся. На самом деле видит в основном свои
            фантазии.
          </UiText>

          <UiText>
            Скептики и снобы. Могут повернуть любую беседу так, что они молодцы,
            а все остальные дураки.
          </UiText>

          <UiText preset="large" color="role">
            Величайшие в мире изобретатели причин, для того чтобы не слезать с
            дивана: за них Политики бегают.
          </UiText>

          <UiText>
            Временами впадает в пессимизм, вынимается оттуда после изрядной доли
            внушенного оптимизма с каплей коньячка.
          </UiText>

          <UiText preset="large" color="role">
            Доморощенный гений. Обладает холодным и мощным умом, неодобрительным
            взглядом и мрачным чувством юмора.
          </UiText>

          <UiText>
            Все, что делает руками получается плохо. Чему завидует — неизвестно,
            поскольку ему редко что нравится в окружающем мире.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Любит все идеологизировать. Не любит, когда его заставляют ждать.
          </UiText>

          <UiText>
            Подпольный сексуальный маньяк, его формула «три Т» (ТВ, тахта,
            тапочки).
          </UiText>

          <UiText>
            Работать с ним вместе можно только под началом какого-то сенсорика.
          </UiText>

          <UiText>
            Иначе он застраивает тебя кубиками льда времени, состоящих из долей
            секунд, умеряя пыл и энтузиазм не хуже огнетушителя.
          </UiText>

          <UiText>
            В результате дела двигаются едва-едва, по строго намеченному плану.
          </UiText>

          <UiText>
            Как начальник ужасен — зануда и педант. Интуитивный подтип к тому же
            еще и тормоз — говорит одно слово в минуту.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">Хладнокровный критикан.</UiText>

          <UiText>
            Способен оборжать любую идею и представить все как полную чушь.
            После него начинаешь сомневаться в каждом шаге.
          </UiText>

          <UiText>
            Невыносимы в споре; если встаешь им в оппозицию, немедленно
            оказываешься в куче дерьма, вываленного на тебя; в речи сквозит
            нескрываемое пренебрежение и чувство превосходства, основанное
            зачастую не на превосходстве в знаниях, а на умении завернуть
            какой-нибудь софизм или подтасовать факты так, что пока
            распутываешь, он придумывает новый ход.
          </UiText>

          <UiText>
            Готовы брюзжать по любому поводу, причем зачастую по диаметрально
            противоположным — в зависимости от сиюминутных пристрастий. И опять,
            когда указываешь на это, — изворачиваются, применяя те же приемы.
          </UiText>

          <UiText>
            Если не хотят чего-то делать, если даже надо, то ни упросить, ни
            заставить невозможно, проще сделать самому. Ну какой еще тип так
            любит чтобы его посылали на ..?
          </UiText>

          <UiText preset="large" color="role">
            Вместо дискуссии все сводят к софистике, и им всегда все не
            нравится.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-3" class="tab">
        <section>
          <UiText preset="large" color="role">
            Потому что Критики – они, сука, пофигисты, ленивые до опупения.
          </UiText>

          <UiText>
            Гонят всем, что ищут смысл жизни – вранье: им попросту лень его
            искать, диван роднее и приятственней.
          </UiText>

          <UiText>
            Если Критик будет загоняться, что мол, он медленный газ и ниипет –
            не верьте.
          </UiText>

          <UiText>
            Тормоз он, товарищи, редкостный – причем свою тормознутость, сука,
            свято холит и лелеет, подводя под нее всяческие логические
            обоснования и умело давя на вашу черную этику.
          </UiText>
        </section>

        <section>
          <UiText>
            Еще умеет прикинуться эмокидом, этаким някой, ибо большие глаза
            делает, сука, как никто. Однако по сути своей Критик — унылое говно,
            ни разу не трепетное лань, и ежели вы ждете от него решительного
            напору, то просидите на жопе до третьего пришествия.
          </UiText>

          <UiText>
            Критика следует аккуратно взять за шкирку, оторвать от компьютера и
            метким пинком подтолкнуть в нужном направлении, не вступая в диспут
            о смысле сих действий, ибо логика у них, сволочей, развита лучше,
            чем ожидаешь, на Критика глядючи.
          </UiText>

          <UiText>
            Впрочем, в быту они ненапряжны — положите их в уголок с книжкой и
            конфетами, и те будут себе тихонечко не отсвечивать, пока вы про них
            не вспомните и не употребите по назначению.
          </UiText>

          <UiText preset="large" color="role">
            К слову, употребить Критика получается у многих, просто потому, что
            Критику на вас положить.
          </UiText>

          <UiText>
            Чем может воспользоваться самый широкий круг лиц, от конфликтера до
            активатора, а активаторы у них еще те — видимо, потому что только их
            глубокий внутренний похуизм и может активизироваться от такого
            кошмара во плоти, как Хранитель.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
