<template>
  <div class="text g-page">
    <section>
      <UiText preset="body" color="accent">
        Описания не должны обязательно совпадать со всеми чертами характера
        личности.
      </UiText>

      <UiText preset="small" color="accent">
        Идея как раз описать наблюдаемые у среднего представителя типа
        особенности поведения и обработки информации психикой.
      </UiText>

      <UiText preset="small" color="accent">
        Автор описания — Велта Микелсоне
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="role">
        Самый деловой и активный соционический тип в соционе.
      </UiText>

      <br />

      <UiText>
        В течение своей жизни ищет все возможные способы как улучшить и
        усовершенствовать уже существующие, отслужившие своё время технологии,
        благодаря чему ему присвоен псевдоним — экспериментатор.
      </UiText>

      <UiText preset="large" color="role">
        Он считает, что на работе необходимо достичь максимально высокие
        показатели приложив минимальные усилия.
      </UiText>

      <UiText>
        Рационально распределяет работу, выбирая самые эффективные способы.
        Быстрая реакция, понимание целесообразности любого действия. Умело
        определяет профессиональные способности каждого сотрудника, не учитывая
        полученную квалификацию.
      </UiText>

      <UiText>
        Бывают такие руководители, которые достигают очень высоких результатов,
        становятся даже миллионерами. Также занимают высокие должности в
        правительстве, умело руководят в министерстве.
      </UiText>

      <UiText>
        Если удачно нашел своё место в жизни, действует с полной отдачей, иногда
        приобретая прозвище трудоголика, так как способен брать на себя огромную
        нагрузку, при этом сам не чувствует объем её.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Понимает целесообразность любого дела, не берется за работу, которая
        нецелесообразна.
      </UiText>

      <UiText>
        Понимает, где надо сэкономить, а где этого делать не стоит. Прекрасно
        разбирается в механизмах действия и понимает, как извлечь пользу.
      </UiText>

      <UiText preset="large" color="role">
        Всю свою работу исполняет последовательно, нацеливаясь на результат.
      </UiText>

      <UiText>
        Его не устраивает работа, где доминируют процессы, но не виден
        результат. Для него важна эффективность.
      </UiText>

      <UiText>
        Бывает, что он чувствует необходимость менять профессию, но везде, где
        работает, быстро приспосабливается. Неразборчивый, способен выполнять
        любую работу. Он не терпит безделья и отсутствие движения. Отлично
        чувствует себя только при максимальной нагрузке.
      </UiText>

      <UiText>
        Как рационализатор, учится на своем опыте, благодаря которому не
        допускает ошибки. Заметив ошибки в работе других, охотно дает советы.
      </UiText>

      <UiText>
        Все свои действия планирует быстро и автоматически. Сперва умело
        учитывает возможные неудачи, перечисляет варианты, как исключить их,
        чтобы достичь оптимального результата.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        У него все просчитано, не теряет ни минуты.
      </UiText>
      <UiText>
        Приняв решение действовать, не теряется и не сомневается, быстро
        хватается за работу с большим энтузиазмом.
      </UiText>

      <UiText>
        Только что услышанную информацию автоматически фиксирует как на
        кинопленку, где отражается процесс развития событий, в том числе
        выполняемые работы. Благодаря этому, способен прогнозировать ход
        действия и достигаемый результат.
      </UiText>

      <UiText preset="large" color="role">
        Отличается терпеливостью и выдержкой.
      </UiText>

      <UiText>
        Контроль ритма, времени для него естествен и не затруднителен. Для него
        неприемлемо опаздывать.
      </UiText>

      <UiText>
        Он прекрасно понимает, как это может повлиять на успешный ход событий.
        Соображает, что опоздав на первую деловою встречу, уже в какой-то мере
        потеряет доверие партнера.
      </UiText>

      <UiText>
        Можно считать человеком компании. Он естественно обращается с любым в
        разной обстановке. Способен найти общий язык с каждым.
      </UiText>

      <UiText preset="large" color="role">
        В нем нет притворства и потребности надевать маску.
      </UiText>
    </section>

    <section>
      <UiText>
        Жизнерадостный, дружелюбный. Иногда в ситуациях, когда ощущает
        внутренний дискомфорт в общении, улыбается, но окружающие другой раз
        воспринимают это как несерьезность. Он — оптимист, который максимально
        ограничивается от отрицательных эмоциях, пессимистических рассказов,
        клеветы.
      </UiText>

      <UiText preset="large" color="role">
        Не жалуется на свои трудности, и не желает слышать об этом от других.
        Часто даже близкие не знают, что он чувствует в душе.
      </UiText>

      <UiText>
        Внутренний оптимизм и необходимость общения загоняют его как бы в тупик.
        Например, когда внезапно высказанная реплика кому-то может показаться
        неуместной. Только потом он понимает, что наверное, сказал что-то
        неуместное, но находит выход из ситуации, не оставляет человека
        обиженным.
      </UiText>

      <UiText>За всю жизнь почти не бывает врагов.</UiText>

      <UiText>
        Не стоит стараться воспитывать его публично, особенно громким голосом.
        Несравнимо лучший результат можно достигнуть, если высказать нотацию с
        глазу на глаз. То, что заслужил, он осознает сам и терпеливо выслушает.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Обладает живым творческим воображением и своеобразным чувством юмора.
      </UiText>

      <UiText>
        Среди них встречаются замечательные юмористы, рассказчики, а также
        хорошие актеры, певцы и ведущие шоу.
      </UiText>

      <UiText>
        Плохо ощущает своё тело, поэтому не имеет высоких требований к комфорту,
        роскошной жизни и другим бытовым и материальным благам.
      </UiText>

      <UiText>
        Он принимает все неудобства в быту как естественные и может
        приспособиться к любым обстоятельствам. Нетребовательный и неразборчивый
        в еде.
      </UiText>

      <UiText>
        Этим объясняется то, что он не понимает придирчивость и мелочность
        ежедневных хозяйственных хлопот. Плохо осознает, почему требуется
        ежедневная уборка квартиры и другие работы по дому. Всё это он
        воспринимает как мелочь, которая отнимает у него время, и занимаясь
        которой, не возможно достичь видимого результата в других делах.
      </UiText>

      <UiText preset="small" color="accent">
        Например, женщина задумывается, какая разница между убранной и
        неубранной квартирой, стертой или не стертой пылью. Считает, что в это
        время можно лучше почитать интересную статью, посмотреть фильм или
        посетить интересную лекцию.
      </UiText>
    </section>

    <section>
      <UiText>
        Не оценивает человека по внешнему виду, но и сам не затрудняет себя
        особым вниманием к своей внешности. Также не обращает внимания,
        насколько сочетаются между собой детали одежды.
      </UiText>

      <UiText preset="small" color="accent">
        Мужчина неловко ощущает себя, надевая костюм. Чувствует себя «не в своей
        тарелке» в ситуациях, когда этикет требует быть в костюме на
        торжественных мероприятиях.
      </UiText>

      <UiText preset="small" color="accent">
        Женщина не считает нужным регулярно следить за собой, игнорирует моду.
        Ей кажется, что её прическа не играет важную роль во внешнем виде.
        Фактически не испытывает желания дополнять наряды бижутерией. Чаще во
        внешнем виде нет согласованности, женственности.
      </UiText>

      <UiText>
        Отсутствуют свои этические нормы. Поэтому он копирует чужие нормы и
        адаптирует их при общении в той среде, где это необходимо и где сам
        считает нужным.
      </UiText>

      <UiText>
        Доверчивый человек, желает видеть только положительные черты людей,
        однако он не видит опасность в лести, обмане и хитрости. Пережив однажды
        предательство, обман, исключает такого человека из своего окружения.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Бесполезно требовать словесного признания в любви.
      </UiText>

      <UiText>
        Он любит не словом, а делом. Может предложить свою помощь, если видит,
        что сможет быть полезным.
      </UiText>

      <UiText>
        В случаях, когда не чувствует себя компетентным, без обиды удаляется,
        считая, что его присутствие неуместно, и теряется зря время.
      </UiText>

      <UiText preset="large" color="role">
        Наступает полная слепота в ситуациях, когда следует решать серьезные
        вопросы в отношениях.
      </UiText>

      <UiText>
        Внутренне ориентирован позитивно, всегда надеется на понимание и
        снисхождение партнера. Чаще всего не находит содержательных слов,
        которыми может воздействовать на партнера. В таких случаях может сказать
        что-то комичное.
      </UiText>

      <UiText>
        Таланты открываются лишь в ситуациях, когда создаются условия для
        проявления его сильных черт характера, в противном случае у него
        возникает серьезная проблема как найти своё место в жизни.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Ценит сильных, настойчивых, волевых людей, осознавая, что он почти лишен
        этих качеств.
      </UiText>

      <UiText>
        Как руководитель не контролирует работу других, считает, что каждый
        должен выполнить работу добросовестно. Не подчиняет других силовыми
        методами, но своего добивается убеждением.
      </UiText>

      <UiText>
        Он нуждается в толчке со стороны, чтобы выйти из кризиса и действовать
        масштабно.
      </UiText>

      <UiText preset="large" color="role">
        Его захватывает конкуренция, которая не позволяет ему останавливаться на
        достигнутом. Разрушитель существующих систем и создатель новых, более
        эффективных.
      </UiText>

      <UiText>
        Активно включается в процессы, происходящие в обществе, потому что
        ощущает ритм времени и всегда в курсе того, что происходит и что следует
        изменить.
      </UiText>

      <UiText>
        Но в тоже время для этого требуется вкладывать определенные усилия, в
        том числе продолжать образование. Громадный потенциал для этого, но к
        сожалению он не всегда это осознает.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
