<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    

    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Велта Микелсоне"
          subtitle="10 минут"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Вера Стратиевская"
          subtitle="31 минута"
          target-content-id="tab-2"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText preset="subtitle" color="role">
            Самый деловой и активный соционический тип в соционе.
          </UiText>

          <br />

          <UiText>
            В течение своей жизни ищет все возможные способы как улучшить и
            усовершенствовать уже существующие, отслужившие своё время
            технологии, благодаря чему ему присвоен псевдоним — экспериментатор.
          </UiText>

          <UiText preset="large" color="role">
            Он считает, что на работе необходимо достичь максимально высокие
            показатели приложив минимальные усилия.
          </UiText>

          <UiText>
            Рационально распределяет работу, выбирая самые эффективные способы.
            Быстрая реакция, понимание целесообразности любого действия. Умело
            определяет профессиональные способности каждого сотрудника, не
            учитывая полученную квалификацию.
          </UiText>

          <UiText>
            Бывают такие руководители, которые достигают очень высоких
            результатов, становятся даже миллионерами. Также занимают высокие
            должности в правительстве, умело руководят в министерстве.
          </UiText>

          <UiText>
            Если удачно нашел своё место в жизни, действует с полной отдачей,
            иногда приобретая прозвище трудоголика, так как способен брать на
            себя огромную нагрузку, при этом сам не чувствует объем её.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Понимает целесообразность любого дела, не берется за работу, которая
            нецелесообразна.
          </UiText>

          <UiText>
            Понимает, где надо сэкономить, а где этого делать не стоит.
            Прекрасно разбирается в механизмах действия и понимает, как извлечь
            пользу.
          </UiText>

          <UiText preset="large" color="role">
            Всю свою работу исполняет последовательно, нацеливаясь на результат.
          </UiText>

          <UiText>
            Его не устраивает работа, где доминируют процессы, но не виден
            результат. Для него важна эффективность.
          </UiText>

          <UiText>
            Бывает, что он чувствует необходимость менять профессию, но везде,
            где работает, быстро приспосабливается. Неразборчивый, способен
            выполнять любую работу. Он не терпит безделья и отсутствие движения.
            Отлично чувствует себя только при максимальной нагрузке.
          </UiText>

          <UiText>
            Как рационализатор, учится на своем опыте, благодаря которому не
            допускает ошибки. Заметив ошибки в работе других, охотно дает
            советы.
          </UiText>

          <UiText>
            Все свои действия планирует быстро и автоматически. Сперва умело
            учитывает возможные неудачи, перечисляет варианты, как исключить их,
            чтобы достичь оптимального результата.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            У него все просчитано, не теряет ни минуты.
          </UiText>
          <UiText>
            Приняв решение действовать, не теряется и не сомневается, быстро
            хватается за работу с большим энтузиазмом.
          </UiText>

          <UiText>
            Только что услышанную информацию автоматически фиксирует как на
            кинопленку, где отражается процесс развития событий, в том числе
            выполняемые работы. Благодаря этому, способен прогнозировать ход
            действия и достигаемый результат.
          </UiText>

          <UiText preset="large" color="role">
            Отличается терпеливостью и выдержкой.
          </UiText>

          <UiText>
            Контроль ритма, времени для него естествен и не затруднителен. Для
            него неприемлемо опаздывать.
          </UiText>

          <UiText>
            Он прекрасно понимает, как это может повлиять на успешный ход
            событий. Соображает, что опоздав на первую деловою встречу, уже в
            какой-то мере потеряет доверие партнера.
          </UiText>

          <UiText>
            Можно считать человеком компании. Он естественно обращается с любым
            в разной обстановке. Способен найти общий язык с каждым.
          </UiText>

          <UiText preset="large" color="role">
            В нем нет притворства и потребности надевать маску.
          </UiText>
        </section>

        <section>
          <UiText>
            Жизнерадостный, дружелюбный. Иногда в ситуациях, когда ощущает
            внутренний дискомфорт в общении, улыбается, но окружающие другой раз
            воспринимают это как несерьезность. Он — оптимист, который
            максимально ограничивается от отрицательных эмоциях,
            пессимистических рассказов, клеветы.
          </UiText>

          <UiText preset="large" color="role">
            Не жалуется на свои трудности, и не желает слышать об этом от
            других. Часто даже близкие не знают, что он чувствует в душе.
          </UiText>

          <UiText>
            Внутренний оптимизм и необходимость общения загоняют его как бы в
            тупик. Например, когда внезапно высказанная реплика кому-то может
            показаться неуместной. Только потом он понимает, что наверное,
            сказал что-то неуместное, но находит выход из ситуации, не оставляет
            человека обиженным.
          </UiText>

          <UiText>За всю жизнь почти не бывает врагов.</UiText>

          <UiText>
            Не стоит стараться воспитывать его публично, особенно громким
            голосом. Несравнимо лучший результат можно достигнуть, если
            высказать нотацию с глазу на глаз. То, что заслужил, он осознает сам
            и терпеливо выслушает.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Обладает живым творческим воображением и своеобразным чувством
            юмора.
          </UiText>

          <UiText>
            Среди них встречаются замечательные юмористы, рассказчики, а также
            хорошие актеры, певцы и ведущие шоу.
          </UiText>

          <UiText>
            Плохо ощущает своё тело, поэтому не имеет высоких требований к
            комфорту, роскошной жизни и другим бытовым и материальным благам.
          </UiText>

          <UiText>
            Он принимает все неудобства в быту как естественные и может
            приспособиться к любым обстоятельствам. Нетребовательный и
            неразборчивый в еде.
          </UiText>

          <UiText>
            Этим объясняется то, что он не понимает придирчивость и мелочность
            ежедневных хозяйственных хлопот. Плохо осознает, почему требуется
            ежедневная уборка квартиры и другие работы по дому. Всё это он
            воспринимает как мелочь, которая отнимает у него время, и занимаясь
            которой, не возможно достичь видимого результата в других делах.
          </UiText>

          <UiText preset="small" color="accent">
            Например, женщина задумывается, какая разница между убранной и
            неубранной квартирой, стертой или не стертой пылью. Считает, что в
            это время можно лучше почитать интересную статью, посмотреть фильм
            или посетить интересную лекцию.
          </UiText>
        </section>

        <section>
          <UiText>
            Не оценивает человека по внешнему виду, но и сам не затрудняет себя
            особым вниманием к своей внешности. Также не обращает внимания,
            насколько сочетаются между собой детали одежды.
          </UiText>

          <UiText preset="small" color="accent">
            Мужчина неловко ощущает себя, надевая костюм. Чувствует себя «не в
            своей тарелке» в ситуациях, когда этикет требует быть в костюме на
            торжественных мероприятиях.
          </UiText>

          <UiText preset="small" color="accent">
            Женщина не считает нужным регулярно следить за собой, игнорирует
            моду. Ей кажется, что её прическа не играет важную роль во внешнем
            виде. Фактически не испытывает желания дополнять наряды бижутерией.
            Чаще во внешнем виде нет согласованности, женственности.
          </UiText>

          <UiText>
            Отсутствуют свои этические нормы. Поэтому он копирует чужие нормы и
            адаптирует их при общении в той среде, где это необходимо и где сам
            считает нужным.
          </UiText>

          <UiText>
            Доверчивый человек, желает видеть только положительные черты людей,
            однако он не видит опасность в лести, обмане и хитрости. Пережив
            однажды предательство, обман, исключает такого человека из своего
            окружения.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Бесполезно требовать словесного признания в любви.
          </UiText>

          <UiText>
            Он любит не словом, а делом. Может предложить свою помощь, если
            видит, что сможет быть полезным.
          </UiText>

          <UiText>
            В случаях, когда не чувствует себя компетентным, без обиды
            удаляется, считая, что его присутствие неуместно, и теряется зря
            время.
          </UiText>

          <UiText preset="large" color="role">
            Наступает полная слепота в ситуациях, когда следует решать серьезные
            вопросы в отношениях.
          </UiText>

          <UiText>
            Внутренне ориентирован позитивно, всегда надеется на понимание и
            снисхождение партнера. Чаще всего не находит содержательных слов,
            которыми может воздействовать на партнера. В таких случаях может
            сказать что-то комичное.
          </UiText>

          <UiText>
            Таланты открываются лишь в ситуациях, когда создаются условия для
            проявления его сильных черт характера, в противном случае у него
            возникает серьезная проблема как найти своё место в жизни.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Ценит сильных, настойчивых, волевых людей, осознавая, что он почти
            лишен этих качеств.
          </UiText>

          <UiText>
            Как руководитель не контролирует работу других, считает, что каждый
            должен выполнить работу добросовестно. Не подчиняет других силовыми
            методами, но своего добивается убеждением.
          </UiText>

          <UiText>
            Он нуждается в толчке со стороны, чтобы выйти из кризиса и
            действовать масштабно.
          </UiText>

          <UiText preset="large" color="role">
            Его захватывает конкуренция, которая не позволяет ему
            останавливаться на достигнутом. Разрушитель существующих систем и
            создатель новых, более эффективных.
          </UiText>

          <UiText>
            Активно включается в процессы, происходящие в обществе, потому что
            ощущает ритм времени и всегда в курсе того, что происходит и что
            следует изменить.
          </UiText>

          <UiText>
            Но в тоже время для этого требуется вкладывать определенные усилия,
            в том числе продолжать образование. Громадный потенциал для этого,
            но к сожалению он не всегда это осознает.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="small" color="accent">1 — Базовая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_business" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Практика</UiText>
              <UiText preset="body">Деловая логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Нет большей беды для Предпринимателя, чем невозможность найти
            должное применение своим деловым качествам. Вся его жизнь — поиск
            возможностей максимально реализовать свои силы, ум и способности в
            интересной и перспективной деятельности.
          </UiText>

          <UiText>
            Деловые качества Предпринимателя проявляются в зависимости от
            объективных возможностей, предоставляемых ему конкретными условиями
            и ситуацией.
          </UiText>

          <UiText color="role">
            Только на собственные волевые усилия Предприниматель рассчитывать не
            будет — нецелесообразно, тем более, что в жизни еще существуют
            удача, везение и другие объективные условия, при которых имеет смысл
            проявлять свое умение и свои деловые качества.
          </UiText>

          <UiText preset="large" color="role">
            При неблагоприятных обстоятельствах Предприниматель считает вообще
            бессмысленным себя к чему-либо принуждать — лучше попытаться
            изменить условия. «Сизифов труд» не для него.
          </UiText>

          <UiText>
            Представители этого типа активно борются за равно справедливые
            условия и равно широкие возможности для всех.
          </UiText>

          <UiText>
            Предприниматель борется за восстановление справедливости — старается
            вернуть то, что причитается ему по праву.
          </UiText>

          <UiText>
            Если нет возможности восстановить справедливость, Предприниматель
            ищет для себя новое место, где его точка зрения будет разделяться и
            где его работа будет достойно оценена.
          </UiText>

          <UiText preset="large" color="role">
            Представители этого типа постоянно находятся в поиске лучших условий
            и более широких возможностей применения своим деловым качествам.
          </UiText>

          <UiText>
            Для них характерна частая смена профессий, смена места жительства:
            не получилось здесь — уезжают в другие края, открывают для себя
            новые земли, новые возможности. Они — «первопроходцы». Не удалось
            реализовать себя в одной области, смело переходят в другую, пока
            наконец не найдут себе дело по душе.
          </UiText>

          <UiText preset="large" color="role">
            Предпочитают добиваться высокой эффективности разумным и
            рациональным распределением своих сил.
          </UiText>

          <UiText color="role">
            Именно поэтому представители этого типа не имеют себе равных по
            части разработки и внедрения новых технологий, рациональной и
            эффективной организации рабочего процесса, великолепно генерируют
            интересные рационализаторские идеи, являются авторами многих
            прогрессивных технологий и методик.
          </UiText>

          <UiText>
            Предприниматель — ярый противник всех нерациональных и неэффективных
            методов работы. Организовывая производство, придает значение
            материальному стимулированию и личной заинтересованности своих
            работников.
          </UiText>

          <UiText color="accent">Живи сам и дай жить другим.</UiText>

          <UiText>
            Предпочитает работу с конкретным практическим применением.
            Абстрактными и отвлеченными проектами не соблазняется.
          </UiText>

          <UiText>
            Не способен поступать вопреки собственному мнению? вопреки
            собственному представлению о здравом смысле. Каждую деятельность он
            рассматривает с точки зрения ее целесообразности «а иначе, зачем?».
            Работать любит и умеет выполнять работу высококвалифицированно «а
            иначе, зачем?».
          </UiText>

          <UiText>
            Считает целесообразным заниматься делом, приносящим высокие прибыли.
            На мелочи старается не размениваться.
          </UiText>

          <UiText color="role">
            Криминальным бизнесом не занимается, несмотря на многообещающие
            доходы, поскольку этого не позволяет система нравственных ценностей,
            на которую он подсознательно сориентирован.
          </UiText>

          <UiText>
            Отложить или накопить их не всегда умеет. Легче всего он тратит
            деньги, доставшиеся ему «легко» — в качестве выигрыша или подарка.
          </UiText>

          <UiText>
            Обычно не склонный к авантюрным проектам, Предприниматель способен
            вкладывать «легкие» деньги в предприятие, не слишком основательно им
            продуманное и просчитанное.
          </UiText>

          <UiText color="role">
            Неудачи и просчеты в работе сам себе не прощает, но внешне сохраняет
            спокойствие и оптимизм: «На ошибках учатся.»
          </UiText>

          <UiText>
            Не крохобор. Ненавидит крохоборов. Считает, умеешь заработать —
            имеешь право потратить. Легче и свободнее тратит крупные суммы —
            тяжелее расстается с мелкими, из-за чего при всей широте натуры
            производит впечатление человека прижимистого.
          </UiText>

          <UiText color="role">
            Независимо от уровня доходов, предпочитает покупать себе самые
            дорогие вещи, считая их самыми качественными.
          </UiText>

          <UiText preset="large" color="role">
            Не любит заниматься починкой, ремонтом, переделкой. Предпочитает
            хорошо заработать и купить новое. Или нанять людей, которые это за
            него сделают.
          </UiText>

          <UiText>
            В трудную минуту не брезгует тяжелой работой, если она хорошо
            оплачивается. Не любит мелкую рутинную работу, не любит
            прорабатывать детали, не любит быть «на подхвате», «на побегушках»,
            не любит отупляющего, безынициативного труда.
          </UiText>

          <UiText>
            Предприниматель не терпит и не допускает контроля со стороны за
            своими поступками, своим временем и качеством своей работы — чужое
            недоверие считает для себя оскорбительным. И в делах и в личной
            жизни считает взаимное доверие нормой отношений.
          </UiText>

          <UiText color="role">
            Старается не иметь дело с необязательными людьми, ненавидит
            жульничество, мошенничество, «нечестную игру», «халявщиков».
          </UiText>

          <UiText>
            Предпочитает обещать поменьше, но сделать побольше.
            Предусмотрителен. Оценивает свои поступки с точки зрения их
            последствий. Терпеть не может безответственности во всех формах
            отношений.
          </UiText>

          <UiText preset="large" color="role">
            Не любит контролировать чужую работу в процессе выполнения —
            предпочитает оценивать конечный результат.
          </UiText>

          <UiText color="role">
            Не любит зависеть от чужих сроков, чужой инициативы, поэтому
            предпочитает работу, где он может быть сам себе хозяином: сам себе
            задает темп, сам себе планирует, сам себе устанавливает норму.
          </UiText>

          <UiText>Не любит работать с медлительным напарником.</UiText>

          <UiText preset="large" color="role">
            Прекрасный руководитель и организатор. Умеет распределить работу
            соответственно возможностям и способностям каждого.
          </UiText>

          <UiText color="role">
            Моментально оценивает человека по его делам, уровню квалификации и
            способностям. Работу, за которую берется, выполняет всегда с
            энтузиазмом, быстро и качественно.
          </UiText>

          <UiText>
            Бюрократическую волокиту воспринимает как величайшее зло — это то,
            что его крайне раздражает, убивает его деловую активность и приводит
            в подавленное состояние.
          </UiText>

          <UiText>
            Необходимость жить в условиях, где его деловые качества не находят
            применения, где его труд не получает адекватной оплаты, угнетает
            Предпринимателя. В таких условиях он старается надолго не
            задерживаться.
          </UiText>

          <UiText>
            Предприниматель очень мобилен и динамичен. Легко приспосабливается к
            новым условиям, стойко переносит тяготы и лишения. Особенно, если
            знает, что со временем это будет достойно вознаграждено.
          </UiText>

          <UiText>
            Представители этого типа великолепно работают в экстремальных
            условиях — спасателями, испытателями, каскадерами.
          </UiText>

          <UiText preset="large" color="role">
            Именно в экстремальной ситуации Предприниматель ярче всего проявляет
            свои волевые качества, выдержку, хладнокровие, деловую смекалку, а
            также умение точно рассчитать свое время, силы и возможности.
            Расслабившись, о времени может вообще забыть.
          </UiText>

          <UiText color="role">
            Никогда не пасует перед трудностями — мобилизует все свои силы для
            того, чтобы их преодолеть.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">2 — Творческая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_time" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чутьё</UiText>
              <UiText preset="body">Интуиция времени</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Предприниматель умеет увидеть для себя преимущества, предоставляемые
            ему временем.
          </UiText>

          <UiText color="role">
            Его деловые качества ярче всего проявляются в условиях удобных и
            выгодных для него временных отношений. Предприниматель умеет видеть
            выгоду грядущих перемен, равно как и умеет увидеть безнадежность и
            бесперспективность «застойных периодов».
          </UiText>

          <UiText>
            Умеет увидеть и оценить эпоху, в которой раскроются его возможности,
            и умеет использовать все те блага и преимущества, которые она ему
            предоставляет.
          </UiText>

          <UiText>
            Умеет приспособиться к трудным временам и перетерпеть их с
            наименьшим для себя ущербом.
          </UiText>

          <UiText preset="large" color="role">
            Умеет заставить время работать на себя. Точно знает, что и когда
            имеет смысл делать. Умеет спешить и умеет выжидать.
          </UiText>

          <UiText color="role">
            Знает, когда нужно действовать решительно, а когда нужно запастись
            терпением и переждать.
          </UiText>

          <UiText>Пережидая, нередко упускает время и возможности.</UiText>

          <UiText color="role">
            Предприниматель обладает всеми необходимыми качествами для того,
            чтобы приспособить свое поведение к условиям неопределенной и
            нестабильной ситуации.
          </UiText>

          <UiText color="accent">
            Например, умеет не обнаруживать свою заинтересованность сделкой —
            чтобы не поставить себя в невыгодное положение.
          </UiText>

          <UiText color="role">
            Умеет быть выдержанным и терпеливым, какого бы напряжения ему это ни
            стоило. Умеет не обнаруживать своей некомпетентности — чтобы не
            уронить свой престиж. Умеет не обнадеживать понапрасну — чтобы не
            создать о себе мнение как о безответственном человеке, хотя это ему,
            к сожалению, не всегда удаëтся.
          </UiText>

          <UiText>
            При неблагоприятных обстоятельствах решительные действия у него
            чередуются с периодами колебаний, сомнений и бездействия.
          </UiText>

          <UiText color="role">
            В период выжидания ему трудно переключиться на какую-нибудь другую
            деятельность, поэтому иногда создается впечатление, что он
            бездельничает.
          </UiText>

          <UiText>
            Многие Предприниматели считают себя лентяями, хотя на самом деле —
            их хлебом не корми, дай поработать.
          </UiText>

          <UiText>
            Предприниматель ненавидит периоды вынужденного бездействия, ожидания
            по независящим от него причинам: это буквально выбивает его из
            колеи.
          </UiText>

          <UiText preset="large" color="role">
            В такие периоды он не всегда способен переключиться на другую работу
            — ведь ему, как любому рациональному человеку, неудобны накладки,
            путаница и сумбур в делах.
          </UiText>

          <UiText>
            Предприниматель предпочитает насыщенный ритм жизни и хорошо себя
            чувствует, когда его день расписан по часам и до предела уплотнен
            интересными и неотложными делами.
          </UiText>

          <UiText>
            И в то же время было бы наивно полагать, что при всей своей
            рациональности Предприниматель строго придерживается составленного
            им расписания — он достаточно динамичен и легко приспосабливается к
            изменению обстоятельств.
          </UiText>

          <UiText color="role">
            Его интуиция времени подчинена интересам дела, интересам
            целесообразности, поэтому он постоянно вносит коррективы в свой
            распорядок дня.
          </UiText>

          <UiText preset="large" color="role">
            Что в свою очередь может выражаться в таких казусах, как опоздание
            на назначенную деловую встречу, или две деловые встречи, назначенные
            одновременно в двух отдаленных местах.
          </UiText>

          <UiText>
            Не имеет смысла спрашивать у Предпринимателя о времени его
            возвращения домой или о его планах на вечер.
          </UiText>

          <UiText>
            При всей своей рациональности он на эти вопросы определенно не
            ответит. Более того, такие вопросы его раздражают.
          </UiText>

          <UiText preset="large" color="role">
            Выходя из дома, он автоматически превращается в «охотника за
            удачей», которого направляет уже его интуиция.
          </UiText>

          <UiText>
            Поэтому Предпринимателю даже приблизительно неизвестно, сколько
            времени продлится его рабочий, его деловой, день, что очень
            усложняет жизнь его домочадцам.
          </UiText>

          <UiText>
            Предпринимателю не свойственно подгонять свои дела под составленное
            им расписание.
          </UiText>

          <UiText color="accent">
            Например, бросить незавершенную работу и побежать на свидание он
            может только в случае сверх значимых для него отношений.
          </UiText>

          <UiText>
            Именно такой «жертвы» требует от него на первых порах дуализации его
            дуал Хранитель.
          </UiText>

          <UiText>
            В детстве Предприниматели тоже не любят составлять себе четкий
            распорядок дня: мало ли, может, в то время, как он сидит дома и
            делает уроки, во дворе будет происходить что-нибудь очень
            интересное, требующее его участия.
          </UiText>

          <UiText>
            По крайне мере, практика показывает, что составляемые в детстве
            распорядки дня соблюдались Предпринимателем не больше одного-двух
            дней.
          </UiText>

          <UiText>
            При благоприятных обстоятельствах распорядок дня Предпринимателя
            чаще всего бывает именно уплотнен: он может отметиться на лекции в
            институте, затем побежать к телефону-автомату уладить какие-то свои
            дела, затем сбегать где-то подзаработать и после всего вернуться и
            дослушать лекцию.
          </UiText>

          <UiText>
            Или: отпроситься на неделю с занятий, уехать в другую страну,
            переделать там кучу дел, проведать родственников, завязать деловые
            контакты, снова вернуться к занятиям, и за два дня наверстать все
            упущенное.
          </UiText>

          <UiText>
            Если «деловой день» Предпринимателя не заполнен достаточным
            количеством сколько-нибудь серьезных дел, это верный признак того,
            что он переживает тяжелые времена. Предприниматель ненавидит
            безделье, но непродуктивный расход времени и сил он ненавидит еще
            больше.
          </UiText>

          <UiText preset="large" color="role">
            Предпринимателя раздражает любой непредвиденный, расход времени.
          </UiText>

          <UiText>
            Его раздражает медлительность во всех ее проявлениях, например,
            когда кто-то медленно разговаривает. Больше всего Предпринимателя
            раздражает, когда перед ним кто-то медленно идет или медленно едет.
            Транспортные пробки для него самая чудовищная пытка.
          </UiText>

          <UiText preset="large" color="role">
            Предприниматель терпеть не может ждать.
          </UiText>

          <UiText>
            Хотя нередко заставляет ждать других. Для него нет ничего глупее,
            чем стоять на остановке в ожидании транспорта. Поэтому
            Предприниматели по возможности стараются иметь свое транспортное
            средство, даже если это какой-нибудь убогонький велосипед. За
            отсутствием личного транспорта предпочитают ходить пешком.
          </UiText>

          <UiText>
            Предприниматели обожают быструю езду. И с этим бороться бесполезно.
            Вопреки своей практичности, они готовы заплатить какой-угодно штраф,
            но не откажут себе в этом удовольствии.
          </UiText>

          <UiText preset="large" color="role">
            Любит быстрые темпы работы, вообще любит все делать быстро,
            желательно за один присест.
          </UiText>

          <UiText>
            Предпочитает, чтобы процесс подготовки к работе был минимальным по
            времени — иначе уже не хочется делать саму работу. Предприниматель
            любит сделать всю работу быстро и хорошо, а потом с удовольствием
            отдохнуть в приятной компании.
          </UiText>

          <UiText color="role">
            Не любит ходить по магазинам и делать покупки, поскольку не любит
            стоять в очередях, и, кроме того, ему трудно оценивать качество
            вещей.
          </UiText>

          <UiText preset="large" color="role">
            Ходить по инстанциям, сидеть в очередях терпеть не может. По той же
            причине не любит ходить по врачам.
          </UiText>

          <UiText>
            Предпринимателя раздражает необходимость отвлекаться от работы для
            объяснений, которые он уже много раз давал; раздражает, когда на
            него перекладывают чужую работу и этим ломают его планы.
          </UiText>

          <UiText>
            Предпринимателю вообще не нравится, когда кто-то ломает его планы —
            иное дело, когда он сам в них что-либо меняет.
          </UiText>

          <UiText>
            Его девизы — «Время не ждет» и «Время — деньги». Его время
            действительно дорого стоит. Его планы гибкие и динамичные. Ему
            удобен партнер, который считается с его планами и подстраивается под
            них.
          </UiText>

          <UiText>Что подсознательно делает его дуал — Хранитель.</UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">3 — Ролевая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_emotions" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Желание</UiText>
              <UiText preset="body">Этика эмоций</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Иногда создается впечатление, что Предприниматель не совсем ясно
            представляет, зачем ему даны эмоции и что ему нужно с ними делать.
            Иногда он появляется на людях под маской простоватого весельчака,
            своего «в доску» парня, иногда напускает на себя показную суровость.
          </UiText>

          <UiText color="role">
            Как правило, эмоции Предпринимателя подчиняются его рассудку и
            проявляются в той форме, в какой это нужно в интересах дела.
          </UiText>

          <UiText>
            В «интересах дела» Предприниматель может вообще не обнаруживать
            своих эмоций либо выражать нечто противоположное тому, что он сейчас
            переживает.
          </UiText>

          <UiText preset="large" color="role">
            В общении проявляет дружелюбие, умеет быть коммуникабельным,
            дипломатичным. Старается находить общий язык в любой компании, умеет
            быть обаятельным и остроумным.
          </UiText>

          <UiText color="role">
            Очень располагает к себе людей. Ценит хороший юмор, шутку, заряжает
            всех своим весельем и оптимизмом. Любит рассказывать анекдоты.
          </UiText>

          <UiText>
            Благодаря этому свойству, Предприниматель расслабляет и успокаивает
            своего вечно настороженного дуала Хранителя.
          </UiText>

          <UiText>
            Иногда на начальном этапе дуализации возникают некоторые проблемы с
            не всегда уместными шуточками Предпринимателя, которые иногда носят
            оттенок черного юмора, иногда — характер глупых розыгрышей.
          </UiText>

          <UiText>
            Общаясь с Хранителем, Предприниматель становится избирательнее во
            всех формах своих острот.
          </UiText>

          <UiText>
            То же самое происходит и с манерой Предпринимателя «эмоционально
            выражаться»: при Хранителе эмоциональный лексикон Предпринимателя
            существенно беднеет.
          </UiText>

          <UiText>
            В обществе дуала Предприниматель старается быть вежливым и
            деликатным. Так что со временем это становится неотъемлемой частью
            его поведения.
          </UiText>

          <UiText>
            Под маской балагура и весельчака Предприниматель часто пытается
            спрятать от посторонних свои переживания и чувства.
          </UiText>

          <UiText>
            Но только от дуала ему это скрыть никогда не удаëтся. Хранитель
            требует от Предпринимателя искренних, откровенных эмоций,
            соответствующих истинному положению вещей.
          </UiText>

          <UiText>
            Эмоционального давления на себя Предприниматель не переносит —
            точнее, переносит как стихийное бедствие: собирает всю свою волю в
            кулак и терпеливо пережидает, пока кончится это испытание.
          </UiText>

          <UiText>
            Тому, кто хочет стать хорошим партнером любому из представителей
            этого типа, следует знать, что никогда и не при каких
            обстоятельствах «пилить» и упрекать Предпринимателя нельзя, хотя он
            нередко на это провоцирует своим поведением: ни к каким
            положительным результатам это не приведет, а отношения испортит
            настолько, что поправить их потом будет практически невозможно.
          </UiText>

          <UiText>
            Часто сам создает ситуацию, позволяющую ему быстро определить
            возможную расстановку сил: постарается каким-либо образом заявить
            свои права на лидерство и посмотреть, какова будет реакция.
          </UiText>

          <UiText>
            Предприниматель вообще болезненно переживает отрицательные эмоции со
            стороны окружающих. Например, когда ему демонстрируют обиду,
            раздражение, неприязнь, антипатию.
          </UiText>

          <UiText color="role">
            Терпеть не может, когда ноют, устраивают истерики, провоцируют
            ревность или скандал. Это его пугает, парализует: Предприниматель,
            при внешней настороженности и зажатости, все же дружелюбен,
            миролюбив и очень доброжелателен.
          </UiText>

          <UiText preset="large" color="role">
            Никакой обиды, никаких страданий он никому причинять не хочет, даже
            ненароком.
          </UiText>

          <UiText>
            Очень боится произвести на кого-либо неприятное впечатление,
            оставить о себе плохую память, плохое мнение. Поэтому он постоянно
            нуждается в этической коррекции со стороны партнера, что ему удобнее
            всего, разумеется, в партнерстве со своим дуалом, на этические
            ценности которого он подсознательно сориентирован.
          </UiText>

          <UiText color="accent">
            Например, если к нему обращаются с трудновыполнимой просьбой,
            старается не отказывать.
          </UiText>

          <UiText>
            Даже, когда заранее знает, что просьба невыполнима, не отказывает в
            категоричной форме, поскольку подсознательно настроен на уязвимую
            этику своего дуала Хранителя, обычно воспринимающего категоричный
            отказ как разрыв отношений.
          </UiText>

          <UiText>
            Самая трудная для Предпринимателя этическая ситуация — когда его
            партнер глубоко замыкается в себе.
          </UiText>

          <UiText>
            Такое состояние свойственно Хранителю в кризисной ситуации и
            Предприниматель его воспринимает как сигнал тревоги.
          </UiText>

          <UiText preset="large" color="role">
            Неопределенность выражаемых эмоций его по-настоящему настораживает и
            серьезно беспокоит. Он буквально начинает себя плохо чувствовать,
            когда видит, что на него действительно чем-то обижены.
          </UiText>

          <UiText>
            В такие минуты он ходит вокруг партнера кругами, напряженно
            вглядываясь в его лицо и пытаясь понять, что происходит. Со своей
            стороны он готов пойти на любые уступки, сделать все, что в его
            силах, лишь бы только вывести партнера из этого состояния.
          </UiText>

          <UiText>
            Предприниматель способен легко и быстро сходиться с людьми:
            Предприниматели как никто умеют «обрастать» друзьями. Впрочем, было
            бы неправильно считать, что представители этого типа позволяют легко
            завоевать свое расположение.
          </UiText>

          <UiText>
            Предприниматель далеко не всех подпускает на близкую дистанцию. На
            далекой дистанции Предприниматели очень недоверчивы — и этим они
            очень похожи на своего дуала Хранителя.
          </UiText>

          <UiText>
            Кроме того, Предприниматели знают, что не всегда умеют правильно
            разобраться в человеке, они всю жизнь этому учатся. Не любят
            знакомиться «вслепую». Не любят, когда им навязывают какие-то
            знакомства. Но на близкой дистанции доверчивы, и даже слишком.
          </UiText>

          <UiText color="role">
            Обмануть доверие Предпринимателя, значит, навсегда потерять его
            дружбу и уважение. Предприниматели очень болезненно переживают
            разочарование в дружбе и в любви, поскольку преданность и верность
            для них важнейшие этические ценности.
          </UiText>

          <UiText preset="large" color="role">
            За злоупотребление его доверием Предприниматель мстит, хотя по
            природе своей не мстителен.
          </UiText>

          <UiText color="role">
            Он не терпит лжи, лицемерия, несправедливости, оскорбления в любой
            форме, насилия и унижения.
          </UiText>

          <UiText>
            Проявление любого из этих явлений его не просто раздражает — бесит.
            Отстаивать свои интересы он может и с кулаками,но не дай Бог его до
            этого довести.
          </UiText>

          <UiText>
            Вспыльчивость для Предпринимателя — противоестественное состояние.
            Обычно это спокойные и уравновешенные люди.
          </UiText>

          <UiText>
            Предприниматели стараются контролировать свои эмоции, избегают
            общения с теми, кто их явно раздражает. С уважением относятся к
            чужому эмоциональному настрою и того же требуют для себя.
          </UiText>

          <UiText>
            Общаясь на далекой дистанции с малознакомым человеком,
            Предприниматели, иногда без видимой причины, «выпускают колючки».
            Объявляют себя «волком-одиночкой».
          </UiText>

          <UiText>
            Нужно обладать незаурядной этической смелостью, чтобы обратиться к
            такому «колючему Предпринимателю» с ласковым словом.
          </UiText>

          <UiText>
            К счастью, для его дуала Хранителя это не представляет никаких
            проблем. Он за внешней колючестью видит только глубоко ранимую душу,
            требующую к себе исключительно бережного отношения.
          </UiText>

          <UiText>
            Лично его колючесть Предпринимателя никак не отпугивает, а наоборот,
            даже приятно тонизирует. Достаточно уверенный в себе Хранитель
            способен приручить самого неприступного «волка-одиночку».
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">4 — Болевая функция.</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_comfort" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Комфорт</UiText>
              <UiText preset="body">Сенсорика ощущений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Предприниматель часто испытывает ощущение дискомфорта с самим собой
            и со своим окружением. В его движениях нередко наблюдается
            скованность, а подчас и некоординированность. Угловатость и
            напряженность в сочетании с неловкостью.
          </UiText>

          <UiText>
            Предприниматель раздражается, когда испытывает неприятные ощущения.
            Раздражается потому, что стыдится их.
          </UiText>

          <UiText>
            Он сам не понимает, почему, например, проявляя выносливость в
            экстремальных ситуациях, в обычных условиях он становится
            восприимчив к таким мелочам.
          </UiText>

          <UiText>
            Предприниматель плохо чувствует меру своих ощущений. Поэтому ему
            нужен партнер, который бы чувствовал это за него, который бы знал
            его вкусы, его привычки; который бы заранее побеспокоился о том,
            какие ощущения Предприниматель испытает в следующую секунду.
          </UiText>

          <UiText>
            Сам о себе Предприниматель может и не позаботиться, и именно поэтому
            забота со стороны партнера должна быть предельно предусмотрительной.
          </UiText>

          <UiText color="role">
            Важно, чтобы Предпринимателю были созданы все условия для
            полноценного отдыха. Не имеет значения, занимался он сегодня работой
            или целый день ничего не делал, но даже если он только что проснулся
            и сразу пошел смотреть телевизор, роптать не следует: значит, ему
            сейчас необходима «подзарядка» какими-то новыми впечатлениями и
            новой информацией.
          </UiText>

          <UiText preset="large" color="role">
            Кроме того, именно в период «вынужденной спячки» Предприниматель
            испытывает самые сильные беспокойство и напряжение.
          </UiText>

          <UiText>
            Находясь в своем нормальном, «деловом режиме», он вообще очень редко
            позволяет себе отдохнуть и расслабиться.
          </UiText>

          <UiText>
            Поэтому, если Предприниматель уже приготовился к отдыху, не нужно
            его напрягать: это его очень раздражает. Нельзя передвигать
            Предпринимателя с места на место, когда он уже сел есть, нельзя его
            отвлекать в этот момент разговорами или звать к телефону. Хотя на
            рабочем месте он может и есть и работать одновременно.
          </UiText>

          <UiText>
            Когда Предприниматель сам о себе заботится, он не расслабляется. Для
            Предпринимателя забота о себе — это только лишняя и не всегда
            целесообразная работа, поскольку в быту он очень неприхотлив и может
            обойтись без многого.
          </UiText>

          <UiText color="role">
            Принимая же заботу партнера, Предприниматель как бы рассчитывает,
            что ему помогут расслабиться. Поэтому на малейшее проявление
            дискомфорта реагирует очень болезненно.
          </UiText>

          <UiText color="accent">
            Например, отсутствие горячей воды на военных сборах — это нормально,
            но отсутствие горячей воды дома к моменту его прихода с работы —
            серьезное разочарование.
          </UiText>

          <UiText>
            Почему Хранителю всегда так важно знать время его прихода с работы?
            — Чтобы к этому моменту всегда были наготове и горячая вода и
            горячий обед, чтобы все дела в доме уже были закончены и чтобы
            Предпринимателю ничто не мешало спокойно отдыхать.
          </UiText>

          <UiText preset="large" color="role">
            Женщины-Предприниматели очень неохотно занимаются домашним
            хозяйством
          </UiText>

          <UiText>
            Предприниматель-домохозяйка — это вообще явление исключительное,
            особенно в наше время
          </UiText>

          <UiText>
            Особенно их раздражает необходимость разрываться между домом и
            бизнесом:
          </UiText>

          <UiText color="accent">
            «Мне срочно нужно делать телемаркетинг, а я тут как идиотка у плиты
            стою, суп варю, да еще затеяла эту уборку… »
          </UiText>

          <UiText>
            Отпуск по уходу за ребенком женщина-Предприниматель тоже старается
            совместить с наименее активным периодом своей карьеры:
          </UiText>

          <UiText color="accent">
            «Я так решила: пока еще у меня вся работа будет налаживаться, пока
            еще я буду компьютер осваивать, язык учить, я все равно дома сижу,
            так я за это время хоть ребеночка рожу… »
          </UiText>

          <UiText>
            Женщина-Предприниматель не всегда удачно подбирает себе одежду и
            косметику.
          </UiText>

          <UiText>
            Следует заметить, представительницы этого типа красивы чаще всего
            именно своей естественной красотой, косметика далеко не всегда их
            украшает, даже если макияж накладывается профессиональным гримером.
          </UiText>

          <UiText>
            Многие представители этого типа даже при классически красивой
            внешности считают себя непривлекательными.
          </UiText>

          <UiText>
            Считая свое лицо некрасивым, причем, совершенно незаслуженно, могут
            скрывать его под огромными черными очками, так что для всех остается
            загадкой — действительно ли у него такие некрасивые глаза или это
            миф?
          </UiText>

          <UiText>
            Скорее всего, это — миф. Предприниматель почти никогда не бывает
            уверен в собственном вкусе, в эстетичности своей внешности, в
            манерах своего поведения, что, кстати сказать, и приводит его к
            чрезмерной стеснительности, зажатости, «колючести».
          </UiText>

          <UiText preset="large" color="accent">
            Плохо чувствует расположение или нерасположение к себе окружающих.
            Не уверен, что может вызывать симпатии или быть любимым, и это его
            колоссальное заблуждение. Не ощущает своей привлекательности.
            Недолюбливает себя.
          </UiText>

          <UiText>
            В праздничной, парадно-официальной обстановке чувствует себя
            скованно. Хорошо ему там, где обстановка не требует парада и
            церемоний: на природе, в лесу, в походе, где допустимы простая
            спортивная одежда, естественное поведение, исключающее манерность.
          </UiText>

          <UiText>
            Иногда эстетическая самооценка Предпринимателя бывает настолько
            заниженной, что он предпочитает окружать себя явно ущербными людьми,
            иногда даже с физическими отклонениями.
          </UiText>

          <UiText>
            Или предпочитает грубые, дешевые удовольствия в компании людей
            заниженного социального статуса.
          </UiText>

          <UiText color="role">
            Беспорядок в быту Предпринимателю не мешает. К эстетическим
            качествам вещей он равнодушен. Часто в его одежде присутствует
            какая-либо эстетическая нелогичность.
          </UiText>

          <UiText>
            Зная за собой этот недостаток, Предприниматели очень не любят, когда
            их разглядывают в упор.
          </UiText>

          <UiText>
            Поэтому Хранитель никогда не смотрит на Предпринимателя своим
            «пронизывающим» взглядом, на близкой психологической дистанции
            Хранитель вообще ни на кого так не смотрит и никогда не делает
            замечаний относительно недостатков в его внешности и одежде — он
            может либо искренне посочувствовать человеку, одетому неудобно, либо
            предложить свое участие в решении этой проблемы, но критиковать не
            будет, если его, конечно, об этом не попросят.
          </UiText>

          <UiText>
            Проявление заботы о себе Предприниматель воспринимает, как выражение
            хорошего отношения. Только с таким партнером он по-настоящему
            расслабляется, только ему он по-настоящему доверяет.
          </UiText>

          <UiText>
            Получая достаточную поддержку по своей слабой функции,
            Предприниматель «открывается» для получения информации по своей
            «суггестивной» (внушаемой) функции.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">5 — Внушаемая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_people" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чувство</UiText>
              <UiText preset="body">Этика отношений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Эта функция формирует самые незыблемые ценности его типа. Она
            «слепая». Она пассивна. Она реализуется подсознательно и как бы
            является хранилищем жизненных ценностей и установок, которые
            формируют мировоззрение Предпринимателя.
          </UiText>

          <UiText color="role">
            Это — индикатор, с которым он сверяет информацию о поступках
            окружающих его людей.
          </UiText>

          <UiText>
            Предпринимателю необходимо знать побудительные мотивы поступков,
            знать, кто действительно к нему хорошо относится, а кого не мешало
            бы и поостеречься.
          </UiText>

          <UiText>
            Поскольку Предпринимателю самому довольно трудно понять и
            проанализировать это, он нуждается в человеке, который превосходно
            понимает все тонкости взаимоотношений и всегда может его очень
            подробно в этом вопросе проконсультировать.
          </UiText>

          <UiText>И именно в этом его дуал Хранитель вне конкуренции.</UiText>

          <UiText>
            Подсознательно сориентированный на высокие моральные и нравственные
            установки, Предприниматель также является защитником и хранителем
            важнейших этических ценностей. Дружба, любовь, преданность интересам
            дела, интересам своей «команды» — позитивная основа его этики, его
            этический фундамент.
          </UiText>

          <UiText>
            Так же как и Хранитель, Предприниматель предъявляет к партнеру очень
            высокие этические требования, хотя и проявляет гораздо большую
            терпимость к некоторым незначительным отклонениям от важнейших
            нравственных принципов. В отличие от Хранителя Предприниматель не
            всегда чувствует, когда его обманывают: он это вычисляет логически,
            но, раз уличив партнера во лжи, никогда ему этого не забудет и не
            простит.
          </UiText>

          <UiText>
            Любой кризис отношений Предприниматель переживает очень болезненно.
            И самое страшное для Предпринимателя, когда партнер либо не может,
            либо не желает вывести его из этого состояния.
          </UiText>

          <UiText>
            Хранитель в этом отношении опять же предпочтительнее всех других
            партнеров: он не только не допустит кризиса отношений, но даже
            малейшей неопределенности в них не потерпит.
          </UiText>

          <UiText>
            В ситуации кризиса отношений Предприниматель ощущает свою
            неспособность к каким-либо решительным действиям. Подсознательно он
            настроен на то, чтобы отношения из кризиса выводил его партнер, хотя
            испортить их он вполне может и собственными силами.
          </UiText>

          <UiText preset="large" color="role">
            И в процессе формирования отношений Предприниматель подсознательно
            рассчитывает, что всю инициативу на себя возьмет его партнер.
          </UiText>

          <UiText>
            И Хранитель действительно предрасположен к тому, чтобы взять на себя
            всю этическую и волевую инициативу, если, конечно, не слишком скован
            предрассудками.
          </UiText>

          <UiText>
            Со своей стороны, Предприниматель охотно берет на себя всю деловую
            инициативу в развитии отношений: он всегда найдет способ преодолеть
            любые препятствия, любые расстояния — главное, чтобы его партнер не
            испытывал никаких затруднений или неудобств.
          </UiText>

          <UiText>
            Проблема Предпринимателей в том, что Хранитель не единственный
            психологический тип, способный взять на себя инициативу в развитии
            отношений, кроме того, как всякий дуал, для Предпринимателей он
            менее всего заметен и наименее привлекателен.
          </UiText>

          <UiText>
            Поэтому Предприниматели часто уступают инициативе психологически
            несовместимых с ними партнеров, что особенно болезненно сказывается
            именно в период кризиса отношений: партнеры-логики, к примеру,
            обладая слабой этикой, не могут вывести отношения из кризиса, а
            психологически несовместимые партнеры-этики сами способны
            спровоцировать осложнение отношений, чтобы использовать его как
            средство эмоционального воздействия.
          </UiText>

          <UiText>
            Предприниматель всегда замечает, когда им пытаются этически
            манипулировать. Другое дело, он не всегда знает, как следует на это
            реагировать.
          </UiText>

          <UiText preset="large" color="role">
            Ему необходимо время, чтобы разобраться, какой характер отношений
            стоит за всеми этими манипуляциями.
          </UiText>

          <UiText>
            Если он приходит к выводу, что такой способ отношений не слишком
            усложняет его жизнь, то вполне может втянуться в эту чуждую ему
            этическую игру. Хотя, в принципе, никаких этических игр
            Предприниматель не признает: он ненавидит лицемерие, двуличие,
            фальшь, неискренность; терпеть не может, когда с ним лукавят, когда
            перед ним ставят какие-то неопределенные этические цели, иными
            словами — морочат голову.
          </UiText>

          <UiText>
            Предприниматели не из тех партнеров, которые легко отбиваются от
            своей «законной половины».
          </UiText>

          <UiText>
            В случае сильного психологического дискомфорта и неспособности
            что-либо изменить в отношениях он может и сам уйти из семьи. Но
            «отбиваться», даже в случае более привлекательной альтернативы, не
            будет.
          </UiText>

          <UiText>
            При внешней этической мобильности Предприниматель на самом деле в
            этическом плане очень консервативен, что создает ему дополнительные
            проблемы в случае альянса с психологически несовместимыми
            партнëрами.
          </UiText>

          <UiText>
            Хранитель — единственный, кто может гарантировать Предпринимателю
            полнейшее отсутствие проблем по аспекту этики отношений.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">
            6 — Активационная функция
          </UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_will" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Воля</UiText>
              <UiText preset="body">Волевая сенсорика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Предпринимателя в большей степени зависят от благоприятных внешних
            условий, чем от личных волевых усилий.
          </UiText>

          <UiText color="role">
            И тем не менее из критической ситуации его часто выводит именно
            волевое усилие, которое он решает сделать над собой — если не из
            личных побуждений, то уж хотя бы в интересах «своей команды», перед
            которой всегда чувствует большую ответственность.
          </UiText>

          <UiText>
            При всей своей прагматичности и практичности Предприниматели имеют
            обыкновение периодически «зависать в облаках».
          </UiText>

          <UiText preset="large" color="role">
            Казалось бы, Предприниматель не должен делать ничего
            нецелесообразного, поскольку это противоречит программе его
            интеллекта.
          </UiText>

          <UiText color="role">
            И тем не менее его цели иногда оборачиваются миражами, поскольку,
            как любой интуит, он не всегда реалистично смотрит на вещи.
          </UiText>

          <UiText>
            В такой период многое зависит от того, насколько быстро он сможет
            сделать над собой волевое усилие, отказаться от ошибочных планов,
            поставить перед собой новые цели и настроиться на их реализацию.
          </UiText>

          <UiText>
            Предприниматель нуждается в партнере, который может сориентировать
            его на практические цели и убедить в эфемерности его прежних
            замыслов. Ему самому довольно трудно сделать над собой волевое
            усилие, особенно в ситуации кризиса своих планов.
          </UiText>

          <UiText preset="large" color="role">
            Поэтому он активизируется, когда в его жизни появляется новая,
            соответствующая его программе цель, имеющая позитивный смысл,
            определенное направление и возможность реального приложения сил.
          </UiText>

          <UiText color="role">
            Цель, которая выведет его из вынужденного бездействия и бесполезного
            ожидания перемен. Цель, ради которой ему захочется напряженно
            работать и преодолевать трудности.
          </UiText>

          <UiText>
            И именно такую цель задает ему его дуал Хранитель, который хотя и не
            может видеть перспектив, но иногда довольно отчетливо видит
            бесперспективность какого-либо начинания и потому не позволяет
            Предпринимателю застревать на каких-то слишком отдаленных и
            нереальных планах.
          </UiText>

          <UiText>
            Творчески манипулируя различными приемами волевого воздействия,
            Хранитель заставляет Предпринимателя переключиться на более реальные
            и актуальные задачи.
          </UiText>

          <UiText>
            Известно, что Предприниматель не любит запускать свои дела. Но тем
            не менее это периодически происходит. И поскольку для него
            «выправлять» свои дела также неприятно, как и чинить что-нибудь
            поломанное, рядом должен быть кто-то, кто заставит его это сделать.
          </UiText>

          <UiText>
            Разумеется, заставить Предпринимателя подчиниться прямому волевому
            давлению невозможно, он сам этого не допускает. Более того, такой
            способ волевого воздействия ставит под удар этику взаимоотношений с
            ним.
          </UiText>

          <UiText>
            Поэтому в случае с Предпринимателем волевое давление должно быть
            гибким, творческим, а этика отношений — принципиальной. То есть, как
            бы ни был обижен Предприниматель на то, что его постоянно принуждают
            делать над собой усилие, эти обиды должны быстро и легко
            сглаживаться партнером с тем, чтобы не перерастать в кризис
            отношений, что возможно только в партнерстве с Хранителем.
          </UiText>

          <UiText color="role">
            Как любой интуит, Предприниматель по своей природе довольно рассеян.
          </UiText>

          <UiText>
            Не всегда помнит, куда он положил ту или иную вещь. Уборка и
            наведение порядка для него не самое приятное занятие. И тем не
            менее, когда Предприниматель при всем своем безразличии к бытовому
            беспорядку попадает в условия, где порядок строго и неукоснительно
            соблюдается, как это обычно бывает в доме Хранителя, его это и
            организует, и тонизирует…
          </UiText>

          <UiText>
            Один из первых признаков выхода Предпринимателя из душевного кризиса
            — упорядочение им своего образа жизни, интерес к спорту, здоровью,
            физическая, духовная и интеллектуальная работа над собой.
          </UiText>

          <UiText color="role">
            Предприниматель охотно сделает какую-либо работу, окажет услугу
            скорее по просьбе другого, чем по собственному побуждению, если это
            кому-нибудь нужно — это имеет смысл сделать.
          </UiText>

          <UiText>
            Сами Предприниматели не стремятся намеренно подчинять кого-либо
            своей воле. Предприниматель прекрасно умеет организовать работу,
            распределить ее, но принуждать кого-либо ее делать не будет. Ему
            легче материально стимулировать, заинтересовать, воодушевить своим
            энтузиазмом, а заставлять — это не его метод. Просить, кстати
            сказать, он тоже не будет: не исключает, что ему могут отказать, а
            это всегда неприятно.
          </UiText>

          <UiText preset="large" color="role">
            Предприниматель глубоко демократичен. Никакими внешними атрибутами
            власти не прельщается, связями, положением в обществе не кичится,
            ненавидит снобов.
          </UiText>

          <UiText color="role">
            Оценивает людей по их реальным делам и способностям. Преимущество
            власти рассматривает только как возможность полноценно реализовать
            свой творческий потенциал.
          </UiText>

          <UiText>
            Предприниматели не склонны к злоупотреблению властью. Более того,
            они даже могут не подчиниться жестокому или несправедливому, по их
            мнению, приказу. Могут на свой страх и риск не придерживаться
            недостаточно гуманных инструкций.
          </UiText>

          <UiText>
            С удовольствием Предприниматель берет на себя роль лидера и
            прекрасно с ней справляется. Чем больше полномочий получает
            Предприниматель, тем более активизируется и тем успешнее и
            масштабнее работает.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">7 — Функция защиты</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_logic" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Теория</UiText>
              <UiText preset="body">Структурная логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Эта функция дополняет логическую программу Предпринимателя,
            подготавливает для нее теоретическую базу, осуществляет сбор и
            обработку информации. Контролирует ее логичность и достоверность.
          </UiText>

          <UiText color="role">
            Предпринимателя возможно убедить только фактами и логически
            безупречными концепциями. Подсознательно он всегда отмечает для себя
            все логические неувязки и фактические несоответствия в любой
            высказанной ему мысли, в любой предложенной ему теории.
          </UiText>

          <UiText>
            Обладает прекрасной памятью, легко запоминает новую информацию,
            стараясь сразу же ее систематизировать.
          </UiText>

          <UiText>
            Подбор информации делает очень основательно, по возможности из самых
            авторитетных источников. Для Предпринимателя очень важна именно
            достоверность источников информации.
          </UiText>

          <UiText preset="large" color="role">
            Как правило, он опирается только на те факты, в достоверности
            которых лично убежден. Поэтому ему всегда неприятно разочаровываться
            в источнике информации: для него это так же, как и разочарование в
            дружбе — он доверился, а его подвели.
          </UiText>

          <UiText color="role">
            Такой пример: пятилетний ребенок-Предприниматель впервые попал на
            бабушкин огород, где ему показали грядку с репкой, причем репка,
            вопреки его ожиданиям, выглядела очень маленькой, и он решил
            попробовать выдернуть ее собственными силами, что у него легко
            получилось. А дальше он попал в противоречие между реальным фактом и
            источником информации, где было сказано, что репку тянули всей
            семьей и вытянуть не могли. Предприниматель решил, что все-таки надо
            проверить факты и повторял свой опыт до тех пор, пока не передергал
            всю репку на грядке. После этого он впервые задумался, что источники
            информации могут быть и недостоверными.
          </UiText>

          <UiText>
            Сбор информации у Предпринимателей осложняется тем, что они не могут
            себе позволить слишком растягивать во времени этот процесс: ведь так
            и само дело уже может стать несвоевременным.
          </UiText>

          <UiText>
            Предпринимая новое важное дело, всегда старается получить именно
            исчерпывающую информацию: исходя из интересов дела и чувства
            ответственности перед своей командой, он не позволяет себе
            легкомысленно относиться к этому вопросу.
          </UiText>

          <UiText>
            Собирая информацию, Предприниматель старается быть предельно
            дальновидным и предусмотрительным - ему обязательно нужно учесть
            возможные перемены и изменения условий в будущем.
          </UiText>

          <UiText color="accent">
            Например: просчитывая статью расхода, он, как правило, учитывает
            зависимость ее от каких-то непредвиденных обстоятельств: возможного
            роста цен, инфляции, повышения налогов, повышения тарифов на услуги,
            связанные с обслуживанием и страхованием. То есть сбор информации
            осуществляется «по заявке» его последующей психической функции —
            «интуиции возможностей».
          </UiText>

          <UiText preset="large" color="role">
            Предпринимателю свойственно подмечать любое искажение известных ему
            сведений. Очень не любит, когда «передергивают» факты и тем самым
            искажают истину — это его глубоко возмущает.
          </UiText>

          <UiText>
            Как бы он ни был, казалось бы, расслаблен или рассредоточен, любое
            логическое противоречие его моментально настораживает.
          </UiText>

          <UiText>
            Предприниматель — принципиальный противник манипулирования фактами,
            даже если это не меняет сути концепции. Он не всегда с легкостью
            согласится признать, что один и тот же факт является следствием
            самых разных причин.
          </UiText>

          <UiText>
            И не потому, что ему это в принципе трудно понять: просто, принимая
            для себя какую-либо теорию, Предпринимателю важно быть уверенным в
            ее логической последовательности. Точно так же, воспринимая
            какую-либо информацию, он должен быть уверен, что она не основана на
            подтасовке фактов.
          </UiText>

          <UiText>
            В связи с этим иногда возникают проблемы на начальном этапе
            дуализации Предпринимателя с Хранителем: у Хранителя, как известно,
            манипулятивная этика, и с фактами он обращается довольно свободно —
            одному и тому же факту он может придавать противоположное значение и
            большого греха в этом не видит. Это обстоятельство будет
            настораживать Предпринимателя до тех пор, пока он не поймет, что
            логика Хранителя — это не более, чем форма убеждения, которая как
            раз именно на него, Предпринимателя, и рассчитана.
          </UiText>

          <UiText>
            Все свои действия Предприниматель старается строить на основании
            многократно проверенного личного опыта.
          </UiText>

          <UiText>
            Свои технологические методики он разрабатывает тоже на основании
            многократно проверенно личного опыта. Поэтому всякую критику своих
            собственных, «выстраданных» методик воспринимает очень болезненно.
          </UiText>

          <UiText color="role">
            В области научных экспериментов Предприниматели очень смело
            нарабатывают свой личный опыт, причем, начиная с самого раннего
            детства.
          </UiText>

          <UiText>
            Вряд ли найдется хоть один представитель этого типа, который бы хоть
            раз в жизни чего-нибудь не взорвал, не спалил, не пережег.
          </UiText>

          <UiText color="role">
            Очень любят изобретать, мечтают раздвинуть горизонты науки. Своими
            изобретениями очень гордятся, независимо от того, как к этому
            относятся окружающие.
          </UiText>

          <UiText>
            Теоретическая логика Предпринимателя создает информационную базу и
            является предпосылкой его последующей психической функции — интуиции
            возможностей.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">8 — Фоновая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_ideas" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Мысль</UiText>
              <UiText preset="body">Интуиция возможностей</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Этот аспект для Предпринимателя чрезвычайно важен. Подсознательно он
            сравнивает собственные возможности с возможностями других, потому
            что это та область, в которой ему постоянно хочется работать над
            собой и непременно получать высокую оценку.
          </UiText>

          <UiText color="accent">
            Не следует думать, что вследствие этого качества Предприниматель
            завистлив к чужим успехам — ни в коем случае! И хотя он
            действительно не любит, когда ему ставят в пример людей, добившихся
            в жизни большего, чем он, но это только потому, что обычно
            предпочитает сам решать, каким успехам стоит подражать, а каким —
            нет.
          </UiText>

          <UiText>
            Подсознательно Предприниматель чувствует, что это качество ему дано
            для того, чтобы кого-то выручать, вызволять того, кто слабее его,
            того, кто попал в беду, что объясняется подсознательной ориентацией
            на слабую интуицию своего дуала Хранителя.
          </UiText>

          <UiText color="accent">
            Многие представители этого типа в детстве мечтали работать
            спасателями, пожарниками, совершать подвиги и защищать слабых.
          </UiText>

          <UiText preset="large" color="role">
            Предприниматель всю жизнь готовит себя к этой миссии. На протяжении
            всей жизни учится преодолевать препятствия, мечтает развить в себе
            какие-то сверхъестественные возможности.
          </UiText>

          <UiText>
            Даже в зрелом возрасте он может с удовольствием смотреть
            какой-нибудь полудетский боевик, представляя себя на месте
            непобедимого киногероя.
          </UiText>

          <UiText>
            Предприниматель уважает людей, которые многого добились в жизни
            благодаря своему трудолюбию, бесстрашию, упорству, дальновидности,
            здравому смыслу; уважает людей с фантазией, людей, работающих над
            собой, развивающих свои способности.
          </UiText>

          <UiText preset="large" color="role">
            Предприниматель азартен, любит принимать участие в состязаниях силы,
            ловкости и выносливости. Причем к таким состязаниям он подключается
            спонтанно.
          </UiText>

          <UiText color="accent">
            Например, у него может возникнуть желание повторить только что
            увиденный акробатический трюк.
          </UiText>

          <UiText preset="large" color="role">
            Легко включается в пари, в молодости его можно без труда взять на
            «слабо». Предприниматели с самого раннего возраста начинает
            интересовать предел его физических возможностей, предел его
            выносливости и смелости.
          </UiText>

          <UiText color="accent">
            Десятилетняя девочка-Предприниматель «испытывала» себя, сидя верхом
            на перилах балкона, на высоте 8-го этажа.
          </UiText>

          <UiText>
            Предпринимателям очень важно раздвигать границы допустимых
            возможностей. И если, бывает, в первых опытах они еще иногда
            осторожничают, то затем повторяют свои «рекорды» по возможности
            многократно. И очень этим гордятся.
          </UiText>

          <UiText>
            Причем эти «рекорды» далеко не всегда являют собой достойный образец
            для подражания — иногда они носят явно «гусарский» характер.
          </UiText>

          <UiText preset="large" color="role">
            Предприниматели любят демонстрировать свое бесстрашие и отвагу.
          </UiText>

          <UiText>
            В молодости часто проявляют демонстративную бесшабашность,
            беспечность, умеют и любят рисковать. Рассказывая о своих
            достижениях, Предприниматель никогда не приписывает себе ничего
            лишнего — не любит пустого бахвальства. Если кто-то сомневается в
            его подвигах, готов их тут же продемонстрировать.
          </UiText>

          <UiText>
            В зрелом возрасте риск Предпринимателя базируется на точных расчетах
            и хорошо развитой интуиции.
          </UiText>

          <UiText>
            Предприниматели любят играть в азартные игры, часто покупают
            лотерейные билеты, хотя им бывает лень пойти проверить свой выигрыш.
          </UiText>

          <UiText>
            Для них это не более, чем ожидание счастливых перемен или
            своеобразная тренировка интуиции, вроде как «сводка погоды», по
            которой они проверяют, благоволит ли им сегодня удача.
          </UiText>

          <UiText>
            Говоря о своих успехах, Предприниматель старается не подвергать
            критике возможности и способности других. Старается их не обсуждать.
          </UiText>

          <UiText>
            Подсознательно настроен на слабую интуицию своего дуала Хранителя.
          </UiText>

          <UiText>
            Не любит никого специально экзаменовать или испытывать. Если и
            задаст вопрос «на засыпку», то лишь из любознательности, а не из
            самоутверждения.
          </UiText>

          <UiText color="role">
            Предпринимателям всегда интересно узнать жизнь на самых крутых ее
            изломах. Иногда создается впечатление, что они живут как в
            приключенческой киноленте. Смолоду готовят себя к серьезным
            жизненным испытаниям. Их привлекают романтика рискованных
            приключений, работа в условиях повышенной опасности, в тяжелых
            климатических условиях.
          </UiText>

          <UiText>
            Многие из них пробуют себя в различных видах спорта. Предпринимателю
            всегда хочется испытать то, что он еще не испытывал. Даже если ему
            приходилось в жизни, например, водить корабль, он будет сожалеть о
            том, что вот самолетом он еще никогда не управлял.
          </UiText>

          <UiText>
            Другой пример — если открывается какая-нибудь новая дорога,
            Предпринимателю обязательно нужно по ней проехать: «Как это, уже три
            дня, как построили новый мост, а я еще ни разу по нему не проезжал!»
            Предприниматели — прирожденные первопроходцы и первоиспытатели.
            Предпринимателю необходимо попробовать все, что для него ново и
            неизведанно, и не дай Бог его этого лишить.
          </UiText>

          <UiText>
            Предприниматель-нытик — это исключительное явление. Редко кто и
            только из самого близкого окружения может увидеть его в подавленном
            состоянии, не скрывающим своего отчаяния.
          </UiText>

          <UiText>
            Разумеется, в условиях психологического дискомфорта Предприниматель,
            как любой человек, «развинчивается», а следовательно может и ныть, и
            раздражаться по пустякам, но для психологически уравновешенного
            Предпринимателя это не свойственно.
          </UiText>

          <UiText>
            Смерть как реальность представители этого типа плохо воспринимают,
            не верят, что могут потерять близкого человека, и именно поэтому
            утрату своих близких переживают исключительно болезненно, хотя и
            скрывают свои переживания.
          </UiText>

          <UiText preset="large" color="role">
            Предприниматели очень жизнелюбивы и оптимистичны, любят насыщенный
            жизненный ритм: активный, динамичный труд и активный отдых.
          </UiText>

          <UiText color="role">
            Любят путешествия, походы на байдарках или велосипедах, любят
            туристические песни, дым костра, романтику странствий. Любят слушать
            и читать истории о всяких аномальных явлениях, интересуются
            фантастикой и приключениями. Нередко поражают необычайной широтой
            познаний во многих областях.
          </UiText>

          <UiText>
            Предприниматель обычно старается никого не подводить, более того, в
            трудную минуту он видит свою обязанность в том, чтобы найти выход из
            любого затруднительного положения не только для себя, но и для
            «своей команды».
          </UiText>

          <UiText>
            «Своя команда» для Предпринимателя — святое понятие. По просьбе
            друга он может пойти и в огонь и в воду: может, например,
            бескорыстно сдать кровь для совершенно не знакомого ему человека,
            может отдать все свои сбережения друзьям, оказавшимся в
            затруднительном положении.
          </UiText>

          <UiText>
            Для спасения своей команды Предприниматель может совершать чудеса
            смелости, находчивости и выносливости, и тем не менее в быту может
            быть совершенно безразличен к просьбам и поручениям своих близких.
          </UiText>

          <UiText color="role">
            Предприниматель совершенно ужасно себя чувствует, когда видит, что
            невольно становится виновником проблем «своей команды», особенно,
            если он не может достаточно быстро эти проблемы решить.
          </UiText>

          <UiText preset="large" color="role">
            Его раздражает, когда кто-то его в чем-либо подводит или создает
            дополнительные проблемы, осложняющие его собственные планы.
          </UiText>

          <UiText>
            Предприниматель старается избегать «проблемных» людей, и ему самому
            всегда неприятно быть источником чьих-то проблем.
          </UiText>

          <UiText>
            При любых обстоятельствах он демонстрирует уверенность и оптимизм,
            старается не показывать своего страха и не демонстрировать своих
            страданий. Всегда спокоен, невозмутим, всегда говорит ровным и
            бодрым голосом.
          </UiText>

          <UiText>
            Своей жизнестойкостью, оптимизмом, жизнелюбием, здоровым
            авантюризмом, фантазией, оригинальностью мышления Предприниматель
            внушает уверенность в завтрашнем дне своему дуалу Хранителю, выводит
            его из многих жизненных тупиков, прививает вкус к приключениям, учит
            радоваться жизни, открывает перед ним новые неизведанные
            возможности, делает его жизнь богаче, интереснее и насыщеннее
            радостными событиями.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
