<template>
  <div class="text g-page">
    <section>
      <UiText preset="subtitle" color="accent">Сильные стороны</UiText>

      <UiText preset="large" color="role">
        Хорошо разбирается в отношениях между людьми. Добросовестен, обязателен,
        пунктуален.
      </UiText>

      <UiText>
        Ко всему готовится заблаговременно. Выполняет начатую работу тщательно и
        последовательно. Человек долга.
      </UiText>

      <UiText>
        Не жалеет сил и времени для создания порядка. Заставляет себя делать
        даже неинтересную, но необходимую работу.
      </UiText>

      <UiText preset="large" color="role">
        Хороший экономист, умеет рационально обращаться с финансами, не любит
        долгов. Имеет сильную выдержку и самообладание.
      </UiText>

      <UiText>
        Принципиален, если надо, твердо и напористо защищает себя и своих
        близких. Постоянен в своих привычках и привязанностях. Нетерпим к
        неопрятности и халтуре, требует соблюдения оправдавших себя методов
        работы.
      </UiText>

      <UiText>
        Охотно приходит на помощь людям в трудные для них минуты, оказывает
        различные услуги. Хранит верность в семье. На мероприятия не опаздывает.
      </UiText>

      <UiText>
        Стремится равномерно распределять дела по времени, постоянно загружен
        какой-либо работой.
      </UiText>

      <UiText>Трудолюбив в быту.</UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">Проблемы</UiText>

      <UiText>
        Болезненно переносит несправедливость и неэтичность. Раним и
        впечатлителен, на добро и зло отвечает тем же.
      </UiText>

      <UiText>
        Хорошо видит чужие недостатки, отличается резкостью оценок, но чаще своё
        отношение выражает не столько словами, сколько тоном и взглядом.
      </UiText>

      <UiText>
        Склонен делить людей на «своих» и «чужих». Не прощает предательства.
      </UiText>

      <UiText>
        Мнителен, плохо переносит ситуации неопределенности. Не любит частых
        перемен. Ему трудно определить индивидуальные способности людей, ко всем
        склонен предъявлять одинаково высокие моральные требования.
      </UiText>

      <UiText preset="large" color="role">
        Не любит, когда кто-то подвергает оценке его качества, так как внутренне
        не всегда в них уверен. При попытках подавить его может проявлять
        агрессивность.
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Нельзя требовать и ожидать
      </UiText>

      <UiList iconName="chevron-right" iconColor="accent" iconSize="16">
        <UiListItem>Всегда позитивного отношения к жизни.</UiListItem>

        <UiListItem>Равнодушного отношения к аморальным поступкам.</UiListItem>

        <UiListItem>Быстрой перемены в убеждениях и оценках.</UiListItem>

        <UiListItem>
          Восприимчивости к неординарным решениям проблем.
        </UiListItem>
      </UiList>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Подходящие виды деятельности
      </UiText>

      <UiText>
        Социальная сфера. Те её области, где требуется взаимодействие с людьми.
      </UiText>

      <UiText>
        При этом работа может быть кропотливой, требующей сосредоточенности и
        концентрации внимания, как-то: медицина и здравоохранение, особенно
        прикладные области — стоматология, массаж, работа медицинской сестры,
        непосредственное проведение процедур, иглоукалывание, физиотерапия,
        рентгеноскопия, биохимическая диагностика.
      </UiText>

      <UiText>
        Хорошо проявляют себя также в области товароведения, в сфере
        обслуживания — хранение денег и материальных ценностей, в бухгалтерской
        работе обслуживающего характера, на должности кассира.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
