<template>
  <div class="text">
    <section>
      <UiText preset="body" color="accent">
        Описания не должны обязательно совпадать со всеми чертами характера
        личности.
      </UiText>

      <UiText preset="small" color="accent">
        Идея как раз описать наблюдаемые у среднего представителя типа
        особенности поведения и обработки информации психикой.
      </UiText>

      <UiText preset="small" color="accent">
        Автор описания — Велта Микелсоне
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="role">
        Человек с ярко выраженной драматической внутренней и внешней
        эмоциональностью.
      </UiText>

      <br />

      <UiText>
        Прирожденный актер, человек, чувствующий атмосферу и оттенки эмоций
        окружающей его действительности. Умело улавливает эмоциональное
        состояние других — изучает душу человека, распознавая радость, горе или
        страдания.
      </UiText>

      <UiText preset="large" color="role">
        Этим он увлечен всю свою жизнь, независимо от выбранной ему профессии.
      </UiText>

      <UiText>
        Он шутит, смеется, иронизирует, подбадривает и даже внушает страх в
        людях. Его натура переполнена богатыми душевными переживаниями.
        Наставник — человек с огромным талантом, умеющий менять «маски»,
        драматизировать ситуацию. Именно по этой причине он один из талантливых
        режиссеров и актеров.
      </UiText>

      <UiText>
        Умело создает веселую или драматическую ситуацию, иногда чтобы привлечь
        внимание окружающих или ему просто скучно. Он постоянно нуждается в
        острых эмоциях.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Талантливо управляет своим голосом, мимикой, сопровождая живыми жестами.
      </UiText>

      <UiText>
        В зависимости от того, что преобладает в обществе, моментально применяет
        все эти качества — увидев скучного человека, тут же берется его ободрить
        и успокоить. Ему трудно понять равнодушного, скрывающего свои эмоции
        человека.
      </UiText>

      <UiText>
        В таком случае способен разыграть трагическую сцену с целью его оживить.
        Может привлечь почти любого человека. Также он быстро и часто меняет
        свой «образ», изображая обиженного и непонятого человека, и может
        повторить этот спектакль по несколько раз в день.
      </UiText>

      <UiText preset="large" color="role">
        В ситуациях, когда плохо принимают его театральность, ему становится «не
        по себе».
      </UiText>

      <UiText>
        Всегда быть в курсе обо всем, искать виноватых, осуждать их – это его
        дело. Если занимает высокий пост, способен создать крупные перевороты в
        политике. И о его подвигах история не молчит. Не всегда он находит себе
        применение в политике.
      </UiText>

      <UiText preset="large" color="role">
        Благодаря своей дальновидности и осмотрительности, способен дать
        полезные советы и прогнозы в обществе.
      </UiText>

      <UiText>
        Он не только прогнозирует отношения в широком кругу, он талантливо
        предвидит и определяет эмоциональный настрой в крупном масштабе.
      </UiText>

      <UiText>
        Обладает высокой самооценкой, жизнерадостный, деятельный, энергичный,
        непреклонный.
      </UiText>

      <UiText>
        Интересует не только его личная судьба, но и судьба всего общества.
        Стратег, который талантливо распределяет каждое действие в определенный
        момент времени.
      </UiText>

      <UiText preset="large" color="role">
        Чувствует необходимость наполнить свою жизнь и жизнь окружающих яркими
        событиями.
      </UiText>

      <UiText>
        Способен предвидеть в эмоциональном плане продолжительность и важность
        каждого мгновения. Он задает темп событиям и в совершающихся действиях.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Умело манипулирует временем. Может своевременно устранить, а при
        необходимости создать искусственные проблемы.
      </UiText>

      <UiText>
        Такими манипуляциями талантливо выигрывает время для обдумывания, чтобы
        осуществлять свои намерения.
      </UiText>

      <UiText>
        В искусстве сильно отличается от других. Будучи актером, входит в роли
        разного характера и талантливо их исполняет.
      </UiText>

      <UiText preset="small" color="accent">
        Его картины кардинально отличаются от картин других художников. Без
        сомнения в них отражается его многогранный мир, картины перенасыщены
        многообразными персонажами, при этом находящиеся в движении.
      </UiText>

      <UiText preset="small" color="accent">
        Люди изображены с необыкновенной внешностью. Например, голова человека
        может иметь фантастический и необычный вид, иногда руки и ноги не
        человеческие – это все то, что он воображает в своей голове. Картина
        никогда не бывает монотонной, на ней изображены не только люди, но и
        животные, птицы, витающие облака, часто что-то падает с неба, например,
        нож. Кроме этого в картинах отображается его представление о будущем.
      </UiText>

      <UiText preset="large" color="role">
        Не представляет свою жизнь в спокойном, в лишенном эмоций, обществе.
      </UiText>

      <UiText>
        Он не минуты не может усидеть на месте, ему необходимо быть в постоянном
        движении. Также ему необходимо, чтобы жизнь была насыщенна эмоциями и
        препятствиями.
      </UiText>

      <UiText>
        Последние его вдохновляют больше всего. Бывают в жизни такие моменты,
        когда не хватает действия, когда наступают, так называемые, серые дни, и
        это грозит депрессией — кругом слышно только плохое, потерял работу, на
        совести висит неоплаченный кредит. Тогда он придумывает, где найти
        радость.
      </UiText>

      <UiText>
        Один из способов — посетить шоппинг центр или места, где собирается
        большое скопление людей. Может ходить по супермаркетам без гроша в
        кармане, лишь радуясь тому, что видит — яркие рекламы, суета людей,
        азартность покупателей, музыка. Так он обязательно находит положительный
        заряд и его энергия восстанавливается.
      </UiText>

      <UiText>
        Умело предвидит и предупреждает общество о назревании критических
        положений – переворотов, беспорядков, бунтов. В главе о решительных
        поворотах истории именно ему важно быть в центре событий.
      </UiText>

      <UiText>
        Не равнодушен к тому, что происходит в мире. Его волнует всё, что
        разрушает мир — война, потоп, катастрофы, что люди остаются без приюта.
        Тогда он рад за себя — как хорошо, что я живу в стране, где этого ничего
        нет. Лишь бы не было войны!
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Ему мало важен настоящий момент времени, вся сущность его связана с
        прошлым или будущим.
      </UiText>

      <UiText>
        Ему необходимо быть уникальным и добиваться высокого профессионализма в
        своей должности. Но, поскольку он представитель творческой деятельности
        и обладает высокой эмоциональностью, это создает препятствие в разумном
        управлении коллективом.
      </UiText>

      <UiText>
        Внутри испытывает ощущение неуверенности и чувствует недостаток своих
        деловых способностей. Из-за повышенной эмоциональности часто склонен
        смешивать служебные обязанности с личной жизнью.
      </UiText>

      <UiText preset="large" color="role">
        С трудом формулирует обязанности сотрудников, неумело распределяет
        работу и нагрузку.
      </UiText>

      <UiText>
        Слабо выражены способности понять процесс хозяйственной,
        административной деятельности. Чаще всего в таких учреждениях царит
        хаос.
      </UiText>

      <UiText>
        Вне творческих отраслей он слабо оценивает квалификации сотрудников,
        неумело требует от них качественного и профессионального выполнения
        работы.
      </UiText>

      <UiText>
        Его консервативность и шаблонность заставляет придерживаться испытанных
        и проверенных методов действия. С трудом разбирается, что на данный
        момент важнее, а что второстепенное, его подчиненные сотрудники страдают
        от неопределенности. Обычно про такие учреждения говорят, что они ели
        держатся. Критику в свой адрес Наставник воспринимает болезненно.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Ему не свойственна пунктуальность и точность, не требует этих качеств от
        других.
      </UiText>

      <UiText>
        С трудом располагает к себе подчиненных, неумело организует и руководит,
        прямые упреки выражает неуверенно, в коллективе царит
        неудовлетворенность. Избегает излишней ответственности, старается
        делегировать это другим. Как обычный сотрудник часто себя преподносит
        как всесторонне развитого человека.
      </UiText>

      <UiText>
        Но он неумело оценивает свои профессиональные качества, часто их
        преувеличивает. Наставник может гордиться хорошими навыками в точных
        науках, но его выводы носят абстрактный характер – он часто оторван от
        реальной жизни.
      </UiText>
    </section>

    <section>
      <UiText>
        Хотя духовный комфорт ему важнее чем телесный, везде замечает недостатки
        других – как в одежде, так и в быту.
      </UiText>

      <UiText preset="large" color="role">
        Ему необходим комфорт, но сам его создать не умеет.
      </UiText>

      <UiText>
        Обычно в его квартире царит некий хаос. У него отсутствует понятие
        «всему своё место», по возможности избегает бытовых дел.
      </UiText>

      <UiText>
        Он считает, что все домашние заботы — нудная обязанность, которую надо
        выполнять с усилием. У него возникают определенные трудности при выборе
        подходящей одежды.
      </UiText>

      <UiText>
        Часто соединяет несовместимые элементы, но критику по этому поводу
        воспринимает как оскорбление личности.
      </UiText>

      <UiText>
        Природа создала для каждого социотипа своего дуала для комфортной
        совместной жизни. Дуал Наставника — Инспектор. Этим объясняется, почему
        он избегает пронзительных взглядов, ведь Инспектор не смотрит в глаза
        собеседника.
      </UiText>

      <UiText preset="large" color="role">
        Может жить аскетически, игнорируя свои физические потребности, потому,
        что плохо их понимает.
      </UiText>

      <UiText>
        Тяжело переносит боль, но другой раз он не разбирается, заболел ли он
        или хочет заболеть. Он чемпион по посещению поликлиник, поскольку по
        каждому поводу обращается к врачу. Часто его привычки в питании вызывают
        заболевания (острые блюда, несовместимые в пониманию большинства людей
        продукты).
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Философ по жизни, но при этом он не создает свои теории, а заимствует
        мысли от других.
      </UiText>

      <UiText>
        Часто путает понятие «логическое мышление» со своими способностями
        мыслить логически. Фактически его логика характеризуется в способности
        подобрать многочисленные факты, но не в способности их
        систематизировать, поэтому часто противоречит себе. Факты он
        автоматически собирает для своего дуала Инспектора.
      </UiText>

      <UiText>
        Поскольку ему не свойственно прагматическое мышление и действие, он
        ожидает от других предсказуемого поведения и системного мышления.
      </UiText>

      <UiText preset="large" color="role">
        Он нуждается в упорядоченности окружения, но сам этого потребовать и
        установить не умеет. Тут рядом необходим Инспектор, который способен
        ввести вокруг порядок.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Ему важно следовать законам, системе.
      </UiText>

      <UiText>
        У него уже с юных лет образуется своё понятие о стабильности жизни, об
        «основах», на которых она держится.
      </UiText>

      <UiText>
        По этой причине он с подозрением воспринимает новые науки, мотивируя
        тем, что под влияниями их разрушаются его устоявшихся представления о
        стабильности.
      </UiText>

      <UiText>
        У него нестабильная самооценка. Он нуждается в похвалах и комплиментах
        по поводу его внешности, а также в признании своей уникальности.
      </UiText>

      <UiText preset="large" color="role">
        Человек системы, в ней он действует уверенно и чувствует приток энергии.
      </UiText>

      <UiText>
        Он сторонник иерархии, уважительно относится к тем, кто выше его, если
        это не противоречит его убеждениям. Выпадая из системы, может стать
        бездельником.
      </UiText>

      <UiText>
        Он не создан для бизнеса, поскольку бизнес не имеет системы и часто
        подчинен потокам диктата, в нем нет стабильности и предсказуемости.
      </UiText>

      <UiText>
        Он считает себя человеком с устаревшими взглядами, потому что
        современная, нестабильная жизнь его пугает. Ему необходимо жить в
        стабильном, прогнозируемом государстве.
      </UiText>

      <UiText>
        Как идеалист он все оценивает по внутреннему голосу сердца и судит
        человека по первому впечатлению.
      </UiText>
    </section>

    <section>
      <UiText>
        Семья для него – тоже часть структуры, там должен царствовать покой и
        гармоничные отношения. В отличии от остальных социотипов, ему необходимо
        общение с целью побеседовать. Чаще всего нацелен найти такого
        собеседника, которому при беседе откроет какой-то секрет или важную
        информацию. Это он воспримет как факт дружбы в будущем.
      </UiText>

      <UiText>
        Режиссер всегда нуждается в «сцене» с актерами, и эти актеры —
        окружающие люди. И чаще всего разыгрывает спектакль перед народом, лишь
        бы кто-то его слушал. Не представляет свою жизнь без людей, потому что
        при разговоре с одним человеком, он не добьется разворота с обществом.
      </UiText>

      <UiText preset="large" color="role">
        Превосходная черта характера – накапливание разной информации и умение
        выбрать подходящее время для её представления.
      </UiText>

      <UiText>
        Умение убедить, перехитрить, выдумывать, отпарировать позволяет ему
        всегда выходить «сухим из воды».
      </UiText>

      <UiText preset="large" color="role">
        При знакомстве сначала обращает внимание на внешний вид человека,
        оценивает его.
      </UiText>

      <UiText>
        Он считает, что только человек с приведенной в порядок внешностью
        уважает себя и других. Он всегда наблюдает, запоминает детали, не
        копирует других, но в дальнейшем использует понравившиеся детали.
      </UiText>

      <UiText preset="large" color="role">
        Увлекается необычными явлениями, феноменами, аномалиями.
      </UiText>

      <UiText preset="small" color="accent">
        Среди них встречаются верующие фанатики, экстрасенсы и маги.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
