<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Велта Микелсоне"
          subtitle="12 минут"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Вера Стратиевская"
          subtitle="32 минуты"
          target-content-id="tab-2"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText preset="subtitle" color="role">
            Человек с ярко выраженной драматической внутренней и внешней
            эмоциональностью.
          </UiText>

          <br />

          <UiText>
            Прирожденный актер, человек, чувствующий атмосферу и оттенки эмоций
            окружающей его действительности. Умело улавливает эмоциональное
            состояние других — изучает душу человека, распознавая радость, горе
            или страдания.
          </UiText>

          <UiText preset="large" color="role">
            Этим он увлечен всю свою жизнь, независимо от выбранной ему
            профессии.
          </UiText>

          <UiText>
            Он шутит, смеется, иронизирует, подбадривает и даже внушает страх в
            людях. Его натура переполнена богатыми душевными переживаниями.
            Наставник — человек с огромным талантом, умеющий менять «маски»,
            драматизировать ситуацию. Именно по этой причине он один из
            талантливых режиссеров и актеров.
          </UiText>

          <UiText>
            Умело создает веселую или драматическую ситуацию, иногда чтобы
            привлечь внимание окружающих или ему просто скучно. Он постоянно
            нуждается в острых эмоциях.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Талантливо управляет своим голосом, мимикой, сопровождая живыми
            жестами.
          </UiText>

          <UiText>
            В зависимости от того, что преобладает в обществе, моментально
            применяет все эти качества — увидев скучного человека, тут же
            берется его ободрить и успокоить. Ему трудно понять равнодушного,
            скрывающего свои эмоции человека.
          </UiText>

          <UiText>
            В таком случае способен разыграть трагическую сцену с целью его
            оживить. Может привлечь почти любого человека. Также он быстро и
            часто меняет свой «образ», изображая обиженного и непонятого
            человека, и может повторить этот спектакль по несколько раз в день.
          </UiText>

          <UiText preset="large" color="role">
            В ситуациях, когда плохо принимают его театральность, ему становится
            «не по себе».
          </UiText>

          <UiText>
            Всегда быть в курсе обо всем, искать виноватых, осуждать их – это
            его дело. Если занимает высокий пост, способен создать крупные
            перевороты в политике. И о его подвигах история не молчит. Не всегда
            он находит себе применение в политике.
          </UiText>

          <UiText preset="large" color="role">
            Благодаря своей дальновидности и осмотрительности, способен дать
            полезные советы и прогнозы в обществе.
          </UiText>

          <UiText>
            Он не только прогнозирует отношения в широком кругу, он талантливо
            предвидит и определяет эмоциональный настрой в крупном масштабе.
          </UiText>

          <UiText>
            Обладает высокой самооценкой, жизнерадостный, деятельный,
            энергичный, непреклонный.
          </UiText>

          <UiText>
            Интересует не только его личная судьба, но и судьба всего общества.
            Стратег, который талантливо распределяет каждое действие в
            определенный момент времени.
          </UiText>

          <UiText preset="large" color="role">
            Чувствует необходимость наполнить свою жизнь и жизнь окружающих
            яркими событиями.
          </UiText>

          <UiText>
            Способен предвидеть в эмоциональном плане продолжительность и
            важность каждого мгновения. Он задает темп событиям и в
            совершающихся действиях.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Умело манипулирует временем. Может своевременно устранить, а при
            необходимости создать искусственные проблемы.
          </UiText>

          <UiText>
            Такими манипуляциями талантливо выигрывает время для обдумывания,
            чтобы осуществлять свои намерения.
          </UiText>

          <UiText>
            В искусстве сильно отличается от других. Будучи актером, входит в
            роли разного характера и талантливо их исполняет.
          </UiText>

          <UiText preset="small" color="accent">
            Его картины кардинально отличаются от картин других художников. Без
            сомнения в них отражается его многогранный мир, картины перенасыщены
            многообразными персонажами, при этом находящиеся в движении.
          </UiText>

          <UiText preset="small" color="accent">
            Люди изображены с необыкновенной внешностью. Например, голова
            человека может иметь фантастический и необычный вид, иногда руки и
            ноги не человеческие – это все то, что он воображает в своей голове.
            Картина никогда не бывает монотонной, на ней изображены не только
            люди, но и животные, птицы, витающие облака, часто что-то падает с
            неба, например, нож. Кроме этого в картинах отображается его
            представление о будущем.
          </UiText>

          <UiText preset="large" color="role">
            Не представляет свою жизнь в спокойном, в лишенном эмоций, обществе.
          </UiText>

          <UiText>
            Он не минуты не может усидеть на месте, ему необходимо быть в
            постоянном движении. Также ему необходимо, чтобы жизнь была
            насыщенна эмоциями и препятствиями.
          </UiText>

          <UiText>
            Последние его вдохновляют больше всего. Бывают в жизни такие
            моменты, когда не хватает действия, когда наступают, так называемые,
            серые дни, и это грозит депрессией — кругом слышно только плохое,
            потерял работу, на совести висит неоплаченный кредит. Тогда он
            придумывает, где найти радость.
          </UiText>

          <UiText>
            Один из способов — посетить шоппинг центр или места, где собирается
            большое скопление людей. Может ходить по супермаркетам без гроша в
            кармане, лишь радуясь тому, что видит — яркие рекламы, суета людей,
            азартность покупателей, музыка. Так он обязательно находит
            положительный заряд и его энергия восстанавливается.
          </UiText>

          <UiText>
            Умело предвидит и предупреждает общество о назревании критических
            положений – переворотов, беспорядков, бунтов. В главе о решительных
            поворотах истории именно ему важно быть в центре событий.
          </UiText>

          <UiText>
            Не равнодушен к тому, что происходит в мире. Его волнует всё, что
            разрушает мир — война, потоп, катастрофы, что люди остаются без
            приюта. Тогда он рад за себя — как хорошо, что я живу в стране, где
            этого ничего нет. Лишь бы не было войны!
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Ему мало важен настоящий момент времени, вся сущность его связана с
            прошлым или будущим.
          </UiText>

          <UiText>
            Ему необходимо быть уникальным и добиваться высокого
            профессионализма в своей должности. Но, поскольку он представитель
            творческой деятельности и обладает высокой эмоциональностью, это
            создает препятствие в разумном управлении коллективом.
          </UiText>

          <UiText>
            Внутри испытывает ощущение неуверенности и чувствует недостаток
            своих деловых способностей. Из-за повышенной эмоциональности часто
            склонен смешивать служебные обязанности с личной жизнью.
          </UiText>

          <UiText preset="large" color="role">
            С трудом формулирует обязанности сотрудников, неумело распределяет
            работу и нагрузку.
          </UiText>

          <UiText>
            Слабо выражены способности понять процесс хозяйственной,
            административной деятельности. Чаще всего в таких учреждениях царит
            хаос.
          </UiText>

          <UiText>
            Вне творческих отраслей он слабо оценивает квалификации сотрудников,
            неумело требует от них качественного и профессионального выполнения
            работы.
          </UiText>

          <UiText>
            Его консервативность и шаблонность заставляет придерживаться
            испытанных и проверенных методов действия. С трудом разбирается, что
            на данный момент важнее, а что второстепенное, его подчиненные
            сотрудники страдают от неопределенности. Обычно про такие учреждения
            говорят, что они ели держатся. Критику в свой адрес Наставник
            воспринимает болезненно.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Ему не свойственна пунктуальность и точность, не требует этих
            качеств от других.
          </UiText>

          <UiText>
            С трудом располагает к себе подчиненных, неумело организует и
            руководит, прямые упреки выражает неуверенно, в коллективе царит
            неудовлетворенность. Избегает излишней ответственности, старается
            делегировать это другим. Как обычный сотрудник часто себя
            преподносит как всесторонне развитого человека.
          </UiText>

          <UiText>
            Но он неумело оценивает свои профессиональные качества, часто их
            преувеличивает. Наставник может гордиться хорошими навыками в точных
            науках, но его выводы носят абстрактный характер – он часто оторван
            от реальной жизни.
          </UiText>
        </section>

        <section>
          <UiText>
            Хотя духовный комфорт ему важнее чем телесный, везде замечает
            недостатки других – как в одежде, так и в быту.
          </UiText>

          <UiText preset="large" color="role">
            Ему необходим комфорт, но сам его создать не умеет.
          </UiText>

          <UiText>
            Обычно в его квартире царит некий хаос. У него отсутствует понятие
            «всему своё место», по возможности избегает бытовых дел.
          </UiText>

          <UiText>
            Он считает, что все домашние заботы — нудная обязанность, которую
            надо выполнять с усилием. У него возникают определенные трудности
            при выборе подходящей одежды.
          </UiText>

          <UiText>
            Часто соединяет несовместимые элементы, но критику по этому поводу
            воспринимает как оскорбление личности.
          </UiText>

          <UiText>
            Природа создала для каждого социотипа своего дуала для комфортной
            совместной жизни. Дуал Наставника — Инспектор. Этим объясняется,
            почему он избегает пронзительных взглядов, ведь Инспектор не смотрит
            в глаза собеседника.
          </UiText>

          <UiText preset="large" color="role">
            Может жить аскетически, игнорируя свои физические потребности,
            потому, что плохо их понимает.
          </UiText>

          <UiText>
            Тяжело переносит боль, но другой раз он не разбирается, заболел ли
            он или хочет заболеть. Он чемпион по посещению поликлиник, поскольку
            по каждому поводу обращается к врачу. Часто его привычки в питании
            вызывают заболевания (острые блюда, несовместимые в пониманию
            большинства людей продукты).
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Философ по жизни, но при этом он не создает свои теории, а
            заимствует мысли от других.
          </UiText>

          <UiText>
            Часто путает понятие «логическое мышление» со своими способностями
            мыслить логически. Фактически его логика характеризуется в
            способности подобрать многочисленные факты, но не в способности их
            систематизировать, поэтому часто противоречит себе. Факты он
            автоматически собирает для своего дуала Инспектора.
          </UiText>

          <UiText>
            Поскольку ему не свойственно прагматическое мышление и действие, он
            ожидает от других предсказуемого поведения и системного мышления.
          </UiText>

          <UiText preset="large" color="role">
            Он нуждается в упорядоченности окружения, но сам этого потребовать и
            установить не умеет. Тут рядом необходим Инспектор, который способен
            ввести вокруг порядок.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Ему важно следовать законам, системе.
          </UiText>

          <UiText>
            У него уже с юных лет образуется своё понятие о стабильности жизни,
            об «основах», на которых она держится.
          </UiText>

          <UiText>
            По этой причине он с подозрением воспринимает новые науки, мотивируя
            тем, что под влияниями их разрушаются его устоявшихся представления
            о стабильности.
          </UiText>

          <UiText>
            У него нестабильная самооценка. Он нуждается в похвалах и
            комплиментах по поводу его внешности, а также в признании своей
            уникальности.
          </UiText>

          <UiText preset="large" color="role">
            Человек системы, в ней он действует уверенно и чувствует приток
            энергии.
          </UiText>

          <UiText>
            Он сторонник иерархии, уважительно относится к тем, кто выше его,
            если это не противоречит его убеждениям. Выпадая из системы, может
            стать бездельником.
          </UiText>

          <UiText>
            Он не создан для бизнеса, поскольку бизнес не имеет системы и часто
            подчинен потокам диктата, в нем нет стабильности и предсказуемости.
          </UiText>

          <UiText>
            Он считает себя человеком с устаревшими взглядами, потому что
            современная, нестабильная жизнь его пугает. Ему необходимо жить в
            стабильном, прогнозируемом государстве.
          </UiText>

          <UiText>
            Как идеалист он все оценивает по внутреннему голосу сердца и судит
            человека по первому впечатлению.
          </UiText>
        </section>

        <section>
          <UiText>
            Семья для него – тоже часть структуры, там должен царствовать покой
            и гармоничные отношения. В отличии от остальных социотипов, ему
            необходимо общение с целью побеседовать. Чаще всего нацелен найти
            такого собеседника, которому при беседе откроет какой-то секрет или
            важную информацию. Это он воспримет как факт дружбы в будущем.
          </UiText>

          <UiText>
            Режиссер всегда нуждается в «сцене» с актерами, и эти актеры —
            окружающие люди. И чаще всего разыгрывает спектакль перед народом,
            лишь бы кто-то его слушал. Не представляет свою жизнь без людей,
            потому что при разговоре с одним человеком, он не добьется разворота
            с обществом.
          </UiText>

          <UiText preset="large" color="role">
            Превосходная черта характера – накапливание разной информации и
            умение выбрать подходящее время для её представления.
          </UiText>

          <UiText>
            Умение убедить, перехитрить, выдумывать, отпарировать позволяет ему
            всегда выходить «сухим из воды».
          </UiText>

          <UiText preset="large" color="role">
            При знакомстве сначала обращает внимание на внешний вид человека,
            оценивает его.
          </UiText>

          <UiText>
            Он считает, что только человек с приведенной в порядок внешностью
            уважает себя и других. Он всегда наблюдает, запоминает детали, не
            копирует других, но в дальнейшем использует понравившиеся детали.
          </UiText>

          <UiText preset="large" color="role">
            Увлекается необычными явлениями, феноменами, аномалиями.
          </UiText>

          <UiText preset="small" color="accent">
            Среди них встречаются верующие фанатики, экстрасенсы и маги.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="small" color="accent">1 — Базовая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_emotions" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Желание</UiText>
              <UiText preset="body">Этика эмоций</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Для Наставника мир человеческих переживаний, чувств и эмоций — это
            не только сфера его интересов и наблюдений, это в первую очередь его
            «мастерская» и «лаборатория». Здесь он и творит и исследует.
          </UiText>

          <UiText>
            Исследовать душу человека, увидеть источник его боли и страданий,
            показать глубину его переживаний, понять этические мотивы его
            поступков во всем их кажущемся противоречии - в этом Наставник видит
            свое предназначение, для этого он родился, этим он, по сути,
            занимается всю свою жизнь независимо от того, какую область
            профессиональной деятельности для себя избрал.
          </UiText>

          <UiText color="role">
            Никого из входящих в круг его знакомств он не обойдет своим
            «эмоциональным воздействием»: кому шуточкой, кому острым словцом,
            кому розыгрышем, кому тонкой иронией, любому покажет его душу как в
            зеркале.
          </UiText>

          <UiText>
            Любого вовлечет в свой «театр» - в свою «этическую игру», в свою
            «мастерскую-лабораторию».
          </UiText>

          <UiText preset="large" color="role">
            К объекту своих шуток Наставник часто обращается с ласковой иронией
            и снисходительным превосходством, как будто он сейчас находится
            где-то над ним, в каком-то другом мире, там, где ему особенно видна
            вся нелепость и несуразность поведения очередной жертвы его
            внимания.
          </UiText>

          <UiText>
            Шуточки Наставника — это своего рода «коровьевские шуточки», это
            «воландовско-мефистофельские» шутки.
          </UiText>

          <UiText>
            Создавать гнетущую напряженную обстановку для Наставника настолько
            естественно, что он может это делать, находясь практически в любом
            настроении — и в хорошем, и в плохом; и от скуки, и от нечего
            делать.
          </UiText>

          <UiText>
            Достаточно самого незначительного повода и у него вдруг откуда-то
            появляются и металлические нотки в голосе, и жесткие интонации, и
            чеканная дикция, и тяжелый пристальный взгляд, и выдержанные паузы
            во время которых он обдумывает продолжение своего «монолога».
          </UiText>

          <UiText color="role">
            Вокруг каждого человека Наставник создает некое эмоциональное поле,
            которое по своему усмотрению «заряжает» то положительно, то
            отрицательно.
          </UiText>

          <UiText>
            Постоянно выражая свое отношение к этическим качествам человека,
            причем не как свое личное впечатление, а как некое общее, уже
            сложившееся мнение, в котором он лично был бы и рад сомневаться.
          </UiText>

          <UiText>
            Поскольку это все преподносится в форме тонких намеков и
            сопровождается выразительнейшей мимикой, человек сразу чувствует
            себя заинтригованным и незаметно для себя подпадает под сильнейшее
            эмоциональное воздействие, становясь послушной марионеткой, которую
            дергает за веревочки этот, казалось бы, такой доброжелательный
            собеседник.
          </UiText>

          <UiText preset="large" color="role">
            Довольно трудно бывает вовремя опомниться и выйти из-под этого
            «очаровывающего» влияния.
          </UiText>

          <UiText>
            Наставник тут же разыгрывает такую обиду, такое разочарование и
            сожаление, что человеку становится неловко за свое «бестактное»
            поведение и вроде бы ничего другого не остается, как добровольно
            поддаться оказываемому давлению.
          </UiText>

          <UiText>
            Напуская на себя то намеренно безразличный, то загадочный, то
            печальный вид, Наставник старается обратить внимание и заинтриговать
            всех, кто только может его сейчас видеть.
          </UiText>

          <UiText>
            Подсознательно Наставник пользуется любой возможностью найти себе
            подходящие объекты эмоционального влияния, самым идеальным из
            которых является его дуал Инспектор, более всего нуждающийся в
            общении именно такого стиля и характера.
          </UiText>

          <UiText>
            Больше всего раздражает Наставника отсутствие интереса к его
            «театру», намеренное нежелание стать в его спектакле «действующим
            лицом» или даже «зрителем».
          </UiText>

          <UiText>
            «Непробиваемое» безразличие и безучастность к его этической игре —
            единственное, перед чем Наставник бессилен, и это как раз то, чего
            он больше всего боится.
          </UiText>

          <UiText>
            Его особенно настораживают люди, которые, что называется, «себе на
            уме», хотя трудно быть более «себе на уме», чем сам Наставник.
          </UiText>

          <UiText preset="large" color="role">
            Любой из представителей этого типа независимо от возраста и рода
            занятий великолепно владеет своими мимикой, голосом, интонацией и
            благодаря этому качеству делает со своим собеседником все, что
            хочет, получая от него максимум нужной ему информации.
          </UiText>

          <UiText color="role">
            Стоит ему только захотеть, и он расслабляет человека, вызывает его
            на откровенность и внушает ему все, что ему вздумается. Иногда,
            наоборот, буквально сковывает своего собеседника страхом и
            напряжением, полностью подчиняет своей воле, заставляет полностью
            себе довериться.
          </UiText>

          <UiText>
            Наставник — режиссер человеческих эмоций, режиссер настроений.
            Любому человеку Наставник «задаст» именно то настроение, которое
            считает нужным задать.
          </UiText>

          <UiText color="role">
            Эмоциональная «режиссура» Наставника всегда задается только из
            соображений его интересов, его расчетов, его страхов, его подозрений
            и предположений.
          </UiText>

          <UiText>
            Независимо от того, в каком масштабе развивает свою деятельность
            представитель этого типа, политик ли он или рядовой служащий, он в
            совершенстве владеет всем арсеналом необходимых средств воздействия
            для того, чтобы сформировать «нужное» общественное мнение, с помощью
            которого он намерен задать определенное направление действиям
            окружающих его людей.
          </UiText>

          <UiText>
            Создание формальной или неформальной группировки в рамках уже
            существующей системы, выявление формального или неформального
            лидера, смещение существующего лидера, перемещение иерархических
            слоев в системе, вывод из системы группы лиц, являющихся помехой в
            его расстановке сил, — все это сфера его постоянной деятельности
            независимо от возраста, рода занятий и места, занимаемого в системе.
          </UiText>

          <UiText preset="large" color="role">
            Расстановка сил в иерархической системе — основная область его
            этических и деловых интересов и наиважнейшая сфера его деятельности.
          </UiText>

          <UiText color="role">
            Наставнику чрезвычайно важно не только выявить уже существующего
            неформального лидера, но и потенциального. И относительно этой
            будущей расстановки сил сформировать свои отношения в существующей
            социальной структуре.
          </UiText>

          <UiText>
            Именно поэтому любому из представителей этого типа важно знать, что
            «на уме» у того или иного человека.
          </UiText>

          <UiText color="role">
            Особенно Наставника интересуют и настораживают внутренне независимые
            люди, ставящие себя вне карьеры, вне сплетен, вне «интересов
            коллектива», вне «общественного мнения»: таких людей Наставнику
            бывает понять особенно трудно и именно поэтому они кажутся ему
            особенно подозрительными.
          </UiText>

          <UiText preset="large" color="role">
            Наставник не представляет себе жизни без борьбы. Точнее, Наставник
            не представляет себе жизни вне состояния борьбы.
          </UiText>

          <UiText>
            Наставнику всегда есть за что бороться, и всегда есть с кем. Если
            нет цели — он ее придумает, если нет врага — он его найдет. В любом
            случае, без дела сидеть не будет.
          </UiText>

          <UiText color="accent">
            Например, для представителей этого типа очень свойственно создавать
            препятствия на ровном месте исключительно только для того, чтобы их
            преодолевать. Жизнь сразу становится интересной и насыщенной
            событиями.
          </UiText>

          <UiText>
            Причем эти «препятствия» чаще всего оказываются именно этического
            свойства — запускается какая-то интрига, основанная на вымышленной
            сплетне, или на его, Наставника, субъективных подозрениях и
            предположениях; начинается какое-то брожение в коллективе, какой-то
            раскол на группы, на «лагеря», на «врагов» и «друзей», на
            «единомышленников» и «инакомыслящих», на тех, кто «с нами» и кто
            «против нас».
          </UiText>

          <UiText color="role">
            Наставник — это всегда мятежная и беспокойная душа. Но это не только
            горьковский Данко, освещающий людям путь своим пылающим сердцем, это
            еще и «буревестник», возвещающий бурю, и «одинокий парус», который
            эту бурю ищет.
          </UiText>

          <UiText>
            Многие представители этого типа, сами того не замечая, очень
            задиристы, особенно ярко это проявляется в детском и юношеском
            возрасте.
          </UiText>

          <UiText color="accent">
            Например, Наставник иногда ищет ссоры только потому, что все вокруг
            «слишком спокойно», а это его и настораживает, и пугает, и
            раздражает. По большому счету, в спокойствие и тишину Наставник не
            верит. Если «тихий омут», значит, там обязательно «черти водятся» и
            их надо выявить.
          </UiText>

          <UiText>
            И именно в этом Наставник иногда видит высшее проявление
            общественной сознательности и лояльности по отношению к
            существующему строю.
          </UiText>

          <UiText>
            Следует отметить, что описываемый тип интеллекта «запрограммирован»
            на жизне- и дееспособность в условиях экстремальной ситуации, в
            период господства тоталитарных систем, в эпоху крутых поворотов
            истории. Уцелеть в смутные времена и пережить их — важнейшая
            социально-биологическая задача этого типа личности. И именно поэтому
            ему свойственны такие качества, как этическая маневренность,
            дальновидность, предусмотрительность, лояльность и политическая
            «дальнозоркость», равно как и стремление выбиться в высшие
            иерархические слои, чтобы в критической ситуации получить
            определенные преимущества.
          </UiText>

          <UiText>
            Наставник всегда политически активен, всегда стоит на активных
            гражданских позициях. Поэтому его очень раздражает пассивное
            отношение к общественным событиям.
          </UiText>

          <UiText>
            Его раздражает сам тип человека-обывателя, более всего оберегающего
            свой душевный покой.
          </UiText>

          <UiText>
            Наставник ненавидит «обывательщину» и обыденность. Он может какое-то
            время «поиграть» в семейный уют или в семейную идиллию, но «увязнуть
            в быту» себе не позволит. Более того, посчитает это для себя
            деградацией.
          </UiText>

          <UiText color="accent">
            Некоторых представительниц этого типа очень раздражает вынужденная
            необходимость замыкаться в кругу семьи. Это иногда неблагоприятно
            сказывается на их характере и приводит к тому, что они превращают
            свои семейные отношения в арену «военно-политической борьбы».
          </UiText>

          <UiText>
            Любому, самому незначительному бытовому эпизоду Наставник способен
            придать «идейно-политическую» окраску и на этом основании развить
            активную общественную деятельность.
          </UiText>

          <UiText>
            У кого-то юбилейная дата или кто-то заболел — и вот Наставник уже
            организовывает широкомасштабный сбор денег, оказывает все
            необходимые услуги, хлопочет и суетится больше всех, а главное,
            постоянно афиширует факт собственной инициативы, именно то, что он
            возглавляет этот почин.
          </UiText>

          <UiText color="accent">
            «Вот мы тут все...» Посовещались, решили, постановили, осудили,
            одобрили, поддержали…
          </UiText>

          <UiText>
            В любом возрасте, в любой среде, в любой ситуации Наставник
            претендует на лидерство. Всегда, когда ему это нужно, Наставник
            найдет себе подходящую публику. Дай ему только повод, и вот он уже
            чувствует себя как на трибуне, он уже не просто говорит, а
            «произносит речь».
          </UiText>

          <UiText>
            Более того, митинговать он может вообще без повода — для этого ему
            нужно только подходящее настроение, если «душа горит» или «прям зло
            берет», вот тогда и аудитория найдется, и тема подберется.
          </UiText>

          <UiText>
            В отличие от Новатора, который митингует когда угодно, где
            вздумается, и даже не всегда на языке окружающих его людей Наставник
            очень осмотрительно выбирает себе слушателей. Всегда знает, кого и
            за что можно и нужно агитировать.
          </UiText>

          <UiText color="role">
            Обличать, осуждать, «навешивать ярлыки», искать виноватых — все это
            не только форма его самовыражения, но и способ создавать
            общественный настрой, формировать общественное мнение.
          </UiText>

          <UiText preset="large" color="role">
            А в более широких масштабах — способ «делать политику», «творить
            историю».
          </UiText>

          <UiText>
            Стать инициатором какого-нибудь начинания, привлечь к нему новых
            людей, организовать их, повести за собой — всем этим Наставник
            занимается очень охотно.
          </UiText>

          <UiText>
            Причем ему для этого вовсе не обязательно быть политическим
            деятелем: достаточно просто «попасть в струю», угадать «правильное»
            направление, захватить «нужную» инициативу.
          </UiText>

          <UiText>
            Следует заметить, что в своей общественной инициативе Наставник
            очень дальновиден и предусмотрителен: если что-то затеял — это
            неспроста, это с дальним прицелом, с расчетом, это не просто по
            доброте душевной.
          </UiText>

          <UiText>
            То, что Наставник делает только по доброте душевной, он не
            афиширует: мало ли как к этому отнесутся другие? А вдруг из-за этих
            «благодеяний» у него когда-нибудь будут неприятности?
          </UiText>

          <UiText color="accent">
            Пример: представитель этого типа на протяжении многих лет тайком от
            жены помогал материально всем своим родственникам — всем понемногу,
            кому с зарплаты, кому с премии. Но каждый раз предупреждал: «Только
            жене не проговоритесь, она ничего не должна об этом знать!» И не
            было случая, чтобы он забыл об этом упомянуть или предупредить.
          </UiText>

          <UiText preset="large" color="role">
            Лидерству Наставника способствует еще и то обстоятельство, что он
            всегда прирожденный талантливый актер — и это его ценнейшее
            качество.
          </UiText>

          <UiText color="role">
            Он актер и в жизни, и в театре, и в истории, и в политике. Когда
            Наставник выходит на сцену, публика и рыдает и смеется вместе с ним.
            Когда Наставник «выходит в политику», смеющихся остается все меньше
            и меньше.
          </UiText>

          <UiText>
            Многие представители этого типа становятся самыми выдающимися
            актерами, режиссерами, поэтами и музыкантами своего времени. Пока у
            Наставника есть публика, его вдохновение неиссякаемо.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">2 — Творческая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_time" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чутьё</UiText>
              <UiText preset="body">Интуиция времени</UiText>
            </span>
          </div>

          <UiText>
            Если рассматривать человеческие эмоции, как материал в «творческой
            лаборатории» Наставника, то время, в его понимании, — это тот
            инструмент, тот «технологический режим», в котором этот материал
            закаливается и обрабатывается.
          </UiText>

          <UiText preset="large" color="role">
            Наставнику мало вылепить «эмоциональную модель», нужно, чтобы она
            еще и созрела «во времени», нужно показать характер человека (или
            модель его поведения) в развитии. Показать, как это было в прошлом и
            что это будет в будущем.
          </UiText>

          <UiText>
            Количество эмоций, пережитых в единицу времени, — вот формула,
            выражающая способ его существования, его «технологический режим».
          </UiText>

          <UiText>
            Создается впечатление, что Наставник умеет физически ощущать
            протяженность любой единицы времени: она для него как живая клетка и
            живет жизнью заполняющих ее эмоций.
          </UiText>

          <UiText>
            У Наставника-музыканта свое представление о ритмах и темпах. У него
            — микроритмы и микротемпы и в этом секрет его музыкальной
            выразительности.
          </UiText>

          <UiText>
            Наставник-исполнитель всегда узнаваем и по умению выдержать ноту и
            паузу, и по умению строить свое исполнение на игре темпов и нюансов
            эмоций.
          </UiText>

          <UiText>
            Точно так же, как Наставник-танцор всегда узнаваем по точной
            координации движений, соответствующих тончайшей музыкальной
            пластике, а также по исключительной выразительности жестов. У
            Наставника-танцора жест «раскрывается» как цветок, его
            выразительность как бы развивается во времени, так что зритель
            успевает его и увидеть, и понять, и прочувствовать.
          </UiText>

          <UiText>
            Наставник-политик великолепно умеет манипулировать временем: видит
            преимущества развития ситуации во времени, умеет «залечить» проблему
            временем, умеет «вырастить проблему во времени».
          </UiText>

          <UiText>
            Умеет использовать время как своеобразную оранжерейку, где проблема
            «дозревает» до того момента, когда она уже может быть представлена
            обществу в самой убедительной форме. Наставник умеет материализовать
            время, сделать его осязаемым.
          </UiText>

          <UiText color="role">
            Умеет заставить всех почувствовать значимость момента, даже если
            этот момент будет длиться десятилетия.
          </UiText>

          <UiText preset="large" color="role">
            Прекрасно умеет пользоваться преимуществами во времени, которые ему
            дает та или иная ситуация.
          </UiText>

          <UiText color="accent">
            Например, в условиях военных действий Наставник-политик может
            запросить перемирие только для того, чтобы получить временную
            передышку и использовать ее с выгодой для себя и для своей армии:
            передислоцировать войска, подтянуть новые силы. А отдохнув и
            набравшись сил, может устроить какую-нибудь новую «заварушку» и тем
            самым получить повод возобновить военные действия.
          </UiText>

          <UiText preset="large" color="role">
            Наставник очень хорошо умеет координировать свои поступки во
            времени. Что бы он ни делал, это всегда все очень своевременно.
          </UiText>

          <UiText>
            Любой из представителей этого типа — всегда великолепный стратег,
            поэтому каждое его осмысленное действие определяется целями и
            задачами его конечных планов, которые в свою очередь могут быть
            довольно гибкими.
          </UiText>

          <UiText color="accent">
            Например, иному Наставнику-политику состояние войны бывает иногда
            нужнее, чем победа в ней.
          </UiText>

          <UiText>
            Более того, Наставник нередко чувствует себя разочарованным именно
            тогда, когда конечная цель его действий уже достигнута. Уже
            привыкнув к гиперактивной, перенасыщенной событиями жизни,
            Наставнику бывает трудно переключиться на другой, менее активный
            режим - у него возникает ощущение неполноты жизни, ощущение
            упущенных или не полностью реализованных возможностей.
          </UiText>

          <UiText preset="large" color="role">
            Для Наставника очень важно быть уверенным в своевременности
            собственных действий. И именно поэтому он всегда должен быть
            своевременно обо всем осведомлен.
          </UiText>

          <UiText color="role">
            Наставник опасается быть неосведомленным в том, что для него важно,
            поскольку это может привести его к несвоевременным действиям, к
            опозданию, а этого он в принципе старается не допускать.
          </UiText>

          <UiText>
            В критической ситуации Наставник особенно точно координирует свои
            действия во времени: обычно стремится нанести свой удар первым,
            причем это должен быть совершенно неожиданный, ошеломляюще
            сокрушительный удар: слишком много поставлено на карту. Вот
            потому-то Наставнику и нужно, чтобы окружающие ему доверяли и
            делились с ним своими планами и информацией.
          </UiText>

          <UiText color="role">
            Именно поэтому он побаивается скрытных и пассивных людей,
            безучастных к тому, что его волнует: а, может, они его уже обошли?
            Может, они уже получили то, чего он сейчас добивается, и потому так
            спокойны и уверены в себе?
          </UiText>

          <UiText preset="large" color="role">
            Наставнику всегда интересен опыт чужих ошибок. Он его тщательно
            изучает, делает полезные выводы с тем, чтобы самому поостеречься и
            других предостеречь.
          </UiText>

          <UiText>
            Но, каковым бы ни был его собственный негативный опыт, в решающей
            ситуации Наставник действует так, как подсказывают ему его чувства и
            его интуиция, даже если это идет вопреки здравому смыслу.
          </UiText>

          <UiText>
            Возможно поэтому представителям описываемого типа весьма свойственны
            фанатизм и фанатичное самоотречение.
          </UiText>

          <UiText color="accent">
            Очень много террористов-«камикадзе» выходит именно из представителей
            этого типа. «Благостно спичке, сгоревшей, но высекшей пламя».
          </UiText>

          <UiText>
            Наставник в любую эпоху, в любой период истории может видеть высший
            смысл в том, чтобы отдать свою жизнь «за идею», даже если эта идея
            родилась в узком кругу его единомышленников и объединяет всего
            несколько человек.
          </UiText>

          <UiText color="accent">
            Именно поэтому в экстремальной ситуации фанатично настроенный
            представитель этого типа не увидит большого греха в том, чтобы взять
            в заложники мирное население, даже если оно из его же собственного
            лагеря: нет большей чести, чем умереть за идею. Так пусть от их
            «обывательской» жизни будет хоть какой-то прок.
          </UiText>

          <UiText preset="large" color="role">
            Наставник не в состоянии быть пассивным наблюдателем важнейших
            исторических событий.
          </UiText>

          <UiText>
            Даже работая журналистом, международным обозревателем или ведущим
            общественно-политических телепередач, представитель этого типа
            подаëт материал очень тенденциозно и целенаправленно, как бы
            стремясь создать вокруг освещаемого им вопроса определенное
            общественное мнение, с помощью которого он как будто рассчитывает
            скоординировать действия ведущих политиков и направить их в
            определенное русло.
          </UiText>

          <UiText color="role">
            Для Наставника характерно ощущение своего исторического
            предназначения. Он может себя чувствовать частью исторического
            процесса, частью эпохи, носителем и выразителем ее идей.
          </UiText>

          <UiText color="accent">
            Политическая гражданская активность — еще одна причина, по которой
            его может искренне обидеть чья-то принципиальная аполитичность или
            беспринципная лояльность.
          </UiText>

          <UiText>
            Наставника часто можно встретить работающим на «идеологическом
            фронте», причем с искренним энтузиазмом и отдачей, что, однако, не
            мешает ему иногда искренне негодовать по поводу исторических ошибок,
            совершаемых его правительством, предвидеть самый неблагоприятный
            исход событий на «политической арене», видеть какие-то
            неблагополучные тенденции в политической и социальной жизни
            общества.
          </UiText>

          <UiText>
            У Наставника могут быть периоды яркой, эмоционально насыщенной
            жизни, наполненные интересными, »масштабными» делами; могут быть
            периоды длительного выжидания своего «звездного часа», причем этот
            период не менее важен для Наставника, чем первый, и при внешнем
            бездействии он на самом деле не менее насыщен.
          </UiText>

          <UiText>
            Это может быть период его невидимой деятельности, период его
            «подготовки» к решающему моменту. Совершенно неважно, какое именно
            дело он совершит в свой «звездный час»: это может быть и
            государственный переворот, и блестящая речь в парламенте, и
            великолепно сыгранный спектакль, и террористический акт, знаменующий
            начало новой исторической эпохи.
          </UiText>

          <UiText color="role">
            Главное, в этот свой «звездный час» Наставник «войдет в историю».
          </UiText>

          <UiText preset="large" color="role">
            Наставник «видит» время «по-крупному» и играет временем тоже
            «по-крупному». Ему далеко не всегда важна мелкая, сиюминутная
            пунктуальность; намеченный распорядок дня он может выполнять, а
            может и нет.
          </UiText>

          <UiText>
            Для него не это важно. Для него куда интереснее намечающиеся
            глобальные перемены, а также историческая точность и своевременность
            его собственных действий. Ему важно органично вписаться в эпоху, с
            тем чтобы «не быть бревном, лежащим поперек истории».
          </UiText>

          <UiText>
            Наставник хорошо понимает характер той или иной эпохи, умеет
            чувствовать ее лозунг. Умеет видеть аналогии и закономерности в
            чередовании исторических эпох.
          </UiText>

          <UiText preset="large" color="role">
            Часто испытывает ностальгию по той эпохе, которая созвучна его
            миропониманию, в которой были популярны идеи, близкие ему по духу.
          </UiText>

          <UiText color="role">
            Если не находит для себя места в сегодняшнем дне истории, живет в ее
            прошлом.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">3 — Ролевая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_business" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Практика</UiText>
              <UiText preset="body">Деловая логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Наставнику трудно руководить коллективом. Точнее, коллективу трудно,
            когда им руководит Наставник. Уже сам процесс налаживания деловых
            контактов для него не прост.
          </UiText>

          <UiText>
            Наставник всегда заранее предвидит возможные разногласия или даже
            противоборство интересов и соответственно этому себя настраивает.
          </UiText>

          <UiText>
            Наставнику и трудно и скучно контролировать работу подчиненных,
            трудно содержать в порядке деловую документацию, трудно выполнять
            рутинную, будничную работу.
          </UiText>

          <UiText color="role">
            Организация рабочего процесса, создание необходимых технических
            условий, условий оплаты, материального поощрения и стимулирования -
            все это дается ему ценой невероятных усилий, но приносит менее, чем
            скромные результаты.
          </UiText>

          <UiText>
            Поэтому в условиях отсутствия материального стимула, в условиях
            неэффективного и низкопроизводительного труда у Наставника остается
            единственное средство для поддержания необходимого рабочего тонуса —
            эмоциональное и административное давление.
          </UiText>

          <UiText color="role">
            И этими средствами он владеет в совершенстве.
          </UiText>

          <UiText preset="large" color="role">
            Наставник не может просто сказать: «Я доволен, или не доволен, твоей
            работой». Для него слишком непредусмотрительно выражать свое личное
            мнение.
          </UiText>

          <UiText>
            Наставник вообще не любит, когда ссылаются на его личное мнение,
            поэтому обычно опасается говорить лично от себя.
          </UiText>

          <UiText>
            Скорее он скажет: «Директор похвалил твой доклад» или: «Все вокруг
            говорят, что ты в последнее время стал хуже работать». И выразит
            таким образом не свое личное, а общественное мнение, которое на
            самом деле может быть и не таким или вообще еще по этому поводу не
            сложилось.
          </UiText>

          <UiText color="role">
            Но Наставнику выгодно представить общественное мнение именно таким и
            именно для того, чтобы оказать на человека целенаправленное
            воздействие.
          </UiText>

          <UiText>
            Для этой цели ему как раз и нужно показать отношение окружающих ко
            всему происходящему, нужно дать оценку как бы не от себя лично, а
            именно выражая общее мнение.
          </UiText>

          <UiText color="accent">
            Он как бы говорит: «Это не я один так считаю - это все так считают!
            Все врать не будут!» Хотя на самом деле он мог вообще никого не
            спрашивать.
          </UiText>

          <UiText color="role">
            Наставник может совершенно не смущаться тем, что блефует,
            фальсифицирует или подтасовывает факты.
          </UiText>

          <UiText color="accent">
            Особенно, если это делается «в интересах дела» и в связи с «особой
            важностью текущего момента».
          </UiText>

          <UiText>
            Факты, которые невозможно проверить, в данном случае не важны, важно
            его личное желание воздействовать на подчиненного, с тем чтобы
            заставить его работать при любых, даже самых тяжелых, самых
            низкооплачиваемых условиях.
          </UiText>

          <UiText color="accent">
            Поскольку других условий он создать просто не может.
          </UiText>

          <UiText>
            Более того, чем тяжелее общие условия труда, тем важнее для
            Наставника хорошо «проявить себя» на руководящей работе и подольше
            на ней удержаться. Даже будучи рядовым служащим, Наставник может
            проявлять себя сверхсознательным тружеником, работающим «за идею»,
            «за спасибо», и представлять собой образец трудового энтузиазма.
          </UiText>

          <UiText preset="large" color="role">
            Разумеется, дух первенства и стремление к лидерству не позволят ему
            слишком долго застревать на рядовой должности.
          </UiText>

          <UiText color="role">
            Поэтому Наставник не упустит случая провести новую, выгодную для
            себя расстановку сил, которая поможет ему переместиться в более
            удобный иерархический слой.
          </UiText>

          <UiText>
            Суть его «деловой интриги» как раз в том и заключается, чтобы найти
            нужные рычаги воздействия на окружающих и надежную точку опоры для
            себя.
          </UiText>

          <UiText color="role">
            Будучи озабочен своим положением и авторитетом руководителя,
            Наставник свободно и легко манипулирует поведением подчиненных,
            внимательно следя за тем, чтобы его не «подсидели».
          </UiText>

          <UiText>
            Наставники — и руководители и чиновники, умеют находить виноватых
            там, где их нет, умеют и любят брать «на испуг» всех, кто от них
            зависит. Для Наставника-руководителя очень характерно искусственно
            нагнетать обстановку, каждому навязывать «комплекс вины» и
            заставлять ожидать для себя всего самого наихудшего.
          </UiText>

          <UiText>
            Наставник-руководитель часто склонен разыгрывать роль этакого
            Карабаса-Барабаса, управляющего марионетками: время от времени он
            как бы «дергает за веревочки», наблюдая за тем, как приходит в
            действие весь механизм его интриги — это у него такой способ
            координировать работу коллектива, а заодно и «контролировать
            ситуацию».
          </UiText>

          <UiText>
            В результате такого «руководства» обсуждение производственных
            проблем в коллективе постоянно переходит из сферы деловой в сферу
            этическую, из области деловых отношений в область личностных
            «разборок», где Наставник чувствует себя совершенно свободно и
            никому не уступает первенства.
          </UiText>

          <UiText preset="large" color="role">
            Как всякий интуит второй квадры, Наставник опасается последствий
            взятой на себя ответственности.
          </UiText>

          <UiText>
            И это еще одна причина, по которой ему гораздо выгоднее сформировать
            удобное общественное мнение, чем самому открыто высказываться, и
            действовать в соответствии с «мнением большинства», а не самому
            принимать решение с вытекающей отсюда ответственностью.
          </UiText>

          <UiText>
            Такая тактика, кроме всего прочего, дает ему еще и правовое
            прикрытие: он, как «меньшинство» выражает и подчиняется мнению и
            воле большинства, из числа которого потом всегда можно будет найти
            виноватого, списать на него ошибки и осудить за «перегибы».
          </UiText>

          <UiText color="accent">
            Если должность, занимаемая Наставником, предполагает только личную
            ответственность за принимаемое решение, то, допустив непоправимую
            ошибку, такой «лидер» может действовать по принципу: «После нас хоть
            потоп».
          </UiText>

          <UiText preset="large" color="role">
            К встречной деловой инициативе Наставник относится очень
            настороженно, особенно, если она им лично не санкционирована.
          </UiText>

          <UiText>
            Поэтому самые лучшие деловые отношения у него складываются именно с
            его дуалом Инспектором, обычно чутко угадывающим планы и намерения
            своего начальства, всегда соблюдающим «субординацию» и действующим
            только в соответствии с заданными указаниями.
          </UiText>

          <UiText>
            С представителями других психологических типов Наставнику работать
            довольно трудно — того и жди чего-нибудь непредсказуемого,
            каких-нибудь непредвиденных неприятностей.
          </UiText>

          <UiText>
            Кроме того, Наставник так же, как и его дуал Инспектор, следит за
            тем, чтобы материальное поощрение распределялось соответственно
            количеству вложенного труда, соответственно доле личного участия и
            соответственно степени возложенной ответственности, соответственно
            занимаемой должности.
          </UiText>

          <UiText color="accent">
            В качестве личного поощрения Наставник может распределять
            материальные блага и по собственному усмотрению, но постарается,
            чтобы это не получило широкой огласки: «У тебя в концерте два
            выхода, у нее - пять, но заплатят вам поровну. Я уже договорился.
            Только смотри, никому не говори, иначе ты меня подведешь!»
          </UiText>

          <UiText>
            Своим собственным, частнопредпринимательским бизнесом Наставнику
            заниматься тоже нелегко, поскольку, оказавшись вне иерархической
            системы, он чувствует себя очень незащищенным: нет привычной ему
            расстановки сил, никто не принимает за него решений.
          </UiText>

          <UiText>
            За все свои действия он теперь отвечает сам, за все ошибки
            расплачивается из собственного кармана.
          </UiText>

          <UiText color="role">
            В деловых отношениях интригующий тон Наставнику только мешает,
            поскольку настораживает и восстанавливает против него окружающих.
          </UiText>

          <UiText color="accent">
            Начинающая Наставник-предпринимательница позволила себе
            поинтриговать с клиентами, в результате чего они обошлись без ее
            посреднических услуг — заключили сделку «напрямую» и оставили ее без
            комиссионных.
          </UiText>

          <UiText color="role">
            Анализируя свои ошибки, Наставник учится деловой этике, учится
            подчинять свое настроение рассудку, учится делать не то, что ему
            «хочется», а то, что «целесообразно».
          </UiText>

          <UiText preset="large" color="role">
            Учится быть сдержанным в выражении своих эмоций, следит за своим
            эмоциональным лексиконом, старается не выражать ни своего личного,
            ни общественного отношения.
          </UiText>

          <UiText>
            Учится быть корректным с теми, кто ему платит, кто «заказывает
            музыку».
          </UiText>

          <UiText color="accent">
            Попадая в капиталистическую систему, Наставник «социалистической
            закваски» проходят очень трудную и тяжелую школу, причем далеко не
            всегда успешно.
          </UiText>

          <UiText>
            Изучать потребности рынка, рыночные цены и рыночные отношения для
            Наставника, с его мятежной и беспокойной душой, далеко не самая
            интересная работа.
          </UiText>

          <UiText>
            Поэтому ему трудно самому защищать свои деловые интересы, трудно
            самому постоять за себя, трудно объективно оценить свою работу,
            трудно запросить свою цену, трудно на ней настоять. В одном случае
            он может запросить совершенно нереальную стоимость, в другом —
            соглашается работать даже бесплатно.
          </UiText>

          <UiText>
            По мнению Наставника, здесь все решает платежеспособность заказчика,
            о которой он далеко не всегда бывает осведомлен.
          </UiText>

          <UiText>
            Наставник может согласиться поработать и в целях рекламы, и для
            того, чтобы получить хорошую рекомендацию, стаж или опыт работы, но
            при этом всегда будет опасаться, как бы его энтузиазмом не
            злоупотребили.
          </UiText>

          <UiText>
            Наставник способен на альтруистический поступок «смотря по
            обстоятельствам», но ему неприятно, когда его «держат за фрайера» и
            предлагают чисто символическую оплату только потому, что он известен
            своей добровольческо-благотворительной деятельностью.
          </UiText>

          <UiText preset="large" color="role">
            Как самостоятельный исполнитель, Наставник всегда старается
            выполнить свою работу на высокопрофессиональном уровне.
          </UiText>

          <UiText>
            Вообще уважает профессионализм, очень переживает, если по
            объективным причинам это не всегда удаëтся. Старается продумывать и
            прорабатывать малейшие детали, иногда видит в них «изюминку», ради
            которой и задумывалась вся работа.
          </UiText>

          <UiText>
            Не любит начинать несколько дел сразу, не любит перегрузок. Многие
            просчеты в своих делах склонен объяснять чрезмерным объемом работы
            или вынужденным рассредоточением внимания на ее различных планах.
          </UiText>

          <UiText>
            Рассредоточение внимания — действительно одна из его серьезнейших
            проблем: Наставник легко отвлекается с одного плана работы на
            другой, а иногда и вообще забывает, чем он занимался до этого.
          </UiText>

          <UiText>
            В результате накапливается множество запутанных дел, которые ему
            потом приходится распутывать и переделывать заново. Поэтому самую
            ответственную работу он старается выполнять в условиях, исключающих
            всякие внешние помехи. Может продуктивно работать по ночам, когда
            его уже никто и ничто не отвлекает.
          </UiText>

          <UiText preset="large" color="role">
            Очень любит работать по проверенным методикам.
          </UiText>

          <UiText>
            И в этом ему неоценимую услугу оказывает его дуал Инспектор —
            непревзойденный мастер по части разработки методов и инструкций,
            способный досконально изучить любой аспект работы, разложить «по
            полочкам» и в доходчивой, лаконичной форме дать Наставнику
            разъяснения по всем интересующим его вопросам.
          </UiText>

          <UiText preset="large" color="role">
            В быту Наставник старается быть и экономным и расчетливым, но это у
            него плохо получается.
          </UiText>

          <UiText>
            То и дело он под настроение покупает себе какую-нибудь не самую
            нужную вещь, делает лишние траты: то ему хочется пожить на широкую
            ногу, то проявить «широту натуры».
          </UiText>

          <UiText>
            Когда Наставник заведует семейным бюджетом, ему с трудом удаëтся
            свести концы с концами. Вот тут-то его и выручает
            педантично-расчетливый Инспектор, у которого и каждая копейка на
            счету, и каждая статья расхода на учете.
          </UiText>

          <UiText>
            Инспектор очень любит наводить порядок в своих, и в чужих,
            финансовых делах и с удовольствием берет на себя контроль за
            семейным бюджетом. По-настоящему быть практичным и хозяйственным
            Наставник учится у своего дуала Инспектора.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">4 — Болевая функция.</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_comfort" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Комфорт</UiText>
              <UiText preset="body">Сенсорика ощущений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Основная проблема Наставника в его постоянном ощущении внутреннего
            физического дискомфорта. Как будто его постоянно что-то раздражает
            или мучает.
          </UiText>

          <UiText>
            Иногда это проявляется в привычке болезненно морщиться или часто
            моргать, невольно подумаешь, что его раздражает яркий свет или
            громкая музыка. Иногда в привычке разговаривать тихим или болезненно
            сдавленным голосом, будто он только что плакал, или собирается это
            сделать и у него уже «стоит ком в горле». Иногда в привычке говорить
            громким, резким голосом, постоянно «на повышенных интонациях».
          </UiText>

          <UiText>
            Наставника действительно иногда раздражают и резкий свет, и громкая
            музыка — любой предмет, любое явление может для него быть источником
            дискомфорта. Иногда он как будто старается заглушить в себе это
            неприятное состояние.
          </UiText>

          <UiText preset="large" color="role">
            У Наставника часто возникает потребность в острых вкусовых, и не
            только вкусовых, ощущениях. Любит обжигающе острые приправы с
            запахом, резко возбуждающим аппетит.
          </UiText>

          <UiText color="role">
            Однообразие вкусовых ощущений Наставника часто раздражает — хочется
            чего-то изысканного, необычного. Ему бывает интересно попробовать
            какое-то новое блюдо, узнать, из чего оно приготовлено.
          </UiText>

          <UiText>
            Иногда и сам любит поэкспериментировать в области кулинарии — и
            делает это очень смело, но, надо сказать, не всегда удачно. Иногда
            он пытается сочетать нечто, по вкусу в принципе несочетаемое, а
            иногда предпочитает утрированные вкусовые ощущения — для него это
            «как раз то, что нужно».
          </UiText>

          <UiText color="role">
            Случается, он не обращает внимания на качество продуктов и может
            запросто нарезать в салат подгнивших овощей, не говоря уже о том,
            что Наставник по рассеянности вообще может забыть, что он готовит и
            из чего, что он уже положил в котел, а что еще нет.
          </UiText>

          <UiText>
            Некоторые из представителей этого типа любят не столько готовить,
            сколько «играть в повара» — особенно мужчины.
          </UiText>

          <UiText>
            Женщинам-Наставникам это занятие тоже частенько надоедает, и они
            относятся к нему как к наскучившим домашним обязанностям, а иногда
            даже с каким-то раздражением, как будто эта работа представляет для
            них особые трудности.
          </UiText>

          <UiText>
            Как уже говорилось, вынужденная необходимость заниматься только
            домашним хозяйством часто неблагоприятно сказывается на их характере
          </UiText>

          <UiText preset="large" color="role">
            Вообще, устройство быта для Наставника не самое привлекательное
            занятие. Вспоминать, что нужно купить для дома, для семьи, — это
            всегда для него лишнее и мучительное напряжение.
          </UiText>

          <UiText color="accent">
            Художница-Наставник отправила сына в булочную купить свежего хлеба,
            чтобы «освежить» рисунок. Сын принес две булки: одну, чтобы рисунок
            стереть, другую — чтобы съесть. И вот именно это обстоятельство ее
            сначала очень удивило, а потом рассмешило: «Васька-то у меня мужичок
            хозяйственный растет!»
          </UiText>

          <UiText>
            Организация быта для Наставника — это всегда лишняя головная боль
            при более чем скромных результатах. Иногда в его доме не хватает
            многих нужных вещей, а иногда наблюдаются какие-то явные
            несуразности в интерьере.
          </UiText>

          <UiText color="accent">
            «Меня поразило в ее комнате то, что над кроватью, — вот так, как
            обычно люди коврик вешают, — у нее висела каменная плита с
            великолепным старинным рельефом. Довольно большая плита, размером
            где-то полтора метра на метр… Уж не знаю, на чем она там держалась,
            но меня все удивляло, как это можно спать под такой плитой, как же
            ей не страшно?»
          </UiText>

          <UiText preset="large" color="role">
            Именно в быту Наставнику иногда не хватает острых ощущений и он их
            старается добирать, где можно и чем можно.
          </UiText>

          <UiText>
            Это одна из причин, по которой он сам может создавать себе бытовые
            трудности или усложнять свои бытовые отношения вопреки всякому
            здравому смыслу.
          </UiText>

          <UiText>
            Случается, ему не хватает эмоционального напряжения и он может
            устроить свой быт таким образом, чтобы интерьер его комнаты уже сам
            по себе задавал нужное ему настроение.
          </UiText>

          <UiText color="accent">
            Например, он может задрапировать стены черной тканью или завесить их
            политическими плакатами, флагами или вымпелами, портретами своих
            кумиров и вождей; разрисовать комнату какими-нибудь собственными
            художествами, словом, делать все, что ему вздумается, лишь бы
            создавалось приятное настроение.
          </UiText>

          <UiText>
            Разумеется, лучше всего обстоит дело, когда организацией его быта
            занимается его дуал Инспектор. Хозяйственный, работящий, от природы
            наделенный прекрасным эстетическим вкусом, аккуратный, умеющий
            наводить и поддерживать порядок, Инспектор при желании способен
            создать Наставнику именно те условия, о которых он только может
            мечтать. Вплоть до «кофе в постель», особенно если отношения и
            ситуация к этому располагают.
          </UiText>

          <UiText>
            Женщина-Инспектор вообще безупречная хозяйка: и экономная, и
            запасливая, и каждую статью расходов записывает.
          </UiText>

          <UiText>
            Кроме того, сориентированный на этические установки Наставнику
            Инспектор не боится его эмоциональных перепадов, более того, он
            очень хорошо себя в этом режиме чувствует.
          </UiText>

          <UiText>
            Поэтому всегда находит способ предложить своему дуалу и
            соответствующие эстетические критерии, которые, с одной стороны, не
            противоречат его принципам, а с другой — направляют его ощущения в
            гармоничное русло.
          </UiText>

          <UiText>
            Если Наставник проявляет себя как «режиссер сильных переживаний», то
            Инспектор — это художник острых ощущений.
          </UiText>

          <UiText>
            В паре Наставник-Инспектор происходит постоянный
            эмоционально-сенсорный взаимообмен (взаимообмен «кнута и пряника»):
            так же, как эмоциональное поле Наставника постоянно меняется с
            положительного на отрицательное, так и приятные, расслабляющие
            ощущения, создаваемые Инспектором, постоянно сменяются острыми,
            возбуждающими.
          </UiText>

          <UiText>
            Именно дополняя друг друга в эмоционально-сенсорном плане, Наставник
            и Инспектор создают для себя оптимальный психологический режим,
            оптимальную гармонию ощущений.
          </UiText>

          <UiText>
            Многие сенсорные ощущения воспринимаются Наставником эмоционально
            или интуитивно:
          </UiText>

          <UiText color="accent">
            «У моей учительницы-Наставника была своя теория преподавания
            живописи - основная нагрузка делалась на воображение и на память. Мы
            должны были запомнить цвет, а на рисунке только пометить цветовое
            пятно контурной линией соответствующего тона. В результате рисунок
            покрывался сетью каких-то разноцветных контуров, в которых легко
            было запутаться. Мне эта техника никак не удавалась - терялись
            острота и свежесть сиюминутного восприятия цвета… Часто она любила
            говорить: Возьми этот цвет насыщеннее, чтобы он зазвенел, а то он
            молчит, как мертвый…»
          </UiText>

          <UiText color="role">
            Как бы не был Наставник болезненно восприимчив к внешнему
            дискомфорту, со временем он начинает понимать, что источник его
            постоянного раздражения в нем самом — в постоянном ощущении личной
            неустроенности, точнее, «непристроенности» или «неприкаянности».
          </UiText>

          <UiText preset="large" color="role">
            Наставник очень остро ощущает свое одиночество. Иногда, особенно в
            молодости, он склонен разыгрывать роль этакого «печального демона»,
            непонятого и одинокого.
          </UiText>

          <UiText>
            Печальные мысли об одиночестве приводят к размышлениям о «бренности
            бытия», которые особенно часто его посещают в период плохого
            самочувствия.
          </UiText>

          <UiText>
            Достаточно обратить внимание Наставника на его нездоровый вид, как
            он сразу же начинает переживать за состояние своего здоровья,
            размышлять о приближающейся старости и о том, чем неизбежно
            заканчивается человеческая жизнь, что приводит его к еще более
            печальному настроению.
          </UiText>

          <UiText>
            Когда здоровью Наставника начинает что-то действительно серьезно
            угрожать, жизнь его домочадцев превращается в сплошной кошмар:
          </UiText>

          <UiText color="accent">
            «Еще задолго до того, как лечь в больницу, мама начала меня морально
            подготавливать: «Смотри, когда я умру, чтоб ты знал: здесь у нас
            хранится манная крупа, здесь - сахар... Смотри, когда я умру, чтоб
            ты не забывал платить за квартиру». Операция прошла успешно, но я
            так и не понял, зачем ей нужно было настраивать нас на самое
            худшее».
          </UiText>

          <UiText preset="large" color="role">
            Причем такие претензии предъявляются необязательно к самым близким
            людям. Наставники любят, когда во время болезни их навещают не
            только родственники, но и соседи, друзья, сослуживцы или ученики:
          </UiText>

          <UiText color="accent">
            «Лень тебе проведать свою учительницу? Или ты дожидаешься, пока я
            умру?»
          </UiText>

          <UiText>
            Спасение от этой хандры наступает с появлением в его жизни близкого
            человека, от природы наделенного оптимизмом, бодростью духа,
            ясностью ума, сильной волей, преданностью, отзывчивостью и
            дружелюбием, то есть именно теми качествами, которыми в избытке
            обладает его дуал Инспектор, способный чутко улавливать ощущения
            физического и душевного дискомфорта, способный исполнять и
            предупреждать все желания своего партнера.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">5 — Внушаемая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_logic" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Теория</UiText>
              <UiText preset="body">Структурная логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Трудно дать логическое объяснение поступкам Наставника. Иногда даже
            не следует пытаться этого делать. Иногда создается впечатление, что
            Наставник вообще видит себя вне фактов и вне логики.
          </UiText>

          <UiText>
            То есть лично он убеждается только фактами и только достоверными, но
            сам может, как ребенок, ссылаться на какой-то придуманный факт, тем
            более, если его невозможно проверить.
          </UiText>

          <UiText>
            Может часто манипулировать фактами и аргументами по своему
            усмотрению, но очень боится и не любит, когда так поступают по
            отношению к нему самому.
          </UiText>

          <UiText color="role">
            Всегда рад возможности собрать нужную информацию. Иногда он это
            делает как бы между прочим, предварительно расслабив собеседника и
            настроив его на доверительный лад, может как бы невзначай спросить
            его о чем-нибудь важном.
          </UiText>

          <UiText>
            Часто строит из себя этакого наивно-любопытствующего собеседника,
            иногда — якобы сомневающегося скептика, провоцирующего на то, чтобы
            ему убедительно возражали и в качестве аргумента подробно
            информировали о действительном положении вещей, а также излагали все
            планы и раскрывали все карты.
          </UiText>

          <UiText preset="large" color="role">
            Наука, по мнению многих представителей этого типа, ни в коем случае
            не должна быть вне политики, вне социальных проблем, вне
            общественного мнения. Более того, она обязана активно работать на
            его социальную систему и служить ее идеалам.
          </UiText>

          <UiText>
            Поэтому и направление развития науки должно определяться целями и
            задачами субсидирующей ее социальной системы. Придерживаясь такой
            точки зрения, Наставник способен успешно сочетать научную
            деятельность с идеологической работой.
          </UiText>

          <UiText color="accent">
            Правда, последствия такого сочетания не всегда идут на пользу науке.
            История знает немало случаев, когда некоторые представители этого
            типа превращали область научных исследований в арену идеологической
            борьбы, а научные диспуты — в политическое ристалище.
          </UiText>

          <UiText preset="large" color="role">
            Наставник часто поступает вопреки здравому смыслу, поскольку эмоции
            у него обычно преобладают над рассудком.
          </UiText>

          <UiText>
            Именно поэтому ему трудно быть объективным, поэтому-то и понятие об
            объективности у него тоже весьма относительное: чаще всего
            «объективно», в его понимании, то, что он считает нужным и удобным
            для себя.
          </UiText>

          <UiText>
            «Объективную информацию» Наставник довольно часто подбирает
            предвзято, иногда слишком тенденциозно — все зависит от того, для
            какой цели он предполагает эту информацию употребить. Кроме того,
            «объективность» часто зависит от его настроения.
          </UiText>

          <UiText color="accent">
            Например, если «под горячую руку» попросить его написать
            «рекомендательное письмо», он может написать «объективную
            характеристику» с явно критическими тенденциями. Под настроение
            Наставник может выдать «объективный анализ», где вообще одно
            противоречит другому.
          </UiText>

          <UiText>
            Наставник настолько часто «попадается» на собственных нелогичностях
            и противоречиях, что иногда его просто не хочется уже на этом
            ловить. Тем более, что, даже будучи уличенным, он ведет себя совсем
            как ребенок: пугается, раздражается и еще больше запутывается.
          </UiText>

          <UiText>
            Кроме того, ему вообще трудно быть логически последовательным.
            Факты, которыми он оперирует, иногда бывают настолько хаотично
            подогнаны, что никакой последовательности там вообще не наблюдается,
            а только прослеживается какая-то эмоциональная или идеологическая
            тенденция.
          </UiText>

          <UiText>
            И тем не менее Наставник очень ценит в людях способность
            высказываться лаконично и по сути. Чужие высказывания он всегда
            старается запомнить и при случае применить в своей речи, которая
            иногда представляет собой именно цепочку лаконичных, но
            выразительных афоризмов.
          </UiText>

          <UiText color="role">
            Сам Наставник может дать четкое определение какому-либо понятию
            только в том случае, если он его тщательно «вызубрил», а если его
            попросить дать объяснение своими словами, то это, скорее всего,
            будет весьма далеко от истины, а может даже и совершенно
            противоположно ей по смыслу.
          </UiText>

          <UiText>
            Наставник уважает людей, умеющих не упускать противоречивых мелочей,
            умеющих при анализе ситуации учесть каждую деталь, разобраться во
            всем тщательно и досконально.
          </UiText>

          <UiText>
            Ему постоянно нужен кто-то, способный терпеливо распутывать то, что
            он так основательно запутал, кто-то, кто обладает феноменальной
            наблюдательностью и замечательной памятью, и может в любую минуту
            дать ему нужную энциклопедическую справку, процитировать нужную
            инструкцию, предложить нужную методику.
          </UiText>

          <UiText>
            Одним словом, для ведения всей будничной повседневной работы, для
            постоянного наведения порядка в его сумбурных мыслях и в его
            полузапутанной, полуутерянной документации Наставник нужен именно
            такой партнер, как Инспектор, причем нужен как воздух. Без
            Инспектора гениальные гамлетовские идеи так и останутся плодом его
            воображения.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">
            6 — Активационная функция
          </UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_will" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Воля</UiText>
              <UiText preset="body">Волевая сенсорика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Сказать, что Наставник обладает какой-то особой напористостью,
            настойчивостью и большим волевым потенциалом, было бы сильным
            преувеличением. Его настойчивость скорее сродни занудству.
          </UiText>

          <UiText color="role">
            Решительным его тоже не назовешь — он, как всякий интуит, склонен к
            сомнениям и колебаниям. Особыми пробивными способностями обычно не
            отличается. Поэтому всегда нуждается в том, чтобы кто-то за него
            похлопотал. Прямому волевому давлению не поддается, но и
            противостоит ему с трудом, поскольку это требует от него слишком
            большого физического напряжения.
          </UiText>

          <UiText>
            И тем не менее все эти проблемы легко решаются, если Наставник
            наделен большими полномочиями в рамках определенной социальной
            системы. Тут он может развернуться и работать с огромной энергией,
            не чувствуя усталости.
          </UiText>

          <UiText preset="large" color="role">
            Чем выше положение Наставника в системе, тем больше возможностей он
            для себя видит. Наставник склонен злоупотреблять своей властью.
            Способен ею самоутверждаться. Осознание собственных полномочий его
            очень воодушевляет и активизирует.
          </UiText>

          <UiText>
            Сознание безграничности своих полномочий для Наставника опасно — оно
            превращает его в злого демона, развлекающегося судьбами и жизнями
            людей.
          </UiText>

          <UiText>
            Работа в рамках системы для Наставника особенно предпочтительна,
            хотя бы потому, что он уже куда-то пристроен и осталось только
            проявить себя, а за этим уж дело не станет. Наставник гибок и
            динамичен, он умеет быстро оценить ситуацию и быстро приспособиться
            к новым условиям работы.
          </UiText>

          <UiText>
            Он уважает систему иерархий, уважает авторитеты, признанные в этой
            системе. Уважает всех работников этой системы, чьим трудом она
            держится. В рамках системы он живет удобно и уютно. И он рад
            занимать в ней какую-то должность.
          </UiText>

          <UiText preset="large" color="role">
            Иногда, предвидя близкий крах возглавляемой им системы, он готовит
            возможные пути к отступлению, к сохранению хотя бы той ее нынешней
            части, на базе которой можно будет воссоздать ядро будущей.
          </UiText>

          <UiText>
            Когда его система разрушается, он пытается восстановить и объединить
            вокруг этого ядра уцелевшие связи, дать им новый лозунг и наполнить
            их новым актуальным содержанием, подготавливая ее таким образом к
            внедрению в будущем.
          </UiText>

          <UiText color="role">
            Наставник, выпавший из своей системы и не находящий себе места в
            обществе, — это трагедия, это образ чаплинского безработного
            «бродяги».
          </UiText>

          <UiText>
            Наставнику бывает трудно самому себя организовать, заставить себя
            что-то сделать - для этого ему нужен волевой импульс извне.
            Организовать Наставника волевым давлением может только его дуал
            Инспектор — и в этом он бывает строг и непреклонен.
          </UiText>

          <UiText>
            Любое другое воздействие не даст должных результатов: методом
            убеждения Наставника дисциплинировать очень трудно. Он развернет
            дискуссию, которая даст ему возможность выиграть время и тем самым
            остаться на своих позициях. От прямого давления Наставник тоже
            ускользнет: он либо разозлится, либо устроит «сцену», либо начнет
            «ломать комедию».
          </UiText>

          <UiText>
            С другой стороны, Наставника, увлеченного своим делом, нет
            надобности выгонять на работу силой.
          </UiText>

          <UiText color="role">
            Достойнейшие представители этого типа, добившиеся исключительных
            творческих успехов, и сами могут служить образцом выносливости,
            работоспособности и целеустремленности.
          </UiText>

          <UiText>
            Хотя за свое физическое перенапряжение им иногда приходилось
            расплачиваться пусть и блистательной, но все же непродолжительной
            карьерой.
          </UiText>

          <UiText>
            Когда Наставник увлечен работой, он не считается ни со своими
            силами, ни со своим здоровьем. И тут ему совсем не лишней
            оказывается помощь его дуала: Инспектор, как уже говорилось,
            особенно внимателен к ощущениям Наставника. Поэтому он и расслабляет
            его, и переключает на другое занятие, а может и просто волевым
            нажимом заставить его отдохнуть.
          </UiText>

          <UiText>
            Когда Наставник дуализирован, всегда есть кому о нем позаботиться,
            кому скоординировать его работу, распределить его нагрузки.
            Инспектор создает своему дуалу самый оптимальный режим для успешной
            творческой деятельности.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">7 — Функция защиты</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_people" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чувство</UiText>
              <UiText preset="body">Этика отношений</UiText>
            </span>
          </div>

          <UiText>
            Этический кодекс Наставника совершенно безупречно работает именно в
            рамках его социальной системы: с начальством и подчиненными
            Наставник ведет себя «как положено», с равными — общается на равных
            и в этическом плане старается проявить себя с самой лучшей стороны.
          </UiText>

          <UiText>
            Именно поэтому Инспектору, разделяющему аналогичные взгляды и
            убеждения, не следует беспокоиться за успех своих взаимоотношений с
            Наставником: тут ему обеспечены и преданнейшая дружба и искренняя
            самоотверженная любовь.
          </UiText>

          <UiText>
            Родственные связи и взаимоотношения в рамках семьи для Наставника
            (равно как и для его дуала Инспектора) имеют первостепенную
            значимость, поскольку семья ими рассматривается тоже как социальная
            структура: во всем мире могут быть хаос и анархия, но в семейных
            отношениях должен быть строгий, раз и навсегда установленный
            порядок.
          </UiText>

          <UiText color="role">
            Если такового порядка нет, Наставник может противопоставлять себя
            семейным отношениям, может не подчиняться ни общим установкам, ни
            общему укладу.
          </UiText>

          <UiText>
            Представители этого типа очень болезненно переживают семейные
            неурядицы: развод и ссоры родителей, супружескую измену и
            предательство по отношению к семейным интересам, обиду, нанесенную
            членам семьи, — все это очень серьезные и драматичные для Наставника
            события, с которыми ему очень трудно мириться, поскольку они глубоко
            задевают его этические установки.
          </UiText>

          <UiText>
            И именно поэтому он всегда считает себя обязанным на них должным
            образом отреагировать: объявить бойкот, отомстить, отлучить от
            семьи, самому уйти из семьи/ Если таковые поступки вписываются в
            рамки традиций, Наставнику это существенно облегчает задачу, если
            нет — действует по собственному усмотрению, не придавая особого
            значения оценке его поступков окружающими.
          </UiText>

          <UiText>
            Поскольку сфера этических интересов у Наставника сводится к
            наблюдению взаимоотношений в рамках определенной социальной
            структуры, то и расстановка сил в коллективе всегда имеет для него
            решающее значение, поскольку именно она определяет характер и
            направление его действий.
          </UiText>

          <UiText>
            Именно поэтому для Наставника очень важно своевременно выявить
            скрытые этические тенденции, выявить потенциального лидера,
            потенциального фаворита.
          </UiText>

          <UiText>
            Именно поэтому Наставник с особым вниманием наблюдает за тем, чтобы
            поведение и взаимоотношения всех членов коллектива соответствовали
            месту, занимаемому ими в иерархии. Перефразируя латинскую пословицу,
            можно сказать, что Наставник следит за тем, чтобы то, что позволено
            Юпитеру, не позволял себе бык, чтобы поведение и взаимоотношения в
            рамках системы были подобающими и соответствующими.
          </UiText>

          <UiText>
            Следует заметить, что исходя из этих же принципов строит свои
            взаимоотношения и его дуал Инспектор: «То, что позволено Юпитеру не
            позволено быку». Иными словами: поведение в рамках системы должно
            соответствовать занимаемой должности, поскольку определяется правом
            возложенной ответственности. Именно в этом и Инспектор и Наставник
            видят единственно справедливые этические принципы — принципы,
            соответствующие их системе взглядов и отношений.
          </UiText>

          <UiText>
            Каждый раз, когда у кого-либо из членов коллектива проявляются
            «замашки примадонны», Наставник это в первую очередь замечает и его
            первого это настораживает — а с чего бы это? На каком основании? Кто
            и что за этим стоит? И нет ли тут какой-то скрытой тенденции,
            которую он проглядел и, упустив которую, он может оказаться «за
            бортом»?
          </UiText>

          <UiText preset="large" color="role">
            Именно поэтому самое возмутительное для Наставника явление, когда
            кто-то просто так, без всяких на то оснований (санкций или
            полномочий) ведет себя «неподобающим образом».
          </UiText>

          <UiText color="role">
            Наставника это возмущает не только тем, что такое поведение
            размывает рамки системы, вносит в нее хаос. Эта этическая
            непредсказуемость вносит сумбур в его планы и в конечном счете
            угрожает его собственному месту в рамках этой системы.
          </UiText>

          <UiText>
            Интригующий «стиль общения» Наставника как раз и является основным
            способом пронаблюдать и получить информацию именно по этому,
            жизненно важному для него вопросу. Каждый раз, когда ему необходимо
            увеличить приток информации, он начинает активно «интриговать»,
            причем делает это не всегда осознанно. Результаты сказываются
            незамедлительно, причем самые ошеломляющие.
          </UiText>

          <UiText color="accent">
            Если, например, он недостаточно осведомлен о чьем-либо этическом
            потенциале, в самый кратчайший срок его ближайшее окружение
            заряжается лихорадкой «выяснения отношений» и незаметно для себя
            превращается в этакий «курятник», где все друг друга клюют и каждый
            вытворяет такое, о чем потом бывает неприятно вспоминать. А
            невольный «виновник» всех событий наблюдает этот «спектакль» со
            стороны и размышляет о том, как много еще в людях гадкого и грязного
            — теперь-то он это знает наверняка!
          </UiText>

          <UiText preset="large" color="role">
            Наставник способен интриговать на «пустом месте», на «нулевых
            фактах». Ему даже не всегда для этого нужен повод.
          </UiText>

          <UiText color="role">
            Единственная причина — это его полнейшее неведение или непонимание,
            на каком основании интересующий его человек позволяет себе те или
            иные поступки, каковы мотивы его поведения и какое отношение они
            имеют лично к нему.
          </UiText>

          <UiText>
            Цель интриги, форма интриги задаются подсознательно. То есть сам
            Наставник не всегда осознает, что и зачем он делает.
          </UiText>

          <UiText>
            Просто он чем-то обеспокоен и начинает как-то действовать. В данном
            случае его беспокоит собственное неведение и он старается добыть
            информацию любыми средствами — только и всего!
          </UiText>

          <UiText color="accent">
            Иногда, испытывая неловкость перед коллективом за невыполненное
            обещание, он может почувствовать непреодолимое желание устроить
            какую-то «заварушку», которая оказывается очень кстати и помогает
            ему отвлечь коллектив от насущных проблем и переключить его на
            этические «разборки», что в дальнейшем дает ему право сказать: «Да,
            может, я и не самый лучший руководитель, но и вы не ангелы!»
          </UiText>

          <UiText>
            Иногда, тревожась за свое положение в системе, видя в ком-то
            будущего конкурента или просто потенциального лидера, он также
            начинает этически испытывать подчиненных, с тем чтобы узнать степень
            своего влияния на каждого из них.
          </UiText>

          <UiText>
            Причем методы у него могут быть самые неэтичные: он может искушать,
            запугивать, вызывать на откровенность, шантажировать, сплетничать,
            наушничать, подстрекать — к каждому он должен подобрать свой ключик,
            должен исследовать область этических проблем каждого. В этом он
            неутомимый исследователь!
          </UiText>

          <UiText>
            Наставник изначально не верит в абсолютную святость и
            непогрешимость. Пропуская человека сквозь сито своих «проверок», он
            как бы стремится раскрыть изнанку его души, убеждая его (а заодно и
            себя), что это и есть его подлинное лицо, а все остальное — только
            притворство.
          </UiText>

          <UiText color="accent">
            «Предрасположенность к греху — это ведь так естественно! Чего же тут
            стесняться!» — таков как будто вывод его «режиссуры», но каждый из
            «артистов» уже чувствует себя «завербованным», приобщенным к некоему
            «братству грешников».
          </UiText>

          <UiText>
            Поиску «виноватого» Наставники уделяют много времени и сил. Чаще
            всего «виноватым» объявляется тот, кто игнорирует его лидерство.
            Наставник всегда «чувствует» человека внутренне независимого.
          </UiText>

          <UiText>
            Ему бывает необходимо разобраться в причинах этой независимости,
            найти слабую, «болевую» точку в душе каждого, «прощупать» ее болевой
            предел.
          </UiText>

          <UiText>
            Есть еще и другие методы «этического воздействия», свойственные
            некоторым представителям этого типа: частая смена «фаворитов» и
            «опальных», коллективная травля «виноватого», возведение
            «напраслины» с последующим «общественным порицанием», умение
            переводить любое обсуждение в «осуждение».
          </UiText>

          <UiText>
            При кажущейся неэтичности указанных методов для Наставника это не
            более, чем прощупывание «болевых точек» интересующих его людей, это
            всего лишь способ получения необходимой ему информации.
          </UiText>

          <UiText>
            Этим же объясняется и его этическая непоследовательность: например
            сегодня он может быть искренним другом своего вчерашнего «врага».
          </UiText>

          <UiText>
            Причем для оправдания собственной непоследовательности у него
            найдется множество «фактических доводов», кроме одного — он попросту
            испытывал интересующего его человека. Но именно такое объяснение ему
            и самому в голову не придет, поскольку метод воздействия этическим
            отношением у Наставника реализуется подсознательно.
          </UiText>

          <UiText color="accent">
            Впрочем, если его навести на эту мысль, он вполне может с ней
            согласиться, поскольку в самом факте проверки не увидит ничего для
            себя предосудительного: ведь действуя таким образом, он, кроме всего
            прочего, получает еще и информацию о лояльности окружающих его
            людей, об их преданности идеалам его системы, об их
            предрасположенности к «инакомыслию», т. е. все то, что в данный
            момент интересует и волнует его и как человека, и как гражданина. А
            неэтичность методов всегда можно списать и на условия «политической
            обстановки», и на «вынужденную необходимость исторического момента».
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">8 — Фоновая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_ideas" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Мысль</UiText>
              <UiText preset="body">Интуиция возможностей</UiText>
            </span>
          </div>

          <UiText>
            В реальной жизни Наставник не всегда может это рассказать даже
            самому себе как он собирается действовать в той или иной ситуации,
            поскольку этот процесс у него реализуется на уровне подсознания.
          </UiText>

          <UiText>
            Более того, некоторые представители этого типа утверждают, что им
            легче просчитать возможности ситуации для других, чем для себя.
          </UiText>

          <UiText color="accent">
            Тоже верно, поскольку демонстративная функция активнее реализуется
            под влиянием внешнего импульса, а не внутреннего.
          </UiText>

          <UiText color="role">
            Тем не менее Наставник великолепно пользуется этим качеством и в
            повседневной жизни, и в экстремальных ситуациях.
          </UiText>

          <UiText preset="large" color="role">
            Благодаря сильной подсознательно реализуемой интуиции возможностей,
            для него как будто не существует безвыходных ситуаций, он всегда
            находит способ выйти «сухим из воды».
          </UiText>

          <UiText>
            Благодаря этому свойству Наставника практически невозможно
            «припереть к стенке»: у него есть тысячи способов выкрутиться,
            отвлечь от себя внимание или подставить кого-то другого.
          </UiText>

          <UiText>
            Запас его выдумок и трюков неистощим. Он способен пересидеть и
            переждать любую опасность. Он способен «переиграть» любого
            противника, спрятаться так, что его никто не найдет, запутать
            «следы» так, что никто концов не отыщет.
          </UiText>

          <UiText>
            Он не только способен вылезти из любого капкана, но еще и посадить
            туда охотника. Он может кого угодно убедить в своей правоте,
            изобретая для этого доводы, которые ни проверить, ни опровергнуть
            невозможно.
          </UiText>

          <UiText preset="large" color="role">
            Наставник никогда не скажет того, что потом бы обернулось против
            него. А если это и случится, он либо откажется от своих слов, либо
            постарается придать им другой смысл.
          </UiText>

          <UiText color="role">
            Он никогда не подпустит «чужих» к «своему пирогу». Наставники ничего
            и никогда не делают в ущерб себе, но они великолепно умеют создавать
            иллюзию самопожертвования.
          </UiText>

          <UiText>
            Наставник, как прирожденный лидер, не любит признавать свое
            поражение. Он прекрасный стратег и умеет продумать множество
            вариантов к отступлению. Подготовить заранее «потайные ходы»,
            лабиринты, найти себе «двойников» и организовать тайную защиту.
          </UiText>

          <UiText color="accent">
            Современные Наставники-политики в совершенстве владеют всем этим
            арсеналом средств и умеют продолжать «свою игру», даже будучи,
            казалось бы, низложенными.
          </UiText>

          <UiText preset="large" color="role">
            Наставник способен проявлять чудеса выживаемости и неуязвимости.
            Этими же качествами характеризуется и любое политическое движение:
            неонацизм, исламский фундаментализм, международный терроризм,
            чеченский сепаратизм и многие другие.
          </UiText>

          <UiText>
            Порвать отношения с Наставником очень трудно, и то, если только он
            сам тому не воспрепятствует. В противном случае, он ни себе, ни
            другим не даст «выйти из игры».
          </UiText>

          <UiText>
            Он может ее продолжать в самых неожиданных формах и на самых
            невидимых фронтах, но обязательно будет напоминать о себе и не
            позволит себя проигнорировать.
          </UiText>

          <UiText color="role">
            Наставники выгодно используют свою интуицию не только в собственных
            интересах, но и для нужд своего ближайшего окружения, выражая этим
            особое свое расположение и симпатию.
          </UiText>

          <UiText>
            Наставники очень любит, когда окружающие делятся с ним своими
            планами. Это так приятно, когда тебе доверяют, — значит видят в тебе
            друга. В эту минуту он чувствует себя по уши влюбленным в своего
            собеседника.
          </UiText>

          <UiText>
            И ему хочется чем-нибудь отплатить за оказанное доверие, а заодно и
            продемонстрировать свою дальновидность и незаурядный жизненный опыт.
          </UiText>

          <UiText>
            Наставнику совершенно безразлично, от скуки делится с ним собеседник
            или действительно не нашел никого умнее его. В любом случае он
            считает своим долгом указать на все возможные просчеты в излагаемых
            ему планах, даже если эти планы уже «утверждены» и осуществляются.
          </UiText>

          <UiText>
            Последнее обстоятельство его очень обижает: «Почему с ним не
            посоветовались раньше?» Это объясняется тем, что Наставник
            подсознательно настроен на слабую интуицию Инспектора, который
            сначала у всех проконсультируется, а потом уже действует. Именно
            поэтому Наставник всегда волнуется за своевременность своего
            предупреждения и всегда предпочитает предостерегать заранее.
          </UiText>

          <UiText>
            Наставник умеет предвидеть не только отдельные неприятности, но и
            глобальные катастрофы. Хорошо просматривает общие исторические связи
            между явлениями самого различного порядка.
          </UiText>

          <UiText>
            Представителей этого типа часто интересует информация о всевозможных
            неординарных явлениях, феноменах и аномалиях. Многие из них
            увлекаются мистикой, магией, бывают суеверны или фанатично
            религиозны; многие обладают сильным биополем и экстрасенсорными
            способностями.
          </UiText>

          <UiText color="role">
            Среди представителей этого типа встречаются множество талантливых
            людей, незаурядных и одаренных личностей, отличающихся
            исключительной эрудицией и широчайшим диапазоном интересов.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
