<template>
  <div class="text g-page">
    <section>
      <UiText preset="subtitle" color="accent">Сильные стороны</UiText>

      <UiText preset="large" color="role">
        Умеет совершать разумные и полезные поступки. Адаптирует новые идеи к
        практике, извлекает из них максимум пользы.
      </UiText>

      <UiText>
        Ему присуще неброское, тихое упорство при обязательном завершении всего
        начатого, скромность. Изобретателен в быту и на работе, которая ему
        нравится.
      </UiText>

      <UiText>
        В достижимой для него области пространства все организует для работы и
        отдыха.
      </UiText>

      <UiText preset="large" color="role">
        Эстет, полностью доверяющий своему вкусу. Всегда имеет собственное
        мнение о том, что красиво и что некрасиво, где гармония, а где —
        безвкусица.
      </UiText>

      <UiText>
        Ярко и броско одеваться не любит, предпочитает умеренность и гармонию.
      </UiText>

      <UiText>
        Ценит дружбу. Если человек обратился к нему за помощью, помогает, не
        жалея личного времени. Своего мнения никому не навязывает, но потом
        обычно получается так, как он хотел.
      </UiText>

      <UiText>
        Ему доставляет радость, когда сделанное им кому-то понравилось.
      </UiText>

      <UiText>
        Имеет репутацию пунктуального человека. Не любит затягивать встречи.
        Стрессоустойчив, в опасной ситуации ведет себя подчеркнуто хладнокровно.
      </UiText>

      <UiText>
        Предупреждения об опасности вызывают у него не страх, а интерес, желание
        испытать себя.
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">Проблемы</UiText>

      <UiText>
        Склонен к скепсису, любит анализировать и подшучивать. На людях обычно
        не демонстрирует свои эмоции и чувства, хотя довольно впечатлителен.
      </UiText>

      <UiText>
        Очень зависит от настроения, периоды спада чередуются у него с периодами
        повышенной работоспособности.
      </UiText>

      <UiText>
        Скрытен, не любит фамильярности, умеет поставить человека на место.
        Приказ как форма обращения для него не существует: делает так, как
        считает нужным.
      </UiText>

      <UiText>
        По-настоящему эффективно занимается только тем, что приносит
        удовольствие, из-за этого может производить впечатление ленивого
        человека.
      </UiText>

      <UiText preset="large" color="role">
        За бесцельную работу браться не будет. Ему не нравится вялая манера
        говорить, любит четко сформулированные, уверенные высказывания.
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Нельзя требовать и ожидать
      </UiText>

      <UiList iconName="chevron-right" iconColor="accent" iconSize="16">
        <UiListItem>
          Постоянного эмоционального участия в происходящем.
        </UiListItem>

        <UiListItem>
          Сопереживания и сочувствия тому, кто обвиняет других в своих неудачах.
        </UiListItem>

        <UiListItem>Восприятия на веру малопроработанных проектов.</UiListItem>
      </UiList>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Подходящие виды деятельности
      </UiText>

      <UiText>Ему удаëтся рациональное ведение хозяйства.</UiText>

      <UiText>
        Достигает хороших результатов в тех сферах, где необходимо обслуживание
        точной техники, качественное оформление изделий.
      </UiText>

      <UiText>
        Наиболее успешен в управленческой деятельности среднего звена. Может
        работать в малом бизнесе. Умеет красиво и удобно оформить интерьер и
        рабочее место.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
