<template>
  <div class="text g-page">
    <section>
      <UiText preset="body" color="accent">
        Описания не должны обязательно совпадать со всеми чертами характера
        личности.
      </UiText>

      <UiText preset="small" color="accent">
        Идея как раз описать наблюдаемые у среднего представителя типа
        особенности поведения и обработки информации психикой.
      </UiText>

      <UiText preset="small" color="accent">
        Автор описания — Велта Микелсоне
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="role">
        Главный скептик и философ всего социона. Внимательный наблюдатель жизни.
      </UiText>

      <br />

      <UiText>
        Часто бывает серьезным, недовольным или грустным. Терпелив, независим,
        самостоятельный. Прекрасно чувствует течение времени.
      </UiText>

      <UiText preset="large" color="role">
        Видит противоречия в происходящей действительности и предвидит ход
        событий.
      </UiText>

      <UiText>
        Ему понятно, какие перемены произойдут в будущем, способен заметить
        ухудшение ситуации. Он всегда имеет своё мнение о развивающихся событиях
        и целесообразности действий.
      </UiText>

      <UiText>
        Не торопится, так как боится ошибиться, за что окружающие часто считают
        его пассивным. Не любит резких перемен, потому что каждая перемена
        требует вложения сил.
      </UiText>

      <UiText>
        Как интроверту, ему свойственна замкнутость, поэтому свои взгляды и
        прогнозы он высказывает лишь отдельным людям.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Умеет подробно анализировать сложные обстоятельства и хорошо видит
        сущность проблемы.
      </UiText>

      <UiText>
        Человек, который излишне не трудится. Под влиянием меланхолического
        темперамента все его действия совершаются экономно, продуманно,
        медленно. Поэтому со стороны кажется, что он специально бережет себя, но
        это неверно.
      </UiText>

      <UiText>
        Критик много читает и осведомлен во многих вопросах. Ему доступна
        широкая информация, которая позволяет сравнивать и оценивать каждую
        новую идею.
      </UiText>

      <UiText>
        Возможно, поэтому новинки он воспринимает осторожно и без лишнего
        восторга.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Глядя со стороны, часто возникает ощущение, будто он все уже знает.
      </UiText>

      <UiText>
        Подобное он испытывает при встрече с незнакомым человеком, когда ему
        кажется, что тот уже где-то встречался на его пути.
      </UiText>

      <UiText>
        Осознает ценность денег, знает о преимуществах, которые они дают. Если в
        его распоряжении недостаток денежных средств, внутри переживает, но
        другие это не замечают.
      </UiText>

      <UiText>
        Он обычно не одалживает деньги и вещи и не становится должником. Иногда
        ему удаëтся найти самые выгодные способы вложения денег. Свой вложенный
        труд соизмеряет в деньгах.
      </UiText>

      <UiText preset="large" color="role">
        Думает и рассуждает творчески.
      </UiText>

      <UiText>
        Его действия согласованы с законами и правилами, но он также опирается
        на свой опыт и здравый смысл. Склонен усовершенствовать процесс работы.
        Перед заключением сделки тщательно обдумывает её условия и возможные
        последствия, потому что не любит рисковать.
      </UiText>

      <UiText>
        Всегда выбирает самое надежное решение. Не станет торопиться с
        подписанием документа, пока полностью не будет знать о последствиях.
        Иногда откладывает дела на неопределенное время.
      </UiText>

      <UiText preset="small" color="accent">
        Он человек, который точно и кропотливо оформляет всю деловую
        документацию, выявить какие-либо ошибки со стороны фактически
        невозможно. Он учитывает влияние всех законов и правил. Этим он создает
        впечатления о себе как о надежном деловом партнере.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Цель достигает постепенно, самыми простыми способами, учитывая выгоду.
      </UiText>

      <UiText>
        Вмешательство со стороны – поторапливания, принуждения, установленные
        временные рамки – мешают ему работать. Но на него можно положится, он
        все равно выполнит работу в срок. Не любит, когда его отвлекают на
        рабочем месте, выясняют отношения или ведут тайные интриги.
      </UiText>

      <UiText preset="large" color="role">
        Если работа не приносит ожидаемого результата, может потерять
        вдохновение.
      </UiText>

      <UiText>
        В сложных обстоятельствах сохраняет хладнокровие, не поддается
        эмоциональному влиянию. Постоянно совершенствует своё мастерство. Больше
        доверяет себе, неохотно принимает помощь со стороны.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Любит природу и путешествия. Перед тем, как отправиться в поездку или
        поход, запасается необходимыми вещами.
      </UiText>

      <UiText>
        Чтобы чувствовать уверенность в себе, необходимо находиться в хорошей
        физической форме. Он понимает, что спорт помогает поддерживать здоровье
        и сохранять физическую форму.
      </UiText>

      <UiText>
        Нравятся красивые вещи, которые между собой гармонируют. Он всегда
        замечает красоту вокруг. Бывает, что увлекается коллекционированием
        различных вещей и изучением видов искусства. Однако не всегда заметно
        присутствие предметов из коллекции или предметов искусства в его доме.
      </UiText>

      <UiText>
        Одевается не броско, чаще всего выбирая сероватые тона. Стиль одежды у
        представителей этого типа может быть разным.
      </UiText>

      <UiText preset="small" color="accent">
        Мужчины предпочитают повседневный стиль одежды, несмотря на занимаемую
        должность. Борода — неотъемлемый компонент их имиджа. Юноши иногда носят
        длинные волосы, собранные в косе.
      </UiText>

      <UiText preset="small" color="accent">
        Женщины мало используют декоративную косметику, мало внимания уделяют
        прическе, которая обычно ничем не выделяется.
      </UiText>

      <UiText>
        Стиль одежды — от продуманного и изысканного, согласованного с
        последними тенденциями моды, до неряшливого и разрозненного.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Некоторые из них испытывают сложности в устройстве своего быта, поэтому
        к нему не предъявляют высоких требований.
      </UiText>

      <UiText>
        Он выбирает удобную мебель, слушает тихую музыку и предпочитает неяркое
        освещение. Ему нужен душевный покой, уютная и спокойная атмосфера.
      </UiText>

      <UiText>
        Не увлекается дружбой с посторонними. В своем доме принимает только
        близких друзей.
      </UiText>

      <UiText>
        Ходит в гости только к тем людям, которые особенно хорошо к нему
        относятся, где он может непринужденно отдохнуть, предаваясь приятным
        воспоминаниям, интересным беседами.
      </UiText>

      <UiText>
        Также ему очень важно зарядиться позитивной эмоциональной энергией,
        которая избавит его от скуки и грусти. Это дает на некоторое время силу
        и энергию.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Семейный круг — неотъемлемая часть его самого, но он не умеет выразить
        свою привязанность словами.
      </UiText>

      <UiText>
        Это не означает, что он их не любит! У него строгие и четкие очертания
        своей территории. Не умеет жестко защищать свои границы, и поэтому когда
        кто-либо их переступает, он чувствует нарушение его прав.
      </UiText>

      <UiText>
        В обществе ведет себя спокойно, вежливо, оставляя впечатление
        утонченного, образованного и приятного собеседника.
      </UiText>

      <UiText preset="large" color="role">
        Плохо разбирается в своих чувствах, они ему кажутся непонятными или
        противоречивыми, о них не разговаривает. Не стремится познать себя,
        поскольку уверен, что все о себе уже знает.
      </UiText>

      <UiText>
        Возбуждение и обиду не показывает, но может стать угрюмым и
        малоразговорчивым. Если его обидели, отвечает с «черным юмором».
      </UiText>

      <UiText>
        Стремление к власти для Критика не является самоцелью, хотя его сущность
        требует быть рядом с лидером.
      </UiText>

      <UiText>
        Осуществляя свои личные интересы, он часто приближается к вершине в
        обществе и достигает своей цели. Но случается, что его успех вдруг
        начинает затормаживаться.
      </UiText>

      <UiText>
        Это происходит потому, что Критик не умеет экономить отведенное ему
        время, так как долго принимает решения, и часто делает это в последний
        момент.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Достигая определенного уровня или занимая высокую должность, с трудом
        потом покидает своё место.
      </UiText>

      <UiText>
        Слабо мобилизуется. Он не любит резких перемен, это приводит его к
        неопределенности.
      </UiText>

      <UiText>
        Не приемлет репрессивный стиль правления. Этим часто пользуются другие
        люди.
      </UiText>

      <UiText>
        Не предлагает помощи другим по своей инициативе. Если попросишь его о
        помощи, поможет по мере своих возможностей, геройствовать не станет.
      </UiText>

      <UiText preset="large" color="role">
        Ему необходима поддержка человека, наделенного силой воли и позитивными
        эмоциями.
      </UiText>

      <UiText>
        Он уважает сильных целеустремленных и умных людей, которые не боятся
        сложностей и риска. Если у Критика появляется такой партнер, он с
        удовольствием становится его вдохновителем.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Иногда уклоняется от споров и объяснений, тем самым неосознанно
        провоцируя выброс на себя отрицательных эмоций.
      </UiText>

      <UiText>
        Его раздражают и угнетают истерики и слезы. Он тогда теряется, не знает,
        что делать. Сам лишнего не говорит.
      </UiText>

      <UiText>
        Не предлагает помощи другим по своей инициативе. Если попросишь его о
        помощи, поможет по мере своих возможностей, геройствовать не станет.
      </UiText>

      <UiText preset="large" color="role">
        Иногда он становится безразличным, избегает людей, погружается в
        полнейшее бездействие и пессимизм.
      </UiText>

      <UiText>
        В такие моменты не нуждается в сочувствии от других. Считает, что сам
        способен выбраться из этого положения.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
