<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Велта Микелсоне"
          subtitle="10 минут"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Вера Стратиевская"
          subtitle="30 минут"
          target-content-id="tab-2"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText preset="body" color="accent">
            Описания не должны обязательно совпадать со всеми чертами характера
            личности.
          </UiText>

          <UiText preset="small" color="accent">
            Идея как раз описать наблюдаемые у среднего представителя типа
            особенности поведения и обработки информации психикой.
          </UiText>

          <UiText preset="small" color="accent">
            Автор описания — Велта Микелсоне
          </UiText>
        </section>

        <section>
          <UiText preset="subtitle" color="role">
            Главный скептик и философ всего социона. Внимательный наблюдатель
            жизни.
          </UiText>

          <br />

          <UiText>
            Часто бывает серьезным, недовольным или грустным. Терпелив,
            независим, самостоятельный. Прекрасно чувствует течение времени.
          </UiText>

          <UiText preset="large" color="role">
            Видит противоречия в происходящей действительности и предвидит ход
            событий.
          </UiText>

          <UiText>
            Ему понятно, какие перемены произойдут в будущем, способен заметить
            ухудшение ситуации. Он всегда имеет своё мнение о развивающихся
            событиях и целесообразности действий.
          </UiText>

          <UiText>
            Не торопится, так как боится ошибиться, за что окружающие часто
            считают его пассивным. Не любит резких перемен, потому что каждая
            перемена требует вложения сил.
          </UiText>

          <UiText>
            Как интроверту, ему свойственна замкнутость, поэтому свои взгляды и
            прогнозы он высказывает лишь отдельным людям.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Умеет подробно анализировать сложные обстоятельства и хорошо видит
            сущность проблемы.
          </UiText>

          <UiText>
            Человек, который излишне не трудится. Под влиянием меланхолического
            темперамента все его действия совершаются экономно, продуманно,
            медленно. Поэтому со стороны кажется, что он специально бережет
            себя, но это неверно.
          </UiText>

          <UiText>
            Критик много читает и осведомлен во многих вопросах. Ему доступна
            широкая информация, которая позволяет сравнивать и оценивать каждую
            новую идею.
          </UiText>

          <UiText>
            Возможно, поэтому новинки он воспринимает осторожно и без лишнего
            восторга.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Глядя со стороны, часто возникает ощущение, будто он все уже знает.
          </UiText>

          <UiText>
            Подобное он испытывает при встрече с незнакомым человеком, когда ему
            кажется, что тот уже где-то встречался на его пути.
          </UiText>

          <UiText>
            Осознает ценность денег, знает о преимуществах, которые они дают.
            Если в его распоряжении недостаток денежных средств, внутри
            переживает, но другие это не замечают.
          </UiText>

          <UiText>
            Он обычно не одалживает деньги и вещи и не становится должником.
            Иногда ему удаëтся найти самые выгодные способы вложения денег. Свой
            вложенный труд соизмеряет в деньгах.
          </UiText>

          <UiText preset="large" color="role">
            Думает и рассуждает творчески.
          </UiText>

          <UiText>
            Его действия согласованы с законами и правилами, но он также
            опирается на свой опыт и здравый смысл. Склонен усовершенствовать
            процесс работы. Перед заключением сделки тщательно обдумывает её
            условия и возможные последствия, потому что не любит рисковать.
          </UiText>

          <UiText>
            Всегда выбирает самое надежное решение. Не станет торопиться с
            подписанием документа, пока полностью не будет знать о последствиях.
            Иногда откладывает дела на неопределенное время.
          </UiText>

          <UiText preset="small" color="accent">
            Он человек, который точно и кропотливо оформляет всю деловую
            документацию, выявить какие-либо ошибки со стороны фактически
            невозможно. Он учитывает влияние всех законов и правил. Этим он
            создает впечатления о себе как о надежном деловом партнере.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Цель достигает постепенно, самыми простыми способами, учитывая
            выгоду.
          </UiText>

          <UiText>
            Вмешательство со стороны – поторапливания, принуждения,
            установленные временные рамки – мешают ему работать. Но на него
            можно положится, он все равно выполнит работу в срок. Не любит,
            когда его отвлекают на рабочем месте, выясняют отношения или ведут
            тайные интриги.
          </UiText>

          <UiText preset="large" color="role">
            Если работа не приносит ожидаемого результата, может потерять
            вдохновение.
          </UiText>

          <UiText>
            В сложных обстоятельствах сохраняет хладнокровие, не поддается
            эмоциональному влиянию. Постоянно совершенствует своё мастерство.
            Больше доверяет себе, неохотно принимает помощь со стороны.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Любит природу и путешествия. Перед тем, как отправиться в поездку
            или поход, запасается необходимыми вещами.
          </UiText>

          <UiText>
            Чтобы чувствовать уверенность в себе, необходимо находиться в
            хорошей физической форме. Он понимает, что спорт помогает
            поддерживать здоровье и сохранять физическую форму.
          </UiText>

          <UiText>
            Нравятся красивые вещи, которые между собой гармонируют. Он всегда
            замечает красоту вокруг. Бывает, что увлекается коллекционированием
            различных вещей и изучением видов искусства. Однако не всегда
            заметно присутствие предметов из коллекции или предметов искусства в
            его доме.
          </UiText>

          <UiText>
            Одевается не броско, чаще всего выбирая сероватые тона. Стиль одежды
            у представителей этого типа может быть разным.
          </UiText>

          <UiText preset="small" color="accent">
            Мужчины предпочитают повседневный стиль одежды, несмотря на
            занимаемую должность. Борода — неотъемлемый компонент их имиджа.
            Юноши иногда носят длинные волосы, собранные в косе.
          </UiText>

          <UiText preset="small" color="accent">
            Женщины мало используют декоративную косметику, мало внимания
            уделяют прическе, которая обычно ничем не выделяется.
          </UiText>

          <UiText>
            Стиль одежды — от продуманного и изысканного, согласованного с
            последними тенденциями моды, до неряшливого и разрозненного.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Некоторые из них испытывают сложности в устройстве своего быта,
            поэтому к нему не предъявляют высоких требований.
          </UiText>

          <UiText>
            Он выбирает удобную мебель, слушает тихую музыку и предпочитает
            неяркое освещение. Ему нужен душевный покой, уютная и спокойная
            атмосфера.
          </UiText>

          <UiText>
            Не увлекается дружбой с посторонними. В своем доме принимает только
            близких друзей.
          </UiText>

          <UiText>
            Ходит в гости только к тем людям, которые особенно хорошо к нему
            относятся, где он может непринужденно отдохнуть, предаваясь приятным
            воспоминаниям, интересным беседами.
          </UiText>

          <UiText>
            Также ему очень важно зарядиться позитивной эмоциональной энергией,
            которая избавит его от скуки и грусти. Это дает на некоторое время
            силу и энергию.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Семейный круг — неотъемлемая часть его самого, но он не умеет
            выразить свою привязанность словами.
          </UiText>

          <UiText>
            Это не означает, что он их не любит! У него строгие и четкие
            очертания своей территории. Не умеет жестко защищать свои границы, и
            поэтому когда кто-либо их переступает, он чувствует нарушение его
            прав.
          </UiText>

          <UiText>
            В обществе ведет себя спокойно, вежливо, оставляя впечатление
            утонченного, образованного и приятного собеседника.
          </UiText>

          <UiText preset="large" color="role">
            Плохо разбирается в своих чувствах, они ему кажутся непонятными или
            противоречивыми, о них не разговаривает. Не стремится познать себя,
            поскольку уверен, что все о себе уже знает.
          </UiText>

          <UiText>
            Возбуждение и обиду не показывает, но может стать угрюмым и
            малоразговорчивым. Если его обидели, отвечает с «черным юмором».
          </UiText>

          <UiText>
            Стремление к власти для Критика не является самоцелью, хотя его
            сущность требует быть рядом с лидером.
          </UiText>

          <UiText>
            Осуществляя свои личные интересы, он часто приближается к вершине в
            обществе и достигает своей цели. Но случается, что его успех вдруг
            начинает затормаживаться.
          </UiText>

          <UiText>
            Это происходит потому, что Критик не умеет экономить отведенное ему
            время, так как долго принимает решения, и часто делает это в
            последний момент.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Достигая определенного уровня или занимая высокую должность, с
            трудом потом покидает своё место.
          </UiText>

          <UiText>
            Слабо мобилизуется. Он не любит резких перемен, это приводит его к
            неопределенности.
          </UiText>

          <UiText>
            Не приемлет репрессивный стиль правления. Этим часто пользуются
            другие люди.
          </UiText>

          <UiText>
            Не предлагает помощи другим по своей инициативе. Если попросишь его
            о помощи, поможет по мере своих возможностей, геройствовать не
            станет.
          </UiText>

          <UiText preset="large" color="role">
            Ему необходима поддержка человека, наделенного силой воли и
            позитивными эмоциями.
          </UiText>

          <UiText>
            Он уважает сильных целеустремленных и умных людей, которые не боятся
            сложностей и риска. Если у Критика появляется такой партнер, он с
            удовольствием становится его вдохновителем.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Иногда уклоняется от споров и объяснений, тем самым неосознанно
            провоцируя выброс на себя отрицательных эмоций.
          </UiText>

          <UiText>
            Его раздражают и угнетают истерики и слезы. Он тогда теряется, не
            знает, что делать. Сам лишнего не говорит.
          </UiText>

          <UiText>
            Не предлагает помощи другим по своей инициативе. Если попросишь его
            о помощи, поможет по мере своих возможностей, геройствовать не
            станет.
          </UiText>

          <UiText preset="large" color="role">
            Иногда он становится безразличным, избегает людей, погружается в
            полнейшее бездействие и пессимизм.
          </UiText>

          <UiText>
            В такие моменты не нуждается в сочувствии от других. Считает, что
            сам способен выбраться из этого положения.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="small" color="accent">1 — Базовая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_time" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чутьё</UiText>
              <UiText preset="body">Интуиции времени</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Критик живет по принципу «поспешай медленно» и очень не любит, когда
            ему навязывают другие темпы.
          </UiText>

          <UiText>
            Можно только позавидовать тому, что он никогда никуда не спешит и
            никогда никуда не опаздывает. У него даже намеренно опоздать не
            получается.
          </UiText>

          <UiText color="role">
            Транспортные неурядицы и «пробки» на дорогах, похоже, никак не
            усложняют его жизнь: несмотря ни на что, он всегда прибывает
            вовремя.
          </UiText>

          <UiText preset="large" color="role">
            В его жизни никогда не случается ничего непредвиденного, потому что
            он все умеет предвидеть.
          </UiText>

          <UiText>
            Совпадение собственных прогнозов довольно рано перестает его и
            удивлять и радовать. Он как будто рождается со знанием всего того,
            что произойдет с ним в будущем, и всего того, что уже происходило в
            далеком прошлом.
          </UiText>

          <UiText>
            Это, казалось бы, огромное преимущество перед остальными
            оборачивается для него существенной проблемой — иногда ему
            становится скучно жить.
          </UiText>

          <UiText>
            Настолько хорошо он все предвидит, что для него как будто не
            существует в жизни сюрпризов.
          </UiText>

          <UiText>
            Критик не торопится одаривать всех и каждого своими предсказаниями,
            он не идет работать «гадалкой». Для него умение видеть «сквозь
            время» слишком естественно для того, чтобы делать из этого
            «аттракцион». Критик предпочитает роль учителя, анализирующего
            совершаемые ошибки и предостерегающего от их повторения.
          </UiText>

          <UiText>
            Как это ни печально, но Критик со свойственным ему пессимизмом часто
            выполняет функцию того самого сказочного камня, который предрекает:
            «Пойдешь направо — коня потеряешь, пойдешь налево — голову сложишь…»
            И вроде бы не остается никаких других возможностей, кроме как
            повернуть назад.
          </UiText>

          <UiText color="role">
            Критик не тот, кто будет воспевать «безумство храбрых». Наоборот, он
            сочтет своим долгом своевременно предостеречь от безрассудных
            поступков, предупредить о всех возможных опасностях, указать на
            самый неблагоприятный ход событий.
          </UiText>

          <UiText>
            Критик обладает способностью в последовательности любых явлений
            своевременно увидеть самое слабое звено. Он также не сочтет за труд
            проанализировать, какие скрытые опасности оно в себе таит и какие
            грядущие неприятности за собой повлечет.
          </UiText>

          <UiText color="role">
            Критик, как никто другой, видит изначальную обреченность многих
            предприятий или ошибочность многих несвоевременных начинаний. Но при
            всем своем пессимизме Критик, в отличие от некоторых других
            интуитов, не предрекает близкого конца света.
          </UiText>

          <UiText>
            Он вообще против того, чтобы нагнетать общественную истерию
            посредством мрачных прогнозов.
          </UiText>

          <UiText>
            Критик любит философски смотреть на происходящее, поэтому «утешает»
            изречениями типа: «все проходит», «все мы там будем», «завтра еще не
            конец света», «это пройдет»…
          </UiText>

          <UiText>
            Критик считает, что все приходит вовремя к тому, кто умеет ждать.
            Критик умеет ждать. Он умеет заполнить время ожидания так, что оно
            растянется на всю жизнь, не причинив его планам никакого ущерба.
          </UiText>

          <UiText>
            Критик умеет быть хозяином собственного времени — это позволяет ему
            чувствовать себя независимым.
          </UiText>

          <UiText>
            Критик умеет не подчиняться обстоятельствам: он предпочитает их
            использовать. Не имея привычки обольщаться или заблуждаться на свой
            счет, он способен реально оценить собственные возможности в
            конкретных условиях, на определенном этапе.
          </UiText>

          <UiText preset="large" color="role">
            Критик — единственный, кто видит самые скрытые и самые незаметные
            тенденции исторического развития общества.
          </UiText>

          <UiText>
            Он, как никто, чувствует взаимосвязь событий во времени, понимает,
            как происходящее сегодня влияет на дальнейший ход истории.
          </UiText>

          <UiText>
            О каком бы событии ни размышлял Критик, он видит его одновременно в
            настоящем, прошлом и будущем. И это для него не более, чем
            естественное восприятие всех жизненных явлений.
          </UiText>

          <UiText preset="large" color="role">
            Следуя своему постоянному стремлению избегать возможных ошибок,
            Критик часто берет на себя роль стороннего наблюдателя, чем дает
            повод к обвинению в пассивном отношении к жизни.
          </UiText>

          <UiText>
            Недостатком предостережений Критика является отсутствие в них
            позитивной альтернативы, вследствие чего они часто «замораживают»
            чью-то деловую активность.
          </UiText>

          <UiText>
            При всем стремлении Критика предотвратить количество совершаемых в
            мире ошибок их не становится меньше. Хотя бы потому, что отказ от
            намеченных планов во избежание опасностей, сопутствующих их
            осуществлению, уже сам по себе может быть ошибкой.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">2 — Творческая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_business" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Практика</UiText>
              <UiText preset="body">Деловая логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Критик лучше всего работает там, где менее всего на него давят,
            влияют, отвлекают или мешают, где наименьшая вероятность ненужной
            суеты, суматохи, штурмовщины, этических «разборок» или интриг в
            коллективе.
          </UiText>

          <UiText>
            Внутренне глубоко независимый, Критик в любом деле стремится быть
            свободным от обстоятельств. Какой бы ни был напряженный режим на
            производстве, на него это не повлияет: он методично и спокойно
            отрабатывает свой рабочий день, удобно и размеренно распределяет
            свои силы, чередуя разные виды работ и разные виды нагрузок.
          </UiText>

          <UiText>
            Критик педантично следует заданным указаниям. Если ему предписана
            определенная последовательность работы, он ее неукоснительно
            выполняет. Но там, где от него требуется только конечный результат,
            а промежуточная последовательность не важна, он предпочитает
            следовать собственному плану работы и, по возможности, собственным
            рациональным методикам.
          </UiText>

          <UiText preset="large" color="role">
            Очень усидчив, с удовольствием занимается трудоемкой кропотливой
            работой, тщательно прорабатывает детали.
          </UiText>

          <UiText>
            Прежде, чем сдать работу, внимательно ее проверяет, стараясь не
            допустить ошибок. Для Критика очень важно, чтобы анализ ошибок в его
            работе был своевременным и, главное, конструктивным.
          </UiText>

          <UiText>
            Постоянно заботится об уровне своей квалификации. Всегда благодарен
            за ценные указания и советы по работе.
          </UiText>

          <UiText>
            Очень переживает, когда его работа не получает высокой оценки, — это
            наводит его на мысли о собственной «профнепригодности». Иногда
            приходит к выводу, что принесет больше пользы, работая
            консультантом, инструктором, методистом, контролером, чем простым
            исполнителем.
          </UiText>

          <UiText>
            Очень любит, когда к нему на инструктаж присылают новых работников.
            Критик обожает инструктировать — это его «звездный час», которого он
            всегда с нетерпением ждет.
          </UiText>

          <UiText preset="large" color="role">
            Не рекомендуется учить Критика, в каком порядке ему следует
            осуществлять свои планы, когда и как ему заниматься своими делами.
          </UiText>

          <UiText color="role">
            И уж тем более не стоит его поучать, что и как надо делать. Он
            предпочитает не иметь дело с теми, кто знает «как надо»: он из тех,
            кто для себя лучше это знает.
          </UiText>

          <UiText>
            Главное, он знает, стоит ли выполнять это дело вообще. В первую
            очередь, по его мнению, следует основательно продумать, что это за
            дело, кому и для чего оно нужно, и чем именно он в этом деле может
            быть полезен.
          </UiText>

          <UiText color="role">
            Если ему дать какую-то работу, но не назначить срок ее выполнения,
            Критик вообще не сочтет это заданной работой: он либо забудет о ней,
            либо проигнорирует.
          </UiText>

          <UiText>
            Ему необходимо аргументированно объяснить, для чего она нужна и как
            скоро требуется ее исполнение. Только после этого он сможет
            воспринимать задание всерьез. Такой подход к делу объясняется
            стремлением не делать ничего лишнего, не делать того, что никому не
            нужно.
          </UiText>

          <UiText preset="large" color="role">
            Для Критика, как для любого представителя третьей квадры очень важно
            сознание собственной востребованности: он не сделает того, что
            никому не нужно, он хочет быть свободным для дел, которые кому-то
            действительно нужны.
          </UiText>

          <UiText>
            Критик подрядится на бесполезную работу только в том случае, если он
            до этого был безработным и ему сейчас не на что жить. Но
            впоследствии он постарается найти себе более удачное применение.
          </UiText>

          <UiText preset="large" color="role">
            Критик из тех, кто «семь раз отмерит» и еще сто раз подумает, прежде
            чем «отрезать».
          </UiText>

          <UiText>
            Критик обязательно подумает и о последствиях своего соучастия в
            чем-либо Критик старается никогда и ничем не рисковать.
          </UiText>

          <UiText>
            Он не из тех, кто примыкает к оппозиции или к диссидентскому
            движению, хотя и может поддерживать личные отношения с отдельными
            его представителями. Да и зачем ему, если он умеет дождаться нужной
            ему политической ситуации и использовать ее для реализации своих
            планов.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">3 — Ролевая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_comfort" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Комфорт</UiText>
              <UiText preset="body">Сенсорика ощущений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Критик старается сделать все необходимое для устройства собственного
            быта.
          </UiText>

          <UiText>
            Дом Критика — не только его крепость: это и его духовный и
            интеллектуальный «оазис», где непременно должны находиться его
            любимые и дорогие ему вещи — любимые книги, любимая музыка, любимые
            портреты и фотографии на стенах, любимые «памятные подарки» на
            полках.
          </UiText>

          <UiText>
            Критик может уютно устроиться и в одной маленькой комнатке —
            главное, чтобы нашлось место для его «любимого» кресла и для его
            книг.
          </UiText>

          <UiText>
            Критик любит удобную мебель, не важно, какого стиля, любит
            приглушенное, теплое освещение. Любит растопить камин зимним
            вечером, любит шум дождя за окном.
          </UiText>

          <UiText>
            Критик старается запасаться «про черный день» всем необходимым.
          </UiText>

          <UiText color="role">
            Недуализированный Критик по возможности закупает всего «по два, по
            четыре, по шесть, по восемь.» Достоверный факт: один из
            представителей этого типа оборудовал у себя дома уютный и удобный
            подвальчик, куда нанес все нужное «на случай войны».
          </UiText>

          <UiText>
            Критик очень ценит собственный комфорт и душевный покой. Старается
            создавать вокруг себя уютную и удобную микросреду. С удовольствием
            окружает себя красивыми вещами. Любит собирать небольшие коллекции
            произведений искусства, делать себе «памятные подарки».
          </UiText>

          <UiText preset="large" color="role">
            Прекрасно чувствует себя в уютной и доброжелательной обстановке.
            Любит «наносить визиты» в хлебосольные и гостеприимные дома, но
            только будучи уверенным, что ему там действительно рады.
          </UiText>

          <UiText>
            Охотно принимает приглашения на вечеринки в приятную и интересную
            компанию. Заранее беспокоится о том, как провести наступающие
            праздники.
          </UiText>

          <UiText color="role">
            Любит принимать у себя ограниченный круг близких друзей, угощая не
            только вкусной едой, но и приятной интеллектуальной беседой об
            анализе последних событий в области культуры, искусства и политики.
            Вечер, проведенный без интеллектуально насыщенной беседы, Критик
            считает неудавшимся.
          </UiText>

          <UiText>
            Поэтому успех таких вечеров в немалой степени зависит от умения его
            дуала Политика вовремя перестать лидировать и уйти на второй план,
            не мешая Критику в его интеллектуальной инициативе.
          </UiText>

          <UiText>
            Критик всегда открыт для восприятия новых ощущений. Он с детским
            любопытством попробует новое кушанье. Со вниманием выслушает новую
            для себя музыку.
          </UiText>

          <UiText preset="large" color="role">
            Вкусу критика не чуждо смешение музыкальных стилей: он может на
            одной кассете записать и «тяжелый рок», и музыку «барокко».
          </UiText>

          <UiText>
            Впрочем, некоторые из представителей этого типа стараются не
            загромождать свой слух музыкой низкого качества, но это уже
            относится к стремлению Критика всемерно развивать свой
            художественный вкус и создавать себе условия повышенного комфорта:
            тогда он окружает себя вещами лучшего качества, одевается дорого,
            красиво и аккуратно, старается быть в курсе всех художественных
            новинок — премьеры, модные выставки, концерты «знаменитостей».
          </UiText>

          <UiText>
            По той же причине Критик старается бережно относиться к собственному
            здоровью. По мере надобности следит за своим весом, соблюдает
            профилактические диеты, подвергает себя необременительному, по
            возможности, голоданию, питается здоровой растительной пищей.
          </UiText>

          <UiText preset="large" color="role">
            Особое внимание уделяет отдыху и сну. У некоторых представителей
            этого типа складывается свой, индивидуальный режим работы и отдыха.
          </UiText>

          <UiText>
            Иногда Критик не видит для себя особого проступка в том, чтобы
            заснуть там, где ему это вдруг захотелось. Иной раз можно увидеть
            Критика спящим на рабочем месте или даже во время монотонной работы,
            продолжающего ее автоматически делать руками, спящим во время урока,
            во время прослушивания музыкальной программы.
          </UiText>

          <UiText>
            Будучи посланным «на картошку», Критик может уютно устроиться на
            грядке и спать.
          </UiText>

          <UiText>
            Тем не менее сенсорика ощущений — это та область, которую Критик
            старается в себе развивать до общепринятого уровня.
          </UiText>

          <UiText>
            Его успехи на этом поприще — залог его успешной дуализации: старание
            Критика эстетично выглядеть и оформить свой быт надлежащим образом
            вознаграждается вниманием и высокой оценкой его дуала Политика, у
            которого с чувством собственного достоинства и природным
            эстетическим вкусом все обстоит хорошо, и он не потерпит рядом с
            собой «невзрачного замухрышку».
          </UiText>

          <UiText>
            Известны случаи неудавшейся дуализации у Критиков с недоразвитой до
            норматива сенсорикой ощущений.
          </UiText>

          <UiText>
            Поэтому при всем нежелании Критика сделать над собой лишнее волевое
            усилие, он вынужден тщательно заниматься собственной внешностью,
            добротно и со вкусом благоустраивать свой быт и почаще «выходить в
            свет», где у него гораздо больше шансов встретить своего дуала, чем
            сидя дома в собственном уютном кресле.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">4 — Болевая функция.</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_emotions" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Желание</UiText>
              <UiText preset="body">Этика эмоций</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Проявляется в стремлении Критика оградить себя от сильного
            эмоционального воздействия, в нежелании втягиваться в напряженный
            эмоциональный режим.
          </UiText>

          <UiText>
            Критик считает необходимым подчинять свои эмоции рассудку — это его
            незыблемое правило, которого он неукоснительно придерживается сам, и
            постоянно внушает своему окружению.
          </UiText>

          <UiText>
            «Трагинервических явлений, девичьих обмороков, слез…» Критик
            действительно терпеть не может и в своем стремлении избежать их
            любой ценой он часто ведет себя до такой степени неэтично, что сам
            же невольно их и провоцирует.
          </UiText>

          <UiText>
            Стремясь быть предельно сдержанным в проявлении собственных чувств,
            стараясь ничем не обнаружить свое истинное эмоциональное состояние,
            из опасения вовлечься в какую-нибудь этическую интригу, Критик
            неосознанно ведет себя самым интригующим образом, чем постоянно
            навлекает на себя риск самого бурного выяснения отношений.
          </UiText>

          <UiText>
            Напуская на себя демонстративно безучастный вид, он на самом деле
            часто создает ложно многозначительную «маску», которая одновременно
            и интригует и раздражает.
          </UiText>

          <UiText>
            Во всяком случае, у многих из его партнеров возникает желание ее
            сорвать и разглядеть истинное его лицо.
          </UiText>

          <UiText preset="large" color="role">
            Часто бывает так: чем больше «таинственности» он на себя напускает,
            тем «круче» с ним разбираются.
          </UiText>

          <UiText>
            «Напускное безразличие» Критика нередко является для него средством
            «этической разведки» во взаимоотношениях с партнером, проверкой
            заинтересованности партнера в дальнейшем развитии отношений.
            Эмоционально уязвимому, легкоранимому, неуверенному в своей
            привлекательности Критику чрезвычайно важно знать степень
            заинтересованности в нем партнера.
          </UiText>

          <UiText>
            Иногда он использует для этого такой «трюк»: заговорив с партнером о
            чем-нибудь первостепенно значимом, он вдруг делает паузу и как будто
            отвлекается на что-то незначительное, незаметно наблюдая за
            поведением партнера и выжидая, когда и как он проявит интерес к
            затронутой теме.
          </UiText>

          <UiText>
            Во взаимоотношениях с Политиком это еще и способ дисциплинировать
            постоянно рассеивающееся внимание своего дуала, попытка
            сосредоточить его внимание на себе, а также, что очень важно в
            процессе дуализации — попытка соизмерить значимость собственных
            ценностей с ценностями своего партнера.
          </UiText>

          <UiText preset="large" color="role">
            Само собой разумеется, Критик даже для себя не может объяснить
            истинную причину своей «невозмутимости», а загадочности в себе он
            вообще никакой не видит и никогда ее намеренно не напускает — он
            ведь не этик, а логик.
          </UiText>

          <UiText>
            Чаще всего он ведет себя таким образом только из желания оградить
            себя от психологического дискомфорта, который он видит в
            эмоционально перенасыщенном психологическом режиме.
          </UiText>

          <UiText>
            Именно поэтому, как он считает, единственная возможность для него
            подстраховаться — это создать видимость невозмутимости.
          </UiText>

          <UiText>
            Но поскольку это делается главным образом в этических ситуациях, его
            партнеры часто чувствуют себя оскорбленными его безразличием, тем
            более напускным. Вот и получается, что предусмотрительный Критик
            первый становится жертвой собственной подстраховки.
          </UiText>

          <UiText>
            Еще хуже получается, когда Критик начинает «выравнивать»
            эмоциональное состояние партнера, ободряя его взглядом или словом.
          </UiText>

          <UiText color="accent">
            Само по себе это возможно и неплохо, но в сложной этической ситуации
            такое поведение обычно воспринимается не только как «моральная
            поддержка», но и как обнадеживание, что приводит к очередному
            выяснению отношений со всеми вытекающими эмоциональными
            последствиями.
          </UiText>

          <UiText>
            Проявление собственных эмоций для него также не обходится без
            осложнений. Из-за вечного страха быть неправильно понятым при
            естественном их проявлении или при намеренном их сокрытии Критик
            постоянно пребывает в растерянности, когда дело касается выражения
            его собственных чувств.
          </UiText>

          <UiText>
            Тут он сталкивается со многими проблемами одновременно: иногда он
            просто не может в себе разобраться — его чувства кажутся ему либо
            недостаточно определенными, либо слишком противоречивыми.
          </UiText>

          <UiText>
            Кроме того, он не всегда может найти подходящую форму для их
            выражения, и не каждому позволит помочь себе выразить свои чувства.
            Часто он боится сказать что-нибудь лишнее, чтобы не обнадеживать
            человека и не заставить потом страдать. Часто собственные
            эмоциональные возможности кажутся ему недостаточно изученными.
          </UiText>

          <UiText>
            Он может проявлять свои чувства в такой «мудреной» форме, как забота
            о судьбе своих отношений с партнером, предостерегая его от связи с
            собой, «недостойным».
          </UiText>

          <UiText color="role">
            Он может наговорить о себе много несправедливого и неприятного,
            предоставляя судить, «какие розы нам заготовил Гименей». Причем,
            поскольку все это говорится уверенным и рассудительным тоном, мало
            кто заподозрит за всем этим нагромождением противоречивых доводов
            элементарную неуверенность в себе.
          </UiText>

          <UiText>
            К сожалению, избавлять Критика от неуверенности в себе — это долгий,
            мучительно тяжелый и зачастую неблагодарный труд. Один только
            Политика — его дуал, может справиться с этим заданием успешно.
          </UiText>

          <UiText>
            Не утруждая себя размышлениями о противоречивости бальзаковской
            этики, он естественно вовлекает его в свою наивную, бесхитростную и
            искренне-доброжелательную эмоциональную игру. Практика показывает,
            что никакой другой этик, даже ближайший к нему по квадре —
            Хранитель, не в состоянии успешно справиться с бальзаковскими
            «этическими головоломками».
          </UiText>

          <UiText preset="large" color="role">
            Критика всегда пугают и раздражают неадекватно выраженные эмоции,
            независимо от того, положительные они или отрицательные.
          </UiText>

          <UiText color="role">
            Достаточно одного неумеренного восклицания, чтобы он почувствовал
            себя плохо. Поэтому Критик болезненно воспринимает любой разговор на
            повышенных тонах. Независимо от того, деловой это разговор или
            выяснение отношений, он плохо себя чувствует в сплошном потоке
            насыщенных эмоций.
          </UiText>

          <UiText>
            Критик не терпит раздраженного тона, но он обречен всю жизнь с этим
            сталкиваться: в детстве он страдает от раздражения родителей и
            воспитателей, в зрелые годы он раздражает начальство и сослуживцев.
          </UiText>

          <UiText>
            Раздражать опять же может чем угодно: старомодными манерами,
            медлительностью или неловкостью движений, монотонностью голоса,
            кротким или испуганным видом — да мало ли чем, если дело не столько
            в нем самом, сколько в неудобных отношениях, в которые он постоянно
            попадает, как, впрочем, и каждый из нас.
          </UiText>

          <UiText>
            Что уж тогда говорить об истериках со слезами и упреками, о
            скандалах с битьем посуды и «сердечными припадками» с валерьянкой и
            «неотложкой»…
          </UiText>

          <UiText>
            Для Критика это просто кара Господня — только непонятно, за какие
            грехи. Попадая в водоворот истерик, да еще сопровождаемых силовым
            давлением, Критик испытывает панический ужас — состояние, из
            которого он не знает, как вырваться. Поэтому в такой момент способен
            совершить самый дикий, самый неожиданный поступок.
          </UiText>

          <UiText>
            В любой этически неловкой ситуации Критик чувствует себя очень
            неспокойно. Иногда в поисках выхода он усугубляет создавшееся
            напряжение, уже не рассуждая, прав он или виноват, стремясь как
            можно скорее «исчерпать» ситуацию, чем бы ему это ни грозило.
          </UiText>

          <UiText>
            В такие минуты он способен на поступок, о котором возможно потом
            будет сожалеть, но в данную минуту это для него не имеет значения:
            его рассудок полностью подчинен водовороту эмоций, перед которым он
            беспомощен, и потому себе не принадлежит.
          </UiText>

          <UiText preset="large" color="role">
            Ослепление эмоциями для Критика равносильно безумию. То же самое он
            думает и о других. Поэтому боится и ненавидит проявление
            социально-политической истерии в любой ее форме.
          </UiText>

          <UiText color="role">
            Как только появляется очередной политический лидер-маньяк или
            новоявленный пророк-психопат, Критик «уходит» в свой благоустроенный
            подвальчик и затворяется там до лучших времен или спасается
            где-нибудь «за океаном».
          </UiText>

          <UiText>
            После всех пережитых им в реальной жизни потрясений легкая
            эмоциональная разрядка в виде «страшной сказки на ночь»,
            какого-нибудь фильма ужасов, для Критика не более, чем детская
            забава.
          </UiText>

          <UiText preset="large" color="role">
            Юмор Критика — своего рода способ интеллектуально-эмоционального
            «возмездия». Иногда выражается как реакция на ощущаемый им
            психологический дискомфорт.
          </UiText>

          <UiText>
            Иногда юмор Критика выражается в форме очень удачных эпиграмм.
            Иногда это просто тонкая ирония, окрашенная в мрачные тона. «Черный
            юмор» Критика отличается своеобразной некроориентацией. Может
            Критики в отличие от Наставников и не философствуют над черепами
            своих друзей, но довольно часто шутят на эту тему. У Критиков к
            вопросу смерти с детства формируется философски-ироничное отношение.
          </UiText>

          <UiText color="accent">
            Дети-Критики часто развлекаются рисунками «скелетиков», «жутиками» и
            «страшилками».
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">5 — Внушаемая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_will" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Воля</UiText>
              <UiText preset="body">Волевая сенсорика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Критик уважает сильных, хорошо понимающих свои цели людей, не
            пасующих перед трудностями и уверенно пробивающих себе дорогу —
            именно этими качествами обладает его дуал Политик.
          </UiText>

          <UiText>
            Критик никогда не стремится лидировать, предпочитая оставаться
            фигурой «номер два» — «теневым» лидером при могущественном
            покровителе.
          </UiText>

          <UiText>
            Простой и демократичный по натуре, он не кичится достигнутым высоким
            положением и своими влиятельными связями. Прекрасно зная, что «все
            проходит», Критик не из тех, кто положит жизнь и здоровье ради
            блестящей карьеры. Даже находясь на вершине власти, он в первую
            очередь человек, не скрывающий своих слабостей, вкусов и привычек.
          </UiText>

          <UiText color="role">
            Тем не менее Критик обладает глубоким чувством собственного
            достоинства. Умеет уважать достоинство другого и умеет требовать
            уважения к себе.
          </UiText>

          <UiText color="accent">
            Особенно, когда в прогнозе говорится: «На этой неделе не нужно
            выяснять отношений и волноваться по пустякам, а следует жить
            спокойно, побольше отдыхать и заниматься своим здоровьем».
          </UiText>

          <UiText>
            Хотя именно потребовать Критику трудно. Он из тех, кому трудно
            «собрать волю в кулак». Критик не умеет и не любит подчинять
            кого-либо своей воле. Он также не переносит прямого волевого
            давления на себя.
          </UiText>

          <UiText>
            Волевое воздействие Политика, реализованное этическими
            манипуляциями, не воспринимается им как подавление собственной
            личности. В то время как прямолинейное волевое воздействие —
            «волевая сенсорика» Лидера, Инспектора или Хранителя, равно как и
            демонстративная напористость Энтузиаста — его подавляет.
          </UiText>

          <UiText>
            Для Критика характерно постоянное полурасслабленное состояние.
            Критик предпочитает не делать лишних волевых усилий, старается очень
            экономно расходовать свою физическую энергию.
          </UiText>

          <UiText>
            Ни в какую, даже самую увлекательную работу он не будет вкладывать
            больше сил, чем это диктуется объективной необходимостью. Он не из
            тех, кто будет максимально «выкладываться» на «голом энтузиазме».
            Критик требует уважения к собственному труду и достойной его оплаты.
          </UiText>

          <UiText preset="large" color="role">
            Деньги для Критика имеют немаловажное значение, хотя некоторые
            представители этого типа относятся к их отсутствию с философским
            спокойствием: «Деньги - это всего лишь деньги: они приходят и
            уходят».
          </UiText>

          <UiText>
            Тем не менее Критиком глубоко и серьезно осознается преимущество
            денег, как реального рычага силы и власти. Редко встретишь Критика,
            спокойно воспринимающего их отсутствие при наличии «минуса» в банке.
          </UiText>

          <UiText>
            Наоборот, многие из них видят в деньгах не только поддержку для
            себя, но и гарантированную возможность реализовать давно намеченные
            планы.
          </UiText>

          <UiText>
            Накопление денег для Критика — это еще и способ «консервации»
            собственного вложенного труда, возможность сохранности и разумного
            перераспределения собственных сил. Деньги для Критика — это
            «эквивалент силы», сэкономленный в юности для того, чтобы подкрепить
            грядущую старческую немощь.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">
            6 — Активационная функция
          </UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_people" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чувство</UiText>
              <UiText preset="body">Этика отношений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Проблема этики Критика уже в том, что она не находится в постоянном
            центре его внимания - это пассивная, устойчивая ценность его типа и
            не больше.
          </UiText>

          <UiText>
            Критик заинтересован в получении информации по этому аспекту, его
            воодушевляют искренний интерес и проявленная к нему симпатия.
            Доброжелательное отношение побуждает его на благородные душевные
            порывы, которые выражаются в конкретных дружеских услугах.
          </UiText>

          <UiText>
            Те отношения, которые Критик может подчинять своему рассудку,
            складываются у него сравнительно благополучно: Критик предрасположен
            к тому, чтобы быть добрым и отзывчивым другом, заботливым
            семьянином, искренне любящим своих близких.
          </UiText>

          <UiText>
            Мягкий и уступчивый по натуре, умеющий, при желании, быть тактичным,
            деликатным и выдержанным, умеющий уважать чувство собственного
            достоинства, не терпящий интриги, не способный к намеренно дурным
            поступкам, Критик, казалось бы, застрахован от «этических
            неприятностей».
          </UiText>

          <UiText preset="large" color="role">
            Но при ближайшем рассмотрении выясняется, что и в этом плане у него
            возникает немало проблем.
          </UiText>

          <UiText>
            Простейший пример: Критик, незаметно для себя, имеет обыкновение
            обрывать разговор, как только он перестает быть для него
            содержательным, не заботясь об ощущениях неловкости, которые потом
            будет переживать его собеседник, и о том, какое мнение о его
            воспитанности он составит.
          </UiText>

          <UiText>
            В данном случае им только рассматривается фактор целесообразности
            продолжения «безынформативной» беседы и опасения по поводу «впустую»
            потраченного времени.
          </UiText>

          <UiText>
            Допустим, что этот единичный случай еще не сулит серьезных этических
            осложнений, но, поскольку отношения строятся из последовательной
            цепочки таких «единичных случаев», в каждом из них для Критика
            существует реальная опасность неосознанно проявить свою неэтичность,
            которая в условиях напряженных интертипных отношений может
            восприниматься как осознанная или намеренная.
          </UiText>

          <UiText>
            Проблемы начинаются уже тогда, когда отношения еще только
            формируются: с одной стороны, в силу своей исключительной
            способности предвидеть Критик иногда с самого начала видит примерный
            ход развития событий, а это значит, что он может довольно быстро
            потерять к ним интерес, чем рискует обидеть своего партнера и
            спровоцировать болезненное выяснение отношений.
          </UiText>

          <UiText>
            Другой вариант, когда Критик вопреки собственному рассудку все же
            поддается чувствам: при неблагоприятных интертипных отношениях это
            создает дополнительное эмоциональное напряжение, вследствие которого
            его противоречивые и неэтичные поступки только усугубляют проблему.
          </UiText>

          <UiText>
            Опять же, не отнимешь у Критика его постоянного стремления
            «выравнивать» эмоциональное состояние партнера! Проповедуя принцип
            «Учитесь властвовать собою», он часто ставит себя до смешного в
            нелепое положение, особенно, если его собеседник — этик, за которое
            ему потом приходится расплачиваться собственной личной
            неустроенностью и вынужденным одиночеством.
          </UiText>

          <UiText>
            И это еще не все его проблемы. Подсознательно настроенный на Политик
            — яркую, сильную и богато одаренную личность, Критик постоянно
            ожидает «журавля в небе», предпочитая не размениваться на сереньких
            «синиц».
          </UiText>

          <UiText>
            Иногда, больше полагаясь на собственное предвидение, чем на реальное
            наблюдение, он даже не дает себе труда вовремя разглядеть в
            очередной синице желанного журавля, впоследствии не раз сожалея об
            упущенных возможностях.
          </UiText>

          <UiText>
            Кроме того, Критику часто бывает трудно признать за собой наличие
            каких-то недостатков. Практика показывает, что иногда, сталкиваясь с
            реальным воплощением своего идеала, то есть когда подходят и тип
            партнера, и его внешние и внутренние качества, даже тогда он
            умудряется списать собственные неудачи на какие-то объективные
            качества партнера, которые его лично никак не устраивают.
          </UiText>

          <UiText color="role">
            Безотносительно к его индивидуальным качествам именно устройство
            личной жизни часто вызывает у Критика серьезные затруднения.
          </UiText>

          <UiText preset="large" color="role">
            Иногда — наоборот: демонстративно не поддается общему веселью,
            держится обособленно, напускает на себя неприступно-невозмутимый
            вид, «сидит как поповна на смотринах», характерно для женщин.
          </UiText>

          <UiText>
            Именно здесь все «слабые точки» его психологического типа «работают»
            против него: и пассивное отношение к жизни, и глубокий пессимизм, и
            нежелание сделать лишнее усилие, и страх перед возможными
            переживаниями, и недопонимание основных этических понятий, и
            переоценка собственных возможностей.
          </UiText>

          <UiText>
            Отсутствие хотя бы одного из этих условий существенно облегчило бы
            ему решение проблемы.
          </UiText>

          <UiText>
            Тем не менее собственный негативный опыт не мешает Критикам довольно
            успешно работать в сфере этики отношений. Добрые, терпеливые и
            отзывчивые, они часто становятся любимыми учителями и воспитателями.
          </UiText>

          <UiText color="role">
            Многие из представителей этого типа великолепно практикуют в области
            психологии. И, разумеется, успех на поприще литературы, когда они
            описывают этическую интригу, понимая этику отношений интуитивно и
            опираясь на свои глубинные, подсознательные, этические ценности.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">7 — Функция защиты</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_ideas" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Мысль</UiText>
              <UiText preset="body">Интуиция возможностей</UiText>
            </span>
          </div>
          <UiText>
            Создается впечатление, что Критик сознательно не желает видеть
            положительные тенденции в окружающих его явлениях — и он
            действительно этого не желает. Только не осознанно, а
            подсознательно.
          </UiText>

          <UiText preset="large" color="role">
            Из всех наблюдаемых им возможностей он подсознательно замечает
            только те, в которых он предполагает скрытую опасность. В этом он
            видит свое предназначение.
          </UiText>

          <UiText>
            В понимании Критика, позитивны только те возможности, которые
            наименее негативны. Иными словами: лучше всего то, что менее всего
            плохо. Поэтому наблюдение потенциальных возможностей Критика — это в
            первую очередь учет и анализ всех «минусов».
          </UiText>

          <UiText>
            Узкопессимистический анализ наблюдений объясняется подсознательной
            ориентацией Критика на непомерный оптимизм своего дуала Политика и
            является своеобразной защитой от него. Поэтому бальзаковский
            пессимизм постоянно «набирает» необходимый «запас прочности»: и себя
            «подстраховать», и дуала «охладить».
          </UiText>

          <UiText color="accent">
            Попробуйте убедить Критика, что его опасения напрасны - он
            раздражается, и у него моментально появляется выражение испуга в
            глазах. Ему действительно становится страшно, и в первую очередь за
            себя.
          </UiText>

          <UiText preset="large" color="role">
            Сила интуиции Критика — в его «позитивном» пессимизме, позволяющем
            учитывать все возможные осложнения в осуществлении его планов.
          </UiText>

          <UiText>
            Заставляющем подсознательно рассчитывать время выполнения работы с
            учетом вынужденно сниженных темпов: на «раскачку», на усталость, на
            отвлекающие помехи, на непредвиденные осложнения.
          </UiText>

          <UiText>
            Критик — единственный, кто учитывает такой фактор расхода времени,
            как инертность любого начинания.
          </UiText>

          <UiText>
            В любом бизнесе он старается подстраховать себя необходимой
            материальной базой — «запасом прочности», в расчете на инертность
            «раскачки».
          </UiText>

          <UiText preset="large" color="role">
            Критик никогда не рассчитывает на быстрый успех и быстрые доходы —
            это он считает непростительным авантюризмом.
          </UiText>

          <UiText>
            Старается идти не «напролом» и своего дуала от этого предостерегает,
            а «в обход». Умеет и сам выйти из затруднительного положения и
            других научит, как это сделать.
          </UiText>

          <UiText>
            Его проницательности и дальновидности можно только позавидовать:
            осторожен, предусмотрителен, немногословен. Предпочитает не давать
            далеко идущих советов, всегда старается подсказать выход из
            конкретной затруднительной ситуации.
          </UiText>

          <UiText>
            Не афиширует ничего лишнего — намеренно недемонстративен, не дает
            никаких обещаний «авансом».
          </UiText>

          <UiText color="role">
            Не склонен брать на веру чьи-либо сенсационные идеи, во всем
            старается разобраться сам.
          </UiText>

          <UiText preset="large" color="role">
            Часто сокрушается по поводу собственных упущенных возможностей —
            неизбежное следствие его пассивно наблюдательного отношения к жизни.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">8 — Фоновая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_logic" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Теория</UiText>
              <UiText preset="body">Структурная логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Критик в любой ситуации старается выглядеть объективным. Это свое
            качество он с удовольствием демонстрирует.
          </UiText>

          <UiText>
            Но действуя в интересах «абсолютной объективности», он часто
            попадает в неловкое положение: думая об абсолютной справедливости
            своих поступков, часто упускает из виду их этический аспект —
            «справедливо по отношению к кому?»
          </UiText>

          <UiText>
            В любом споре Критик держит демонстративный нейтралитет, стараясь
            никому не «подыгрывать».
          </UiText>

          <UiText color="role">
            Свое отношение к какому-либо поступку он выражает не как частное,
            личное мнение, а как бы выставляет некую, как ему кажется,
            объективную и правильную оценку. Критик любит себя ставить в
            положение судьи.
          </UiText>

          <UiText>
            Для него характерно не просто высказывать свое мнение, а именно
            «выносить суждение» по каждому вопросу. Даже, если ему предлагается
            только обсудить тему.
          </UiText>

          <UiText preset="large" color="role">
            Рассуждения Критика отличаются точностью, лаконичностью и глубоким
            пониманием самой сути вещей. Легкость и простота его высказываний
            потрясают и восхищают.
          </UiText>

          <UiText>
            Подпасть под глубокомысленное расположение духа Критика — это
            огромное «интеллектуальное наслаждение». Это всегда богатейший
            материал для размышлений. Это изречения, которые хочется впитывать и
            изрекать как свои собственные. Когда слушаешь рассуждения Критика,
            невольно возникает желание ходить за ним следом «с пергаментом» и
            записывать каждое слово.
          </UiText>

          <UiText>
            Критик предпочитает не загромождать свою память энциклопедической
            информацией, и хотя среди представителей этого типа встречается
            огромное количество исключительно эрудированных людей, Критик в
            первую очередь поражает глубиной своих знаний.
          </UiText>

          <UiText preset="large" color="role">
            Критик любит и умеет учиться, стараясь получать новую информацию
            последовательно и постепенно, чтобы это не выходило далеко за рамки
            его наблюдений: в первую очередь его интересуют связи между уже
            изученными явлениями.
          </UiText>

          <UiText color="role">
            Воспринимая новую информацию, Критик сразу старается увязывать ее в
            уже существующую систему знаний. Информацию, которая противоречит
            сложившимся системам или разрушает их, воспринимает очень критично.
          </UiText>

          <UiText>
            Критику несвойственно слепое преклонение перед авторитетами.
            Ссылаясь на кого-либо, он подкрепляет свое высказывание точной и
            уместной цитатой, всегда поясняя, какое отношение она имеет к его
            рассуждениям.
          </UiText>

          <UiText>
            Критик часто подкрепляет свои рассуждения поучительной притчей.
            Иногда притча преподносится вместо рассуждений, так что слушателю
            остается только гадать, к чему бы это было сказано.
          </UiText>

          <UiText>
            В действительности же Критики часто «прикрываются» притчей, пытаясь
            рассуждать о том, что плохо поддается их пониманию, как, например,
            аспект этики эмоций или этики отношений.
          </UiText>

          <UiText>
            Критик не видит криминала в том, чтобы рассуждать одновременно обо
            всем. Он готов подхватить любую тему, свободно переключаясь с одной
            на другую. Это происходит не потому, что ему трудно сосредоточиться
            на чем-то одном — это природная динамика его интеллекта,
            подсознательно настроенная на слабую функцию по аналогичному аспекту
            у его дуала Политика, который незаметно для себя перескакивает с
            одного вопроса на другой.
          </UiText>

          <UiText color="role">
            Критик каждую новую тему вплетает в общий ход своих рассуждений так,
            что цельность логической связи при этом не нарушается.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
