<template>
  <div class="text g-page">
    <section>
      <UiText preset="large" color="role">
        Вам в голову часто приходят интересные, перспективные идеи. Умеете
        проникнуть умом вглубь событий и предвидеть перспективу их развития.
      </UiText>

      <UiText>
        Вашей сильной стороной, безусловно, является хорошо развитое
        познавательное мышление. Развитая интуиция помогает вам в выборе
        правильных решений. Способны заглянуть в саму суть вещей и явлений.
        Много читаете и интересуетесь всем новым, необычным. Однако в этом
        кроется опасность «распотрошить» свои силы, потерять основной интерес,
        определяющий вас как личность.
      </UiText>

      <UiText>
        Инструментом для реализации ваших интуитивных идей и догадок служит
        логика. Вы стремитесь логически обосновать свои идеи и убедить тем самым
        окружающих людей в их правильности. Благодаря этому качеству вокруг вас
        объединяются ваши единомышленники.
      </UiText>

      <UiText>
        Вы — враг всего косного и устаревшего. В этом таится опасность стать на
        позицию тотального нигилизма.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Ваша основная проблема — это неумение правильно разобраться в отношениях
        между людьми. Особенно трудно для вас — осознать истинное отношение к
        вам окружающих.
      </UiText>

      <UiText>
        После того как вы интуитивно разобрались в человеке, он становится вам
        неинтересен. Вы не знаете, что с ним делать дальше. Это может
        восстановить его против вас. Вы также не видите своих истинных
        недоброжелателей. Не спешите делать выводы относительно оценки
        окружающих вас людей.
      </UiText>

      <UiText preset="large" color="role">
        Старайтесь определиться в этом вопросе по их объективным поступкам.
      </UiText>

      <UiText>
        Вам трудно даются стабильные хорошие отношения с близкими. Вы можете
        нечаянно проявить бестактность, нарушить устоявшуюся гармонию отношений.
      </UiText>

      <UiText>
        Сдерживайте сиюминутную реакцию на тот или иной поступок близкого
        человека.
      </UiText>

      <UiText>
        Не увлекайтесь излишним демократизмом, который может незаметно для вас
        перейти в фамильярность. Это может способствовать подрыву вашего
        авторитета среди людей.Проявляйте в своем поведении больше такта, чтобы
        не шокировать людей своей откровенностью и прямолинейностью.
      </UiText>

      <UiText>
        Этим вы можете нажить недоброжелателей, даже сами того не желая.
      </UiText>
    </section>

    <section>
      <UiText>
        Еще одна из ваших проблем — это неумение быть постоянно собранным, слабая самодисциплина.
      </UiText>

      <UiText>
        Из-за этого вы запускаете свои повседневные дела, следствием чего является срыв намеченных мероприятий или установленного графика работы.
      </UiText>

      <UiText preset="large" color="role">
        Делайте все вовремя.
      </UiText>

      <UiText>
        Если вы являетесь начальником, то обратите внимание на то, чтобы не скатываться к волюнтаризму.
      </UiText>

      <UiText preset="large" color="role">
        Избегайте необоснованного усиления давления на сотрудников, не перегибайте палку в требовательности и волевом нажиме.
      </UiText>

      <UiText>
        Такая неадекватная реакция может поставить вас в смешное положение.
      </UiText>

      <UiText>
        Переключайте свою потенциальную волевую энергию на занятия спортом, чтобы давать ей выход.
      </UiText>

      <UiText preset="large" color="role">
        Это повысит ваш жизненный тонус, выработает выдержку, вы станете более собранным, дисциплинированным.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
