<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Умеют различать тончайшие нюансы человеческих эмоций.
  </UiText>

  <UiText class="description">
    Способны вызывать у себя и у других любую эмоцию, умеют переходить от драмы к комедии за считанные доли секунды.
  </UiText>

  <UiText class="description">
    Умеют сочувствовать, часто они переживают горе других, как свое. Может настолько сильно переживать за состояние другого человека, что получит нервный срыв.
  </UiText>

  <UiText class="description">
    Прирожденные ораторы, прекрасные актеры и публичные люди. Очень любят менять образы: сегодня — роковая женщина, а завтра —тургеневская девушка.
  </UiText>

  <UiText class="description">
    Часто нагнетает эмоциональное напряжение, может раздуть из мухи слона, в маленькой проблеме видит большую катастрофу, склонен к эмоциональным преувеличениям.
  </UiText>

  <br />
  
  <hr />

  <UiText class="description">
    Находится во власти своих эмоций  — человек настроения, причем этому настроению он легко подчиняет окружающих, подталкивая их к выгодным для него самого действиям.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Подход к людям строго дифференцирован: каждому адресуется особый эмоциональный заряд.
  </UiText>

</template>

<style lang="scss" scoped></style>
