<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Хорошо чувствует возможности других людей, наблюдая со стороны, особенно незнакомых, выделяет людей с интересными способностями среди других.
  </UiText>

  <UiText class="description">
    Стремится установить хорошие отношения с интересными людьми на близкой дистанции, выразить своё расположение к ним.
  </UiText>

  <UiText class="description">
    Находит выход из разнообразных ситуаций, владея видением скрытых возможностей, налаживая хорошие отношения, либо настраивая положительное общественное мнение.
  </UiText>

  <br />
  
  <hr />

  <UiText class="description">
    Никогда не станет заниматься бесперспективной проблемой, он жестко ориентирован на достижение успеха и, следовательно, на избегание тупиков и неприятных ситуаций.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Видит и способен объяснить самую суть какого-либо явления, события; его интуиции подвластны также скрытые способности людей и коллективов.
  </UiText>

  <UiText class="description">
    На базе этой интуитивно осознаваемой информации Советчик принимает решения, обеспечивающие ему скорейшее продвижение к цели.
  </UiText>

  <UiText class="description">
    Кстати, целей, как правило, несколько — и все стратегические, поскольку он видит возможности крупным планом, без детализации.
  </UiText>

  <UiText class="description">
    Он прекрасно знает, куда надо идти, но затрудняется, как, каким способом добиться желаемого.
  </UiText>

</template>

<style lang="scss" scoped></style>
