<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Живет эмоциями. Способен различать тончайшие нюансы любой эмоции. Часто люди боятся его эмоционального напора.
  </UiText>

  <UiText class="description">
    Умеет поднять настроение даже самому грустному человеку, он всегда видит, в хорошем или плохом настроении находится его собеседник.
  </UiText>

  <UiText class="description">
    Различает множество вкусов в еде, гурман, любит хорошую кухню. Часто прекрасно готовит.
  </UiText>

  <UiText class="description">
    Общительны, они легко начинают разговор первыми и заряжают позитивом.
  </UiText>

  <UiText class="description">
    Прекрасный тамада, человек, способный увлечь толпу, зарядить эмоциями и поддержать веселое настроение в компании.
  </UiText>

  <br />
  
  <hr />

  <UiText class="description">
    Руководствуется в основном эмоциями, противопоставляя свои чувства чувствам окружающих.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    В критические моменты часто не способен контролировать свою эмоциональность, его буквально переполняет энергия.
  </UiText>

  <UiText class="description">
    Умеет навязать другим свое настроение; старается, чтобы вокруг него все были веселы и радостны, но не считает нужным заниматься эмоциональным состоянием отдельных личностей.
  </UiText>
</template>

<style lang="scss" scoped></style>
