<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Способен быстро оценить, какой человек слабый, а какой сильный, понять, на кого можно давить, а на кого не стоит.
  </UiText>

  <UiText class="description">
    Способен узнать уязвимые места у знакомых людей и, воздействуя на них, добиться нужного. Всегда сможет за себя постоять.
  </UiText>

  <UiText class="description">
    Любит командовать, особенно если подчиненные слабее его. В случае более сильных людей предпочитает общаться на равных.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Исключительно воинственно настроен.
  </UiText>

  <UiText class="description">
    Считает, что мир можно и нужно завоевать, установив в нем свой порядок. Врагов и конкурентов всерьез не воспринимает: мнит себя непобедимым и неотразимым. 
  </UiText>

  <UiText class="description" preset="large" color="role">
    Уважает силу. При этом и более слабых, и равных воспринимает одинаково — как слабаков.
  </UiText>

  <UiText class="description">
    Он легко определяет силу каждого отдельно взятого человека, но не обращает внимания на группы; он уверен, что «один на один» победит любого.
  </UiText>

</template>

<style lang="scss" scoped></style>
