<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Крайне работоспособны, они готовы заниматься делом хоть сутки напролет, если знают, что это принесет нужный результат.
  </UiText>

  <UiText class="description">
    Каждый день составляет список дел (в голове или на бумаге), которые необходимо выполнить.
  </UiText>

  <UiText class="description">
    Очень практичен, ценит надежность. 
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Любое действие оценивается с точки зрения целесообразности.
  </UiText>

  <br />
  
  <hr />

  <UiText class="description">
    Отличается исключительной работоспособностью, не зависящей ни от каких ситуаций и внешних условий.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Всегда знает, как наладить технологический процесс, бытовой или производственный.
  </UiText>

  <UiText class="description">
    Тонко чувствует динамику дела, которым занимается; это может быть, например, динамика финансовых потоков, становления технических систем или научной разработки.
  </UiText>

  <UiText class="description">
    Способен разобраться в самых сложных процессах до тонкостей, проработка деталей — его конёк. 
  </UiText>

  <UiText class="description">
    Технология, предложенная или внедряемая им, всегда идеально адаптирована к конкретным условиям производства и ориентирована на выполнение актуальных практических задач..
  </UiText>

</template>

<style lang="scss" scoped></style>
