<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Самый решительный во всем соционе. Этот человек прекрасно чувствует расстановку сил, видит кто сильный, а кто слабый.
  </UiText>

  <UiText class="description">
    Умеет руководить, причем как словами, так и силовым давлением.
  </UiText>

  <UiText class="description">
    Отличается категоричностью в суждениях, может довести человека до слез. Не устраивает позиция «среднячка», ему нужно быть первым, лучшим, сильнейшим.
  </UiText>

  <UiText class="description">
    Представители этого типа умеют брать на себя ответственность, стараются найти выход из любой ситуации, бесстрашны и собраны даже в повседневной жизни.
  </UiText>

  <br />
  
  <hr />

  <UiText class="description">
    Непрерывно сканирует пространство на предмет выявления конкурентов за место лидера коллектива или владельца территории.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Мастер тактической конкурентной борьбы.
  </UiText>

  <UiText class="description">
    Он старается любой ценой одержать верх и оценивает ситуацию предельно жестко: если он не самый сильный, значит — слабый.
  </UiText>

  <UiText class="description">
    В целом поведение  — это агрессивная защита своих позиций в социуме, независимо от того, есть желающие бороться с ним или нет.
  </UiText>

</template>

<style lang="scss" scoped></style>
