<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Видит отношения людей в коллективе. Прекрасно понимает, кто как к кому относится, при этом отношение к себе улавливает хуже.
  </UiText>

  <UiText class="description">
    Часто страдает повышенной доверчивостью. Очень важно иметь свои принципы, быть человеком порядочным, не предавать.
  </UiText>

  <UiText class="description">
    Если встречается с такими вещами, как измена или вранье, он может перестать общаться с человеком насовсем.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Если же видит, что человек извиняется и кается, то может простить даже заклятого врага.
  </UiText>

  <UiText class="description">
    В целом, относится к людям лучше, чем они заслуживают.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Тонкий знаток человеческой природы во всех её проявлениях.
  </UiText>

  <UiText class="description">
    Он прекрасно разбирается в межличностных отношениях любого уровня; обладает исключительно точным, глубоко дифференцированным подходом к человеческим отношениях; к каждой личности ищет свой ключ, никогда не выходя при этом за рамки гуманности
  </UiText>

  <UiText class="description">
    Мораль и нравственность трактует широко; он способен понять любого, даже самого отъявленного злодея.
  </UiText>

  <UiText class="description">
    Этический кодекс Гуманиста предусматривает все нюансы взаимоотношений между людьми, в нем нет жестких рамок, ограничивающих свободу людей, а только рекомендации, как сделать жизнь вокруг бесконфликтной и духовно «чистой».
  </UiText>

</template>

<style lang="scss" scoped></style>
