<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Имеет прекрасное воображение, много фантазируют, способны сотворить целый мир у себя в голове.
  </UiText>

  <UiText class="description">
    Их интуиция способна предсказать какие-то события: часто Лирики чувствуют, что скоро что-то произойдет.
  </UiText>

  <UiText class="description">
    Представители этого типа никуда не торопятся, они все делают медленно и часто откладывают дела на завтра.
  </UiText>

  <UiText class="description">
    Могут часто опаздывать и не придавать этому большого значения. Всегда знают, когда нужно прийти, чтобы оказаться в нужном месте своевременно.
  </UiText>

  <UiText class="description">
    Умеют успокаивать людей словами, что в будущем все изменится и станет лучше.
  </UiText>

  <UiText class="description">
    В плане времени — эгоисты. Представители этого типа считают, что время принадлежит им, а не кому-то еще.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Исключительно тонко чувствует ход времени, динамику процессов.
  </UiText>

  <UiText class="description">
    Способен непринужденно путешествовать как в давнее прошлое, так и в отдаленное будущее.
  </UiText>

  <UiText class="description">
    Его пророчества предельно общие, неконкретны, они только отмечают вероятные тенденции развития.
  </UiText>

  <UiText class="description" preset="large" color="role">
    Видит тупиковые варианты развития событий, а также неблагоприятные, грозящие катастрофой.
  </UiText>

  <UiText class="description">
    Он всегда знает, когда нужно действовать, а когда ждать. При желании всегда и всюду успевает, но предпочитает ненавязчиво диктовать окружающим свой ритм жизни.
  </UiText>

</template>

<style lang="scss" scoped></style>
