<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Способен отследить малейшие изменения в тенденциях, он прекрасно разбирается в ходе жизни.
  </UiText>

  <UiText class="description">
    Может предсказать, к чему приведет какое-либо событие.
  </UiText>

  <UiText class="description">
    Легко видит несоответствия и противоречия в вопросах истории и времени.
  </UiText>

  <UiText class="description">
    Часто становятся философами и эрудитами, им нравится изучать прошлое, отслеживать причины и следствия, интересоваться новыми веяниями в науке и культуре.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Старается всегда опережать события, и ему часто это удаëтся.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Отличается исключительно тонким чувством времени — каждый (даже очень мелкий) «квант» времени для него заметен и значим.
  </UiText>

  <UiText class="description">
    Пунктуален, педантичен, весьма предусмотрителен; хозяин своего времени; умеет ненавязчиво внушать свой ритм действий окружающим. Это мастер сложных динамических прогнозов.
  </UiText>

  <UiText class="description">
    Предсказания его всегда детально проработаны, правда, носят в основном конкретный, научно-технический характер; гуманитарные проблемы Критика обычно не волнуют.
  </UiText>

</template>

<style lang="scss" scoped></style>
