<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Прекрасно видит отношения людей к нему и друг к другу.
  </UiText>

  <UiText class="description">
    Знает принятую в обществе норму проявления отношений, а также имеет собственное понимание нравственности.
  </UiText>

  <UiText class="description">
    Невозможно провести с помощью лести и этических уловок — этот человек видит насквозь мотивы и отношение людей.
  </UiText>

  <UiText class="description">
    Существуют всего две категории людей — свои и чужие, причем для своих будет добрым и чутким другом, а для чужих — жестким и холодным человеком.
  </UiText>

  <UiText class="description">
    Полностью доверяет своим этическим оценкам и его сложно убедить в том, что он неправ.
  </UiText>

  <UiText class="description">
    К счастью, неправ он бывает редко.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Это настоящий знаток морали, нравственности и других неписаных законов человечества. Он всегда знает, что является нормой, а что подлежит осуждению. 
  </UiText>

  <UiText class="description">
    Интересно, что государственные законы для него не слишком важны: тавное — поступать по совести; в его понимании даже закон может быть бессовестным, бесчеловечным, а тот, кто его выполняет, — преступником.
  </UiText>

  <UiText class="description" preset="large" color="role">
    Ясно видит моральные качества человека или группы, но совершенно не склонен эти качества дифференцировать.
  </UiText>

  <UiText class="description">
    Для него есть «плохие» и «хорошие». Себя судит еще более строго, чем других.
  </UiText>

  <UiText class="description">
    Измен и предательств не прощает даже близким.
  </UiText>

  <UiText class="description">
    Считает, что его этические нормы должны быть восприняты всеми окружающими, иначе общество деградирует.
  </UiText>

</template>

<style lang="scss" scoped></style>
