<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Умеет понять запросы своего тела,а также почувствовать потребности окружающих людей.
  </UiText>

  <UiText class="description">
    Четко ощущает, когда он хочет есть, когда он хочет пить, когда ему нужно поспать, а когда — отдохнуть.
  </UiText>

  <UiText class="description">
    Различает множество вкусов в еде, гурман, любит хорошую кухню. Часто прекрасно готовит.
  </UiText>

  <UiText class="description">
    Всегда отслеживает, здоровы ли его близкие, он готов подсказать друзьям и родственникам, что делать по вопросам здоровья, посоветовать врача.
  </UiText>

  <UiText class="description">
    Предпочитает комфортную одежду, ткани, приятные к телу, в которых кожа дышит.
  </UiText>

  <UiText class="description">
    Любит ощущать вещи — трогает их, вертит в руках, старается запомнить физические свойства предмета.
  </UiText>

  <UiText class="description">
    Любит обнимать близких людей, держать их за руку, ощущать их присутствие.
  </UiText>

  <br />

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Стремится в любой ситуации доставить себе изысканные ощущения.
  </UiText>

  <UiText class="description">
    Подходит к проблемам комфорта, уюта и самочувствия творчески, для него здесь нет авторитетов.
  </UiText>

  <UiText class="description">
    Мастер выдумывать новые, оригинальные способы получения удовольствий всех видов. Заботлив, внимателен к потребностям окружающих.
  </UiText>
</template>

<style lang="scss" scoped></style>
