<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Человек, который воспринимает окружающую действительность через ощущения.
  </UiText>

  <UiText class="description">
    Эти люди всегда оценивают перспективность и интересность каждой идеи, которая приходит им в голову, а приходит их много.
  </UiText>

  <UiText class="description">
    Загоревшись чем-то, будет думать и работать по 24 часа в сутки, создавая необычные и смелые способы решения проблем.
  </UiText>

  <UiText class="description">
    Очень не любит быть «обычным», «таким как все», для него рутина — это скука смертная, он всячески пытается её избежать.
  </UiText>

  <br />
  
  <hr />

  <UiText class="description">
    Руководствуется ощущениями, а они представляются ему в довольно «грубом» варианте: либо отрицательные, которых нужно избегать, либо приятные, к которым нужно стремиться.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Всегда знает, как можно оптимальным образом организовать пространство вокруг себя.
  </UiText>

  <UiText class="description">
    Он готов терпеливо объяснять окружающим законы эстетики и другие блоки информации, соответствующие аспекту Ощущение.
  </UiText>

  <UiText class="description">
    Комфорт и удобство играют для  важнейшую роль, он старается не делать ничего такого, что способно отнять у него удобное положение в пространстве.
  </UiText>

</template>

<style lang="scss" scoped></style>
