<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <div class="warning">
      <UiText preset="small" color="accent">
        Если вы не умеет воспринимать юмор, обидчивы или зависимы от мнений
        незнакомцев, пожалуйста, не читайте все что ниже.
      </UiText>

      <UiText preset="small" color="accent">
        Ненормативная лексика и сексуальные темы, оскорбление чувств всех
        причастных. Но весело и остроумно. Соблюдена авторская орфография и
        пунктуация.
      </UiText>
    </div>

    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Люркмор"
          subtitle="2 минуты"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Селютин"
          subtitle="4 минуты"
          target-content-id="tab-2"
        />

        <VariousTab
          title="Эльвира Фея"
          subtitle="2 минуты"
          target-content-id="tab-3"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText color="accent">
            <i>
              генки, небыдло, пиздабол, ГСМ, ТП, похуист, ламер, толстый тролль,
              журнализд, юрист, позёр, яндере, феечка
            </i>
          </UiText>

          <UiText preset="large" color="role">
            Бешеное существо — шило в комплекте. Либо спит, либо несётся куда-то
            с бешеной скоростью. Любимое занятие, — насильно мирить или ссорить
            между собой людей, или всячески иначе корректировать отношения
            окружающих друг с другом.
          </UiText>

          <UiText>
            Гонит картину, создаёт миф о себе и первым же начинает в это верить.
            Часто пытается показать себя как волевого человека и сильную
            личность, напуская на себя браваду и показной героизм, однако при
            реальном давлении результат немного предсказуем.
          </UiText>

          <UiText>
            Привязывается к узкому кругу своих людей, чьё мнение для него крайне
            значимо и полностью определяет его настроение.
          </UiText>

          <UiText preset="large" color="role">
            Феерические хвастуны. Как правило они не врут, а просто очень
            приукрашивают и преувеличивают то, что было на самом деле.
          </UiText>

          <UiText>
            Прогнав с детской площадки группу малолетних хулиганов, он потом
            может рассказывать захватывающую историю, как в одиночку разделался
            с опасной бандой местных гопников. Причём сделает это не для того,
            чтобы показать свою охуенность, а просто потому что так интереснее.
          </UiText>

          <UiText>
            Является генератором бесперспективных идей. Интеллектом не
            отличается, оттого часто покупают дорогостоящую астральную хуиту или
            пылесосы Kirby.
          </UiText>

          <UiText>
            Очень поздно взрослеют. Годам к 40, да и то не всегда. Не переносит
            критику своего нелогичного поведения, несмотря на то, какую хрень бы
            не сотворил.
          </UiText>

          <UiText>
            Любят посраться с Инспекторам и надавать пиздюлей Хранителям за их
            слабую Чорную Интуицию (скучные и не оригинальные люди).
          </UiText>

          <UiText>
            Как правило считают скучными всех рационалов, так как сами планов не
            признают. Свою сумбурность и нелогичность считают одним из главных
            достоинств, за что также огребают от Аналитика.
          </UiText>

          <UiText>Интегральный тип Новой Зеландии.</UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">Бочка меда</UiText>
          <UiText preset="large" color="role">
            Интересные собеседники. Тормошат друзей-подруг, вытаскивая
            периодически их из унылого говна.
          </UiText>
          <UiText preset="small" color="accent">Ложка дегтя</UiText>
          <UiText preset="large" color="accent">
            Нехило отсасывают энергию и пьют кровь, особенно у рационалов.
          </UiText>
          <UiText preset="large" color="accent">
            They make other people facepalm!
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="large" color="role">
            «Толку было с него, правда, как с козла молока, но вреда, однако ж,
            тоже никакого.» Завистливая «пустышка».
          </UiText>

          <UiText>
            Буйный фантазер, которому нельзя доверять. Способен обрести
            психологию Плюшкина и человека, которому все всё должны.
          </UiText>

          <UiText preset="large" color="role">
            Мастера по влипанию в истории.
          </UiText>

          <UiText>
            То же что и Гуманисты, а дамы… если бы они ещё когда-нибудь смогли
            определиться чего и кого они хотят, а то ведь так и пробегают всю
            свою жизнь, да и чужие жизни тоже.
          </UiText>

          <UiText>
            «Фигаро здесь, Фигаро там»… Гонит картину, создает миф о себе, и
            первым начинает в это верить.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Не то что разгильдяи, а даже раздолбаи. В голове — тараканы. Но
            оказывается, что не умеет он жить в порядке.
          </UiText>

          <UiText>
            Безобидное животное, даже можно с ним поразвлекаться, если не
            воспринимать его слова за правду. А если воспринимать, можно не
            выжить.
          </UiText>

          <UiText>
            Врет непрерывно, причем злобно, с целью потешить себя за счет
            окружающих, постоянно меняют круг знакомых, так как их сразу
            перестают воспринимать всерьез.
          </UiText>

          <UiText>
            В критических ситуациях погибнут первыми, потому что ничего не умеют
            кроме как болтать языком.
          </UiText>

          <UiText>
            Внутри злобные, претенциозные, ленивые, не порядочные. Никаких
            отношений с ними иметь нельзя, все кончится плохо.
          </UiText>

          <UiText>
            Пустой, тупой и скучный, зато умеет жопку лизать, если кому надо,
            милости прошу, лучше никто не вылижет.
          </UiText>

          <UiText preset="large" color="role">
            Но опять же, жопку лижет многим и без разбора.
          </UiText>

          <UiText>
            А еще они напоминают комок оголенных нервов, все время язвят,
            хорохорятся чего-то.
          </UiText>

          <UiText preset="large" color="role">
            Когда находишься с ними в одном помещении, то ощущаешь нехватку
            воздуха. Прямо вампирищи!
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-3" class="tab">
        <section>
          <UiText preset="large" color="role">
            Ибо Советчики — они, сука, веселые. Причем не узнать об этом у вас
            просто никаких шансов — они веселы всегда, и даже на похоронах это
            те самые люди, что вспоминают, как покойник в мохнатом 19.. году
            перелез через забор и порвал штаны в интересном месте.
          </UiText>

          <UiText>
            Их всегда много, они как ржа или плесень — даже один Советчик
            производит впечатление заполненности помещения так, что дальше
            некуда.
          </UiText>

          <UiText>
            Любят, сука, новизну и приключения — потому их легко развести на
            поебацца; но влюбляются они предусмотрительно только в унылое говно
            типа Мастера или Дипломата, чувствуют, что только такие рохли их
            распиздяйство и выдержат.
          </UiText>

          <UiText>
            Где Советчики незаменим, так это в компании — никто не уйдет
            неоприходованным, притом тихо не будет, потому что по каждому
            вопросу у него непременно имеется своё уникальное и абсолютно
            парадоксальное мнение.
          </UiText>

          <UiText>
            При этом оставлять Советчика без присмотра не рекомендуется — он
            обладает изяществом и грацией бегемота в балетном прикиде, поэтому
            уберите подальше хрупкие статуэтки и хрупких гостей трагического
            склада психики, навроде Критиков и Наставника.
          </UiText>
        </section>

        <section>
          <UiText>
            При первом рассмотрении Советчик напоминают маленькое цунами;
            впоследствии становится ясно, что этот катаклизм закончится, только
            когда вы выпрете его за дверь, что непросто, ежели у вас еще
            осталось выпить, а выпить они не дураки.
          </UiText>

          <UiText>
            Разглагольствуя о равенстве полов и прочей дребедени, он, вне
            зависимости от этого самого пола и ориентации, с удовольствием сядут
            вам на шею, где и останутся навсегда, пребывая в перманентном
            творческом поиске и запое одновременно.
          </UiText>

          <UiText>
            Работать Советчики не любят, а успеха достигают там, где нужно
            запаривать кому-то мозг и молоть языком без стеснения, и не
            требуется ничего делать руками.
          </UiText>

          <UiText>
            Это те самые бродячие продавцы ножей-копилок со встроенным феном и
            яйцедробилкой, которые оставят вас без копейки денег и еще
            задружатся на всю жизнь.
          </UiText>

          <UiText>
            Но не обманывайтесь их пиздец каким дружелюбием: Советчики известные
            мудозвоны, а в силу невъебенной уверенности в себене слушают никого,
            кроме себя и — якобы — Мастеров, которых услышать крайне проблемно.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
