<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">Особенности</UiText>

  <UiText>
    Подвижные, энергичные, непоседливые, обожают быть в центре внимания.
  </UiText>

  <UiText>
    Непредсказуемы, настроение и отношение к людям меняется быстро.
  </UiText>

  <UiText>Легко бросают старые увлечения и друзей, находя новых.</UiText>

  <UiText>Не очень обязательны и последовательны, трудно положиться.</UiText>

  <UiText>
    Умеют убедительно оправдываться, могут приврать без зазрения совести.
  </UiText>

  <UiText>
    В спорах и конфликтах обычно поддерживают сильных, чувствуют баланс сил.
  </UiText>

  <UiText>
    Любят спорт, гимнастику, подвижные игры, обладают хорошей реакцией.
  </UiText>

  <UiText>
    Азартны, вовлекают других, но умеют избегать серьезных рисков.
  </UiText>

  <UiText>Склонны к увиливанию от дел ради удовольствий.</UiText>

  <UiText>
    В меру практичны, любят обмениваться вещами и договариваться, проявляют
    торговые и манипулятивные качества.
  </UiText>

  <UiText>
    Часто выступают заводилами в играх, умеют развлекать и подшучивать, но
    всегда защитят друзей.
  </UiText>

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Сказочный персонаж
  </UiText>

  <UiText class="description" color="black">
    🎭 Буратино — «Золотой ключик»
    <i>(Алексей Толстой)</i>
    . Хитрый, находчивый, обаятельный, но легкомысленный.
  </UiText>

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Рекомендации по воспитанию
  </UiText>

  <UiText class="description" color="black">
    Будьте терпеливы и рассудительны, не давите жестко.
  </UiText>

  <UiText class="description" color="black">
    Объясняйте последствия поступков, учите брать ответственность.
  </UiText>

  <UiText class="description" color="black">
    Хвалите за сделанное, но тактично указывайте на недостатки.
  </UiText>

  <UiText class="description" color="black">
    Показывайте заботу в мелочах, выражайте любовь через действия.
  </UiText>

  <UiText class="description" color="black">
    Мотивируйте завершать дела – если сам не хочет, предлагайте награду или
    обмен.
  </UiText>

  <UiText class="description" color="black">
    Используйте его самолюбие – сомнения в его силах могут заставить его
    проявить настойчивость.
  </UiText>

  <UiText class="description" color="black">
    В крайнем случае – демонстрируйте разочарование и холодность.
  </UiText>

  <UiText class="description" color="black">
    Отвлекайте на достижение крупной цели, которая будет ему интересна.
  </UiText>

  <UiText class="description" color="black">
    Объясняйте перспективу, затем осторожно убирайте от трудного дела, если оно
    ему не по плечу.
  </UiText>

  <hr />

  <UiText class="description" color="black">
    Этот ребенок яркий, харизматичный, но непостоянный. Лучше направлять его
    через поощрение, чем пытаться заставить.
  </UiText>
</template>
