<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    По возможности старается «гасить» слишком сильные эмоции.
  </UiText>

  <UiText class="description">
    Они его выматывают и раздражают. В общении старается быть легким, при этом внутри у него кипит буря, которую он тщательно скрывает.
  </UiText>

  <UiText class="description">
    Лишь в крайнем случае способен выплеснуть все эмоции на другого человека, в других ситуациях старается уйти с головой в работу или хобби, чтобы не показывать своё истинное настроение.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Помощь Советчика окружающим заключается в их эмоциональной защите.
  </UiText>

  <UiText class="description">
    Если идет время, а ничего не делается, возмущается и проявляет отрицательные эмоции.
  </UiText>

  <UiText class="description">
    Он — мастер создания спектаклей на заданную тему, но делает это не для себя, а исключительно ради своих близких или для защиты ценной идеи.
  </UiText>

  <UiText class="description">
    Его чувства исключительно разнообразны и подаются окружающим в зависимости от ситуации.
  </UiText>

  <UiText class="description">
    В обычных условиях эмоции  практически не видны, но зато в критические моменты он исключительно выразителен и подавляет своими чувствами противников, манипулируя к тому же их настроением.
  </UiText>

</template>

<style lang="scss" scoped></style>
