<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Умеет превозмогать себя. Очень не любит, когда в коллективе или дома есть лентяи и люди, безответственно относящиеся к делам и к жизни.
  </UiText>

  <UiText class="description">
    Он чувствует себя хозяином: своей квартиры, своего дела, своих близких. Очень ревнив.
  </UiText>

  <UiText class="description">
    В критической для себя ситуации может начать в прямом смысле рушить все вокруг — бить мебель, рвать обои, кричать.
  </UiText>

  <UiText class="description">
    К счастью, такое бывает крайне редко.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Администратор — прирожденный защитник слабых, обиженных, притесняемых он не может спокойно смотреть, как кого-то обижают, и бросается в бой не раздумывая.
  </UiText>

  <UiText class="description">
    Тем самым он отстаивает не просто жизнь, здоровье и честь человека, а порядок вещей, законность, сами устои социального бытия.
  </UiText>

  <UiText class="description">
    О волевых качествах не рассуждает, но очень остро чувствует их.
  </UiText>

  <UiText class="description">
    Обычно он не хвастается своей силой и не склонен давить на окружающих, но в критической ситуации применит силу не раздумывая.
  </UiText>

</template>

<style lang="scss" scoped></style>
