<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Не любит спешить и не любит замедляться.
  </UiText>

  <UiText class="description">
    Живет в среднем темпе, старается иметь четкий распорядок дня, не любит, когда этот распорядок нарушается.
  </UiText>

  <UiText class="description">
    Пунктуален, работу делает в срок, приходит на встречи вовремя. Не любит отвлекать других людей, не любит и когда отвлекают его.
  </UiText>

  <UiText class="description">
    Ценит людей, которые с уважением относятся к его времени.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Помощь Гуманиста близким людям, да и социуму в целом заключается в навязчивом планировании их времени.
  </UiText>

  <UiText class="description">
    Он даже внешне выглядит как пунктуальный, обязательный и упорядоченный человек, рядом с ним прекращается беспорядочная суета, а устанавливается размеренный рабочий ритм.
  </UiText>

  <UiText class="description">
    От него исходит своеобразная «аура своевременности», неспешности и спокойной уверенности в будущем.
  </UiText>
  
</template>

<style lang="scss" scoped></style>
