<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Окружает себя необходимыми вещами для выполнения рабочих и домашних обязанностей.
  </UiText>

  <UiText class="description">
    Честный человек, законы старается не нарушать.
  </UiText>

  <UiText class="description">
    Неосознанно соблюдает собственный порядок, старается разложить вещи так, чтобы не надо было их долго искать в случае необходимости.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Даже выглядит как-то «логично», упорядоченно, свои доводы и аргументы в области объективных законов мироздания склонен выражать демонстративно, например, рисунками, схемами, графиками.
  </UiText>

  <UiText class="description">
    Все эти графические материалы довольно абстрактны, умозрительны, в повседневной жизни, как правило, неприменимы.
  </UiText>

  <UiText class="description">
    Цель такого рода логических проявлений — помочь людям разобраться в общих закономерностях материального мира.
  </UiText>

</template>

<style lang="scss" scoped></style>
