<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Прекрасно ориентируются в вопросах законов и их соблюдения.
  </UiText>

  <UiText class="description">
    В деловых отношениях ведут себя сдержанно, показывают себя надежными партнëрами по бизнесу.
  </UiText>

  <UiText class="description">
    Очень не любят бюрократию, стараются избежать бумажной волокиты.
  </UiText>

  <UiText class="description">
    Упрямы, если знают, что правы, и готовы долго и упорно доказывать свою правоту.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Готов без устали помогать окружающим, выстраивая для них предельно четкие алгоритмы анализа информации о материальных объектах.
  </UiText>

  <UiText class="description">
    Он обладает даром наглядно и практически без слов объяснять сложные закономерности, действующие в природных и производственных структурах.
  </UiText>

  <UiText class="description">
    Даже внешне  выглядит упорядочение, опрятно и чувствуется что он не нарушает установленных правил поведения с материальными объектами.
  </UiText>

  <UiText class="description">
    Для защиты близких у  всегда наготове свод правил или законов, которые он прекрасно умеет интерпретировать.
  </UiText>

</template>

<style lang="scss" scoped></style>
