<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <div class="warning">
      <UiText preset="small" color="accent">
        Если вы не умеет воспринимать юмор, обидчивы или зависимы от мнений
        незнакомцев, пожалуйста, не читайте все что ниже.
      </UiText>

      <UiText preset="small" color="accent">
        Ненормативная лексика и сексуальные темы, оскорбление чувств всех
        причастных. Но весело и остроумно. Соблюдена авторская орфография и
        пунктуация.
      </UiText>
    </div>

    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Люркмор"
          subtitle="2 минуты"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Селютин"
          subtitle="4 минуты"
          target-content-id="tab-2"
        />

        <VariousTab
          title="Эльвира Фея"
          subtitle="2 минуты"
          target-content-id="tab-3"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText color="accent">
            <i>
              быдло, ГСМ, генки, альфа-самец, яндере, лоли, анархист,
              угнетатель, шлюха, камвхора, ЧСВ, VIP, понты, НЕНАВИСТЬ
            </i>
          </UiText>

          <UiText preset="large" color="role">
            Зашкаливающее ЧСВ, хроническая тупость (очень часто) и неуёмная
            энергия превращают «Наполеона» в оружие массового поражения и
            надёжное средство просирания всех полимеров.
          </UiText>

          <UiText>
            Политик способен свернуть горы, и он таки сворачивает их. Или ему
            сворачивают башку. Ибо нехуй. ИЧСХ, он делает это чужими руками, ибо
            во-первых, это не царское дело, а во-вторых, чтобы потом, в случае
            соразмерного эпичного фейла, собственнохуйно же и выебать тех, кто
            выполнял его приказ.
          </UiText>

          <UiText>
            Не достаётся только Критику, потому что он знал, что сворачивание
            гор — лютая хуита и отговаривал Политика от этого плана.
          </UiText>

          <UiText>
            Как вариант, Критик сам разработал этот хитрый план, ибо Политик
            совершенно не понимает суть Системы, отчего срётся с Аналитиком и
            жёстко подавляется Инспектором за несоблюдение правил.
          </UiText>

          <UiText>
            Считается интегральным типом Италии, Грузии, Одессы, Техаса.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">Бочка меда</UiText>
          <UiText preset="large" color="role">
            С Политиком не соскучишься. К тому же, они так ловко манипулируют
            людьми, что тем порою кажется, что они исполняют собственную волю.
          </UiText>
          <UiText preset="small" color="accent">Ложка дегтя</UiText>
          <UiText preset="large" color="accent">
            Что Политик вбил в свою голову, выбивается лишь ломом. Единственная
            возможность поддерживать общение с ним — никогда не спорить.
          </UiText>
          <UiText preset="large" color="accent">
            Много врёт и все его хотят.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="large" color="role">
            Я сам себя перехитрил! Искренне полагает, что его все обожают, но —
            это смешно!
          </UiText>

          <UiText>
            Самый несобранный тип. Бегает, шумит, — а ничего сделать толком не
            может. Самый лицемерный тип.
          </UiText>

          <UiText>
            Вот уж много шума из ничего, да и результат под стать тому с чего
            начали.
          </UiText>

          <UiText preset="large" color="role">
            Если согласился — это ровно ничего не значит, кроме того, что не
            хочет с тобой сегодня спорить.
          </UiText>

          <UiText>
            Король без свиты. Завидует чужой красивой жизни. Любит деньги и
            умеет торговаться — в том смысле, что скорее откажется от покупки,
            чем даст кому-то заработать на этом хоть копейку. Не любит, когда им
            командуют, и предпочитает сразу руководящую должность.
          </UiText>

          <UiText>
            Крупная хищница. Акула, способная годами кружить вокруг жертвы,
            выбирая момент. И когда жертва поверит в свою безопасность и
            расслабится - наносит смертельный удар. Глаза, в которых тускло
            мерцает жажда убийства.
          </UiText>

          <UiText>
            Эти хапают все министерство авиации целиком, но не побрезгуют и
            содержимым карманов пассажиров.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Базарные торговки и мелкие воровки. Крупные, массивные, задница в
            два самовара. Хамское выражение лица.
          </UiText>

          <UiText>
            При совке работали в столовых и пивных ларьках. Их роль в авиации —
            выковыривать ценные заклепки из самолета и прятать их в рейтузах до
            тех пор, пока самолет не развалится.
          </UiText>

          <UiText>
            Безумный Политик, и этим все сказано. Самый ненавистный из
            начальников: зарплата постоянно задерживается и уменьшается, приказы
            противоречат друг другу, приступы волевого давления сменяются такими
            же приступами этики.
          </UiText>

          <UiText preset="large" color="role">
            Обещают всем и вся, золотые горы и алмазные берега, без зазрения
            совести.
          </UiText>

          <UiText>
            И не дай бог ему противоречить — начинается пальба из всех орудий, и
            больше ты никогда никаких денег от него не увидишь, если не будешь
            ему полезен, конечно.
          </UiText>
        </section>

        <section>
          <UiText>
            Как от партнера по бизнесу от Политика шарахаюсь — их хаотичные
            метания от одной идеи заработка к другой, такой же безумной и
            отбрасывающей все и всяческие статусы и законы могут завести либо за
            решетку, либо в лужу крови на лестничной клетки… твоей собственной.
          </UiText>

          <UiText>
            К тому же он просто не знает, что такое «вовремя сделанное дело» или
            «в срок выполненный контракт», и построить его по времени может
            только Критик.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">Торгаш до мозга костей.</UiText>

          <UiText>
            Готовы брюзжать по любому поводу, причем зачастую по диаметрально
            противоположным — в зависимости от сиюминутных пристрастий. И опять,
            когда указываешь на это, — изворачиваются, применяя те же приемы.
          </UiText>

          <UiText preset="large" color="role">
            Либо ты уничтожаешь его, либо он уничтожит тебя.
          </UiText>

          <UiText>
            Безумный Политик, и этим все сказано. Безумству и хаосу поют они
            песню!
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-3" class="tab">
        <section>
          <UiText preset="large" color="role">
            Политики – они, сука, центр вселенной и ниипет.
          </UiText>

          <UiText>
            При первом столкновении с Политиком вы не замечаете ничего
            подозрительного — обаятельные гады, они маскируются под Советчиков
            или даже Лидеров, фееря и сверкая изо всех сил.
          </UiText>

          <UiText>
            Через какое-то время вы чувствуете, что вам активно вешают лапшу на
            уши, и рассказ о том, как ограбил швейцарский банк, переспал с Наоми
            Кэмпбелл и завоевал мир — все только до завтрака! — теряет для вас
            свою прелесть.
          </UiText>

          <UiText>
            И тут наступает критический момент — вы возражаете Политику, а
            возможно — если вы самоубийца или Наставник — даже говорите ему, что
            он пиздит.
          </UiText>

          <UiText>
            Через пару часов, пережив три истерики и сто раз объяснив Политику,
            что вы верите ему, как себе, и просто оговорились… хочешь чайку?...
            они идиоты, дада!... вы попытаетесь держаться от него подальше.
          </UiText>

          <UiText>
            Но не тут-то было: Политики мертвой хваткой вцепляется в любого, кто
            не шлет его на хуй при первой встрече, и окружает заботой и
            вниманием, удушающими, словно паутина Черной вдовы.
          </UiText>
        </section>

        <section>
          <UiText>
            Поначалу жизнь с Политика кажется сказкой: секс — до утра, обед — из
            трех блюд, романтические ужины — еженедельно, халатик — только с
            кружевами.
          </UiText>

          <UiText>
            Но все сказки имеют обыкновение заканчиваться, а вот Политик — он
            остается с вами и постепенно выпивает до капли, чтоб сообщить, что
            вы, собственно, были его недостойны.
          </UiText>

          <UiText>
            Кто (или что) может быть достоин Политика — остается тайной,
            покрытой мраком; и в итоге они находят Критика, который не то чтобы
            достоин — но ему глубоко наплевать на выпендреж и гонор некоторых
            излишне шумных уродов.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
