<template>
  <div class="text">
    <section>
      <UiText preset="body" color="accent">
        Описания не должны обязательно совпадать со всеми чертами характера
        личности.
      </UiText>

      <UiText preset="small" color="accent">
        Идея как раз описать наблюдаемые у среднего представителя типа
        особенности поведения и обработки информации психикой.
      </UiText>

      <UiText preset="small" color="accent">
        Автор описания — Велта Микелсоне
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="role">
        Прирожденный политик, человек, который умеет убеждать и вести за собой.
      </UiText>

      <br />

      <UiText>
        Наделен силой воли и огромной энергией. Рожден быть лидером,
        руководителем и организатором, он чаще всего занимает ведущие должности.
        Выдвигает цель и убежденно стремиться к ней, своей идеей увлекая и
        объединяя и захватывая людей.
      </UiText>

      <UiText>
        Знаток людей с рождения, своим проницательным взглядом моментально видит
        настроение и легко определяет — на кого можно повлиять, а кого следует
        опасаться.
      </UiText>

      <UiText preset="large" color="role">
        Умело расшевелит нерешительных и неуверенных, но с трудом подчиняется
        управлению других, особенно тех кто слабее его.
      </UiText>

      <UiText>
        Необходима свобода, независимость и широкое пространство в деятельности,
        иначе он задыхается от безделья.
      </UiText>

      <UiText preset="large" color="role">
        Лучше всего себя чувствует, если оказывается во главе большого
        коллектива.
      </UiText>

      <UiText>
        Руководя большим коллективом, сосредоточивается на поставленную цель,
        мало обращая внимание на мелочи и индивидуальности подчиненных.
      </UiText>

      <UiText>
        Однако в малом коллективе при достижении цели способен придираться к
        каждой мелочи, даже не относящихся к делу. Поэтому в большом коллективе
        пользуется уважением больше нежели в малом.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Он обладает высокой самооценкой, жизнерадостный, деятельный, энергичный,
        непреклонный.
      </UiText>

      <UiText>
        Легко принимает решения и работает с азартом. Тщательно выполняет
        обязанности и требует того же от других. Работает искренне, с большим
        размахом. С тем, кто сильнее его, устанавливает равные отношения.
        Старается избегать контакта с неприятными людьми.
      </UiText>

      <UiText preset="large" color="role">
        Не понимает и не уважает ленивых и пассивных людей.
      </UiText>

      <UiText>
        Считает, что совершить можно всё, было бы желание. Тому, кто менее
        грамотный или неумело руководит, не позволяет себя недооценивать и
        контролировать, даже может таких выжить с места.
      </UiText>

      <UiText>
        Не переносит, когда окружающие не считаются с ним и не соблюдают его
        замечаний и указаний. Ему важно достичь и сохранить высокий статус перед
        коллективом и окружающими.
      </UiText>

      <UiText preset="large" color="role">
        Он живет сегодня, все ему необходимое он находит здесь и сейчас.
      </UiText>

      <UiText>
        Везде, где прикасалась его рука мастера, не нуждается в переработке. При
        этом ему необходимы острые ощущения, свобода и веселый образ жизни.
      </UiText>

      <UiText>
        Обычно нравится людям, так как знает, что люди ожидают и хотят услышать.
        В любой деятельности он творит политику с целью что-то добиться для
        осуществления своих намерений. Ему трудно смириться, что где-то
        существует его недоброжелатель.
      </UiText>

      <UiText>
        Скорее всего он придумывает любую причину, чтобы встретиться с таким
        человеком и наладить с ним отношения.
      </UiText>

      <UiText preset="large" color="role">
        Он первым идет на контакт, даже в тех случаях, когда его обидели.
      </UiText>
    </section>

    <section>
      <UiText>
        В молодости слишком доверяет людям, но с годами учится соблюдать
        дистанцию и держать язык за зубами. Однако, если почувствует, что его
        используют корыстно, старается прервать отношения. На самом деле
        отношения не прекращаются, но следует заметить, что он придает им другой
        статус.
      </UiText>

      <UiText preset="large" color="role">
        Открытый, простодушный, сердечный, он осознанно и намеренно вступает в
        отношения.
      </UiText>

      <UiText>
        Часто необдуманно слишком близко подпускает к себе людей, о чем позже
        приходится сожалеть.
      </UiText>

      <UiText>
        Спешит развить отношения с новым партнером, не оценив серьезность
        чувств. Страсть принимает за чувства. Но вскоре понимает, что страсть
        быстро остывает и наступает равнодушие. По этой причине часто его
        счастье изначально обречено на неудачу.
      </UiText>

      <UiText>
        Когда в отношениях появляется трещина и он созрел на развод, он едва ли
        способен признаться партнеру в том, что чувства прошли. Он ждет, когда
        партнер догадается об этом сам.
      </UiText>

      <UiText>
        Если партнер решился самовольно переселится к нему жить, на это не
        соглашается, такие отношения считает ненормальными. Воспринимает это как
        угрозу своей личности.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Ему важно понять и убедиться самому, что от каждого можно ожидать.
      </UiText>

      <UiText>
        В молодости он мало разборчив в отношениях с людьми, поэтому поспешная
        оценка ведет к поражению. В зрелом возрасте такого рода ошибок допускает
        меньше, но все равно продолжает развивать в себе осмотрительность.
      </UiText>

      <UiText preset="large" color="role">
        Громадные наполеоновские планы часто «висят в воздухе».
      </UiText>

      <UiText>
        Но это не потому, что он боится воплотить их в жизнь. У него нет навыков
        структурировать и прогнозировать реализацию идей.
      </UiText>

      <UiText>
        Это тормозит его работу, поэтому он нуждается в партнере, который
        способен ему помочь в этом деле.
      </UiText>

      <UiText>
        Ему необходимо осваивать новые навыки — может несколько раз в жизни
        кардинально менять профессии.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Все, что он начинает новое, ему необходимо довести до совершенства.
      </UiText>

      <UiText>
        Ему очень важна оценка труда. Упреки оказывают на него огромное влияние,
        ему стыдно быть не талантливым и неумелым. В своё самосовершенствование
        он вкладывает все силы, чтобы не повторять ошибки.
      </UiText>

      <UiText>
        Если осознал, что освоенная отрасль ему не по душе, резко может
        перестать этим заниматься и начать искать что-то другое.
      </UiText>

      <UiText preset="large" color="role">
        Ему необходимы перемены, непрерывное развитие событий, чтобы все кругом
        кипело и он был в центре событий.
      </UiText>

      <UiText>Часто хочет куда-то мчаться, что-то менять.</UiText>

      <UiText>
        Не терпит неопределенности. Часто сам инициирует решение ситуации,
        несмотря на то, чем это может закончится. У него конкретное мышление и
        восприятие мира.
      </UiText>

      <UiText>
        Систематизирует свой быт. Его раздражают внезапные перемены в его
        установленном порядке. Плохо удаëтся отличить важное от второстепенного.
        Часто его высказывания и действия противоречивы и непонятны окружающим.
      </UiText>

      <UiText preset="large" color="role">
        У него возникают сложности при анализе причинно-следственных связей.
      </UiText>

      <UiText>
        При участии в детальной научно-исследовательской работе, он всячески
        старается ее избежать.
      </UiText>

      <UiText>
        Бывает, что поверхностно прочитав текст, в последствии искажает его
        смысл. Иногда это вызывает раздражение, пока кто-то со стороны не
        разъяснит правильно суть вещей.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        С осторожностью говорит о правилах и законах.
      </UiText>

      <UiText>
        С годами обретает советчиков, с помощью которых быстро решает непонятные
        ему вопросы.
      </UiText>

      <UiText>
        Предпочитает выслушать советы, но если это не соответствует его видению,
        действует, как считает нужным.
      </UiText>

      <UiText>
        Бесит ожидание и бездельничество, так как он не может долго находится на
        одном месте. За работу хватается моментально, не уделяя времени на
        обдумывание.
      </UiText>

      <UiText>
        Иногда погружается в размышления о будущем. Он задумывается — останется
        ли что-нибудь после меня? Зато он желает получить готовые прогнозы,
        чтобы подготовиться к действиям.
      </UiText>

      <UiText>
        Признателен тем, кто помогает понять, насколько эффективен вложенный
        труд, стоит ли этим заниматься, что надо сделать сперва, от чего надо
        отказаться.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Умеет зарабатывать деньги и свободно обращается со своими денежными
        средствами.
      </UiText>

      <UiText>
        Может быть расточительным, считает, что именно сегодня нужно жить
        красиво. Трудности его не пугают, их решение придает ему сил для
        дальнейших действий — он учится на ошибках. У него всегда появляются
        новые идеи, как действовать. Может длительное время заниматься тем, что
        его увлекает.
      </UiText>

      <UiText>
        Своё настроение может перенести на работу. Тогда он бурчит, в такой
        момент может поссорится. Но после перемирия настроение улучшается.
      </UiText>

      <UiText>
        Ему необходим порядок вокруг, удобная и необходимая для работы
        обстановка. Приносит улучшения в работе, которые полезны не только ему
        самому, но и для другим.
      </UiText>

      <UiText preset="large" color="role">
        Не возьмется за работу, которая не принесет ожидаемого результата. Чем
        больше ответственность и риска, тем бодрее он себя чувствует.
      </UiText>

      <UiText>
        Характерно ярко выраженное чувство красоты и своеобразный вкус,
        отличающийся от тенденций моды, но в тоже время все детали наряда между
        собой согласованы, не найдется ничего лишнего и не надлежащего.
      </UiText>

      <UiText>
        Предпочитает яркие цвета. Обязательно присутствуют аксессуары.Обычно его
        одежда выглядит дороже, чем на самом деле.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        При знакомстве сначала обращает внимание на внешний вид человека,
        оценивает его.
      </UiText>

      <UiText>
        Он считает, что только человек с приведенной в порядок внешностью
        уважает себя и других. Он всегда наблюдает, запоминает детали, не
        копирует других, но в дальнейшем использует понравившиеся детали.
      </UiText>

      <UiText preset="large" color="role">
        Дома ему необходим комфорт и уют. Не стесняется говорить о своих
        физиологических нуждах.
      </UiText>

      <UiText>
        Поддерживает свою физическую форму и следит за состоянием духа.
        Регулярно проверяет здоровье. Обладает сильной сексуальной энергией.
      </UiText>

      <UiText>
        Милосердный. У него всегда найдется кто-то, о ком он заботится. Если
        кто-то из близких попал в беду, может пожертвовать многим – вещами,
        деньгами, лекарствами, жилплощадью.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Эмоции Политика созданы для воздействия на других.
      </UiText>

      <UiText>
        Способен резко менять своё отношение и поведение, приспосабливаясь к
        ситуации. Этим подтверждается его псевдоним Политик. Он – ловкий тактик,
        который талантливо реагирует в каждой ситуации.
      </UiText>

      <UiText preset="large" color="role">
        Он умеет создавать вокруг себя атмосферу праздника, принимать и
        развлекать гостей и не позволяет им скучать.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
