<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Велта Микелсоне"
          subtitle="11 минут"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Вера Стратиевская"
          subtitle="34 минуты"
          target-content-id="tab-2"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText preset="subtitle" color="role">
            Прирожденный политик, человек, который умеет убеждать и вести за
            собой.
          </UiText>

          <UiText>
            Наделен силой воли и огромной энергией. Рожден быть лидером,
            руководителем и организатором, он чаще всего занимает ведущие
            должности. Выдвигает цель и убежденно стремиться к ней, своей идеей
            увлекая и объединяя и захватывая людей.
          </UiText>

          <UiText>
            Знаток людей с рождения, своим проницательным взглядом моментально
            видит настроение и легко определяет — на кого можно повлиять, а кого
            следует опасаться.
          </UiText>

          <UiText preset="large" color="role">
            Умело расшевелит нерешительных и неуверенных, но с трудом
            подчиняется управлению других, особенно тех кто слабее его.
          </UiText>

          <UiText>
            Необходима свобода, независимость и широкое пространство в
            деятельности, иначе он задыхается от безделья.
          </UiText>

          <UiText preset="large" color="role">
            Лучше всего себя чувствует, если оказывается во главе большого
            коллектива.
          </UiText>

          <UiText>
            Руководя большим коллективом, сосредоточивается на поставленную
            цель, мало обращая внимание на мелочи и индивидуальности
            подчиненных.
          </UiText>

          <UiText>
            Однако в малом коллективе при достижении цели способен придираться к
            каждой мелочи, даже не относящихся к делу. Поэтому в большом
            коллективе пользуется уважением больше нежели в малом.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Он обладает высокой самооценкой, жизнерадостный, деятельный,
            энергичный, непреклонный.
          </UiText>

          <UiText>
            Легко принимает решения и работает с азартом. Тщательно выполняет
            обязанности и требует того же от других. Работает искренне, с
            большим размахом. С тем, кто сильнее его, устанавливает равные
            отношения. Старается избегать контакта с неприятными людьми.
          </UiText>

          <UiText preset="large" color="role">
            Не понимает и не уважает ленивых и пассивных людей.
          </UiText>

          <UiText>
            Считает, что совершить можно всё, было бы желание. Тому, кто менее
            грамотный или неумело руководит, не позволяет себя недооценивать и
            контролировать, даже может таких выжить с места.
          </UiText>

          <UiText>
            Не переносит, когда окружающие не считаются с ним и не соблюдают его
            замечаний и указаний. Ему важно достичь и сохранить высокий статус
            перед коллективом и окружающими.
          </UiText>

          <UiText preset="large" color="role">
            Он живет сегодня, все ему необходимое он находит здесь и сейчас.
          </UiText>

          <UiText>
            Везде, где прикасалась его рука мастера, не нуждается в переработке.
            При этом ему необходимы острые ощущения, свобода и веселый образ
            жизни.
          </UiText>

          <UiText>
            Обычно нравится людям, так как знает, что люди ожидают и хотят
            услышать. В любой деятельности он творит политику с целью что-то
            добиться для осуществления своих намерений. Ему трудно смириться,
            что где-то существует его недоброжелатель.
          </UiText>

          <UiText>
            Скорее всего он придумывает любую причину, чтобы встретиться с таким
            человеком и наладить с ним отношения.
          </UiText>

          <UiText preset="large" color="role">
            Он первым идет на контакт, даже в тех случаях, когда его обидели.
          </UiText>
        </section>

        <section>
          <UiText>
            В молодости слишком доверяет людям, но с годами учится соблюдать
            дистанцию и держать язык за зубами. Однако, если почувствует, что
            его используют корыстно, старается прервать отношения. На самом деле
            отношения не прекращаются, но следует заметить, что он придает им
            другой статус.
          </UiText>

          <UiText preset="large" color="role">
            Открытый, простодушный, сердечный, он осознанно и намеренно вступает
            в отношения.
          </UiText>

          <UiText>
            Часто необдуманно слишком близко подпускает к себе людей, о чем
            позже приходится сожалеть.
          </UiText>

          <UiText>
            Спешит развить отношения с новым партнером, не оценив серьезность
            чувств. Страсть принимает за чувства. Но вскоре понимает, что
            страсть быстро остывает и наступает равнодушие. По этой причине
            часто его счастье изначально обречено на неудачу.
          </UiText>

          <UiText>
            Когда в отношениях появляется трещина и он созрел на развод, он едва
            ли способен признаться партнеру в том, что чувства прошли. Он ждет,
            когда партнер догадается об этом сам.
          </UiText>

          <UiText>
            Если партнер решился самовольно переселится к нему жить, на это не
            соглашается, такие отношения считает ненормальными. Воспринимает это
            как угрозу своей личности.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Ему важно понять и убедиться самому, что от каждого можно ожидать.
          </UiText>

          <UiText>
            В молодости он мало разборчив в отношениях с людьми, поэтому
            поспешная оценка ведет к поражению. В зрелом возрасте такого рода
            ошибок допускает меньше, но все равно продолжает развивать в себе
            осмотрительность.
          </UiText>

          <UiText preset="large" color="role">
            Громадные наполеоновские планы часто «висят в воздухе».
          </UiText>

          <UiText>
            Но это не потому, что он боится воплотить их в жизнь. У него нет
            навыков структурировать и прогнозировать реализацию идей.
          </UiText>

          <UiText>
            Это тормозит его работу, поэтому он нуждается в партнере, который
            способен ему помочь в этом деле.
          </UiText>

          <UiText>
            Ему необходимо осваивать новые навыки — может несколько раз в жизни
            кардинально менять профессии.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Все, что он начинает новое, ему необходимо довести до совершенства.
          </UiText>

          <UiText>
            Ему очень важна оценка труда. Упреки оказывают на него огромное
            влияние, ему стыдно быть не талантливым и неумелым. В своё
            самосовершенствование он вкладывает все силы, чтобы не повторять
            ошибки.
          </UiText>

          <UiText>
            Если осознал, что освоенная отрасль ему не по душе, резко может
            перестать этим заниматься и начать искать что-то другое.
          </UiText>

          <UiText preset="large" color="role">
            Ему необходимы перемены, непрерывное развитие событий, чтобы все
            кругом кипело и он был в центре событий.
          </UiText>

          <UiText>Часто хочет куда-то мчаться, что-то менять.</UiText>

          <UiText>
            Не терпит неопределенности. Часто сам инициирует решение ситуации,
            несмотря на то, чем это может закончится. У него конкретное мышление
            и восприятие мира.
          </UiText>

          <UiText>
            Систематизирует свой быт. Его раздражают внезапные перемены в его
            установленном порядке. Плохо удаëтся отличить важное от
            второстепенного. Часто его высказывания и действия противоречивы и
            непонятны окружающим.
          </UiText>

          <UiText preset="large" color="role">
            У него возникают сложности при анализе причинно-следственных связей.
          </UiText>

          <UiText>
            При участии в детальной научно-исследовательской работе, он всячески
            старается ее избежать.
          </UiText>

          <UiText>
            Бывает, что поверхностно прочитав текст, в последствии искажает его
            смысл. Иногда это вызывает раздражение, пока кто-то со стороны не
            разъяснит правильно суть вещей.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            С осторожностью говорит о правилах и законах.
          </UiText>

          <UiText>
            С годами обретает советчиков, с помощью которых быстро решает
            непонятные ему вопросы.
          </UiText>

          <UiText>
            Предпочитает выслушать советы, но если это не соответствует его
            видению, действует, как считает нужным.
          </UiText>

          <UiText>
            Бесит ожидание и бездельничество, так как он не может долго
            находится на одном месте. За работу хватается моментально, не уделяя
            времени на обдумывание.
          </UiText>

          <UiText>
            Иногда погружается в размышления о будущем. Он задумывается —
            останется ли что-нибудь после меня? Зато он желает получить готовые
            прогнозы, чтобы подготовиться к действиям.
          </UiText>

          <UiText>
            Признателен тем, кто помогает понять, насколько эффективен вложенный
            труд, стоит ли этим заниматься, что надо сделать сперва, от чего
            надо отказаться.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Умеет зарабатывать деньги и свободно обращается со своими денежными
            средствами.
          </UiText>

          <UiText>
            Может быть расточительным, считает, что именно сегодня нужно жить
            красиво. Трудности его не пугают, их решение придает ему сил для
            дальнейших действий — он учится на ошибках. У него всегда появляются
            новые идеи, как действовать. Может длительное время заниматься тем,
            что его увлекает.
          </UiText>

          <UiText>
            Своё настроение может перенести на работу. Тогда он бурчит, в такой
            момент может поссорится. Но после перемирия настроение улучшается.
          </UiText>

          <UiText>
            Ему необходим порядок вокруг, удобная и необходимая для работы
            обстановка. Приносит улучшения в работе, которые полезны не только
            ему самому, но и для другим.
          </UiText>

          <UiText preset="large" color="role">
            Не возьмется за работу, которая не принесет ожидаемого результата.
            Чем больше ответственность и риска, тем бодрее он себя чувствует.
          </UiText>

          <UiText>
            Характерно ярко выраженное чувство красоты и своеобразный вкус,
            отличающийся от тенденций моды, но в тоже время все детали наряда
            между собой согласованы, не найдется ничего лишнего и не
            надлежащего.
          </UiText>

          <UiText>
            Предпочитает яркие цвета. Обязательно присутствуют аксессуары.Обычно
            его одежда выглядит дороже, чем на самом деле.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            При знакомстве сначала обращает внимание на внешний вид человека,
            оценивает его.
          </UiText>

          <UiText>
            Он считает, что только человек с приведенной в порядок внешностью
            уважает себя и других. Он всегда наблюдает, запоминает детали, не
            копирует других, но в дальнейшем использует понравившиеся детали.
          </UiText>

          <UiText preset="large" color="role">
            Дома ему необходим комфорт и уют. Не стесняется говорить о своих
            физиологических нуждах.
          </UiText>

          <UiText>
            Поддерживает свою физическую форму и следит за состоянием духа.
            Регулярно проверяет здоровье. Обладает сильной сексуальной энергией.
          </UiText>

          <UiText>
            Милосердный. У него всегда найдется кто-то, о ком он заботится. Если
            кто-то из близких попал в беду, может пожертвовать многим – вещами,
            деньгами, лекарствами, жилплощадью.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Эмоции Политика созданы для воздействия на других.
          </UiText>

          <UiText>
            Способен резко менять своё отношение и поведение, приспосабливаясь к
            ситуации. Этим подтверждается его псевдоним Политик. Он – ловкий
            тактик, который талантливо реагирует в каждой ситуации.
          </UiText>

          <UiText preset="large" color="role">
            Он умеет создавать вокруг себя атмосферу праздника, принимать и
            развлекать гостей и не позволяет им скучать.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="small" color="accent">1 — Базовая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_will" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Воля</UiText>
              <UiText preset="body">Волевая сенсорика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Для человека этого типа характерна волевая защита собственных
            интересов и интересов «своей команды», защита собственного
            приоритета любой ценой.
          </UiText>

          <UiText>
            Но не с целью прямого и беспощадного подавления, а для максимальной
            реализации собственного творческого и этического потенциала, для
            наиболее полного выражения собственной яркой индивидуальности, для
            реализации собственных этических целей и задач.
          </UiText>

          <UiText color="role">
            Поэтому соотношение сил в системе ценностей Политика — это в первую
            очередь соревнование личных достижений и успехов. Политику важно
            признание его личных заслуг.
          </UiText>

          <UiText preset="large" color="role">
            Важно признание его авторитета через осознание его личных качеств:
            признание его самым чутким и заботливым руководителем, самым
            энергичным и самым деятельным.
          </UiText>

          <UiText>
            Признание его самым верным и самым надежным другом. Признание его
            самым лучшим и самым непревзойденным в своем роде деятелем.
          </UiText>

          <UiText>
            Чем бы он ни занимался, какую бы деятельность для себя ни выбрал,
            Политик всегда ставит для себя задачу быть лучшим из лучших.
          </UiText>

          <UiText>
            Сама по себе цель весьма похвальная и заслуживающая уважения, но с
            другой стороны — каких физических сил стоит прожить всю жизнь как на
            спортивном состязании: постоянно оглядываясь на соперников,
            постоянно сравнивая собственные успехи с чужими достижениями,
            постоянное напряжение в вечном стремлении вырваться вперед и не
            уступить первенства.
          </UiText>

          <UiText>
            Политик старается легко и быстро добиваться поставленных целей.
            Увлеченно занимаясь выбранным делом, не считаясь с затраченными для
            достижения успеха усилиями, Политик способен на исключительную
            работоспособность и на любые, даже противоречащие здравому смыслу
            жертвы.
          </UiText>

          <UiText>
            Не задумываясь о том, что рискует показаться хвастливым, Политик на
            каждом шагу «рапортует» о своих достижениях, иногда довольно
            искренне удивляясь тому, что другие отстают от его «образцовых»
            темпов.
          </UiText>

          <UiText color="role">
            Он как бы предлагает в любом деле «равняться» на него. И в самом
            деле, почему бы и нет? Политик великолепно умеет навязать дух
            творческого соревнования и деловой активности самому пассивному и
            равнодушному к общему энтузиазму человеку.
          </UiText>

          <UiText>
            Заставит подсуетиться самого безынициативного и бездеятельного. До
            какой крайней точки самоотстраненности и пассивности дошел бы его
            дуал Критик, если бы не исключительный энтузиазм и гиперактивность
            Политика!
          </UiText>

          <UiText color="role">
            Политик всегда осуждает и порицает в людях пассивность, отсутствие
            инициативы, отступление от намеченных планов.
          </UiText>

          <UiText>
            Нельзя сказать, чтобы Политик явно поощрял умение «работать локтями»
            — скорее, он поощряет умение «бороться, искать, найти и не
            сдаваться».
          </UiText>

          <UiText>
            Политик не уважает тех, кто пасует перед трудностями. Он всегда за
            активную жизненную позицию, за активный поиск решений. Иногда
            методы, которые он предлагает для решения проблем, выглядят
            несколько прямолинейными.
          </UiText>

          <UiText>
            Не то чтобы он предлагал идти и ломиться в закрытые двери, хотя это
            тоже не исключается, но отстаивать свои права любым возможным
            способом, добиваться намеченного при любых условиях, это уж
            непременно.
          </UiText>

          <UiText>
            Политику действительно важно знать, какие проблемы решаются методом
            волевого давления, а какие — нет. Поэтому, давая советы, которым,
            возможно, он сам бы и не последовал, Политик делает это из
            соображений получения информации по важному для себя, «программному»
            аспекту «волевой сенсорики»: где можно «давить», а где — нельзя.
          </UiText>

          <UiText preset="large" color="role">
            Точно так же в оценке потенциальных соперников Политик в первую
            очередь рассматривает способность человека противостоять
            оказываемому на него давлению, а также умение постоять за себя и
            готовность дать немедленный отпор.
          </UiText>

          <UiText color="role">
            Часто уверенный в своем силовом превосходстве или чувствующий, что
            ситуация «работает» на него, Политик может себе позволить «пробный
            выпад» в сторону того, чей силовой потенциал его сейчас интересует.
          </UiText>

          <UiText>
            Отсутствие немедленной защиты иногда наводит его на ошибочную мысль,
            что человек вообще на нее не способен. Иногда такие поспешные выводы
            приводят его к очень неприятным ситуациям.
          </UiText>

          <UiText>
            Политику крайне неприятно, когда его публично «ставят на место» —
            это занижает его самооценку. Еще нелепее ситуация, когда какой-либо
            вообще малознакомый человек по непонятным причинам на него нападает.
          </UiText>

          <UiText color="role">
            В этом случае Политик чувствует себя очень растерянным. К сожалению,
            он не всегда способен быстро взять контроль над своими чувствами и
            спокойно и твердо потребовать объяснений.
          </UiText>

          <UiText>
            Политик может ярко, иногда вызывающе «заявить» о себе. Он может
            бросить вызов обществу, может взять себе скандальный сценический
            образ: для него это не более, чем выражение собственной творческой
            индивидуальности.
          </UiText>

          <UiText>
            Гораздо больше его беспокоит отсутствие интереса к себе. Нежелание
            замечать его ярко выраженные способности, нежелание признать его
            успех, нежелание подчиниться его лидерству.
          </UiText>

          <UiText preset="large" color="role">
            Политик в первую очередь человек действия. Поэтому особенно
            болезненно он воспринимает любое ограничение своей активности.
          </UiText>

          <UiText>
            Проблема, с которой он довольно часто сталкивается, поскольку его
            активность носит довольно противоречивый и сумбурный характер.
          </UiText>

          <UiText color="role">
            Его деятельность предполагает широкий размах и масштабность
            мероприятий.
          </UiText>

          <UiText>
            Исключительно инициативен, может буквально «вломиться» в чужую
            жизнь, в чужие отношения, из-за чего нередко производит впечатление
            наглеца и нахала. Часто бывает бесцеремонен и навязчив.
          </UiText>

          <UiText>
            В стремлении захватить инициативу любой ценой Политик часто
            проявляет себя далеко не лучшим образом, из-за чего иногда попадает
            в неловкую ситуацию, иногда бывает просто жалок или смешон.
          </UiText>

          <UiText>
            Нет ничего больнее для Политика, чем видеть, что все его старания
            завоевать, именно завоевать, авторитет, популярность или
            расположение, приводят к диаметрально противоположным результатам.
          </UiText>

          <UiText>
            К чести Политика, он умеет признавать факт собственных ошибок и
            способен публично признать свою вину, хотя возможно это ему дается
            тяжелее, чем другим.
          </UiText>

          <UiText>
            Было бы неправильно сказать, что для Политика в первую очередь важны
            его амбиции. Для него гораздо обиднее непонимание его добрых
            намерений. В своем праве на лидерство Политик совершенно искренне
            уверен.
          </UiText>

          <UiText>
            Поэтому непризнание его приоритета для него глубоко обидно, так как
            это в первую очередь непризнание его заслуг, его честного
            самоотверженного, творческого, с полной отдачей сил труда.
          </UiText>

          <UiText>
            Если у Лидера лидерство - это стратегический расчет, где любое
            ущемление его амбиций воспринимается как враждебный выпад, Политик,
            в отличие от Лидера, борется не за самоутверждение собственных
            амбиций, а за право оправдать возложенное на него доверие.
          </UiText>

          <UiText>
            Проще говоря, если Лидеру важно ощущение его реальной власти,
            Политику важно добровольное признание и доверие. Лидеру важно
            захватить власть, Политику важно удержать лидерство.
          </UiText>

          <UiText>
            Если Лидеру нужна власть, чтобы возглавить систему, то Политику,
            чтобы в первую очередь максимально реализовать свой творческий
            этический потенциал, демократизировать возглавляемую им систему,
            этически усовершенствовать ее. Если стратегия Лидера — стремление
            захватить все сферы влияния, то для Политика важно захватить «пальму
            первенства» во всех сферах своей деятельности: личные достоинства,
            по его мнению, еще больше убеждают окружающих в его праве на
            лидерство.
          </UiText>

          <UiText>
            Если Лидер всегда жестко контролирует захваченную сферу влияния, то
            Политик не всегда замечает, что он вообще захватил какое-то
            пространство.
          </UiText>

          <UiText color="role">
            Следует отметить, что сравнение программных функций Лидера и
            Политика дается для пояснения принципиальных различий в их «волевых
            сенсориках», а вовсе не для того, чтобы указать, кто из них
            «хороший» лидер, а кто «плохой» — у каждого из них своя социальная
            функция, необходимая для реализации в определенной ситуации и в
            определенных общественных условиях.
          </UiText>

          <UiText preset="large" color="role">
            Поступки Политика в первую очередь отличаются быстротой и
            напористостью, немедленной и всесторонней инициативой. Он незаметно
            для себя заполняет все окружающее пространство.
          </UiText>

          <UiText>
            Не всегда замечает, не всегда оценивает методы, которые он
            использует для скорейшего завоевания симпатий: ему важнее удержать
            свой авторитет, и для этого он готов честно и этично отработать
            взятые на себя обязательства.
          </UiText>

          <UiText>
            Проблема Политика еще и в том, что в отличие от Лидера, всегда
            знающего, «как надо», Политик отчетливо знает только «как не надо».
            При всех своих исключительных талантах Политик скорее разрушитель,
            чем созидатель.
          </UiText>

          <UiText>
            В политике он разрушитель тоталитарных и авторитарных систем. В
            искусстве он — смелый новатор, ниспровергающий существующие до него
            устоявшиеся формы.
          </UiText>

          <UiText>
            Он может быть основоположником нового направления в искусстве,
            которое никто кроме него и продолжить не сможет. Подражать — сколько
            угодно, продолжить — нет. Среди представителей этого типа часто
            встречаются яркие творческие индивидуальности, всесторонне одаренные
            личности.
          </UiText>

          <UiText>
            Противоречивость «волевой сенсорики» Политика заключается в самой
            демократичности его единовластия.
          </UiText>

          <UiText>
            Политик искренне ненавидит тиранию и деспотизм, он из тех, чье имя
            пишут «на обломках самовластья». И в то же время он всеми средствами
            стремится не уступать своего влияния.
          </UiText>

          <UiText color="role">
            Признание собственного поражения в этом плане для него особенно
            мучительно. Попытка любой ценой удержать свое влияние нередко
            приводит Политика к отчаянным и противоречивым поступкам, имеющим
            для него часто трагические последствия.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">2 — Творческая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_people" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чувство</UiText>
              <UiText preset="body">Этика отношений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Любые этические отношения Политик в первую очередь строит с позиций
            волевой сенсорики. То есть, как бы они ни развивались, Политик в
            любом случае должен оставаться лидером.
          </UiText>

          <UiText>
            Политик глубоко убежден, что и первое и последнее слово в развитии
            отношений должны оставаться за ним. Он всегда абсолютно уверен в
            своем праве контролировать любую этическую ситуацию, независимо от
            того, является ли он в ней главным лицом или второстепенным.
          </UiText>

          <UiText>
            Несмотря на сравнительно крепкие этические установки, и притом, что
            этика отношений — его сильная творческая функция, нельзя сказать,
            чтобы этические отношения у Политика складывались легко.
          </UiText>

          <UiText>
            Политику вообще ничего не дается легко, потому что он все и всегда
            завоевывает. Проблема Политика в том, что он часто завоевывает то,
            что у него никто и не оспаривает. Он, на свою беду, имеет
            обыкновение завоевывать именно то, что и так по праву принадлежит
            ему.
          </UiText>

          <UiText preset="large" color="role">
            Казалось бы, что мешает Политику просто и естественно воспринимать
            свою природную привлекательность, свое обаяние, легкость и
            непринужденность в общении.
          </UiText>

          <UiText>
            Но в том-то и беда, что Политику нужно постоянное и повсеместное
            признание этих качеств. Более того, ему необходимы доказательства
            признанного первенства, доказательства его неоспоримого влияния.
          </UiText>

          <UiText>
            Причем именно в погоне за этими доказательствами он и умудряется
            растерять все свое «царственное» величие. Иногда создается
            впечатление, что он именно напрашивается на комплименты, насильно и
            неуместно «тянет» на себя внимание, увлекается самолюбованием.
          </UiText>

          <UiText color="role">
            И в области этики Политику недостаточно полупобед: только
            появившись, он должен очаровать всех, обаять всех, «растопить» всех,
            заинтересовать всех или, если нужно, заинтриговать всех.
          </UiText>

          <UiText>
            А если и находится кто-то, кого он совсем не заинтересован к себе
            расположить, то только потому, что этого человека он просто для себя
            никак не рассматривает, он для него, попросту говоря, «пустое
            место».
          </UiText>

          <UiText preset="large" color="role">
            Неудивительно, что при такой этике поведения Политик умудряется,
            независимо от масштабов его деятельности, нажить себе немало врагов.
          </UiText>

          <UiText color="role">
            Причем отношения по схеме друг — недруг у него тоже строятся очень
            контрастно и непоследовательно: вчерашний недруг сегодня «милостиво»
            принимается в число друзей, потому что «так надо», сегодняшний друг,
            уделяющий больше внимания другому субъекту, уже не друг, а
            «предатель».
          </UiText>

          <UiText>
            Политик, пожалуй, единственный, кто в третьей квадре делит отношения
            на «врагов» и «друзей» — Хранитель делит на «своих» и «чужих», а
            интуиты-логики об этом вообще не задумываются.
          </UiText>

          <UiText color="role">
            Именно потому, что этика отношений у Политика формируется под
            влиянием волевой сенсорики, точнее, ее реализует, максимализм
            является ее отличительной чертой.
          </UiText>

          <UiText>
            Но, само собой разумеется, этика Политика не может и не должна быть
            последовательной: реализационная функция — всегда манипулятивная,
            всегда такая, какая нужна программе интеллекта. В случае Политика
            волевая сенсорика — аспект незыблемый, программный, а этика
            отношений только оформляет «расстановку сил»: меняется силовое
            соотношение — меняется и этика.
          </UiText>

          <UiText preset="large" color="role">
            К тем, кого Политик уважает и чьего расположения добивается, — одно
            отношение, к тем, кого «в грош не ставит», — другое. В том-то и
            проблема этики Политика, секрет быстрейшего наживания им врагов — в
            его непоследовательном этическом максимализме.
          </UiText>

          <UiText>
            Как надолго Политик «застревает» в фазе вражды или дружбы, зависит
            только от конкретной ситуации. Но разумеется, Политик не отступит,
            пока не прояснит ее для себя окончательно, точнее, он отступит,
            только будучи убежденным, что отношения окончательно развалились и у
            него нет шансов их исправить.
          </UiText>

          <UiText color="accent">
            Исправить, в понимании Политика, значит снова завоевать авторитет.
            Неважно, что именно он делает — просит ли прощения или устраивает
            скандал: это не более чем средство «выправить» ситуацию любым
            способом.
          </UiText>

          <UiText preset="large" color="role">
            Этичность Политика, уже в силу своей манипулятивности, всегда
            относительная, несмотря на крепкие этические установки.
          </UiText>

          <UiText>
            То есть в какой-то определенной ситуации Политик вполне может
            осознавать, что поступает нехорошо (более того, он всегда знает, как
            надо бы поступить), но у него всегда находится «убедительное»
            оправдание собственным неэтичным поступкам.
          </UiText>

          <UiText>
            Неэтичность в поступках других Политик всегда замечает, но далеко не
            всегда осуждает и даже не всегда по этому поводу высказывается. К
            чести Политика надо признать, что он способен относиться с юмором к
            чужим этическим несовершенствам.
          </UiText>

          <UiText preset="large" color="role">
            Постоянно борется за расширение сферы своего этического влияния. Его
            можно считать своего рода «этическим захватчиком».
          </UiText>

          <UiText>
            Но действия Политика в зоне своего влияния сумбурны,
            непоследовательны и зачастую неэтичны. Постоянно меняется этическая
            тактика, меняются «доверенные лица», меняются друзья-враги,
            постоянно смещаются центры волевого давления и эмоционального
            воздействия.
          </UiText>

          <UiText>
            Политик менее всего осознает, что все происходящее — это только
            реакция на какие-то его конкретные действия. Чем больше он суетится,
            тем больше накаляется ситуация, тем больше он теряет стратегические
            ориентиры в своих этических отношениях.
          </UiText>

          <UiText>
            В конце концов он совсем запутывается, кто ему сейчас кем является,
            и вот он уже ведет свой этический «ближний бой», свою какую-то
            узкоколейную «челночную» дипломатию, какие-то примитивные
            полудетские интриги. Похоже, никто не умеет так «творчески» портить
            свои отношения, как это удаëтся самому Политику.
          </UiText>

          <UiText preset="large" color="role">
            В любом случае, как бы ни расценивались его поступки, Политик
            искренне хочет «чтобы все было как лучше».
          </UiText>

          <UiText>
            Он действительно старается как можно лучше все уладить, чтобы все им
            были довольны, старается для всех быть хорошим. Такая позиция
            приводит либо к противоречивым действиям с его стороны, либо к
            отсутствию каких-либо решительных действий, что только усугубляет
            его этические проблемы.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">3 — Ролевая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_ideas" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Мысль</UiText>
              <UiText preset="body">Интуиция возможностей</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Программная волевая сенсорика постоянно требует информации по
            аспекту интуиция возможностей.
          </UiText>

          <UiText>
            Политику необходимо наиболее точно оценить возможности и способности
            каждого человека, входящего в круг его общения, поскольку
            собственное представление об успехе у него выстраивается
            относительно потенциальных возможностей и успехов его окружения.
          </UiText>

          <UiText>
            Политику всегда важно знать, на какой стадии реализации своих планов
            находятся окружающие его люди.
          </UiText>

          <UiText color="accent">
            Например, в процессе учебы Политик постоянно интересуется, не
            отстает ли он от других в выполнении учебных заданий. Более того, он
            всегда старается сдать работу одним из первых, старается обратить на
            себя внимание преподавателей, создать о себе впечатление
            перспективного специалиста.
          </UiText>

          <UiText>
            В любой ситуации Политик заранее интересуется позитивными
            возможностями.
          </UiText>

          <UiText color="accent">
            Например, еще до окончания учебы он старается выяснить все возможные
            варианты распределения рабочих мест, ищет для себя какие-то полезные
            деловые связи, интересуется возможностями других студентов.
          </UiText>

          <UiText>
            Для получения интересующей его информации развивает высокую
            активность: находит время побеседовать с каждым о планах на будущее.
            При этом старается взять располагающий к откровению «задушевный»
            тон, доверительно сетуя на какие-то свои еще не решенные проблемы.
          </UiText>

          <UiText color="role">
            Любит производить впечатление человека, который в курсе всех
            событий, иногда может намекнуть, что у него «все схвачено». Часто,
            явно преувеличивая, говорит о своем влиянии. Не прочь приврать или
            «поблефовать».
          </UiText>

          <UiText preset="large" color="role">
            Для Политика очень важно с самого начала общения определить
            потенциал человека: иногда Политик оценивает человека относительно
            его субъективных способностей, иногда — относительно занимаемого им
            места в обществе, иногда — по внешнему виду.
          </UiText>

          <UiText>
            На основании приблизительной оценки ситуации и потенциала
            действующих лиц Политик подчас позволяет себе довольно далеко
            выходить за рамки допустимых этических норм.
          </UiText>

          <UiText color="role">
            Интуиция потенциальных возможностей подсказывает ему, к кому и как
            можно относиться, кто и как себя поведет, кто способен постоять за
            себя, а кто — нет.
          </UiText>

          <UiText>
            Иногда Политик позволяет себе весьма вызывающее поведение, которое у
            него называется «говорить правду в глаза». Но поскольку понятие о
            правде у Политик весьма относительное, хотя бы потому, что это его
            личная точка зрения, наиболее точное, с психологической точки
            зрения, объяснение его «поискам правды» — это не что иное, как
            желание этически и интуитивно «прощупать» ситуацию. Желание узнать,
            сойдет ли ему с рук то, что он сейчас делает, и как отреагируют на
            такую «правду в глаза».
          </UiText>

          <UiText>
            Политик не выносит неопределенности. Поэтому иногда он специально
            ускоряет кризис ситуации, чтобы сделать в ней новую расстановку сил
            и понять свое место в системе отношений. Понять, кто есть кто, как
            его воспринимают и за кого «его держат».
          </UiText>

          <UiText>
            К счастью для себя и своего дуала Критика, в условиях
            неопределенности отношений Политик не всегда замыкается на одном
            партнере. В этот период он может открыть для себя «второй фронт».
          </UiText>

          <UiText>
            Подсознательно настроенный на уязвимую этику эмоций Бальзака,
            Политик побаивается выяснять те отношения, которыми он особенно
            дорожит, опасается эмоционально «давить» на партнера. Поэтому для
            перераспределения излишней эмоциональной активности ему нужен своего
            рода «запасной вариант», который его отвлекает и делает менее
            зависимым от «основного варианта».
          </UiText>

          <UiText>
            Тактика «второго фронта» вынуждает Политика лукавить, хитрить,
            выкручиваться из неловких ситуаций, а он всего этого не любит — ему
            это неудобно: это унижает его достоинство, противоречит его
            этическим принципам, главные из которых — порядочность, честность и
            преданность.
          </UiText>

          <UiText preset="large" color="role">
            Кроме того, слабая интуиция возможностей ему этого не позволяет: он
            всегда боится уличения во лжи, боится, что невольно выдаст себя, что
            проговорится, что это станет каким-то образом известно его партнеру.
          </UiText>

          <UiText>
            И тем не менее, поскольку он не всегда способен последовательно
            выяснять отношения со всеми своими партнëрами, неопределенность
            ситуации часто вынуждает его маневрировать между ними — он просто не
            видит для себя другого выхода.
          </UiText>

          <UiText>
            Анализ возможностей ситуации у Политика часто бывает слишком
            поверхностный или слишком оптимистичный, поскольку он собирает
            информацию не из самых авторитетных источников и оценивает ее не
            самым критичным образом.
          </UiText>

          <UiText color="accent">
            Например, многие представители этого типа безоговорочно верят
            средствам массовой информации, даже если те распространяют
            совершенно неправдоподобные слухи.
          </UiText>

          <UiText>
            Иногда Политик разыгрывает роль человека, уверенно глядящего в
            будущее, видящего для себя и для других массу возможностей. Часто он
            и сам при этом воодушевляется и старается воодушевить окружающих.
          </UiText>

          <UiText>
            Однако, столкнувшись с первыми реальными, объективными
            препятствиями, о своем «воодушевлении» забывает так, как будто его
            никогда и не было. Тогда уже начинается лихорадочный поиск
            возможного выхода из затруднительного положения.
          </UiText>

          <UiText>
            Ошибка по аспекту «интуиции возможностей» обходится Политику очень
            дорого: в лучшем случае — это отдельные неприятные ситуации, в
            которые он рискует попасть, в худшем — это крах всей его карьеры.
          </UiText>

          <UiText>
            Поэтому Политик очень старается не сделать ничего такого, что
            впоследствии обернулось бы против него. И хотя он никогда не бывает
            до конца уверенным в своей интуиции, тем не менее он стремится ее
            постоянно развивать с тем, чтобы иметь возможность безошибочно на
            нее полагаться.
          </UiText>

          <UiText>
            Наиболее полную помощь по этому аспекту Политик все-таки получает от
            своего дуала Бальзак, который не только умеет предвидеть самое
            неблагоприятное развитие событий, но и может в мягкой и деликатной
            форме предостеречь от возможных неприятностей.
          </UiText>

          <UiText preset="large" color="role">
            А заодно и подскажет способ их избежать.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">4 — Болевая функция.</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_logic" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Теория</UiText>
              <UiText preset="body">Структурная логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Политику трудно быть объективным, поскольку он находится в плену
            своих этических установок, своих симпатий и антипатий.
          </UiText>

          <UiText>
            Его поступки могут противоречить здравому смыслу хотя бы потому, что
            чаще всего они отражают его эмоциональное отношение к происходящему.
          </UiText>

          <UiText>
            Иногда в поведении Политика как бы смещается логическая значимость
            его поступков, он поступает вопреки здравому смыслу, основываясь на
            каких-то примитивных логических стереотипах только потому, что «так
            принято поступать».
          </UiText>

          <UiText>
            Причем, руководствуясь своими логическими стереотипами, он часто
            поступает в ущерб своим этическим принципам: например, разрушает
            сложившиеся хорошие отношения со своими близкими только потому, что
            реагирует так, как принято логически, по общим понятиям, а не так,
            как он это чувствует этически: скажем, ругает за то, за что надо, в
            общепринятом, стереотипном понимании, ругать, хвалит за то, за что
            надо хвалить.
          </UiText>

          <UiText>
            Иногда это выражается в привычке пользоваться поверхностными
            логическими (и этическими) стереотипами, действовать в соответствии
            с этими лозунгами и изрекать их по поводу и без повода: «жалость
            унижает человека», «боятся — значит уважают», «ревнует — значит
            любит», «где постелил, там и спи», «женщина не должна проявлять
            инициативу»…
          </UiText>

          <UiText color="role">
            Иногда это логически смещенные интонации и акценты в речи. Иногда
            это этически неоправданная мимика.
          </UiText>

          <UiText preset="large" color="role">
            Иногда это смещенные или неустойчивые интересы к воспринимаемой
            информации.
          </UiText>

          <UiText color="accent">
            Например: слушая объяснения, Политик часто отвлекается от главной
            мысли, его вдруг начинают интересовать какие-то совершенно
            второстепенные моменты или несущественные частности. Незаметно для
            себя, он уходит в сторону от основной темы или отвлекает вопросами
            второстепенной значимости. Либо вопросами, которые вовсе не имеют
            отношения к обсуждаемому предмету.
          </UiText>

          <UiText preset="large" color="role">
            Еще одна характерная для представителей этого типа черта:
            способность по поводу и без повода отвлекаться от заданной темы на
            разговоры о себе.
          </UiText>

          <UiText>
            Заниматься классификацией понятий или знаний, приводить их в
            стройную систему — для Политика скучная и муторная работа.
          </UiText>

          <UiText preset="large" color="role">
            Ему трудно сосредоточиться на логическом анализе какого-либо
            явления, трудно сосредоточиться для последовательного понимания
            логических выводов, трудно самому изложить что-либо последовательно:
            он может начать объяснение прямо с середины и продолжать его,
            постоянно возвращаясь к начальным и промежуточным стадиям.
          </UiText>

          <UiText>
            Таким образом, в изложении Политика некоторые даже простые
            объяснения представляются весьма запутанными.
          </UiText>

          <UiText>
            Поверхностность представлений о многих явлениях его не смущает — он
            считает это естественным.
          </UiText>

          <UiText>
            Главное, чтобы обсуждаемый предмет был хоть отдаленно, но знаком:
            нельзя же производить впечатление полной некомпетентности.
          </UiText>

          <UiText preset="large" color="accent">
            Очень осторожен в высказываниях, касающихся правовой или технической
            стороны дела, не рискует показаться необъективным или
            некомпетентным.
          </UiText>

          <UiText>
            Не любит изучать инструкции и правила — ему это скучно.
            Представитель этого типа может неоднократно пережигать
            электроприбор, включая его, не ознакомившись с инструкцией. Известен
            случай «неудачной» чистки памяти компьютера, после которой оказались
            стертыми все заложенные в него программы.
          </UiText>

          <UiText>
            И как бы ни был печален его личный опыт, все равно Политику трудно
            изменить себя, и он часто полагается не на инструкцию, в которой
            редко и мало что понимает, а на удачу, везение и на свою интуицию,
            несмотря на то, что она его довольно часто подводит.
          </UiText>

          <UiText>
            Опыт чужих ошибок тоже не всегда производит на него достаточное
            впечатление. Политик может сколько угодно совещаться и
            консультироваться, но в конечном счете поступит по-своему, наперекор
            всем советам и здравому смыслу.
          </UiText>

          <UiText>
            Политика отличает исключительная способность постоянно «набивать
            шишки» на одном и том же месте. Глубоко страдать, мучиться и
            спрашивать у всех и каждого, почему это всякий раз происходит именно
            с ним, и какие недостатки ему нужно в себе изжить для того, чтобы
            эти напасти наконец прекратились.
          </UiText>

          <UiText>
            Требуются колоссальное терпение и выдержка, качества, присущие его
            дуалу Критику, чтобы приучить Политика анализировать опыт прошлых
            ошибок, как раз то, чего Политик, вопреки желанию окружающих, делать
            решительно отказывается, и не просите, и не уговаривайте. Он
            поступал и поступает только, как ему заблагорассудится, а иначе он
            просто не может быть самим собой.
          </UiText>

          <UiText preset="large" color="role">
            Для Политика серьезную проблему представляет необходимость тщательно
            продумывать свои поступки, вести себя осмотрительно и рассудительно.
          </UiText>

          <UiText>
            Замечаний в нелогичности собственных действий он не переносит.
            Требование быть последовательным в своих действиях выводит его из
            себя. Для него характерно поступать умно и логично только до тех
            пор, пока этого от него не требуют, пока его уважают и с ним
            считаются.
          </UiText>

          <UiText>
            Но стоит только акцентировать внимание на его нелогичности, как все
            его действия сразу же перестают логически контролироваться и
            приобретают характер беспорядочной, панической суеты.
          </UiText>

          <UiText preset="large" color="role">
            Обвинения Политика в нелогичности только усугубляют его проблемы.
          </UiText>

          <UiText color="role">
            Сам Политик очень болезненно переносит любую критику в свой адрес, а
            поскольку требования к себе у него бывают довольно завышенными, ему
            трудно признать при наличии всех своих достоинств такой недостаток,
            как небезупречная логика.
          </UiText>

          <UiText>
            Политику вообще хочется быть человеком без недостатков. А кому этого
            не хочется? Поэтому Политик очень переживает, когда его умственным
            способностям дают невысокую оценку. Ему очень трудно позволить себе
            не быть самым умным, хотя это лучшее, что он может для себя сделать.
          </UiText>

          <UiText>
            Следует заметить, что Политику легче быть последовательным и
            логичным в своих поступках после того, как он разобрался в
            возможностях ситуации,последовательность работы функции.
          </UiText>

          <UiText>
            Для Политика поступать разумно — это значит поступать благоразумно,
            предусмотрительно, дальновидно. Чем основательнее он будет
            информирован по аспекту интуиция возможностей, тем легче ему
            поступать логически продуманно.
          </UiText>

          <UiText color="role">
            Словом, для того, чтобы в поступках Политика было меньше
            противоречий и суеты, нужно поставить его в определенный
            психологический режим, в котором он будет получать достаточную
            информацию по интуиции возможностей, поддержку по интуиции времени
            и, что очень важно, отсутствие критики по аспекту логики
            соотношений.
          </UiText>

          <UiText>
            То есть Политику необходима психологическая поддержка Критика. Его
            умение показать перспективы ситуации в такой форме, чтобы они
            Политика не напугали и не ввергли в панику, показать возможный запас
            времени, чтобы отвлечь его от суеты и создать ему условия для
            обстоятельного логического анализа. Критик умеет находить самые
            простые и доступные пониманию формы объяснений.
          </UiText>

          <UiText color="role">
            Он очень методичен в своих объяснениях, умеет иллюстрировать их
            удачными примерами. Умеет подвести собеседника к нужному логическому
            выводу, предоставляя ему самому радоваться собственному открытию.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">5 — Внушаемая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_time" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чутьё</UiText>
              <UiText preset="body">Интуиция времени</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Своих проблем по этому аспекту Политик не скрывает. Да и как их
            скроешь, когда и так ясно, что времени при всей его исключительной
            активности ему никогда не хватает.
          </UiText>

          <UiText>
            И откуда ему взяться, если принять во внимание способность Политика
            одновременно начинать множество дел, каждое из которых требует
            больших затрат времени и труда.
          </UiText>

          <UiText>
            Поэтому он предпочитает вообще об этом не задумываться: делает то,
            что ему сейчас хочется, и тратит на это столько времени, сколько
            того требует дело. Старается работать быстро, предпочитает не
            застревать на каком-то этапе работы, чтобы успеть сделать как можно
            больше, старается не усложнять себе работу.
          </UiText>

          <UiText color="role">
            Если возникают какие-то неясности, Политик переключается на другое
            дело. Главное для него — все время продвигаться вперед, не застревая
            на частных проблемах.
          </UiText>

          <UiText color="accent">
            Увлекаясь процессом работы, Политик часто не замечает ее
            бесперспективности. Поэтому он иногда боится задумываться о том, что
            будет дальше или что произойдет потом.
          </UiText>

          <UiText>
            Политику легче жить сегодняшним днем, не задумываясь о будущем. Хотя
            за сегодняшнее легкомыслие ему и приходится дорого расплачиваться
            впоследствии, он предпочитает видеть в своем будущем только то, что
            для себя желает. Поэтому информацию о возможных проблемах он
            воспринимает очень неохотно, несмотря на то, что осознает всю ее
            важность.
          </UiText>

          <UiText preset="large" color="role">
            Политик очень не любит ждать. Ему это невероятно трудно — он слишком
            деятелен и потому слишком нетерпелив. Ему хочется всего сейчас и
            поскорее.
          </UiText>

          <UiText>
            Случается, что ему еще и некогда думать или просто не хочется
            тратить время на размышления.
          </UiText>

          <UiText>
            Критик задает ему размеренный жизненный темп, учит его жить по
            принципу «поспешай медленно». Охлаждает непомерную горячность
            Политика, успокаивает его: «Время даст ответы на все вопросы»,
            «время все расставит по местам». И именно таким «объяснением»
            Политик как раз и внушается. У него вдруг возникает желание (а
            иногда и любопытство) терпеливо «досмотреть», чем же все это
            кончится.
          </UiText>

          <UiText>
            Иногда Политик размышляет о том, «правильно» он сейчас живет или
            «неправильно». Как его сегодняшние поступки отразятся на его будущей
            судьбе и что он должен изменить сейчас для того, чтобы в будущем для
            него все сложилось благополучно.
          </UiText>

          <UiText preset="large" color="role">
            Сами по себе размышления на эту тему для него очень утомительны и
            болезненны. Поэтому он предпочитает заблаговременно получать готовую
            информацию по этому аспекту.
          </UiText>

          <UiText>
            Иногда у него возникает желание «навести порядок» в своей
            сегодняшней жизни с тем, чтобы подготовить себе благополучное
            будущее. Тогда ему становится необходим анализ последствий каждого
            своего шага и каждого действия.
          </UiText>

          <UiText>
            Политику важно знать, что с ним произойдет после того, как он
            предпримет тот или иной шаг.
          </UiText>

          <UiText color="accent">
            Ему действительно часто необходима инструкция: «пойдешь направо —
            коня потеряешь…»
          </UiText>

          <UiText>
            Самой природой ему ниспослан для этого такой дуал, как Критик. Никто
            лучше него не сумеет предсказать дальнейший исход событий в
            зависимости от тех или иных обстоятельств. Нужно только рассказать
            Критику «что было», а «что будет и чем сердце успокоится», он уже
            расскажет сам.
          </UiText>

          <UiText>
            От Критика Политик может получить наиболее точную информацию о
            своевременности и целесообразности любого своего начинания, получить
            представление о последствиях каждого своего действия, увидеть
            отражение своих сегодняшних поступков в далеком и недалеком будущем.
          </UiText>

          <UiText>
            Такой род информации для Политика всегда ценен и актуален, а Критик
            в этом вопросе не имеет себе равных. Благоразумным,
            предусмотрительным и дальновидным Политик может быть только
            благодаря своевременным предостережениям и прогнозам Критика.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">
            6 — Активационная функция
          </UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_business" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Практика</UiText>
              <UiText preset="body">Деловая логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Политик — человек исключительной деловой активности и
            работоспособности. Исключительно вынослив, усерден.
          </UiText>

          <UiText>
            С готовностью берется за любую работу, не считаясь с затратами
            времени и сил. Если обстоятельства того требуют, он берется и за
            физически тяжелую работу, сопряженную с опасностями и трудностями.
          </UiText>

          <UiText>
            Для Политика, как и для любого представителя третьей квадры очень
            важно реализовать свой творческий потенциал, важно осознавать
            востребованность своего труда. Поэтому Политик весьма
            активизируется, берясь за конкретно выполнимое дело. И чем более ему
            понятен способ его выполнения, тем больше энтузиазма и активности он
            проявляет.
          </UiText>

          <UiText>
            Политик часто производит впечатление человека, который все умеет.
            Действительно, он довольно быстро осваивает новые специальности —
            точнее, новые ремесла. Причем, раз освоенное им уже не забывается.
          </UiText>

          <UiText preset="large" color="role">
            Активно используя свои разносторонние способности и таланты, Политик
            легко находит возможность для дополнительных и необременительных
            заработков.
          </UiText>

          <UiText>
            Политик всегда «и швец, и жнец, и на дуде игрец». За какую бы
            практическую работу он ни взялся, все делает быстро, легко, как бы
            играючи.
          </UiText>

          <UiText>
            Политик включается в работу очень активно, сам процесс работы его
            привлекает больше, чем подготовка к ней.
          </UiText>

          <UiText>
            Рассуждая о выполнении какой-то работы, выдвигает возможные варианты
            в надежде, что кто-то со стороны выберет лучший и возьмется за его
            реализацию, но, войдя в работу, предпочитает уже не размышлять о
            разных вариантах: разрабатывает тот, который первым пришел в голову.
          </UiText>

          <UiText>
            К критике своих ошибок относится болезненно, но счастлив, когда его
            работа чем-то выгодно отличается от других. Не любит скрупулезно
            проверять результаты работы — предпочитает, чтобы за него это сделал
            компетентный и надежный партнер, который и проверит, и успокоит, и
            сделает полезные замечания.
          </UiText>

          <UiText>
            Необходимость прорабатывать детали его часто угнетает и раздражает.
            Иногда не дает себе времени основательно разобраться в теоретическом
            материале — предпочитает разбираться в процессе работы, попутно
            советуясь на каждом этапе, вызывающем у него затруднения.
          </UiText>

          <UiText color="role">
            Заинтересован в существенных, конструктивных замечаниях. С большим
            вниманием выслушает советы по поводу рационального выполнения его
            работы, но очень не любит, когда критикуют конечный результат. Ему
            удобно работать по четко разработанным и легко запоминающимся
            методикам.
          </UiText>

          <UiText preset="large" color="role">
            В быту довольно практичен, умеет рационально вести хозяйство.
          </UiText>

          <UiText>
            С интересом выслушивает информацию о способах удачного вложения
            денег, о возможности сделать выгодное приобретение. В этом вопросе
            для него нет более ценного консультанта, чем его дуал Критик,
            который всегда предостережет Политика от неразумных денежных трат,
            не даст ему увлечься каким-нибудь авантюрным проектом, отговорит его
            от слишком быстрого и потому сомнительного способа обогащения.
          </UiText>

          <UiText>
            От Критика Политик получает по каждому вопросу четкую информацию:
            что нужно делать, в какой последовательности и нужно ли это делать
            вообще.
          </UiText>

          <UiText color="role">
            На базе такой информации у Политика возникает уверенность в
            правильности своих действий, ощущение покоя и порядка в жизни,
            понимание того, что его силы и энергия расходуются разумно и
            целенаправленно.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">7 — Функция защиты</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_comfort" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Комфорт</UiText>
              <UiText preset="body">Сенсорика ощущений</UiText>
            </span>
          </div>
          <UiText preset="large" color="role">
            Никогда не позволит себе Политик выглядеть хуже других. Всегда умеет
            себя эффектно преподнести, хотя к своему внешнему виду относится
            довольно придирчиво и критично.
          </UiText>

          <UiText>
            Независимо от уровня своих доходов, Политик одевается со вкусом.
            Часто имеет собственный, иногда довольно экстравагантный, стиль, с
            которым может быть он сам в глубине души и не согласен, но считает
            необходимым его придерживаться, чтобы иметь возможность обратить на
            себя внимание.
          </UiText>

          <UiText>
            Политик и внешне стремится выгодно отличаться от других: яркость
            своей внешности он считает непременным условием собственного успеха.
          </UiText>

          <UiText>
            Комфорт и бытовые удобства Политик считает непременным условием
            нормального существования. В организации собственного быта
            руководствуется в первую очередь требованием оптимальных удобств. К
            оформлению быта относится без особого снобизма: чистота, уют,
            удобство — его основные эстетические критерии. Разумеется, в его
            доме все должно быть не хуже, чем у других.
          </UiText>

          <UiText>
            Эстетика для Политика — сфера реализации многочисленных его талантов
            и способностей. У него довольно четкие и определенные эстетические
            критерии, хотя многим они кажутся спорными. Эстетически Политик
            всегда логичен, его художественный стиль всегда оправдан.
            Экстравагантность для Политика не более, чем способ творческого
            самовыражения.
          </UiText>

          <UiText preset="large" color="role">
            Искусство — область, где творческие успехи Политика наиболее заметны
            и находят наиболее яркое и полное выражение. Здесь он более всего
            стремится к безупречной работе и именно здесь его мастерство
            заслуженно получает наиболее высокую оценку.
          </UiText>

          <UiText>
            Политику свойственна высокая физическая активность и выносливость.
            На проблемах своего самочувствия предпочитает не сосредотачиваться.
            Любит активный, насыщенный впечатлениями отдых.
          </UiText>

          <UiText>
            Очень жизнелюбив. Его жизнелюбия с избытком хватает и на него
            самого, и на его дуала Критика.
          </UiText>

          <UiText preset="large" color="role">
            Ни при каких обстоятельствах Политик не теряет природного оптимизма
            и вкуса к жизни.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">8 — Фоновая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_emotions" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Желание</UiText>
              <UiText preset="body">Этика эмоций</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Эмоции Политика в первую очередь подсознательно оформляют его
            манипулятивную этику отношений. То есть эмоции выражаются именно
            такие, какие, по мнению Политика, требует данная ситуация.
          </UiText>

          <UiText>
            Именно поэтому Политик выражает всегда нужное, опять же, по его
            мнению, эмоциональное отношение к происходящему. Если у него
            праздник, значит, всем нужно веселиться, и он первый будет стараться
            поднять общее настроение.
          </UiText>

          <UiText>
            Хотя не всегда считает себя обязанным брать на себя роль
            массовика-затейника.
          </UiText>

          <UiText>
            Если какая-то проблема, значит, шутки в сторону, и он первый со
            свойственным ему эмоциональным напором постарается ускорить ее
            разрешение.
          </UiText>

          <UiText preset="large" color="role">
            Политик великолепно умеет решать свои проблемы методом
            эмоционального воздействия, как любой этик.
          </UiText>

          <UiText>
            Но поскольку мера его воздействия реализуется подсознательно и
            сориентирована на проблемную эмоциональность Критика, —
            эмоциональное воздействие Политика всегда не слишком серьезное и не
            очень драматичное.
          </UiText>

          <UiText>
            Это своего рода этическая игра, выражающая нужный в данный момент
            эмоциональный импульс.
          </UiText>

          <UiText>
            Политик себя считает достаточно сильным человеком, чтобы самому
            справиться с собственными проблемами. Поэтому его эмоциональное
            воздействие на партнера не является сигналом экстремальности
            ситуации, как, например, у Энтузиаста — это только форма его
            эмоциональной манипуляции партнером: с одной стороны, себя
            подзарядить, с другой — партнера раскачать. А его дуал Критик
            эмоционально «раскачивается» очень тяжело.
          </UiText>

          <UiText preset="large" color="role">
            Эмоциям Политика, особенно в юном возрасте, свойственна такая
            «детская преувеличенность».
          </UiText>

          <UiText color="role">
            Часто их выражение предваряется восторженными или испуганными
            восклицаниями. Иногда эмоциональным потоком Политик пользуется в
            случае невозможности что-либо обстоятельно объяснить:
          </UiText>

          <UiText color="accent">
            «Ах, ну как ты так можешь! Ой, ну как ты не понимаешь! Ну что же это
            такое!»
          </UiText>

          <UiText>
            В зрелом возрасте эмоции Политика больше подчиняются системе его
            отношений, и уже реже являются способом самостоятельного выражения
            его настроений. Во всяком случае, жизненный опыт, а также удачная
            дуализация, приучает Политика быть осторожнее и сдержаннее в
            выражении своих эмоций.
          </UiText>

          <UiText>
            Общение с Критиком, умеющим пригасить излишнюю, неоправданную,
            пылкость, идет Политику только на пользу — исчезает его
            эмоциональная инфантильность, которая на протяжении всей его жизни
            действительно мешает ему выглядеть величественно.
          </UiText>

          <UiText>
            Сдержанность эмоций, воспитанная Критиком, только облагораживает
            Политика, она придает особую значимость его высказываниям и
            поступкам и выгодно работает на его авторитет.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
