import type { IntertypeDataType } from "@types";

const ACTIVITY: IntertypeDataType = {
  id: "activity",
  name: "Активации",
  alternativeName: "Откровенность",
  shortDescription: "Поощрение активности друг друга",
  lvl: "+5",
  positiveTags: [
    "Откровенность",
    "Зарядка",
    "Активность",
    "Игривость",
    "Эмоциональный подъем",
    "Захватывающее интенсивное общение",
    "Откровенность",
    "Поддержка",
    "Трудовая активность",
  ],
  negativeTags: [
    "Откровенность",
    "Зарядка",
    "Активность",
    "Игривость",
    "Эмоциональный подъем",
    "Захватывающее интенсивное общение",
    "Откровенность",
    "Поддержка",
    "Трудовая активность",
  ],
};

export default ACTIVITY;
