import type { IntertypeDataType } from "@types";

const BENEFICIARY: IntertypeDataType = {
  id: "beneficiary",
  name: "Заказчик",
  alternativeName: "Бессмысленность",
  shortDescription: "Снисходительность",
  lvl: "+2",
  positiveTags: [
    "Удовлетворение",
    "Бессмысленность",
    "Притяжение",
    "Активность",
    "Расширение интересов",
    "Ощущение значимости",
    "Опека",
    "Преданность партнера",
    "Удовлетворение потребностей",
    "Направление активности",
    "Помощь",
    "Раскрытие потенциала",
  ],
  negativeTags: [
    "Неадекватная оценка партнера",
    "Недовольство",
    "Агрессивность",
    "Переутомление",
    "Раздражение",
    "Высокомерие",
    "Прихоти",
    "Предвзятость и завышенные требования",
    "Игнорирование",
    "Пренебрежение",
    "Эгоизм",
  ],
};

export default BENEFICIARY;
