import type { IntertypeDataType } from "@types";

const BENEFICIARY: IntertypeDataType = {
  id: "beneficiary",
  name: "Заказчик",
  alternativeName: "Бессмысленность",
  shortDescription: "Снисходительность",
  lvl: "+2",
  positiveTags: [
    "Притяжение",
    "Активность",
    "Расширение интересов",
    "Ощущение значимости",
    "Опека",
    "Преданность партнера",
    "Удовлетворение потребностей",
    "Направление активности",
    "Помощь",
    "Раскрытие потенциала",
  ],
  negativeTags: [
    "Притяжение",
    "Активность",
    "Расширение интересов",
    "Ощущение значимости",
    "Опека",
    "Преданность партнера",
    "Удовлетворение потребностей",
    "Направление активности",
    "Помощь",
    "Раскрытие потенциала",
  ],
};

export default BENEFICIARY;
