import type { IntertypeDataType } from "@types";

const CONTRARY: IntertypeDataType = {
  id: "contrary",
  name: "Погашение",
  alternativeName: "Скука",
  shortDescription: "Неустойчивая дистанция",
  lvl: "−3",
  positiveTags: [
    "Сильное притяжение",
     "Взаимное любопытство", 
     "Интересное общение",
     "Решение проблем"
    ],
  negativeTags: [
    "Внутреннее недовольство", 
    "Тревога", 
    "Напряжение",
    "Обиды",
    "Изнурительные бесплодные споры",
    "Раздражение",
    "Нервозность",
    "Агрессивность",
    "Озлобленность",
    "Сарказм",
    "Черствость",
    "Придирчивость",
    "Нетактичность",
    "Преувеличивание недостатков",
    "Угнетение",
    "Унижения",
    "Издевательства",
    "Бурные стычки",
    "Отсутствие взаимопомощи",
    "Усталость",
    "Полный разлад",
    "Психические и психосоматические нарушения",
  ],
};

export default CONTRARY;
