import type { IntertypeDataType } from "@types";

const DUAL: IntertypeDataType = {
  id: "dual",
  name: "Дуальные",
  alternativeName: "Взаимодополнение",
  shortDescription: "Полное дополнение",
  lvl: "+7",
  tags: ["Взаимопомощь", "Баланс", "Искренность", "Взаимопомощь", "Удовлетворение потребностей", "Глубокое содержательное общение", "Полное взаимопонимание", "Энергетическое насыщение", "Подъем настроения", "Общность ценностей", "Защита друг друга", "Активность", "Уравновешенность", "Самовоспитание", "Творческое развитие"],
};

export default DUAL;
