import type { IntertypeDataType } from "@types";

const GIVER: IntertypeDataType = {
  id: "giver",
  name: "Подзаказный",
  alternativeName: "Подталкивание",
  shortDescription: "Исполнительность",
  lvl: "+1",
  positiveTags: [
    "Подталкивание",
    "Благосклонность",
    "Притяжение",
    "Сочувствие",
    "Восхищение партнером",
    "Задор",
    "Насыщение энергией",
    "Забота",
    "Поддержка",
    "Стремление принести удовольствие",
    "Развитие",
    "Ответственность",
    "Самореализация",
  ],
  negativeTags: [
    "Подталкивание",
    "Благосклонность",
    "Притяжение",
    "Сочувствие",
    "Восхищение партнером",
    "Задор",
    "Насыщение энергией",
    "Забота",
    "Поддержка",
    "Стремление принести удовольствие",
    "Развитие",
    "Ответственность",
    "Самореализация",
  ],
};

export default GIVER;
