import type { IntertypeDataType } from "@types";

const GIVER: IntertypeDataType = {
  id: "giver",
  name: "Подзаказный",
  alternativeName: "Подталкивание",
  shortDescription: "Исполнительность",
  lvl: "+1",
  positiveTags: [
    "Самореализация",
    "Подталкивание",
    "Благосклонность",
    "Притяжение",
    "Сочувствие",
    "Восхищение партнером",
    "Задор",
    "Насыщение энергией",
    "Забота",
    "Поддержка",
    "Стремление принести удовольствие",
    "Развитие",
    "Ответственность",
    "Самореализация",
  ],
  negativeTags: [
    "Манипулирование",
    "Услужливость",
    "Заискивание",
    "Унижения",
    "Драматизм",
    "Непонимание со стороны партнера",
    "Зависимость",
    "Неприятие потребностей",
    "Несамостоятельность",
    "Подчиненность",
    "Перенапряжение",
    "Страдания",
  ],
};

export default GIVER;
