import type { IntertypeDataType } from "@types";

const KINDRED: IntertypeDataType = {
  id: "kindred",
  name: "Родственные",
  alternativeName: "Обмен мнениями",
  shortDescription: "Дальние родственники",
  lvl: "-2",
  positiveTags: [
    "Соперничество",
    "Обмен мнениями",
    "Приятное общение",
    "Взаимопонимание",
    "Общие цели",
    "Снятие напряжения и волнения",
    "Успокоение",
    "Отстаивание и защита друг друга",
  ],
  negativeTags: [
    "Соперничество",
    "Обмен мнениями",
    "Приятное общение",
    "Взаимопонимание",
    "Общие цели",
    "Снятие напряжения и волнения",
    "Успокоение",
    "Отстаивание и защита друг друга",
  ],
};

export default KINDRED;
