import type { IntertypeDataType } from "@types";

const KINDRED: IntertypeDataType = {
  id: "kindred",
  name: "Родственные",
  alternativeName: "Обмен мнениями",
  shortDescription: "Дальние родственники",
  lvl: "-2",
  positiveTags: [
    "Соперничество",
    "Обмен мнениями",
    "Приятное общение",
    "Взаимопонимание",
    "Общие цели",
    "Снятие напряжения и волнения",
    "Успокоение",
    "Отстаивание и защита друг друга",
  ],
  negativeTags: [
    "Неприятие методов работы",
    "Скука из-за схожести взглядов",
    "Болезненное восприятие замечаний",
    "Ссоры",
    "Недоверие",
    "Неуважение",
    "Подчеркивание недостатков",
    "Пренебрежение",
    "Застой",
    "Компромиссы и лавирования",
    "Потребность в самостоятельности",
  ],
};

export default KINDRED;
