import type { IntertypeDataType } from "@types";

const PARALLEL: IntertypeDataType = {
  id: "parallel",
  name: "Параллельные",
  alternativeName: "Опустошение",
  shortDescription: "Назревающий конфликт",
  lvl: "−7",
  positiveTags: [
    "Веселье",
    "Ощущение идилии",
    "Шутливое общение",
    "Свободный обмен мыслями",
    "Увлекательные разговоры",
    "Восхищение оригинальностью взглядов",
    "Готовность помочь",
    "Общность взглядов",
  ],
  negativeTags: [
    "Ссоры из-за мелких противоречий",
    "Подчеркивание недостатков",
    "Упреки",
    "Негодования",
    "Обвинения",
    "Подозрительность",
    "Нервозность",
    "Уклонение от обязанностей",
    "Безысходность",
  ],
};

export default PARALLEL;
