import type { IntertypeDataType } from "@types";

const PRAGMATIC: IntertypeDataType = {
  id: "pragmatic",
  name: "Деловые",
  alternativeName: "Сотрудничество",
  shortDescription: "Равные партнеры",
  lvl: "-2",
  positiveTags: [
    "Легкое общение",
    "Взаимопонимание",
    "Подшучивания",
    "Чувство равенства",
    "Ощущение безопасности",
    "Уравновешенность",
    "Искренние похвалы",
    "Расширение знаний и нормативов поведения",
  ],
  negativeTags: [
    "Легкое общение",
    "Взаимопонимание",
    "Подшучивания",
    "Чувство равенства",
    "Ощущение безопасности",
    "Уравновешенность",
    "Искренние похвалы",
    "Расширение знаний и нормативов поведения",
  ],
};

export default PRAGMATIC;
