import type { IntertypeDataType } from "@types";

const PRAGMATIC: IntertypeDataType = {
  id: "pragmatic",
  name: "Деловые",
  alternativeName: "Сотрудничество",
  shortDescription: "Равные партнеры",
  lvl: "-2",
  positiveTags: [
    "Восхищение интеллектом",
    "Сотрудничество",
    "Легкое общение",
    "Взаимопонимание",
    "Подшучивания",
    "Чувство равенства",
    "Ощущение безопасности",
    "Уравновешенность",
    "Искренние похвалы",
    "Расширение знаний и нормативов поведения",
  ],
  negativeTags: [
    "Угнетение",
    "Давление",
    "Насмешки и уколы по слабым местам",
    "Борьба за лидерство",
    "Неприятие целей и ценностей",
    "Скука",
    "Навязывание своего понимания",
    "Нездоровая конкуренция",
    "Деловая напряженность",
    "Перекладывание ответственности",
  ],
};

export default PRAGMATIC;
