import type { IntertypeDataType } from "@types";

const QUASIDENTICAL: IntertypeDataType = {
  id: "quasidentical",
  name: "Квазитождество",
  alternativeName: "Заблуждение",
  shortDescription: "Сосуществование при непонимании",
  lvl: "−1",
  positiveTags: [
    "Интерес",
    "Заблуждение",
    "Дискуссии",
    "Сонаправленный интерес",
    "Интерес к взглядам и знаниям друг друга",
    "Восхищенность интеллектом",
    "Готовность помочь",
  ],
  negativeTags: [
    "Усложнение простых вещей",
    "Желание делать все по-своему",
    "Трудности во взаимопонимании",
    "Непонимание и осуждение",
    "Обиды",
    "Равнодушие",
    "Подозрения в ненадежности и измене",
    "Скрытое недовольство",
    "Удары по самолюбию",
    "Долгие споры",
    "Непринятие суждений партнера",
    "Поучения «как не нужно делать»",
  ],
};

export default QUASIDENTICAL;
