import type { IntertypeDataType } from "@types";

const SEMIDUAL: IntertypeDataType = {
  id: "semidual",
  name: "Полудуальные",
  alternativeName: "Поддержка",
  shortDescription: "Неполное дополнение",
  lvl: "+2",
  positiveTags: [
    "Поддержка",
    "Оценка",
    "Легкий контакт",
    "Увлеченное общение",
    "Уверенность",
    "Многообразие тем",
    "Повышение тонуса и работоспособности",
    "Защита и поддержка в начинаниях",
  ],
  negativeTags: [
    "Поддержка",
    "Оценка",
    "Легкий контакт",
    "Увлеченное общение",
    "Уверенность",
    "Многообразие тем",
    "Повышение тонуса и работоспособности",
    "Защита и поддержка в начинаниях",
  ],
};

export default SEMIDUAL;
