import type { IntertypeDataType } from "@types";

const SUPEREGO: IntertypeDataType = {
  id: "superego",
  name: "Суперэго",
  alternativeName: "Переутомление",
  shortDescription: "Уважение друг к другу",
  lvl: "−5",
  positiveTags: [
    "Восхищение способностями", 
    "Переутомление", 
    "Расположение",
    "Взаимоуважение",
    "Интересный обмен мыслями",
    "Восхищение манерами и поведением",
    "Быстрое решение вопросов",
    "Желание высказать точку зрения и возбудить к себе интерес",
    "Оказание конкретной помощи"
  ],
  negativeTags: [
    "Соперничество", 
    "Непонимание", 
    "Недоверие",
    "Трения",
    "Необходимость подстраиваться",
    "Невольное причинение боли",
    "Унижения",
    "Обиды",
    "Пустые обещания",
    "Споры",
    "Желание отдалиться и не помогать",  
    "Взаимная глухота",
    "Претензии в том, что партнер делает все назло",
    "Ссоры",
    "Отсутствие поддержки в делах",
    "Навязывание своей точки зрения",
    "Непонятность логики поведения",
    "Умалчивания о намерениях",
    "Критика",
    "Ощущение подвоха",
    "Острые конфликты",
    "Отчуждение",
  ],
};

export default SUPEREGO;
