import type { IntertypeDataType } from "@types";

const SUPERVISOR: IntertypeDataType = {
  id: "supervisor",
  name: "Ревизор",
  alternativeName: "Напряжение",
  shortDescription: "Строгость",
  lvl: "−2",
  positiveTags: [
    "Самоуважение",
    "Напряжение",
    "Самосовершенствование", 
    "Значимость",
    "Благотворительная опека", 
    "Увлечение партнером", 
    "Помощь", 
  ],
  negativeTags: [
    "Неуважительные замечания", 
    "Пренебрежение", 
    "Придирки",
    "Указывание на недостатки",
    "Повышенная требовательность",
    "Упреки",
    "Прихоти",
    "Обвинения",
    "Оскорбления",
    "Насмешки",
    "Самодовольство",
    "Упрямство",
    "Недооценка и унижение партнера",
    "Тревога",
    "Стремление перевоспитывать",
    "Презрение",
    "Беспокойство",
    "Перенапряжение",
    "Раздражение",
    "Моральные издевательства",
  ],
};

export default SUPERVISOR;
