import type { IntertypeDataType } from "@types";

const UNDERLING: IntertypeDataType = {
  id: "underling",
  name: "Подревизный",
  alternativeName: "Перегрузка",
  shortDescription: "Нервное обучение",
  lvl: "−3",
  positiveTags: [
    "Значимость",
    "Перегрузка",
    "Стимул", 
    "Самоценность",
    "Интересное общение", 
    "Умение прощать", 
    "Восхищение партнером",
    "Благосклонность и уважение",
  ],
  negativeTags: [
    "Усложнение проблем", 
    "Подчиненность и зависимость", 
    "Навязчивость",
    "Несамостоятельность",
    "Непонимание со стороны партнера",
    "Претензии",
    "Стремление перевоспитывать",
    "Придирчивость",
    "Обидчивость",
    "Преувеличение недостатков",
    "Впечатлительность",
    "Уязвимость",
    "Ранимость",
    "Безысходность",
    "Изнурения",
    "Страдания",
  ],
};

export default UNDERLING;
