<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <div class="warning">
      <UiText preset="body" color="accent">
        Описания не должны обязательно совпадать со всеми чертами характера
        личности.
      </UiText>

      <UiText preset="small" color="accent">
        Идея как раз описать наблюдаемые у среднего представителя типа
        особенности поведения и обработки информации психикой.
      </UiText>
    </div>

    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Велта Микелсоне"
          subtitle="8 минут"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Вера Стратиевская"
          subtitle="20 минут"
          target-content-id="tab-2"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText preset="subtitle" color="role">
            Один из самых любознательных соционических типов во всем соционе.
          </UiText>

          <br />

          <UiText>
            Свойственно живое мышление и бесконечное фантазирование,
            генерирование идей и умение подсказать путь их реализации. Постоянно
            бывает чем-то увлечен. Часто идеи опережают настоящее время.
          </UiText>

          <UiText>
            Возможно, они будут приняты спустя много лет. Среди них — основатели
            многих наук и новых направлений в науки.
          </UiText>

          <UiText preset="large" color="role">
            Склонен изучать абстрактные вопросы и явления.
          </UiText>

          <UiText>
            В любой момент готов обсудить разные события и процессы. Умеет
            применять личный опыт в своих исследованиях, в результате рождаются
            новые замыслы.
          </UiText>

          <UiText>
            Своим рассеянным взглядом он ищет новые возможности, как будто
            постоянно оценивая, что можно, а что нельзя,где есть смысл, а где —
            нет.
          </UiText>

          <UiText>
            Благодаря быстрой реакции, поразительно быстро улавливает суть
            вещей, чем удивляет других. Из-за своей сообразительности, бывает
            ему трудно дослушать долгую речь, прерывает разговор, поскольку уже
            давно догадался, о чем идет речь.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Его социальная роль — исследователь.
          </UiText>

          <UiText>
            Он находит всестороннюю информацию обо всем, что его интересует.
            Предвидит причины различных событий, распознает их на раннем этапе.
            Его прогнозы о развитии процессов часто близки к истине. Способен
            провести следственный анализ.
          </UiText>

          <UiText preset="large" color="role">
            Чувствует повороты событий, взвешивает их и умеет выработать план
            действий.
          </UiText>

          <UiText>
            Его задача — предоставить идею, но не воплотить её в жизнь, для этой
            цели ему нужна команда.
          </UiText>

          <UiText>
            Важно подтвердить свою уникальность. Иногда он преувеличивает её,
            отстаивая везде свою правду, иногда действуя очень агрессивно.
          </UiText>

          <UiText>
            Полемика и творческие дискуссии — его интеллектуальное развлечение,
            в течении которого он может анализировать, понять и выразить свою
            теорию.
          </UiText>

          <UiText>
            Умело разделяет все данные по определенным признакам, устанавливает
            связь между ними и связывает их воедино.
          </UiText>

          <UiText>
            Способен уловить взаимную связь, казалось бы, между абсолютно
            разными явлениями, доказать абсолютно всё. Всегда готов участвовать
            в обсуждении сложных вопросов, но не всем приемлем и понятен стиль
            его изложения мысли.
          </UiText>

          <UiText>
            Рационализатор, любую идею умеет адаптировать, чтобы можно было её
            использовать по назначению. Созданные логические структуры гибки,
            при необходимости легко поддаются изменениям.
          </UiText>

          <UiText color="accent">
            Часто является руководителем исследовательских институтов. Там, где
            царит дух творчества, у него складываются дружелюбные и равноправные
            отношения.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">Творческая личность</UiText>

          <UiText>
            Следует отметить, что руководящая работа не является творческой.
            Если он руководитель, у него часто возникают затруднения при решении
            этических и хозяйственных проблем.
          </UiText>

          <UiText>
            Создает впечатление решительного человека с силой воли, в
            чрезвычайных ситуациях не прислушивается к другим и действует
            самостоятельно, что создает проблемы в общении. Он не переносит
            ограничения, горячо защищает только свои взгляды, но для
            руководителя такие качества неуместны. Но нельзя сказать, что
            остается равнодушным в случаях столкновения, он делает анализ своих
            действий, сравнивает с другими.
          </UiText>

          <UiText>
            Фактически он не стремится к власти, так как считает, что власть
            отбирает у человека свободу. Он — не тот человек, который желает
            конкурировать с кем-нибудь, поскольку он не умеет форсировать
            процесс.
          </UiText>
        </section>

        <section>
          <UiText>
            Делает все возможное, чтобы освободиться от хозяйственных работ,
            которые он считает мелочами, мешающими ему работать творчески.
          </UiText>

          <UiText>
            Он как бы показывает, что человека более интересуют предметы, чем
            люди, с которыми он вовсе не обязательно желает общаться.
          </UiText>

          <UiText preset="large" color="role">
            Не способен долго сердиться.
          </UiText>

          <UiText>
            Рьяно защищает свой образ жизни. Если его пытаются подчинить или
            ограничить, его действия могут быть непредсказуемы. По этой причине
            его считают неуравновешенным человеком с тяжелым характером.
          </UiText>

          <UiText>
            Трудно требовать, чтобы он вел себя этично, таким образом ситуация
            может лишь ухудшиться. Если ему выразить замечания, он может
            высказать то, от чего другим станет стыдно.
          </UiText>

          <UiText preset="large" color="role">
            Своё поведение не меняет до старости и остается вечным ребенком.
            Поддается на клевету, в таких ситуациях он беззащитен перед
            интригами.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            При общении с незнакомыми людьми — осторожен, спокоен и внимателен.
          </UiText>

          <UiText>
            Обычно он не инициатор в отношениях, хотя у него большой круг
            знакомых, большинство выбрали его сами.
          </UiText>

          <UiText preset="large" color="role">
            Часто не может ответить, кто его лучший друг. Поскольку он любитель
            обсуждать интересные события, согласен вокруг себя собрать многих.
            Спокойная обстановка соблюдается до тех пор, пока все его слушают и
            согласны с его мнением.
          </UiText>

          <UiText>
            Вопросы человеческих взаимоотношений ему не ясны. Определяет, как к
            нему относятся, создавая провокационные ситуации, в которых как бы
            экспериментирует с людьми.
          </UiText>

          <UiText>
            Как демократ, желающий не потерять свой круг знакомых, легко обещает
            свою помощь. Из-за своей рассеянности обещанное забывает, поэтому
            лучше всего обещанное просить у него сразу.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            При общении с незнакомыми людьми — осторожен, спокоен и внимателен.
          </UiText>

          <UiText>
            Обычно он не инициатор в отношениях, хотя у него большой круг
            знакомых, большинство выбрали его сами.
          </UiText>

          <UiText preset="large" color="role">
            Часто не может ответить, кто его лучший друг. Поскольку он любитель
            обсуждать интересные события, согласен вокруг себя собрать многих.
            Спокойная обстановка соблюдается до тех пор, пока все его слушают и
            согласны с его мнением.
          </UiText>

          <UiText>
            Вопросы человеческих взаимоотношений ему не ясны. Определяет, как к
            нему относятся, создавая провокационные ситуации, в которых как бы
            экспериментирует с людьми.
          </UiText>

          <UiText>
            Как демократ, желающий не потерять свой круг знакомых, легко обещает
            свою помощь. Из-за своей рассеянности обещанное забывает, поэтому
            лучше всего обещанное просить у него сразу.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            С трудом понимает чувства партнера, он не умеет сохранить отношения.
          </UiText>

          <UiText>
            Потому что он не умеет вести себя тонко и чутко. Не умеет бороться
            за партнера, так как боится ошибиться.
          </UiText>

          <UiText preset="large" color="role">
            Не скряга, он не гонится за богатством и деньгам. Со всем, что у
            него есть, способен делиться и помогать другим, бывает что отдает
            почти последнее. Он бескорыстный человек.
          </UiText>

          <UiText>
            Его трудно считать хозяйственным. Этим объясняется буквальная
            неспособность заниматься домашними обязанностями. Также ему
            свойственна нерешительность в делах, которые могут принести выгоду.
            Особенно мужчины не находят применение своим способностям, поскольку
            не умеют себя дисциплинировать.
          </UiText>

          <UiText color="accent">
            Будучи руководителем, не способен направлять своё учреждение для
            получение регулярной прибыли. Не способен дать материальную оценку
            своей работы — излишне её преувеличивая и таким путем отпугивая
            возможного клиента. Иногда способен работать вообще за «спасибо».
          </UiText>

          <UiText>
            Без помощи партнера обрастает многочисленными бытовыми проблемами —
            он не в состоянии сам привести в порядок окружающее его
            пространство. Тяжело удаëтся создать уют вокруг себя. Но бытовой
            хаос фактически мало его волнует, потому что не требователен к нему.
          </UiText>

          <UiText>
            Одинокий Новатор может долго не замечать, сыт ли он или голодный,
            холодно ли ему или он перегрелся, заболел ли он. Другая крайность —
            отсутствие ощущения своего тела. Это часто вызывает проблемы со
            здоровьем.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Ему необходимо, чтобы кто-то регулярно заботился о нем. Только тогда
            он полностью расслабляется.
          </UiText>

          <UiText>
            Человек с естественным тонким чутьем и полный положительных эмоций
            легко поймет его потребности и настроение. Если этого не хватает,
            способен потерять жизнерадостность, увлечься искусственными
            стимуляторами.
          </UiText>

          <UiText>
            Обычно удлиненное выражение лица с тонкими чертами, спина часто
            напоминает половину буквы «C». Предпочитает авангардный стиль
            одежды, который многим не нравится. Женщина не умеет подчеркнуть
            женственность, часто предпочитает мужской стиль одежды.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            У него случаются частые спады настроения.
          </UiText>

          <UiText>
            В его присутствии не полагается обсуждать тему, касающуюся его
            лично. Психологический дискомфорт отражается на лице, после чего
            появляется нервное поведение, иногда даже истерика. Не умеет
            словесно выразить самочувствие.
          </UiText>

          <UiText>
            Не способен жить в одиночестве, у него собираются веселые компании.
            Чаще всего он устраивает тусовки у себя или организует их на другом
            месте.
          </UiText>

          <UiText>
            Туманное представление о том, что значит вовремя. Ему не получается
            считаться со временем других людей, и также он не умеет порадовать
            других своим прибытием вовремя.
          </UiText>

          <UiText preset="large" color="role">
            Когда увлекся какой-то очередной идеей, он вкладывает в это
            буквально всю энергию, работает днем и ночью, даже забывая поесть.
          </UiText>

          <UiText>
            Часто его увлечения связаны с исследованием катастроф, стихийных
            бедствий, массовой гибели людей и других судьбоносных событий. Ему
            интересно изучать причины возникновения всего возможного. Он как
            никто другой интересуется устройством и существованием мира, а также
            интересуется концом света.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Скептически относится к политике и религии: не признает ритуалов,
            идолов, колдовства.
          </UiText>

          <UiText>
            Его нельзя назвать доверчивым, недалеким. Он не совершает
            необдуманных поступков, не понимает людей не имеющих собственного
            мнения.
          </UiText>

          <UiText>
            Иногда он становится безразличным, избегает людей, погружается в
            полнейшее бездействие и пессимизм. В такие моменты не нуждается в
            сочувствии от других. Считает, что сам способен выбраться из этого
            положения.
          </UiText>

          <UiText>
            Погружается в дело, которое привлекло его внимание и кажется
            интересным, способен дать совет, как повернуть его в нужном
            направлении.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Отсутствует талант накапливания вещей и денег.
          </UiText>

          <UiText>
            Иногда заработанные деньги израсходует бесцельно. В доме держит
            только самые необходимые бытовые приборы.
          </UiText>

          <UiText>
            В вопросах, касающихся практической стороны жизни, предпочитает
            обращаться за советами. Часто меняет место работы. Важно начинать
            работу с начала, а не подключиться с середины. Не терпит, когда его
            работа подвергается контролю.
          </UiText>

          <UiText preset="large" color="role">
            Он не переносит однообразную работу, быстро надоедает все привычное
            и знакомое.
          </UiText>

          <UiText>Долго работает лишь в умственной деятельности.</UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="small" color="accent">1 — Базовая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_ideas" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Мысль</UiText>
              <UiText preset="body">Интуиция возможностей</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Отсутствует талант накапливания вещей и денег.
          </UiText>

          <UiText>
            Для Новатора изучение любого предмета - это в первую очередь
            изучение открывающихся перед ним перспектив. Умение увидеть
            возникающие в любой области новые возможности - сильнейшая и
            характернейшая его черта.
          </UiText>

          <UiText>
            Мечтатель и фантазер, увлекающийся своими идеями и увлекающий ими
            других. Безучастность окружающих к его собственному замыслу
            воспринимается им крайне болезненно.
          </UiText>

          <UiText>
            Его раздражают люди, не умеющие и не желающие мечтать. Приземленные
            «реалисты», воспринимающие его мечты как пустые и никчемные
            фантазии, рискуют обрести в его лице ярого и непримиримого
            противника.
          </UiText>

          <UiText>
            Мысль и фантазия для Новатора — две вещи неразделимые. Размышляя, он
            фантазирует, фантазируя — размышляет.
          </UiText>

          <UiText preset="large" color="role">
            Проявляют феноменальные способности в самых различных областях
            интеллектуального творчества, генерируя идеи, высказывая гипотезы,
            на несколько столетий опережающие достижения современной им эпохи.
          </UiText>

          <UiText>
            Трудно переоценить их вклад в развитие интеллектуальной деятельности
            общества. Выдающиеся представители этого типа по праву считаются
            основоположниками многих научных направлений.
          </UiText>

          <UiText>
            Открывать новые горизонты и новые перспективы во всех областях
            научной, творческой и общественно-политической деятельности — таково
            их высшее предназначение.
          </UiText>

          <UiText>
            Поражает их способность с непостижимой быстротой понимать самую суть
            вещей. Менее всего нуждается в том, чтобы ему «раскладывали по
            полочкам» объясняемое.
          </UiText>

          <UiText>
            Чрезвычайно раздражается, когда его принимают за тугодума. Чаще
            всего сам «регулирует темпы» восприятия нового материала:
            подсказывает собеседнику, что все сказанное он уже понял, и можно
            продолжать изложение.
          </UiText>

          <UiText preset="large" color="role">
            Постигая смысл нового явления, он уже размышляет о возможностях его
            применения.
          </UiText>

          <UiText preset="small" color="accent">
            В детстве, в школьные годы представитель этого типа часто производит
            впечатление ученика, мыслями отсутствующего на уроке. Причем
            учитель, как правило, менее всего догадывается, что смысл нового
            материала ученик давным-давно понял. И теперь лишь самостоятельно
            его обдумывает, отключившись от раздражающих его объяснений,
            рассчитанных на «тугодумных идиотов» и тормозящих его собственную
            творческую мысль, несравнимо более важную и интересную, чем
            примитивные примеры школьного учителя.
          </UiText>

          <UiText>
            Едва успев открыть для себя новые возможности, Новатор начинает
            активизировать окружающих на новые и оригинальные проекты. Причем и
            сам активно участвует в их разработке, впоследствии допуская к их
            реализации и других.
          </UiText>

          <UiText>
            Не любит подолгу застревать на одном и том же проекте, на одной и
            той же идее, но было бы ошибкой считать его человеком неустойчивых
            интересов.
          </UiText>

          <UiText>
            Теряет интерес к своему проекту только в нескольких случаях: если
            уже не видит никаких возможностей для его реализации или если
            реализация этого проекта входит в свою завершающую фазу, а в это
            время на его пути оказывается новая, более перспективная идея.
          </UiText>

          <UiText>
            Весьма характерно быстрое переключение на новые, более интересные
            проекты. В его понимании нецелесообразно тратить время на то, что
            почти до конца уже продумано, в то время как постоянно расширяются
            горизонты новых возможностей, открывающие доступ к новым идеям и
            теориям.
          </UiText>

          <UiText>
            Увлекаясь чем-либо, Новатор не способен отвлекаться на другое
            занятие. Поэтому мало сказать, что он предпочитает заниматься только
            тем, что ему интересно, — Новатор не в состоянии заниматься тем, что
            ему не интересно. Можно с уверенностью утверждать, что вынужденное
            обучение какому-нибудь обязательному предмету для любого из
            представителей этого типа — мучительная пытка и прямое насилие над
            самим собой.
          </UiText>

          <UiText preset="large" color="role">
            Интуиция и вдохновение — его подлинные и тщательно оберегаемые
            ценности. В любой ситуации отстаивает свое право действовать так,
            как подсказывают ему интуиция и вдохновение.
          </UiText>

          <UiText>
            Всевозможные инструкции, руководства, директивы и циркуляры —
            определенно не для него. График работы в его понимании — это насилие
            над вдохновением. С какой стати он должен генерировать свои идеи в
            какие-то определенные часы?!
          </UiText>

          <UiText>
            Весьма характерно быстрое переключение на новые, более интересные
            проекты. В его понимании нецелесообразно тратить время на то, что
            почти до конца уже продумано, в то время как постоянно расширяются
            горизонты новых возможностей, открывающие доступ к новым идеям и
            теориям.
          </UiText>

          <UiText>
            Будучи увлеченным своей работой, способен проявлять исключительное
            усердие и чудеса работоспособности, но в тот период, когда идея еще
            не созрела и только обдумывается, Новатор может производить
            совершенно ошибочное впечатление человека, изнывающего от безделья.
          </UiText>

          <UiText>
            На самом же деле, где бы он ни находился и с кем бы ни общался, спит
            он или бодрствует, его мысль способна уловить любой, казалось бы,
            самый незначительный импульс, который, возможно, мог бы
            заинтересовать его, а в дальнейшем найти отражение в его идеях,
            гипотезах, теориях и проектах.
          </UiText>

          <UiText preset="large" color="role">
            Любая новая информация может стать источником неистощимого
            вдохновения. Его интеллектуальное творчество — это постоянный и
            непрерывный процесс.
          </UiText>

          <UiText>
            Если Новатор хотя бы на полчаса или на час перестал генерировать
            идеи — значит он либо заболел, либо переутомился. В любом случае это
            очень тревожный симптом.
          </UiText>

          <UiText preset="large" color="role">
            Всегда дерзкая фантазия в сочетании с неутомимым и пытливым умом.
          </UiText>

          <UiText>
            Смело разрушая все отжившие и нежизнеспособные системы, он
            раздвигает перед современниками горизонты будущего, считая своим
            долгом уже сегодня размышлять о проблемах, которые возникнут перед
            человечеством завтра.
          </UiText>

          <UiText>
            Идеи, теории и проекты, в мире которых живет и существует Новатор,
            при всей своей кажущейся фантастичности лично ему представляются
            реально осуществимыми и ни в коем случае не оторванными от
            действительности, поскольку основаны на реальной информации и на
            понимании реальной сути вещей.
          </UiText>

          <UiText>
            В силу этих причин многие представители этого типа считают себя
            истинными реалистами и категорически не согласны с тем, чтобы о них
            отзывались как о наивных фантазерах и пустых мечтателях.
          </UiText>

          <UiText>
            Имеет обыкновение щедро раздаривать свои идеи. И чем щедрее он их
            раздаривает, тем больше их генерирует. А поскольку Новатор лучше чем
            кто-либо другой понимает, что невозможно объять необъятное, он
            скорее согласится с тем, чтобы его идею разработал и запатентовал
            кто-нибудь другой, чем позволит своему «детищу» погибнуть на корню,
            так и не развившись в сколько-нибудь серьезный проект.
          </UiText>

          <UiText>
            Поэтому лучшее, что может желать для себя Новатор-теоретик, — это
            получить возможность руководить научным коллективом, разрабатывающим
            широкомасштабные и перспективные проекты.
          </UiText>

          <UiText>
            Их идеи, как правило, рассчитаны на то, чтобы осчастливить все
            человечество или хотя бы какую-то его часть — именно поэтому они
            выглядят в глазах современников наивными мечтателями.
          </UiText>

          <UiText preset="small" color="accent">
            История подтвердила возможность реализации практически всех идей
            Новаторов, а то обстоятельство, что не всякая их теория удачно
            реализовалась, объясняется отдельными просчетами как их самих,
            склонных по мере возможности игнорировать факты, неблагоприятные для
            популяризации развиваемой ими теории, так и просчетами реализаторов
            их теорий, нередко переиначивающих идеи Новаторов в своекорыстных
            целях.
          </UiText>

          <UiText preset="large" color="role">
            Круг интересов чрезвычайно широк. Причем, незаурядная эрудиция
            поразительным образом сочетается с исключительной глубиной познаний
            в самых различных и подчас не связанных друг с другом областях.
          </UiText>

          <UiText>
            В интеллектуальном плане живет очень широко и насыщенно. Он берет от
            жизни все самое интересное и самое замечательное, а взамен щедро
            одаривает ее плодами своего творчества, которых и современникам с
            избытком хватает, да еще и потомкам немало останется.
          </UiText>

          <UiText>
            Многие представители этого типа наделены великолепной памятью на
            цифры и исторические даты. В любую минуту с поразительной точностью
            могут они процитировать отрывок из какого-нибудь литературного
            произведения или научного труда, могут совершенно свободно
            воспроизвести по памяти любые энциклопедические данные.
          </UiText>

          <UiText preset="large" color="role">
            Любая новая информация, новые методы, новый подход, новые
            возможности воспринимаются им с огромным энтузиазмом.
          </UiText>

          <UiText>
            В силу своего оптимизма он часто рассчитывает на предполагаемый
            наилучший ход событий. Часто думает о том, что должно быть, или о
            том, что могло бы быть, а не о том, что есть на самом деле.
            Реальность вносит в его рассчеты свои коррективы, но, к сожалению,
            не всегда своевременно.
          </UiText>

          <UiText preset="large" color="role">
            Наделен свойством мысленно отрываться от реальности, поскольку
            фантазия и вдохновение могут овладеть им в любое время и в любом
            месте.
          </UiText>

          <UiText>
            Этим же объясняется и его рассеянность, из-за которой он не только
            может забыть, где находится та или иная вещь, но и где находится он
            сам. Новатор может не услышать, что к нему кто-то обращается, не
            увидеть, что рядом с ним вообще кто-то находится.
          </UiText>

          <UiText>
            Он может улыбаться собственным мыслям, разговаривать или спорить с
            самим собой. Может забыть поздороваться, потому что в данный момент
            он вообще не думает о приличиях.
          </UiText>

          <UiText preset="small" color="accent">
            Правила поведения в обществе, равно как и любое другое правило для
            него вовсе не является неоспоримой истиной.
          </UiText>

          <UiText preset="large" color="role">
            Способен на экстравагантную выходку. Причем экстравагантность для
            него является не только способом самовыражения, но и возможностью
            привлечь внимание к своим идеям и теориям.
          </UiText>

          <UiText>
            Его привлекают и интересуют все, кто способен подавать оригинальные
            идеи, кто умеет видеть необычное в обыкновенном и находить скрытые
            возможности там, где, казалось бы, ничего уже невозможно изобрести.
            Все, кто этого не умеют, в его понимании немногого стоят.
          </UiText>

          <UiText>
            Может довольно точно высказываться о характере, способностях и
            возможностях окружающих его людей. К сожалению, далеко не всегда в
            деликатной форме.
          </UiText>

          <UiText preset="large" color="role">
            Способен очень точно оценить интеллектуальный потенциал собеседника.
          </UiText>

          <UiText>
            Умеет и любит развивать свои способности. Причем к этому процессу
            относится очень серьезно. Любая помеха в этом деле воспринимается им
            как ущемление его собственных прав.
          </UiText>

          <UiText>
            Не любит признаваться в собственных ошибках, поэтому всегда находит
            объяснения своим неудачам — чаще всего «списывает» их на других.
          </UiText>

          <UiText>
            Объясняется это тем, что Новатор в первую очередь сам себе не
            прощает собственных просчетов, и потому старается обелить себя в
            глазах окружающих, чтобы не усугублять собственных страданий их
            упреками.
          </UiText>

          <UiText preset="large" color="role">
            Склонен к саморекламе (особенно в молодости) и переоценке
            собственных возможностей. Но в кругу близких друзей может посетовать
            на невезение и собственную неудачливость.
          </UiText>

          <UiText>
            В ситуации психологического дискомфорта, особенно в детском и
            юношеском возрасте, Новатор уходит от реальной действительности в
            область полностью вымышленных фантазий, где и пытается творчески
            реализовать себя: сочиняет фантастические истории про себя и своих
            друзей, рисует одному ему понятные картины, пишет стихи.
          </UiText>

          <UiText>
            Словом, придумывает себе другую жизнь, которая находится как бы по
            другую сторону реальности. В этой другой жизни у него все
            складывается самым удачным образом. Более того, она иногда является
            его главной по сути жизнью.
          </UiText>

          <UiText>
            События и персонажи его выдуманной жизни иногда запоминаются ему
            ярче, чем реальные события. Об этой своей, потусторонней жизни
            предпочитает никому не рассказывать, разве только самым близким и
            понимающим его людям — это его глубокая, тщательно оберегаемая
            тайна.
          </UiText>

          <UiText>
            Очень характерно и неотъемлемо ощущение внутренней свободы и
            независимости. Поэтому его вторая, «нереальная» жизнь включается как
            дополнительное жизненное пространство в тех условиях, когда
            реальность становится невыносимой.
          </UiText>

          <UiText>
            Его нельзя заставить думать «как все», невозможно задвинуть его в
            рамки условностей, придуманных неизвестно кем, невозможно запретить
            ему свободно высказываться.
          </UiText>

          <UiText preset="large" color="role">
            Удобен он окружающим или нет, — он такой, какой он есть. Все
            остальное - проблема тех, кто с ним психологически несовместим.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">2 — Творческая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_logic" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Знание</UiText>
              <UiText preset="body">Структурная логика</UiText>
            </span>
          </div>

          <UiText>
            Для того чтобы принять для себя какую-либо систему ценностей,
            Новатору в первую очередь нужно ее логически понять, логически для
            себя уяснить.
          </UiText>

          <UiText>
            О каждом явлении и «сверхъявлении» он должен иметь четкое логическое
            представление, в противном случае его начинают одолевать различные
            суеверия, он будет чувствовать себя очень нехорошо до тех пор, пока
            не сможет логически себе эти явления объяснить.
          </UiText>

          <UiText preset="large" color="role">
            Предпочитает до всего додумываться своим умом.
          </UiText>

          <UiText preset="small" color="accent">
            Например, если на экзамене не знает доказательства какой-либо
            теоремы, — то может без всяких проблем, доказать ее заново, причем
            своим методом.
          </UiText>

          <UiText>
            Умение мыслить считает качеством наиболее ценным как в себе, так и в
            других.
          </UiText>

          <UiText>
            Интеллектуальному творчеству, развитию интеллектуальных способностей
            придает огромное значение. Будучи преподавателем, считает своим
            долгом в первую очередь воспитывать у студентов умение мыслить — в
            противном случае не представляет себе, как сможет что-либо им
            объяснить.
          </UiText>

          <UiText preset="large" color="role">
            Cильно развито ассоциативное мышление. Причем ассоциации могут быть
            самыми неожиданными.
          </UiText>

          <UiText>
            В своем интуитивном полете мысль Новатора может уноситься в самые
            отдаленные и никак не совместимые друг с другом области.
          </UiText>

          <UiText>
            Спор, полемика для него своего рода интеллектуальное развлечение,
            возможность порассуждать, высказать свои взгляды, привлечь внимание
            к своей теории. Никто так не умеет вовлечь в спор или втянуть в
            дискуссию, как это делает Новатор. Здесь ему нет равных.
          </UiText>

          <UiText>
            Великолепно провоцирует спор — для этого ему достаточно только
            порассуждать вслух в многолюдном месте, а все остальное уже довершит
            экстравагантность его высказываний, как правило, редко оставляющая
            кого-либо равнодушным.
          </UiText>

          <UiText>
            Не всегда ставит своей целью любой ценой навязать собственное
            мнение, хотя и будет очень разочарован, если это ему не удастся.
            Часто вступает в спор не только потому, что процесс спора доставляет
            ему удовольствие, но еще и для того, чтобы ознакомить «широкие
            массы» со своими взглядами и идеями.
          </UiText>

          <UiText preset="large" color="role">
            Выигрывает спор не только благодаря эрудиции, но и благодаря умению
            выставлять самые неожиданные контраргументы — и здесь ему нет
            равных.
          </UiText>

          <UiText>
            Логика Новатора настолько свободна, настолько подвижна и гибка, что
            независимо от уровня собственного образования и невзирая на
            авторитет и эрудицию своего оппонента, Новатор может кого угодно
            поставить в тупик своими контраргументами, может доказать все, что
            ему только хочется или что ему вздумалось доказать.
          </UiText>

          <UiText>
            Может с легкостью сопоставить вещи, которые никому и в голову не
            придет сопоставлять. А почему бы и нет? А кто сказал, что это нельзя
            сравнивать?
          </UiText>

          <UiText preset="small" color="accent">
            Иногда тем труднее спорить с Новатором, чем он менее образован.
          </UiText>

          <UiText>
            Новые идеи у Новатора появляются внезапно, в самый неожиданный
            момент, в процессе любой деятельности: во время еды, во время
            разговора, во время прослушивания музыки, просмотра фильма —
            появляются как результат деятельности его подсознания.
          </UiText>

          <UiText>
            Генерировать идеи он может даже во сне. Причем там же они могут и
            разрабатываться. Иногда проснувшись, Новатор вспоминает приснившиеся
            ему «исходные данные» и размышляет: откуда он их взял? по аналогии с
            чем они возникли?. К своим «разработкам во сне» Новатор относится с
            исключительной серьезностью, как к вполне реальным проектам.
          </UiText>

          <UiText preset="large" color="role">
            Любую, самую невероятную идею может развить в четко сформулированную
            и логически выстроенную теорию.
          </UiText>

          <UiText>
            Причем на основании имеющихся у него фактов и предположений уже
            может увидеть и выявить скрытые в этой теории закономерности.
          </UiText>

          <UiText>
            Результат научной деятельности Новатора часто выражается в создании
            разнообразных логических структур и классификаций. Причем эти
            структуры не статичны, а динамичны и гибки, а потому легко
            модифицируются с появлением новых факторов и обстоятельств.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">3 — Ролевая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_will" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Намерение</UiText>
              <UiText preset="body">Волевая сенсорика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Характерно стремление отстоять и защитить свое право жить так, как
            ему хочется.
          </UiText>

          <UiText>
            Постоянно и повсеместно требует признания своих прав на свободное
            интеллектуальное творчество вне всяких ограничений. Как свободна его
            мысль и фантазия, так же должен быть свободен и он. Свободен от
            всяких условностей, обязанностей, обязательств, претензий — от
            всего, что мешает его интеллектуальному творчеству.
          </UiText>

          <UiText preset="large" color="role">
            В свете таких установок у Новатора возникают серьезные этические и
            правовые проблемы.
          </UiText>

          <UiText>
            Не всякий из его окружения понимает, что в то время как Новатор
            целыми днями лежит на диване и смотрит в потолок, в его голове
            вызревают великие идеи, способные осчастливить все человечество.
          </UiText>

          <UiText>
            В то же время не может и не считает нужным отвлекаться от
            размышления над своими проектами для того, чтобы вспоминать, вымыл
            ли он за собой посуду, как того категорически требуют окружающие.
          </UiText>

          <UiText>
            Его раздражает любое требование окружающих, поскольку отвлекает от
            гениальных, исключительных и уникальных идей на какие-то бытовые
            мелочи. Разумеется, чем мелочнее требования и претензии, тем больше
            они его раздражают.
          </UiText>

          <UiText preset="large" color="role">
            Борется за право избавить себя от этих раздражителей, оградить себя
            от них, поскольку вообще не желает сталкиваться с какими бы то ни
            было помехами на своем творческом пути.
          </UiText>

          <UiText preset="small" color="accent">
            Например, его проекты должны приниматься в том виде, в каком он их
            представляет, причем бесспорно и безоговорочно. Никакой рутинной
            работы, связанной с их описанием и разработкой, требовать от него
            нельзя, поскольку это тормозит его творческую мысль и бесполезно
            расходует его драгоценное время.
          </UiText>

          <UiText>
            У него часто возникает противоречие между завышенными требованиями,
            предъявляемыми им к окружающим, и заниженными требованиями,
            предъявляемыми им к себе.
          </UiText>

          <UiText preset="small" color="accent">
            Например, оценивая чужую работу, он не потерпит даже малейших
            логических просчетов и неточностей, в то время как в своей работе
            может считать допустимой любую логическую ошибку, утверждая, что она
            не влияет существенно на суть его теории.
          </UiText>

          <UiText>
            То же самое происходит и в области прав и обязанностей: на своих
            правах он будет категорически настаивать, не позволяя себе ни
            малейших уступок. И с такой же неуступчивостью он постарается
            оградить себя от каких бы то ни было обязательств.
          </UiText>

          <UiText>
            С выполнением обещанного у Новатора возникают постоянные проблемы:
            когда он дает обещание, он думает только о том, что он, разумеется,
            может это сделать, то есть это в его силах, но он совсем не думает о
            том, что он будет это делать.
          </UiText>

          <UiText>
            Поэтому всякое требование выполнить обещанное Новатора попросту
            злит: неужели кто-то всерьез может рассчитывать, что он будет
            отвлекаться от своих интереснейших дел на какие-то пустяки, которые
            лично его вообще не интересуют.
          </UiText>

          <UiText preset="large" color="role">
            Попытка навязать ему какие-то стабильные обязанности будет
            воспринята им исключительно враждебно.
          </UiText>

          <UiText>
            Воспринята, как чей-то злой умысел: это значит, кому-то не дает
            покоя его внутреннее желание быть свободным в своих делах, мыслях и
            планах. Это значит, кто-то его хочет «запрячь», кто-то на нем хочет
            «воду возить». Вопрос: кто? Кто он, этот злоумышленник?
            «Злоумышленник» очень быстро находится и ему объявляется война «до
            победного конца».
          </UiText>

          <UiText preset="large" color="role">
            В число «злоумышленников» может попасть любой человек из его
            ближайшего окружения.
          </UiText>

          <UiText>
            Это может быть его близкий родственник, супруг, приятель, начальник
            — кто угодно. Бесполезно убеждать его, что эти требования
            предъявляются в его же интересах и для его же удобств — разве может
            кто-то лучше него самого знать его интересы?!
          </UiText>

          <UiText>
            Новатор, сосредотачивающий все свои силы и помыслы на войне с
            «ветряными мельницами», - это всегда трагедия, это всегда грустное и
            неприятное явление.
          </UiText>

          <UiText>
            Неисчерпаемая, богатейшая фантазия, кропотливейшим образом собранные
            «факты», блестяще построенная интрига — все это направляется на то,
            чтобы «подвести под монастырь» бывшего начальника, довести до
            инфаркта бывшую тещу, лишить жилплощади бывшую супругу.
          </UiText>

          <UiText>
            Чувство долга (необходимости, ответственности) воспитывается у
            Новатора через логическое понимание поступить тем или иным образом и
            через наблюдение и логический анализ последствий своих поступков.
            Хотя ему иногда трудно сосредоточиться на таких наблюдениях.
          </UiText>

          <UiText>
            С другой стороны, трудно себе представить Новатора, постоянно
            сосредоточенного на том, чтобы не доставлять окружающим никаких
            неудобств и постоянно отвлекающегося на то, чтобы проверить, не
            забыл ли он помыть за собой посуду и не оставил ли включенным свет в
            туалете — такой Новатор со временем начинает замечать, что
            гениальные идеи посещают его все реже и реже.
          </UiText>

          <UiText>
            Более того, он замечает, что уже вообще не в состоянии
            сосредоточиться на интеллектуальном творчестве настолько, чтобы не
            думать об окружающих его бытовых мелочах. Такой «законфликтованный»
            Новатор представляет собой уже другую, хотя и менее проблематичную,
            но тоже не всегда привлекательную крайность.
          </UiText>

          <br />

          <UiText preset="large" color="role">
            Проблемы решаются тогда, когда у Новатора появляется партнер,
            деликатно и ненавязчиво распределяющий его права и обязанности.
          </UiText>

          <UiText>
            Умеющий сглаживать его конфликты с окружающими, умеющий выражать
            свои требования в такой форме, которая ему кажется убедительной,
            правомерной и необременительной.
          </UiText>

          <UiText>
            Именно таким партнером для Новатора является его дуал (идеально
            дополняющий его партнер) — сенсорно-этический интраверт, Дипломат.
          </UiText>

          <UiText>
            У Дипломата аспект волевой сенсорики находится на позициях
            наблюдательной функции. Дюма очень тонко и чутко подсознательно
            наблюдает, как воспринимает партнер предъявляемые к нему требования,
            какие обязанности он с готовностью берет на себя и как их выполняет.
          </UiText>

          <UiText>
            Дипломат очень тактично, в свойственной ему особенной мягкой и
            деликатной манере регулирует этот аспект, одновременно и
            приспосабливаясь к требованиям партнера, и приучая его считаться с
            возможностями окружающих.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">4 — Болевая функция.</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_people" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чувство</UiText>
              <UiText preset="body">Этика отношений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Отношения с окружающими у Новатора складываются очень нелегко,
            причем на любой дистанции.
          </UiText>

          <UiText preset="small" color="accent">
            Например, заниженные требования к себе наряду с завышенными
            требованиями к другим часто воспринимаются его окружением как
            вопиющая несправедливость.
          </UiText>

          <UiText>
            Привычка завышать собственные способности и одновременно с этим
            презрительно отзываться об интеллектуальном потенциале других людей
            также не вызывает особых симпатий.
          </UiText>

          <UiText>
            Буквально на каждом шагу Новатор создает ситуации, при которых всем
            присутствующим становится крайне неловко за его поведение, не говоря
            уже о его ближайшем окружении, часто готовом сквозь землю
            провалиться от стыда за него.
          </UiText>

          <UiText>
            Такие характерные для Новатора «неловкости» поведения, как
            бесцеремонность, навязчивость, бестактность, граничащая с хамством,
            полнейшее пренебрежение приличиями — все это мелочи по сравнению с
            теми, действительно серьезными проблемами, которые возникают в
            процессе его взаимоотношений на более близкой дистанции.
          </UiText>

          <UiText preset="large" color="role">
            И первая из них заключается в том, что свободу и независимость он, в
            основном, признает только для себя, не оставляя за своим партнером
            иногда даже права на собственное мнение.
          </UiText>

          <UiText>
            В условиях чуть усложнившейся этической ситуации он может сразу же
            поставить партнеру жесткие этические условия, иногда даже в форме
            ультиматума.
          </UiText>

          <UiText preset="small" color="accent">
            Например, уже на начальном этапе знакомства Новатор может
            потребовать, чтобы его подруга порвала отношения со всеми своими
            поклонниками, поскольку желает сразу же оградить ее от всяких
            посторонних влияний, а заодно и себя от возможных соперников.
          </UiText>

          <UiText preset="large" color="role">
            Это происходит по причине логического подхода к вопросам этики, а
            также в силу того, что он вообще не видит дистанции между собой и
            человеком, с которым намеревается близко общаться.
          </UiText>

          <UiText>
            Едва успев завязать отношения, Новатор уже рассматривает своего
            партнера как часть самого себя — из чего делается «логический» вывод
            о том, что партнер теперь уже принадлежит ему целиком и полностью.
          </UiText>

          <UiText>
            Следовательно, теперь уже никакого права выбора и личной свободы у
            партнера не остается, равно как и не может быть несовпадения
            взглядов, поскольку теперь за него решает, думает и выбирает
            Новатор.
          </UiText>

          <UiText preset="large" color="role">
            Посторонний человек еще может иметь некоторую свободу мнений. Это он
            вполне может допустить.
          </UiText>

          <UiText>
            Но что касается партнера, тут все решается им однозначно: партнер —
            это уже часть его самого, и следовательно, должен во всем ему
            подчиняться.
          </UiText>

          <UiText preset="small" color="accent">
            «Партнером» Новатора можно стать уже через 15 минут после знакомства
            с ним и именно потому, что он так решил.
          </UiText>

          <UiText>
            Для Новатора этическая ситуация тем удобнее, чем меньше она дает
            предпосылок для возникновения этических проблем. Поэтому в своем
            стремлении создать беспроблемные (для себя) отношения он может до
            крайней степени ужесточить свои требования к партнеру, контролирует
            его связи, отношения, поведение и образ мыслей.
          </UiText>

          <UiText preset="small" color="accent">
            Впрочем, все вышеописанное происходит, как правило, в условиях
            психологической несовместимости с партнером. Иногда, впрочем, бывает
            и при нарушении дуального равновесия.
          </UiText>

          <UiText preset="large" color="role">
            В условиях психологического дискомфорта Новатор раздражается по
            любому поводу, постоянно испытывая к партнеру неприязнь и недоверие.
            Разумеется, ничем не обоснованные.
          </UiText>

          <UiText>
            Раздражение и неприязнь к партнеру могут возникнуть у Новатора и на
            самом начальном этапе его взаимоотношений. И тем не менее Новатор
            будет стараться эти отношения продолжать, развивать и даже
            настаивать на том, чтобы они были узаконены.
          </UiText>

          <UiText>
            Поступая таким образом, он рассчитывает, что со временем сможет
            создать условия, при которых партнер вынужден будет «переделаться» и
            приспособиться к его взглядам.
          </UiText>

          <UiText>
            Причем, именно супружество как раз и представляется ему таким
            условием. Кроме того, вследствие проблематичной коммуникабельности у
            Новатора всегда трудно складываются отношения с окружающими, и он
            это знает, к этому привыкает и считает такие отношения нормой.
          </UiText>

          <UiText>
            Нравится прилюдно разворачивать диспут на этические темы, особенно,
            если для этого есть подходящий, как ему кажется, повод. Иногда
            создается впечатление, что он обожает привлекать посторонних к
            обсуждению своих личных проблем.
          </UiText>

          <UiText>
            «Разборки» со своим ближайшим окружением — женой, братом, матерью,
            тещей и другими родственниками, Новатор действительно довольно часто
            проводит в многолюдном и совершенно неподходящем для этого месте — в
            общественном транспорте, в гостях, в театре, в учреждении, в
            присутствии посторонних людей или даже общих знакомых, что только
            усугубляет неловкость ситуации.
          </UiText>

          <UiText>
            Причем «провинившийся» вынужден не только краснеть за откровенно
            хамское поведение Новатора, не только выслушивать его оскорбления,
            часто несправедливые и далеко выходящие за рамки приличий, но и
            мучительно страдать от стыда перед окружающими за неловкость самой
            ситуации и за свою причастность к этому человеку.
          </UiText>

          <UiText preset="large" color="role">
            В такие минуты Новатор бывает чудовищно жесток: ситуация интуитивно
            планируется им таким образом, что из нее просто невозможно выйти.
          </UiText>

          <UiText>
            Пока вокруг есть публика — будет продолжаться и эта «публичная
            казнь». Не следует, однако, думать, что «крутые разборки» он
            проводит только в присутствии посторонних — они возможны в любой
            обстановке, но в любом случае Новатор найдет возможность подгадать
            момент, когда его партнер будет особенно беззащитен и уязвим.
          </UiText>

          <UiText>
            Когда его поведение выходит за рамки, допустимые нормами общения,
            его совершенно невозможно призвать к порядку, поскольку это приводит
            к абсолютно противоположному результату.
          </UiText>

          <UiText preset="large" color="role">
            Именно потому, что никаких «норм общения» он в принципе не желает
            признавать, он пользуется любым случаем эти нормы разрушить.
          </UiText>

          <UiText>
            Поэтому, чем более критикуется поведение Новатора, тем большую
            неловкость он испытывает и тем более начинает протестовать против
            предъявляемых к нему этических требований, чем еще более усугубляет
            ситуацию.
          </UiText>

          <UiText>
            Получив замечание по поводу бестактности, он начнет откровенно
            грубить, грубость перейдет в хамство, следующие стадии — откровенный
            цинизм и хулиганство.
          </UiText>

          <UiText>
            Причем направить его реакцию в другое направление можно только в том
            случае, если вовремя перестать осуждать его поступки и найти способ
            его успокоить. А это может сделать только психологически совместимый
            с ним партнер.
          </UiText>

          <br />

          <UiText>
            Это, как правило, удаëтся одному только его дуалу — Дипломату,
            способному очень тонко чувствовать состояние собеседника, умеющему
            вовремя подметить и отрегулировать перепады его настроения.
          </UiText>

          <UiText preset="large" color="role">
            Кроме того, общество Дипломат практически всегда действует на
            Новатора успокаивающе и расслабляюще — состояние, свойственное
            каждому человеку при общении с дуалом.
          </UiText>

          <UiText>
            Обходительный Дипломат оказывает Новатору неоценимую услугу не
            только тем, что смягчает его поведение, но и тем, что смягчает его
            отношения с окружающими.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">5 — Внушаемая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_comfort" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Ощущение</UiText>
              <UiText preset="body">Сенсорика ощущений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Крайне раздражает необходимость самому заботиться о собственном
            комфорте, поскольку это мешает ему думать, работать и отвлекает от
            других более важных дел.
          </UiText>

          <UiText>
            Поэтому Новатор старается организовать отношения с партнером таким
            образом, чтобы вопрос его комфорта решался как-нибудь без его
            участия.
          </UiText>

          <UiText>
            В быту неприхотлив. Когда быт организовывается его собственными
            усилиями, сводит свои потребности к минимуму. Питается где-то на
            стороне — часто у друзей и знакомых. Порядок в доме наводит только
            тогда, когда беспорядок ему действительно мешает работать.
          </UiText>

          <UiText>
            По магазинам ходить не любит, не всегда представляет, что бы ему
            хотелось купить, качество вещей оценивает плохо, не любит
            простаивать в очередях.
          </UiText>

          <UiText>
            Во вкусах консервативен. Предпочитает есть то, что ему привычно, и
            то, что занимает минимум времени на подготовку. Может питаться на
            ходу, всухомятку.
          </UiText>

          <UiText preset="small" color="accent">
            Например, не отрываясь от работы, может есть хлеб, намазанный
            горчицей. Готовит себе редко. Иногда, вдруг, у него может возникнуть
            желание сварить себе что-нибудь такое, чем его кормили в детстве,
            например манную кашу.
          </UiText>

          <UiText preset="large" color="role">
            К новым вкусовым ощущениям относится недоверчиво. Часто доверяет
            вкусу только тех людей, которые вызывают у него симпатию и с
            которыми у него хорошие отношения.
          </UiText>

          <UiText>
            Равно, как и внушается советами только тех людей, которые вызывают у
            него уважение, которым он по-настоящему доверяет и которых «любит».
            Таким людям он часто подражает в привычках, в манерах поведения, во
            вкусах.
          </UiText>

          <UiText>
            Он может одеваться в «папином стиле», настаивать, чтобы ему готовили
            еду «по маминому» рецепту.
          </UiText>

          <UiText>
            Партнер, вызывающий у него антипатию, никогда не сможет угодить его
            вкусам, как бы ни старался.
          </UiText>

          <UiText>
            Причем ссылки на «авторитетный источник» будут только раздражать
            Новатора. Самый авторитетный источник — это человек, к которому он
            хорошо относится.
          </UiText>

          <UiText preset="large" color="role">
            Он должен постоянно чувствовать, что его партнеру доставляет
            удовольствие за ним ухаживать.
          </UiText>

          <UiText>
            Только в этом случае он по-настоящему расслабляется. И наоборот,
            любой намек на то, что о нем заботятся из чувства долга, и что это
            его, в свою очередь, ко многому обязывает, воспринимается Новатором
            исключительно болезненно, поскольку подсознательно он настроен на
            сенсорику и этику Дипломата, для которого дарить удовольствие —
            такая же радость, как и получать его.
          </UiText>

          <br />

          <UiText>
            Аспект сенсорики ощущений у Новатора теснейшим образом связан с
            аспектом этики отношений. Поэтому для полного счастья ему требуется
            партнер, не только наделенный от природы великолепным вкусом, но и
            способный выразить свое хорошее отношение в той форме, которая
            покажется ему убедительной.
          </UiText>

          <UiText preset="large" color="role">
            И это возможно только в случае с его дуалом Дипломатом, у которого
            аспект сенсорики ощущений является программным, а аспект этики
            отношений — демонстративным.
          </UiText>

          <UiText>
            Дипломат исключительно тонко чувствует гармонию цветов, запахов,
            звуков, а свое мнение высказывает, как правило, в деликатной и
            доброжелательной манере. Любая другая форма подачи информации по
            этому аспекту Новатора не убеждает, поэтому никакой другой
            «сенсорик» на воспитание его вкусов не повлияет так, как это сделает
            Дипломат.
          </UiText>

          <UiText>
            В области искусства и эстетики Новатор часто самым интересным
            образом проявляет себя именно с «подачи» Дипломата — как его ученик
            или последователь, причем, непосредственное общение с дуалом тут
            даже не всегда обязательно.
          </UiText>

          <UiText>
            Новатор стремится к восприятию приятных ощущений, поскольку в
            конечном итоге он сориентирован на гармонию ощущений,
            соответствующих сенсорной программе его дуала. Искусство, по мнению
            Новатора, должно доставлять удовольствие. И оно действительно
            доставляет удовольствие, причем не только ему самому, но и его
            зрителям.
          </UiText>

          <UiText preset="small" color="accent">
            Новаторский подход, оригинальность общего замысла, разнообразие
            интересно разработанных тем — вот те основные качества, которыми
            характеризуется художественное творчество представителей этого типа.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">
            6 — Активационная функция
          </UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_emotions" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Желание</UiText>
              <UiText preset="body">Этика эмоций</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Настроение во многом зависит от ощущений, которые он испытывает.
          </UiText>

          <UiText>
            Например, чувство голода делает его не просто раздражительным —
            агрессивным. Новатор очень чувствителен к неприятным ощущениям.
          </UiText>

          <UiText>
            На его настроение может повлиять неприятный, пронизывающий взгляд
            собеседника или властные интонации его голоса. Бесцеремонное
            поведение, равно как и любое проявление неуважения вызывают у него
            приступы внезапного раздражения.
          </UiText>

          <UiText preset="large" color="role">
            Не любит и не умеет открыто говорить о своих эмоциях. Обычно он
            выражает их косвенно, говоря о своих побуждениях.
          </UiText>

          <UiText preset="small" color="accent">
            Например, будучи раздраженным, Новатор может сказать партнеру: «Я
            вышвырну тебя в окно!» — но это вовсе не означает, что он именно так
            и поступит. И это даже не означает крайнюю ненависть — это всего
            лишь раздражение, обычно вызванное какими-то неприятными ощущениями.
          </UiText>

          <UiText>
            Свои симпатии Новатор часто выражает в виде какой-либо позитивной
            информации. Например, он не скажет девушке: «Вы мне нравитесь». Если
            он нечто подобное из себя выдавит, это будет откровенной фальшью.
          </UiText>

          <UiText>
            Обычно он подаëт эту информацию намеком — сообщает девушке, что
            рассказал про нее своим родителям и теперь она приглашена к ним в
            гости. Предложение руки и сердца также делает в форме намека. «Через
            месяц я вернусь из командировки и мы с тобой сможем подать
            заявление».
          </UiText>

          <UiText preset="large" color="role">
            Открыто признаться в своих чувствах он не может, как, впрочем, и
            любой логик, потому что для него это слишком загадочное явление,
            природу которого он не может до конца осознать и объяснить.
          </UiText>

          <UiText>
            Кроме того, для него это слишком интимный момент. Поэтому он будет
            испытывать неловкость и раздражение, если заставить его об этом
            говорить.
          </UiText>

          <UiText>
            Новатор не считает нужным об этом говорить еще и потому, что
            подсознательно сориентирован на очень гибкую и чуткую этику эмоций
            своего дуала Дипломата, способного уловить любые оттенки чувств и
            настроений своего партнера.
          </UiText>

          <UiText>
            Ощущение психологического (или сенсорного) дискомфорта всегда
            сказывается на настроении Новатора. Долгое время пребывать в
            подавленном состоянии он не может, поэтому иногда сам провоцирует
            скандал, дает выход своему раздражению, а заодно и пытается что-либо
            изменить в условиях невыносимой для него обстановки.
          </UiText>

          <UiText preset="large" color="role">
            Очень тяжело переживает нанесенную ему обиду, этическую неловкость
            или ситуацию кризиса отношений.
          </UiText>

          <UiText>
            В этом случае он может бурно изливать свои отрицательные эмоции на
            окружающих, обсуждая наболевшую тему с кем угодно, даже с совершенно
            посторонними людьми.
          </UiText>

          <UiText>
            Может заниматься самокритикой или «этическим самобичеванием»:
            рассказывать о каких-то своих неблаговидных поступках, признаваться
            в супружеских изменах, в каких-то своих «коварных» планах и подлых
            намерениях.
          </UiText>

          <UiText>
            У него начинаются приступы раскаяния и совершенно не контролируемых
            откровений — какого-то мучительного, этического самоочищения. Своего
            рода «этическая рвота», освобождение от каких-то эмоциональных и
            этических «шлаков».
          </UiText>

          <br />

          <UiText>
            Находясь в таком состоянии, Новатор может производить впечатление
            человека несдержанного, неуравновешенного, вспыльчивого,
            агрессивного, жестокого, скандального, но не следует забывать, что
            все это является только следствием испытываемого им психологического
            дискомфорта, это всего лишь болезненная реакция на какие-то
            определенные раздражители, природу которых можно выявить и понять и
            которые можно устранить.
          </UiText>

          <UiText>
            Что, собственно, и делает его дуал Дипломат: в период эмоционального
            кризиса окружает его особенно тщательной заботой, стараясь не
            допускать к нему никаких раздражителей. А также старается
            игнорировать его болезненные «откровения» и ту неприятную
            информацию, которую они в себе несут.
          </UiText>

          <UiText>
            Ситуация коренным образом меняется, когда Новатор попадает в
            обстановку искреннего радушия и доброжелательности. Когда приятные
            ощущения у него сочетаются с положительными эмоциями.
          </UiText>

          <UiText preset="large" color="role">
            Такая обстановка его очень активизирует: он чувствует, что ему
            действительно рады, что он интересен, обаятелен и привлекателен.
          </UiText>

          <UiText>
            У него сразу же появляются уверенность в себе, легкость и
            непринужденность в манерах и в общении. Его поведение становится
            раскованным, свободным и естественным.
          </UiText>

          <UiText>
            Он производит на окружающих благоприятное впечатление. Проявляет
            себя как интереснейший и остроумный собеседник.
          </UiText>

          <UiText preset="large" color="role">
            В такие минуты он чувствует особый эмоциональный подъем, испытывает
            особенное расположение к человеку, у него возникает желание сделать
            для этого человека что-то хорошее.
          </UiText>

          <UiText preset="small" color="accent">
            Такое состояние Новатор испытывает только в условиях общения с
            психологически совместимым партнером.
          </UiText>

          <UiText>
            Благодаря способности Дипломата тонко чувствовать и регулировать
            эмоциональное состояние своего партнера, Новатор попадает в условия
            самого благоприятного и наиболее оптимального для себя
            эмоционального режима.
          </UiText>

          <UiText>
            Ощущение душевного тепла, уюта, покоя, искреннего интереса к себе и
            радушия — все это необходимо Новатору для того, чтобы чувствовать
            себя спокойным и счастливым, и именно это он испытывает, общаясь со
            своим дуалом Дипломатом.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">7 — Функция защиты</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_time" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чутьё</UiText>
              <UiText preset="body">Интуиция времени</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Время Новатора полностью принадлежит его творческой работе. Поэтому
            он раздражается, когда кто-либо распоряжается его временем как
            своим.
          </UiText>

          <UiText>
            Умеет видеть возможности, которые предоставляет ему время, причем не
            только для себя, но и для других, в частности для своего дуала
            Дипломата. Сам видит и всегда подсказывает партнеру, сколько времени
            имеется в его распоряжении для выполнения той или иной задачи.
          </UiText>

          <UiText preset="large" color="role">
            Предпочитает строить далекие планы, корректируемые временем и
            обстоятельствами.
          </UiText>

          <UiText>
            Планировать что-либо в сжатые сроки не любит, поскольку не любит
            спешки, и любой работой занимается до тех пор, пока не иссякнет его
            вдохновение. Распределять количество работы во времени Новатор не
            может, это его слишком стесняет.
          </UiText>

          <UiText>
            Личное время воспринимается им как переменная величина: минуты
            ожидания тянутся до бесконечности, время интересных занятий
            пролетает незаметно.
          </UiText>

          <UiText>
            Расход чужого времени в расчет им обычно не принимается. Имеет
            обыкновение опаздывать, хотя может с точностью до минуты рассчитать
            время, необходимое на дорогу. Обычно в эти расчеты включается время
            на «допустимое опоздание».
          </UiText>

          <UiText>
            С сожалением отмечает упущенное для себя время и нереализованные
            возможности. Всегда готов начать все сначала, не считаясь с
            возрастом и объективными обстоятельствами.
          </UiText>

          <UiText>
            Не любит подводить итоги, поскольку всегда считает, что мог бы
            добиться больших результатов, если бы не какие-то «объективные
            причины», повлиявшие на его успехи и деловую активность.
          </UiText>

          <UiText>
            Многими своими неудачами обязан внутреннему состоянию апатии,
            безволия, энергетического спада, которое его периодически
            охватывает.
          </UiText>

          <UiText preset="large" color="role">
            Ему легче повлиять на неблагоприятные внешние обстоятельства, чем
            что-либо изменить в самом себе.
          </UiText>

          <UiText>
            Всегда в курсе событий общественно-политического значения.
            Предвидеть ход истории умеет как никто другой.
          </UiText>

          <UiText>
            В своих прогнозах, как правило, не ошибается. Решающие политические
            события может предсказать с точностью до полугода.
          </UiText>

          <UiText>
            Из огромного количества информации умеет выбрать и запомнить факты,
            коренным образом влияющие на дальнейшее развитие истории.
          </UiText>

          <UiText preset="large" color="role">
            Всегда наблюдает исторические перемены в интересующей его области.
            Область исторических наблюдений и прогнозов у Новатора связана
            именно с областью его деловых и профессиональных интересов.
          </UiText>

          <UiText preset="small" color="accent">
            Например, если он спортсмен, то всегда может с точностью сказать,
            кто на каких соревнованиях выиграл и с каким результатом, если это
            экономист или финансист, то помнит движение курса валют в ведущих
            странах за последние 100 — 200 лет.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">8 — Фоновая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_business" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Действие</UiText>
              <UiText preset="body">Деловая логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Очень любит советовать по поводу того, как нужно выполнять ту или
            иную работу.
          </UiText>

          <UiText>
            И это обстоятельство часто его подводит, поскольку каждый раз, когда
            он на словах проявляет себя специалистом в каком-нибудь деле, его
            познания производят на окружающих настолько неизгладимое
            впечатление, что ни у кого не возникает и тени сомнения в том, что
            именно он и будет самым лучшим его исполнителем.
          </UiText>

          <UiText>
            Но в том-то и беда Новатора, что прекрасно представляя себе, как в
            принципе делается та или иная работа, он часто не имеет о ней ни
            малейшего практического понятия.
          </UiText>

          <UiText preset="small" color="accent">
            Иными словами, «берется за паяльник не с того конца»,чем очень
            разочаровывает своих работодателей, которые после такого
            «специалиста» не знают уж кого и приглашать и начинают думать, что
            предлагаемая ими работа (как их в этом пытается убедить Новатор) в
            принципе невыполнима.
          </UiText>

          <UiText>
            Новатор не любит включаться в работу на ее завершающем этапе - это
            значит быть простым исполнителем в рамках чужого проекта, а он и
            свои-то проекты до конца прорабатывать не любит.
          </UiText>

          <UiText>
            Но бывает и так, что «вписавшись» в чужой проект, Новатор сразу же
            начинает ощущать его «своим», и тогда у него возникает непреодолимое
            желание изменить всю предыдущую работу по собственному усмотрению, и
            он самым решительным образом на этом настаивает.
          </UiText>

          <UiText preset="small" color="accent">
            Иногда даже может поставить ультиматум: угрожает отказаться от
            участия в работе, если его требование не будет выполнено. Но если в
            результате такого поведения его действительно отстраняют от работы,
            бывает глубоко обижен и несказанно разочарован. Такой вариант
            развития событий он склонен предполагать менее всего.
          </UiText>

          <UiText preset="large" color="role">
            Ему приходится часто менять места работы, и не всегда по
            собственному желанию.
          </UiText>

          <UiText>
            Ему бывает трудно подчиняться требованиям руководства, а в случае,
            если они не совпадают с его собственным мнением, не подчиняется им
            вообще. Иногда старается воспользоваться любой возможностью, чтобы
            выполнить работу по своей методике и тем самым доказать свою
            правоту.
          </UiText>

          <UiText>
            Новатор с невысоким профессиональным уровнем часто склонен
            игнорировать фактор профессиональной дисциплины, что особенно
            неприятно, когда от его деятельности зависит работа его сотрудников.
          </UiText>

          <UiText preset="small" color="accent">
            Например, если такой Новатор работает в театральном или музыкальном
            коллективе, он иногда позволяет себе или опаздывать на репетиции или
            вообще на них не приходить. Может на каждом шагу спорить с
            режиссером и навязывать ему свой вариант сценического решения. Свой
            «сценический вариант» может продемонстрировать самым неожиданным
            образом прямо во время выступления. Может прямо на сцене позволить
            себе какую-нибудь экстравагантную выходку в ущерб другим актерам.
            Новатор, выбирающий для себя исполнительскую карьеру, но при этом
            отказывающийся быть «исполнителем», всегда создает проблемы как для
            себя, так и для своих сослуживцев.
          </UiText>

          <UiText>
            Но в условиях жесткой дисциплины и официальности Новатор
            действительно работать не способен.
          </UiText>

          <UiText>
            Такие условия он старается сразу же «сломать», изменить, как-то
            приспособить к удобному для себя режиму. Той работой, которая его
            слишком стесняет, как правило, не дорожит. К работе, которая не
            реализует всего его творческого потенциала, часто теряет интерес,
            едва успев войти в курс дела.
          </UiText>

          <UiText preset="large" color="role">
            Не любит скрупулезно проверять результаты своей работы. Не любит
            прорабатывать детали. Не переносит рутину.
          </UiText>

          <UiText>
            Может некоторое время выполнять несложную физическую работу, но его
            мысли в этот момент будут находиться совершенно в другом измерении,
            что непременно скажется на результатах дела.
          </UiText>

          <UiText>
            И тем не менее Новатор довольно высоко оценивает и широко
            рекламирует свои деловые качества. Умеет запросить за свою работу ту
            цену, которая кажется ему достойной.
          </UiText>

          <UiText>
            Запрашивает обычно намного больше, чем ему предлагают — в расчете на
            то, что ему придется поторговаться; и соглашается с предложенной
            ценой, только будучи абсолютно уверенным в невысокой
            платежеспособности своего заказчика.
          </UiText>

          <UiText preset="large" color="role">
            Любит демонстрировать свою практичность. Гордится умением экономно
            расходовать свои средства.
          </UiText>

          <UiText>
            Пытается убедить окружающих, что может безбедно существовать на
            самые скромные доходы.
          </UiText>

          <UiText>
            Если не удаëтся прилично заработать, переходит на режим строжайшей экономии. Свое неумение зарабатывать часто маскирует нежеланием гнаться за деньгами, поскольку он лично может довольствоваться и малым.
          </UiText>

          <UiText preset="large" color="role">
            Любит демонстративно-расчетливо планировать свои личные расходы. Любит обучать экономии.
          </UiText>

          <UiText>
            Если у членов его семьи это не получается, начинает вести бюджет сам, показывая пример того, как надо это делать: начинает вникать во все домашние мелочи, перепроверять все статьи расходов и доходов. Словом, не успокоится, пока не докажет, что все хозяйство велось слишком расточительно.
          </UiText>

          <br />

          <UiText>
            Ситуация меняется, когда партнером Новатора становится его дуал Дипломат. В этом случае у Новатора наконец-то возникает желание зарабатывать и он начинает дорожить местом своей работы.
          </UiText>

          <UiText>
            В критической ситуации Новатор может и для Дипломат ввести режим строжайшей экономии, но это будет действительно временное явление, в то время как с другим, психологически несовместимым партнером, такая мера будет постоянной и единственно возможной.
          </UiText>

          <UiText preset="large" color="role">
            Только ради Дипломата Новатор способен сделать над собой необходимое усилие для того, чтобы совместить свои творческие интересы с практическими потребностями своей семьи.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
