<template>
  <div class="text g-page">
    <section>
      <UiText preset="body" color="accent">
        Описания не должны обязательно совпадать со всеми чертами характера
        личности.
      </UiText>

      <UiText preset="small" color="accent">
        Идея как раз описать наблюдаемые у среднего представителя типа
        особенности поведения и обработки информации психикой.
      </UiText>

      <UiText preset="small" color="accent">
        Автор описания — Велта Микелсоне
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="role">
        Один из самых любознательных соционических типов во всем соционе.
      </UiText>

      <br />

      <UiText>
        Свойственно живое мышление и бесконечное фантазирование, генерирование
        идей и умение подсказать путь их реализации. Постоянно бывает чем-то
        увлечен. Часто идеи опережают настоящее время.
      </UiText>

      <UiText>
        Возможно, они будут приняты спустя много лет. Среди них — основатели
        многих наук и новых направлений в науки.
      </UiText>

      <UiText preset="large" color="role">
        Склонен изучать абстрактные вопросы и явления.
      </UiText>

      <UiText>
        В любой момент готов обсудить разные события и процессы. Умеет применять
        личный опыт в своих исследованиях, в результате рождаются новые замыслы.
      </UiText>

      <UiText>
        Своим рассеянным взглядом он ищет новые возможности, как будто постоянно
        оценивая, что можно, а что нельзя,где есть смысл, а где — нет.
      </UiText>

      <UiText>
        Благодаря быстрой реакции, поразительно быстро улавливает суть вещей,
        чем удивляет других. Из-за своей сообразительности, бывает ему трудно
        дослушать долгую речь, прерывает разговор, поскольку уже давно
        догадался, о чем идет речь.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Его социальная роль — исследователь.
      </UiText>

      <UiText>
        Он находит всестороннюю информацию обо всем, что его интересует.
        Предвидит причины различных событий, распознает их на раннем этапе. Его
        прогнозы о развитии процессов часто близки к истине. Способен провести
        следственный анализ.
      </UiText>

      <UiText preset="large" color="role">
        Чувствует повороты событий, взвешивает их и умеет выработать план
        действий.
      </UiText>

      <UiText>
        Его задача — предоставить идею, но не воплотить её в жизнь, для этой
        цели ему нужна команда.
      </UiText>

      <UiText>
        Важно подтвердить свою уникальность. Иногда он преувеличивает её,
        отстаивая везде свою правду, иногда действуя очень агрессивно.
      </UiText>

      <UiText>
        Полемика и творческие дискуссии — его интеллектуальное развлечение, в
        течении которого он может анализировать, понять и выразить свою теорию.
      </UiText>

      <UiText>
        Умело разделяет все данные по определенным признакам, устанавливает
        связь между ними и связывает их воедино.
      </UiText>

      <UiText>
        Способен уловить взаимную связь, казалось бы, между абсолютно разными
        явлениями, доказать абсолютно всё. Всегда готов участвовать в обсуждении
        сложных вопросов, но не всем приемлем и понятен стиль его изложения
        мысли.
      </UiText>

      <UiText>
        Рационализатор, любую идею умеет адаптировать, чтобы можно было её
        использовать по назначению. Созданные логические структуры гибки, при
        необходимости легко поддаются изменениям.
      </UiText>

      <UiText color="accent">
        Часто является руководителем исследовательских институтов. Там, где
        царит дух творчества, у него складываются дружелюбные и равноправные
        отношения.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">Творческая личность</UiText>

      <UiText>
        Следует отметить, что руководящая работа не является творческой. Если он
        руководитель, у него часто возникают затруднения при решении этических и
        хозяйственных проблем.
      </UiText>

      <UiText>
        Создает впечатление решительного человека с силой воли, в чрезвычайных
        ситуациях не прислушивается к другим и действует самостоятельно, что
        создает проблемы в общении. Он не переносит ограничения, горячо защищает
        только свои взгляды, но для руководителя такие качества неуместны. Но
        нельзя сказать, что остается равнодушным в случаях столкновения, он
        делает анализ своих действий, сравнивает с другими.
      </UiText>

      <UiText>
        Фактически он не стремится к власти, так как считает, что власть
        отбирает у человека свободу. Он — не тот человек, который желает
        конкурировать с кем-нибудь, поскольку он не умеет форсировать процесс.
      </UiText>
    </section>

    <section>
      <UiText>
        Делает все возможное, чтобы освободиться от хозяйственных работ, которые
        он считает мелочами, мешающими ему работать творчески.
      </UiText>

      <UiText>
        Он как бы показывает, что человека более интересуют предметы, чем люди,
        с которыми он вовсе не обязательно желает общаться.
      </UiText>

      <UiText preset="large" color="role">Не способен долго сердиться.</UiText>

      <UiText>
        Рьяно защищает свой образ жизни. Если его пытаются подчинить или
        ограничить, его действия могут быть непредсказуемы. По этой причине его
        считают неуравновешенным человеком с тяжелым характером.
      </UiText>

      <UiText>
        Трудно требовать, чтобы он вел себя этично, таким образом ситуация может
        лишь ухудшиться. Если ему выразить замечания, он может высказать то, от
        чего другим станет стыдно.
      </UiText>

      <UiText preset="large" color="role">
        Своё поведение не меняет до старости и остается вечным ребенком.
        Поддается на клевету, в таких ситуациях он беззащитен перед интригами.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        При общении с незнакомыми людьми — осторожен, спокоен и внимателен.
      </UiText>

      <UiText>
        Обычно он не инициатор в отношениях, хотя у него большой круг знакомых,
        большинство выбрали его сами.
      </UiText>

      <UiText preset="large" color="role">
        Часто не может ответить, кто его лучший друг. Поскольку он любитель
        обсуждать интересные события, согласен вокруг себя собрать многих.
        Спокойная обстановка соблюдается до тех пор, пока все его слушают и
        согласны с его мнением.
      </UiText>

      <UiText>
        Вопросы человеческих взаимоотношений ему не ясны. Определяет, как к нему
        относятся, создавая провокационные ситуации, в которых как бы
        экспериментирует с людьми.
      </UiText>

      <UiText>
        Как демократ, желающий не потерять свой круг знакомых, легко обещает
        свою помощь. Из-за своей рассеянности обещанное забывает, поэтому лучше
        всего обещанное просить у него сразу.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        При общении с незнакомыми людьми — осторожен, спокоен и внимателен.
      </UiText>

      <UiText>
        Обычно он не инициатор в отношениях, хотя у него большой круг знакомых,
        большинство выбрали его сами.
      </UiText>

      <UiText preset="large" color="role">
        Часто не может ответить, кто его лучший друг. Поскольку он любитель
        обсуждать интересные события, согласен вокруг себя собрать многих.
        Спокойная обстановка соблюдается до тех пор, пока все его слушают и
        согласны с его мнением.
      </UiText>

      <UiText>
        Вопросы человеческих взаимоотношений ему не ясны. Определяет, как к нему
        относятся, создавая провокационные ситуации, в которых как бы
        экспериментирует с людьми.
      </UiText>

      <UiText>
        Как демократ, желающий не потерять свой круг знакомых, легко обещает
        свою помощь. Из-за своей рассеянности обещанное забывает, поэтому лучше
        всего обещанное просить у него сразу.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        С трудом понимает чувства партнера, он не умеет сохранить отношения.
      </UiText>

      <UiText>
        Потому что он не умеет вести себя тонко и чутко. Не умеет бороться за
        партнера, так как боится ошибиться.
      </UiText>

      <UiText preset="large" color="role">
        Не скряга, он не гонится за богатством и деньгам. Со всем, что у него
        есть, способен делиться и помогать другим, бывает что отдает почти
        последнее. Он бескорыстный человек.
      </UiText>

      <UiText>
        Его трудно считать хозяйственным. Этим объясняется буквальная
        неспособность заниматься домашними обязанностями. Также ему свойственна
        нерешительность в делах, которые могут принести выгоду. Особенно мужчины
        не находят применение своим способностям, поскольку не умеют себя
        дисциплинировать.
      </UiText>

      <UiText color="accent">
        Будучи руководителем, не способен направлять своё учреждение для
        получение регулярной прибыли. Не способен дать материальную оценку своей
        работы — излишне её преувеличивая и таким путем отпугивая возможного
        клиента. Иногда способен работать вообще за «спасибо».
      </UiText>

      <UiText>
        Без помощи партнера обрастает многочисленными бытовыми проблемами — он
        не в состоянии сам привести в порядок окружающее его пространство.
        Тяжело удаëтся создать уют вокруг себя. Но бытовой хаос фактически мало
        его волнует, потому что не требователен к нему.
      </UiText>

      <UiText>
        Одинокий Новатор может долго не замечать, сыт ли он или голодный,
        холодно ли ему или он перегрелся, заболел ли он. Другая крайность —
        отсутствие ощущения своего тела. Это часто вызывает проблемы со
        здоровьем.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Ему необходимо, чтобы кто-то регулярно заботился о нем. Только тогда он
        полностью расслабляется.
      </UiText>

      <UiText>
        Человек с естественным тонким чутьем и полный положительных эмоций легко
        поймет его потребности и настроение. Если этого не хватает, способен
        потерять жизнерадостность, увлечься искусственными стимуляторами.
      </UiText>

      <UiText>
        Обычно удлиненное выражение лица с тонкими чертами, спина часто
        напоминает половину буквы «C». Предпочитает авангардный стиль одежды,
        который многим не нравится. Женщина не умеет подчеркнуть женственность,
        часто предпочитает мужской стиль одежды.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        У него случаются частые спады настроения.
      </UiText>

      <UiText>
        В его присутствии не полагается обсуждать тему, касающуюся его лично.
        Психологический дискомфорт отражается на лице, после чего появляется
        нервное поведение, иногда даже истерика. Не умеет словесно выразить
        самочувствие.
      </UiText>

      <UiText>
        Не способен жить в одиночестве, у него собираются веселые компании. Чаще
        всего он устраивает тусовки у себя или организует их на другом месте.
      </UiText>

      <UiText>
        Туманное представление о том, что значит вовремя. Ему не получается
        считаться со временем других людей, и также он не умеет порадовать
        других своим прибытием вовремя.
      </UiText>

      <UiText preset="large" color="role">
        Когда увлекся какой-то очередной идеей, он вкладывает в это буквально
        всю энергию, работает днем и ночью, даже забывая поесть.
      </UiText>

      <UiText>
        Часто его увлечения связаны с исследованием катастроф, стихийных
        бедствий, массовой гибели людей и других судьбоносных событий. Ему
        интересно изучать причины возникновения всего возможного. Он как никто
        другой интересуется устройством и существованием мира, а также
        интересуется концом света.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Скептически относится к политике и религии: не признает ритуалов,
        идолов, колдовства.
      </UiText>

      <UiText>
        Его нельзя назвать доверчивым, недалеким. Он не совершает необдуманных
        поступков, не понимает людей не имеющих собственного мнения.
      </UiText>

      <UiText>
        Иногда он становится безразличным, избегает людей, погружается в
        полнейшее бездействие и пессимизм. В такие моменты не нуждается в
        сочувствии от других. Считает, что сам способен выбраться из этого
        положения.
      </UiText>

      <UiText>
        Погружается в дело, которое привлекло его внимание и кажется интересным,
        способен дать совет, как повернуть его в нужном направлении.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Отсутствует талант накапливания вещей и денег.
      </UiText>

      <UiText>
        Иногда заработанные деньги израсходует бесцельно. В доме держит только
        самые необходимые бытовые приборы.
      </UiText>

      <UiText>
        В вопросах, касающихся практической стороны жизни, предпочитает
        обращаться за советами. Часто меняет место работы. Важно начинать работу
        с начала, а не подключиться с середины. Не терпит, когда его работа
        подвергается контролю.
      </UiText>

      <UiText preset="large" color="role">
        Он не переносит однообразную работу, быстро надоедает все привычное и
        знакомое.
      </UiText>

      <UiText>Долго работает лишь в умственной деятельности.</UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
