<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <div class="warning">
      <UiText preset="small" color="accent">
        Если вы не умеет воспринимать юмор, обидчивы или зависимы от мнений
        незнакомцев, пожалуйста, не читайте все что ниже.
      </UiText>

      <UiText preset="small" color="accent">
        Ненормативная лексика и сексуальные темы, оскорбление чувств всех
        причастных. Но весело и остроумно. Соблюдена авторская орфография и
        пунктуация.
      </UiText>
    </div>

    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Люркмор"
          subtitle="2 минуты"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Селютин"
          subtitle="4 минуты"
          target-content-id="tab-2"
        />

        <VariousTab
          title="Эльвира Фея"
          subtitle="2 минуты"
          target-content-id="tab-3"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText color="accent">
            <i>
              ОБВМ, ГСМ, АГП, ЧСВ, херка, метросексуал, пиздабол, герой,
              риветхэд, сатанист, элитизм, пафос, ТП, фрик, мизантроп, гот,
              жопоголизм, тролль, угнетатель, поцреот, пирсингованное быдло,
              анхуман, НЕНАВИСТЬ
            </i>
          </UiText>

          <UiText>
            Человек с богатым внутренним миром, который выглядит адекватно
            только на сцене (и то не всегда). Ярый поклонник всяческих
            мистификаций, атсралов, долбославий и прочего, что занимает его моск
            куда больше, чем работа и дела.
          </UiText>

          <UiText preset="large" color="role">
            Зачастую подобные стремления быстро приводят его к веществам.
            Поклонник авторитаризма, власти, что в сексуальной жизни роднит его
            с Инспектором. Вечный предсказатель экстерминатусов и Больших
            Пиздецов.
          </UiText>

          <UiText preset="large" color="role">
            Ещё очень любит геройство. И частенько перебарщивает с риском для
            жизни. Как чужой, так и собственной. Не всегда только понятно,
            зачем.
          </UiText>

          <UiText>
            Процент Наставников среди самоубийц самый большой. Обычно добивается
            успеха только в той работе, где надо интриговать, льстить, в общем,
            пускать в ход всевозможные этические уловки. Актёр в чистом виде. В
            политике часто добивается признания, как оратор (яркий тому пример —
            Гитлер. Правда, дальше пиздежа дело редко заходит).
          </UiText>

          <UiText>
            Жизненный цикл описан Уильямом нашим Шекспиром — «Втирается в
            доверие, интригует, всех мочит».
          </UiText>

          <UiText>
            Интегральный тип Индии, Палестины и почти всех арабских стран.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">Бочка меда</UiText>
          <UiText preset="large" color="role">
            Создав Драму, Наставник не позволит тусовке скатиться в унылое
            говно…
          </UiText>
          <UiText preset="small" color="accent">Ложка дегтя</UiText>
          <UiText preset="large" color="accent">
            …ну или же, наоборот, заявится в компанию тех же Воздуха или Земли и
            превратит их весёлый утренник в унитаз с говном!..
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText>
            Этический подтип — тривиальный паяц и фигляр, актеришка
            провинциального театра на задворках. Интуитивный подтип —
            высокомерный циник.
          </UiText>

          <UiText preset="large" color="role">
            Несчастное и безжалостное существо, пытающееся манипулировать миром.
            Нерешителен. Кривляка.
          </UiText>

          <UiText>
            Перестраховщики с большой буквы. Видят все плохие исходы и стелят
            солому. Я их узнаю по неумению держать себя в пространстве.
          </UiText>

          <UiText>
            Очень тяжелая смесь желания быть в центре внимания и неуверенности в
            своем внешнем виде, неумения двигаться.
          </UiText>

          <UiText preset="large" color="role">
            Неистовый романтик. Очень любит внимание. Не любит, когда его
            игнорируют. Непоседа и провокатор. В плохом смысле.
          </UiText>

          <UiText>
            Упорный и упрямый идеалист, создатель альтернативных течений и
            религий. Считает, что всегда прав. Завидует чужому немотивированному
            везению.
          </UiText>

          <UiText>
            Любит покровительствовать слабым и нерешительным людям, но за себя
            постоять не может. Одинаково способен как на полное
            самопожертвование, так и на страшные поступки для доказательства
            своей правоты.
          </UiText>

          <UiText preset="large" color="role">
            А, уж, как смачно они болеют... Саморазрушающаяся конструкция.
          </UiText>
        </section>

        <section>
          <UiText>Язва. Не чувствуют грани.</UiText>

          <UiText>
            Еще одно квадратное колесо. Работает только «под настроение», однако
            таковое бывает не часто. Лентяи, однозначно! Иначе будет валяться с
            унылым видом, изображая вселенскую скорбь, или прыгать вокруг,
            изображая собственную крутизну, или… короче — изображая.
          </UiText>

          <UiText>
            Пока он мечется от одного человека к другому, все дела придут в
            упадок, все отношения будут испорчены, все возможности упущены.
          </UiText>

          <UiText>
            После чего он решит, что это все не то, что ему надо, и переметнется
            в противоположную сторону. Никогда не пойду работать туда, где
            начальник — Наставник, эта фирма обречена на вымирание, если его
            вовремя не сменить.
          </UiText>

          <UiText preset="large" color="role">
            Неуместные и наигранные эмоции. Диктаторские замашки.
          </UiText>
        </section>

        <section>
          <UiText>
            Их неистовый романтизм основан на показухе — лишь бы заметили, лишь
            бы привлечь к себе внимание. Они называют это любовью к Мельпомене,
            но мы-то видим их жалкие потуги второсортных актеров, которые не
            знают даже, куда деть руки, судорожно размахивая ими, которые не в
            ладах с собственным телом и окружающим их пространством.
          </UiText>

          <UiText>
            А если не замечают их, то начинается ярая зависть к другим, которым,
            по их мнению, как-то немотивированно везет.
          </UiText>

          <UiText>
            В этой своей страсти быть на виду, сходят с ума следующим образом —
            провоцируют мелкие (предать, подставить товарища) и крупные (Вторая
            мировая война) пакости, создают альтернативные течения и религии,
            типа национал-социализма и садомазохизма.
          </UiText>

          <UiText>
            Подобный твердолобый идеализм безжалостен к окружающим — страшные
            поступки для доказательства своей правоты, и все ради того, чтобы не
            утратить рычаги манипулирования миром и людьми, его населяющими.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-3" class="tab">
        <section>
          <UiText preset="large" color="role">
            Наставники — они же, сука, трагичные все из себя.
          </UiText>

          <UiText>
            Обладают, как правило, большими глазами, тонким профилем, и вообще
            такие дышащие духами и туманами.
          </UiText>

          <UiText>
            Однако будьте настороже: весь этот пафосный бред скрывает
            депрессивное чмо, которое ненавидит всех и вся еще почище
            Хранителей.
          </UiText>

          <UiText>
            И, в отличие от последних, умеет этим пользоваться, ибо принципы там
            и не ночевали.
          </UiText>

          <UiText>
            Поголовно мнят себя великими актерами, даже если их на пушечный
            выстрел никогда не подпускали к гримерке; умеют красиво встряхивать
            башкой и горько улыбаться, особенно часто делают это, если просят
            денег, а денег они будут просить часто, ибо зачем же духовным людям
            заморачиваться на презренном бабле.
          </UiText>

          <UiText>
            По сути, Наставники — вдохновенные распиздяи, но втайне этого
            стыдятся, и, в отличие от Советчиков, пытаются изобразить из себя
            трудоголика такого, шо писец.
          </UiText>

          <UiText>
            Получается хреново, от чего они впадают в еще больший ступор и
            принимаются красиво депрессовать, кончать с собой или декламировать
            стихи (иногда одновременно), а если вам особо не повезло – еще и
            петь тихим голосом. Или не тихим.
          </UiText>

          <UiText>
            Из любой фигни вроде заусенца или потекшей туши Наставник сделает
            трагедию вселенского масштаба, причем оторванная пуговица в
            пересказе превратится в падение бомбардировщика аккурат на своё
            пальто.
          </UiText>

          <UiText>
            Пальто будет непременно черным, ибо Наставники носят траур по этому
            миру, а еще опять забыли постирать. Озабочены и этого не скрывают,
            дадут с полпинка, изобразят африканскую страсть, однако не льстите
            себе.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Как хороший режиссер, старается ставить спектакли по возможности в
            разных театрах, чтоб срубить побольше бабла и аплодисментов.
          </UiText>

          <UiText>
            А без публики, как фикус без окурка – не функционирует, временно
            косплея Лирика и прикидываясь невинно убиенным веником.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
