<template>
  <div class="text g-page">
    <section>
      <UiText preset="subtitle" color="accent">Сильные стороны</UiText>

      <UiText preset="large" color="role">
        Имеет хорошие дипломатические и коммерческие способности. Быстро
        ориентируется в экстремальных ситуациях.
      </UiText>

      <UiText>
        Уверен в себе, смел и решителен. Всегда знает, чего хочет. Советуется
        больше формально, решения принимает самостоятельно.
      </UiText>

      <UiText>
        Стремится быть в курсе различных событий и сам любит быть в центре
        внимания. В общении вежлив, располагает к доверию, умеет создать
        атмосферу интимности и задушевности.
      </UiText>

      <UiText preset="large" color="role">
        Обаятелен, демократичен, обычно держится раскованно и непринужденно.
        Эстет, любит одеваться со вкусом и разнообразно. Заботится о близких,
        ценит уют и комфорт.
      </UiText>

      <UiText>
        Стремится к практической деятельности. Предпочитает ближайшие конкретные
        цели, приносящие реальную пользу.
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">Проблемы</UiText>

      <UiText>
        Довольно неорганизован, склонен отвлекаться в работе на несущественные
        детали. Ему трудно долгое время концентрировать своё внимание на чем-то
        одном.
      </UiText>

      <UiText>
        Склонен к колебаниям в выборе, что приводит к внутренним размышлениям и
        сомнениям, которые он скрывает. Его настоящим доверием пользуются
        немногие.
      </UiText>

      <UiText>
        Довольно консервативен к новому: ему нужно определенное время, чтобы
        воспринять и разобраться в новой технологии и убедиться в её
        практичности.
      </UiText>

      <UiText>
        Идет на риск только после того, как хорошо все взвесит. Склонен
        нивелировать индивидуальные склонности людей, любит, чтобы все
        действовали единообразно.
      </UiText>

      <UiText preset="large" color="role">
        Проявляет агрессивность, если его свободу ограничивают. Своё настроение
        переносит на окружающих.
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Нельзя требовать и ожидать
      </UiText>

      <UiList iconName="chevron-right" iconColor="accent" iconSize="16">
        <UiListItem>Пунктуальности и обязательности.</UiListItem>

        <UiListItem>Организованности и логичности в делах.</UiListItem>

        <UiListItem>Умения хорошо распределять обязанности.</UiListItem>

        <UiListItem>
          Глубоких стратегических и аналитических способностей.
        </UiListItem>

        <UiListItem>
          Справедливости при распределении материальных благ.
        </UiListItem>

        <UiListItem>Выполнения всех своих обещаний.</UiListItem>
      </UiList>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Подходящие виды деятельности
      </UiText>

      <UiText>
        Успешно проявляет себя в социальной сфере, торговле (особенно оптовой),
        снабжении, дипломатическом представительстве, в организации и проведении
        культурно-массовых мероприятий, в шоу-бизнесе, сфере развлечений, на
        эстраде.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
