<script lang="ts" setup>
import type { IntertypeIdType } from "@types";

const props = defineProps<{ intertypeId: IntertypeIdType }>();
</script>

<template>
  <div class="text">
    <UiText preset="large" color="accent">
      Неблагоприятные отношения, которые отличаются также отсутствием симметрии:
      в этой паре партнеры относятся друг к другу неодинаково.
    </UiText>

    <UiText>
      Один из партнеров имеет название ревизора, а второй — подревизного.
    </UiText>

    <UiText color="dark-grey">
      Отношения социального заказа образуют закрытое кольцо в соционе. Каждый
      ТИМ имеет своего заказчика и своего подзаказного.
    </UiText>

    <UiText color="dark-grey">
      У подревизного партнера создается впечатление, что ревизор специально
      следит за ним, пытаясь выведать все его неудачи, смотря на него сверху
      вниз, снисходительно.
    </UiText>

    <UiText preset="large" color="accent">
      Подревизный ощущает, что ревизор постоянно его оценивает, и поэтому, в его
      присутствии, он напрягается, пытаясь не сделать ошибок.
    </UiText>

    <UiText>
      Для подревизного ревизор является человеком значимым, его внимание и
      похвалу очень хочется заслужить своими действиями.
    </UiText>

    <UiText>
      При этом подревизный постоянно ощущает, что ревизор его недооценивает, что
      еще сильней увеличивает желание доказать свою значимость и полезность. К
      сожалению, такие попытки никогда не бывают успешными.
    </UiText>

    <UiText>
      Ревизор в глазах подревизного — это преподаватель, который постоянно
      придирается, пытается учить, перевоспитывать.
    </UiText>

    <UiText>
      При этом, в глазах ревизора подревизный кажется человеком неплохим, но
      которому не хватает опыта. Подревизного хочется обучить, подсказать ему,
      как лучше делать.
    </UiText>

    <UiText>
      Но советы он не воспринимает и делает как прежде, что очень нервирует
      ревизора. Из-за этого ревизор может считать подревизного бестолковым
      человеком.
    </UiText>

    <hr />

    <UiText preset="large" color="accent">
      Отношения ревизор-подревизный — это отношения матери и непослушного
      ребенка.
    </UiText>

    <UiText>
      В отношениях ревизии оба партнера чувствуют свою значимость: ревизор
      понимает, что подревизный без него пропадет, а подревизный видит, что для
      ревизора он важен и ценен, несмотря на придирки.
    </UiText>

    <UiText>
      В отношениях ревизии напряжение склонно накапливаться постепенно. С каждым
      днем растет раздражение ревизора над бестолковостью подревизного, а
      подревизный начинает нервничать, поскольку не понимает, почему ревизор
      хочет его перевоспитать.
    </UiText>

    <UiText preset="large" color="accent">
      Рано или поздно взаимное недовольство перерастает в конфликт.
    </UiText>

    <UiText>
      Очень тревожные отношения для подревизного, поскольку при появлении
      ревизора у него появляется навязчивая мысль, что он все делает «не так».
      Особенно ярко конфликт ревизии проявляется в том случае, если ревизор и
      подревизный — это коллеги, работающие над одним проектом.
    </UiText>

    <UiText>
      В целом, любое тесное взаимодействие — это уже гарантия возникающих
      сложностей между этими людьми.
    </UiText>

    <UiText>
      Подревизные часто страдают тогда, когда ревизор — один из родителей или
      ближайших родственников. Из таких отношений подревизный партнер выходит
      часто с психологической травмой, неуверенностью в себе.
    </UiText>

    <UiText preset="large" color="accent">
      Из таких отношений подревизный партнер выходит часто с психологической
      травмой, неуверенностью в себе.
    </UiText>

    <hr />

    <UiText>
      Отношения ревизии — одни из самых неблагоприятных, наравне с конфликтными,
      поэтому при возможности, общение между партнëрами стоит сократить — это
      стресс, как и для ревизора, так и для подревизного.
    </UiText>

    <UiText>
      Если же общение сократить никак не получается, необходимо следовать
      советам, которые помогут предотвратить ссоры.
    </UiText>

    <UiText preset="large" color="accent">
      Отношения ревизии могут развиваться лишь в спокойное время.
    </UiText>

    <UiText color="dark-grey">
      Когда наступает период активных быстрых действий, все проблемы отношений
      выплескиваются друг на друга. Поэтому необходимо поддерживать, хотя бы и
      искусственно, спокойное течение жизни: необходимо заранее друг друга
      предупреждать о каких-то внезапных ситуациях, рассказывать об изменениях,
      которые будут происходить, не эмоционировать и обсуждать все наедине друг
      с другом.
    </UiText>

    <UiText preset="large" color="accent">
      Ревизор должен дозировать информацию.
    </UiText>

    <UiText color="dark-grey">
      Это касается любой информации, выдаваемой подревизному. Не стоит также
      требовать от него быстрого понимания. За любые положительные проявления со
      стороны подревизного стоит радоваться, за отрицательные — постараться не
      ругаться.
    </UiText>

    <UiText preset="large" color="accent">
      Учитывайте критическое отношение друг к другу.
    </UiText>

    <UiText>
      Ревизор всегда будет критиковать подревизного, причем не конкретные его
      огрехи, а его образ жизни целиком. При этом, подревизный, наоборот, будет
      критиковать конкретные проявления ревизора, в целом, восхищаясь им как
      человеком более опытным и знающим.
    </UiText>
  </div>
</template>

<style scoped lang="scss">
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 16px;
}
</style>
