<script lang="ts" setup>
import type { IntertypeIdType } from "@types";
import PageHeaderWidget from "@widgets/PageHeaderWidget.vue";

const props = defineProps<{ intertypeId: IntertypeIdType }>();
</script>

<template>

<PageHeaderWidget iconName="specialist" title="Что может помешать дуалам найти общий язык?" />

  <div class="text">
    <UiText>
      Отдельно важно пояснить, что кроме непосредственно соционических интертипных отношений, также на взаимодействие влияют и другие факторы.
    </UiText>

    <UiText>
      Давайте рассмотрим дуальные отношения — самые комфортные во всем соционе.
    </UiText>

    <UiText>
      Если взять обратную ситуацию, допустим, встретились два человека с конфликтными типами, то это совсем не значит, что они сразу будут друг друга ненавидеть. При дистанционном общении эти люди могут приятно проводить время, общаться с пользой, относиться друг к другу положительно. 
    </UiText>

    <UiText preset="large" color="accent">
      Но как только наступает сближение, то проблемы неизбежно появятся.
    </UiText>

    <UiText>
      Важно также отметить, что появление любого человека в вашей жизни несет некий скрытый смысл, который необходимо осознать.
    </UiText>

    <UiText>
      Соответственно, преобладание представителей одного типа в вашем окружении дает вам возможность понять, что же хотят вам донести все эти люди.
    </UiText>

    <hr />

    <UiText preset="large" color="accent">
      Любые интертипные отношения необходимы для решения важной для вас задачи: нет ненужных отношений.
    </UiText>

    <UiText color="dark-grey">
      К примеру, «квазитождик» может вывести из режима самоограничения, «миражник» помогает осуществить потаенные желания, а «активатор» может дать ответ на те вопросы, которые мучают человека уже давно.
    </UiText>

    <hr />

    <UiText preset="large" color="accent">
      Уровень развития людей
    </UiText>

    <UiText>
      Никакие дуальные отношения не спасут людей, один из которых предпочитает в 40 лет жить на пенсию родителей и ничего не делать, а другой с 20 лет работает по 12 часов в сутки ради того, чтобы добиться в жизни успеха. Зрелость или инфантилизм.
    </UiText>

    <hr />

    <UiText preset="large" color="accent">
      Травмы и психологические проблемы
    </UiText>

    <UiText>
      Полное понимание в соционическом плане не обеспечит человеку терапию, которую должен осуществлять опытный психолог.
    </UiText>

    <hr />

    <UiText preset="large" color="accent">
      Уровень образования и культуры
    </UiText>

    <UiText>
      Вряд ли найдут общий язык дуалы, один из которых закончил с красными дипломом институт и любит ходить в музеи, а второй отсидел в тюрьме 20 лет и предпочитает выпить бутылку водки с корешами.
    </UiText>

    <UiText>
      С какими-то из 16 типов отношения у вас будут лучше, с какими-то хуже, и это правило работает абсолютно со всеми типами в соционе.
    </UiText>

  </div>
</template>

<style scoped lang="scss">
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 16px;
}
</style>
