<template>
  <div class="text g-page">
    <section>
      <UiText preset="large" color="role">
        Вы — без сомнения, волевой и решительный человек. Всегда ставите перед
        собой крупные, далеко идущие цели.
      </UiText>

      <UiText>Вы — человек ответственный, не бросающий слов на ветер.</UiText>

      <UiText>
        Не любите зря тратить силы на мелочи, несущественные дела. Вы умеете
        хорошо реагировать на ситуации, идете на временные компромиссы, но не
        теряете из виду главную цель.
      </UiText>

      <UiText>
        Ваш деятельный характер особенно хорошо проявляется в критических
        ситуациях.
      </UiText>

      <UiText preset="large" color="role">
        Ваше упорство в преодолении препятствий возрастает пропорционально их
        количеству.
      </UiText>

      <UiText>
        Вы очень азартны, хотя попусту рисковать не станете. Вы любите занятия,
        которые дают возможность проявлять такие качества, как смелость,
        находчивость, силу воли и хладнокровие в момент опасности.
      </UiText>

      <UiText>
        Вы обладаете хорошими организаторскими способностями. Вы умеете найти
        подходящих людей и правильно расставить их в зависимости от их деловых
        качеств и функциональной полезности, умеете направить их усилия на
        достижение главной цели.
      </UiText>

      <UiText>
        Вы не стремитесь выставлять свои заслуги напоказ. Вы предпочитаете
        оставаться в тени, стимулируя других людей к нужной вам деятельности.
        Для вас характерно чувство ответственности за порученное дело.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Основная проблема вашей жизни — недостаток такта и дипломатичности в
        отношениях с людьми. Иногда вы открыто проявляете нетерпимость к чужим
        недостаткам и слабостям.
      </UiText>

      <UiText>
        Для достижения своих целей вы порой способны переступить через интересы
        других людей, чем можете вызвать моральное осуждение окружающих в свой
        адрес.
      </UiText>

      <UiText preset="large" color="role">
        Помните, что формула «цель оправдывает средства» не всегда бывает
        верна.Воспитывайте в себе терпимость, уважайте достоинство и чувства
        других людей.
      </UiText>

      <UiText>
        Глубокое изучение философии и религии, где обосновываются
        общечеловеческие ценности, поможет вам глубже разобраться в сущности
        человека.
      </UiText>

      <UiText preset="large" color="role">
        Воспитывайте в себе вежливость и корректные манеры поведения. Больше
        уважения проявляйте к лицам противоположного пола.
      </UiText>

      <UiText>
        Не теряйте чувства романтики, без которого ваша жизнь может превратиться
        в бесцветное существование.
      </UiText>

      <UiText preset="large" color="role">
        Не ждите от своего партнера исключительной инициативы в проявлении
        чувств, старайтесь чаще демонстрировать ему своё хорошее расположение.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Другая ваша проблема — чрезмерная концентрация внимания на недостатках в
        человеке. Это может послужить причиной несправедливого к нему отношения.
      </UiText>

      <UiText>
        Будьте более чутки и внимательны, заботьтесь о людях не только на
        словах, но и на деле. Не оставляйте без ответа обращенные к вам вопросы.
        Выслушивая человека, не думайте о постороннем, сконцентрируйтесь на его
        проблемах.
      </UiText>

      <UiText>
        Не преуменьшайте роль интеллектуального труда на производстве.
      </UiText>

      <UiText preset="large" color="role">
        Чаще задумывайтесь о возможных последствиях своих поступков.
      </UiText>

      <UiText>
        Никогда не перекладывайте ответственность за просчеты в деле на других
        людей — это может отразиться на вашей репутации в будущем.
      </UiText>

      <UiText>
        Пытайтесь контролировать те ситуации, которые выходят за рамки
        формального общения.
      </UiText>

      <UiText>
        Вы можете поставить себя в неловкое положение неуместными вопросами,
        которые могут быть восприняты окружающими как бестактные.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
