<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <div class="warning">
      <UiText preset="small" color="accent">
        Если вы не умеет воспринимать юмор, обидчивы или зависимы от мнений
        незнакомцев, пожалуйста, не читайте все что ниже.
      </UiText>

      <UiText preset="small" color="accent">
        Ненормативная лексика и сексуальные темы, оскорбление чувств всех
        причастных. Но весело и остроумно. Соблюдена авторская орфография и
        пунктуация.
      </UiText>
    </div>

    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Люркмор"
          subtitle="2 минуты"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Селютин"
          subtitle="1 минута"
          target-content-id="tab-2"
        />

        <VariousTab
          title="Эльвира Фея"
          subtitle="2 минуты"
          target-content-id="tab-3"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText color="accent">
            <i>
              небыдло, админ, альфа-самец, пранкер, ТП-мужичка, жопоголизм,
              модник, феминистка, мизантроп, PROFIT
            </i>
          </UiText>

          <UiText preset="large" color="role">
            Профессиональный мозгоёб — могут вести себя и нормально, но обилие
            неуместных, иногда и глупых шуток — черта Администратора, вызывает
            лютый, бешеный батхёрт у лоботрясов и распиздяев.
          </UiText>

          <UiText>
            Администратор просто рвётся с цепи, лишь бы сделать где-нибудь
            ремонт, причём вовсе не обязательно, что своими руками.
          </UiText>

          <UiText>
            Представительный. Обожает руководить по телефону, способен обзвонить
            хуеву тучу народу и обговорить уйму дел, не вставая с кресла.
            Сферический начальник в вакууме. Если и доставляет, то исключительно
            намеренно.
          </UiText>

          <UiText preset="large" color="role">
            В одежде главный принцип — чтобы всё было достойно, поэтому какую бы
            хуиту он ни надел, вы рядом с ним будете выглядеть как вахтёр в
            телогрейке, даже если на вас вечерний костюм.
          </UiText>

          <UiText>Администратор считается интегральным типом Британии.</UiText>

          <UiText>
            И вы ещё спрашиваете, почему она гадит этой стране? Конфликт же!
            Штирли при экстравертности не имеют по 100 друзей на 1 км² и не
            особо рвутся заводить новых, ибо как никто другой, чувствуют правило
            95%.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">Бочка меда</UiText>
          <UiText color="role">
            …наглядно видно, что описание Администраторов самое короткое, не
            считая конечно Мастера, Дипломата и Политика, а так же ещё пятка
            представителей 3 первых квадр. А всё почему? Потому что
            Администратор, сука, работают, а не пишут хуйню. А за это про них
            никто слова хорошего не скажет.
          </UiText>
          <UiText preset="large" color="role">
            Справедливости ради, стоит отметить, что обычно работать начинают в
            очень юном возрасте (ЧСВ при этом раздувается до невъебенных
            размеров) на какой-нибудь должности типа «администратор в
            компьютерном клубе», но оттого, что не нихуя не карьеристы, остаются
            на этой работе лет до тридцати.
          </UiText>
          <UiText preset="small" color="accent">Ложка дегтя</UiText>
          <UiText preset="large" color="accent">
            Уничтожат всех, кто сорвёт их планы! Ну и некоторые представители
            задолбают хуёвым чувством юмора, всё зависит от прокачки ролевой.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="large" color="role">
            Аристократ с психологией наемного рабочего, раба. Пользы от него
            больше, чем вреда.
          </UiText>

          <UiText>
            Разложить по полочкам человеческие эмоции. Холодная нарисованная
            радостная улыбка, как у теток в загсе.
          </UiText>

          <UiText>
            6 дней работает, один день пьёт, чтобы не чувствовать пустоты
            внутри, которую никакой работой не заполнишь.
          </UiText>

          <UiText preset="large" color="role">
            Помимо работы — либо молчун, либо зануда. Считает себя всегда
            правым.
          </UiText>

          <UiText>
            Жутко навязчивы в плане заботы. Завалит советами, не слышит, что эти
            советы не нужны и её мнение тоже, наоборот, с непреклонностью танка
            будет заставлять её слушать.
          </UiText>

          <UiText>
            Мало того, при общих знакомых занимается критикой близких. Никогда
            не хвалит, многое воспринимает как должное.
          </UiText>

          <UiText preset="large" color="role">
            Проводник в жизнь принципа «бей своих чтоб чужие боялись».
          </UiText>

          <UiText>
            Громко орёт о своей занятости, и порядке, тогда как в собственных
            бумагах бардак жуткий и много теряется времени впустую.
          </UiText>

          <UiText>Прижимисты, уговорить на покупку тяжело безумно.</UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Всё покупается для гостей, презенты... для выгоды в будущем.
            Ограничены и самоуверенны ужасно, а то что не понимают — увы, не
            способны понять что могут нуждаться в этом другие.
          </UiText>

          <UiText>Жестоко наказывают.</UiText>

          <UiText>
            Мелочны, тупы (ограничены), работящи более по виду. Очень
            своеобразная любовь и забота исходят из жесточайших личных списков
            стереотипов.
          </UiText>

          <UiText>
            Маньяки высшего образования. То, что считают залогом стереотипа
            счастливой жизни, проповедуют с миссионеркой уверенностью, силой
            падающего пресса и навязчивостью комаров.
          </UiText>

          <UiText preset="large" color="role">
            Искренне убежден, что весь мир для него, что он центр Вселенной.
            Всегда знает, как надо, что надо, зачем и почему. Особенно, когда
            касается других. Завышенная самооценка.
          </UiText>

          <UiText>
            Страшно любит деньги, шикарную жизнь. Убежден, что все земные блага
            только для него и существуют.
          </UiText>
        </section>

        <section>
          <UiText>
            Командир, любит поучать, наставлять, подавлять, требовать
            невозможного, интриган, критикан истеричный, любит подсчитывать
            чужие доходы, сексуально распущен, всех подстраивает под себя.
          </UiText>

          <UiText>
            Выбирает людей слабее себя, а потом настойчиво пытается их
            переделать, перевоспитать, начинает предъявлять кучу претензий.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Часто меняет мнение. Сегодня это у него белое, а завтра черное.
            Требует постоянного внимания к своей персоне.
          </UiText>

          <UiText>
            Это тем более неприятно, что с посторонними вы ведете себя
            подчеркнуто сдержанно и корректно, демонстрируете воспитанность и
            хорошие манеры. Близкие могут быть в обиде на вас из-за этого
            качества.
          </UiText>

          <UiText preset="large" color="role">
            Своей несдержанностью вы можете оттолкнуть от себя близких людей.
            Будьте терпимей, не спешите сгоряча выкладывать правду в глаза.
          </UiText>

          <UiText>
            Зануда, часто придираюсь к словам (хотя прекрасно понимаю смысл, но
            если сказано неточно, редко могу пересилить себя), обидчив.
          </UiText>

          <UiText preset="large" color="role">
            Уменьшенная копия Инспектора в масштабе 1:1000.
          </UiText>

          <UiText>
            От того более тупой, мелочный, склочный, придирчивый и завистливый.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-3" class="tab">
        <section>
          <UiText preset="large" color="role">
            Администраторы — они, сука, вообще темные лошадки, чем и бесят. С
            виду такие добренькие, улыбчивые, помогут завсегда, и не только
            пиздежом, как Гуманисты, а подойдешь поближе, приглядишься – и кааак
            наткнешься на дружеский кулак глазом!
          </UiText>

          <UiText>
            А еще они такие правильные. Все у них разложено по полочкам, все
            распланировано на двести лет вперед по десяти разным сценариям,
            включая: возможный конец света, развод, смену ориентации и прилет на
            Землю недружественной инопланетной делегации с Сириуса.
          </UiText>

          <UiText>
            Разложить по полочкам собственную и чужую жизни для Администраторы
            все равно, что сексом заняться — кстати, трахаться они тоже
            предпочитают по расписанию, за сюрприз можно и схлопотать.
          </UiText>

          <UiText>
            Идеальные исполнители без особых амбиций, работящие пофигисты, на
            которых, впрочем, начальник всегда поглядывает с некой опаской.
          </UiText>
        </section>

        <section>
          <UiText>
            В целом, Администратор напоминает сундук с механическим приводом и
            такой сложной системой замков, что и пробовать не хочется.
          </UiText>

          <UiText>
            Еще они непрошибаемо спокойны, как бетонная стена, медленной и
            уверенной в себе мохнатой гусеницей ползут по жизни в некую лишь им
            известную сторону, на окружающих обращают внимания не больше, чем на
            мошек.
          </UiText>

          <UiText>
            В отличие от Политика или там Новатора не пыжатся, стараясь
            изобразить из себя нечто – они и так знают, кто они, а мы – нет,
            потому в близком общении со Администратором всегда есть некий
            элемент ужастика, где героиня-блондинка под зловещую музыку
            распаковывает яркую коробку, в котором вместо конфет оказывается
            семейка живых тарантулов.
          </UiText>

          <UiText>
            Впрочем, там могли быть и шоколадушки, верно? Так и с ним –
            проживите с ним хоть всю жизнь, паук может выскочить только в самом
            конце… или не выскочить.
          </UiText>

          <UiText preset="large" color="role">
            Администраторы – они ж, суки, скрытные до жопы, но вообще ниче так,
            из рационалов так вообще лапушки, особливо если сравнить с теми ж
            Инспекторами.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
