<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Живо интересуется вопросами бизнеса, самореализации, эффективности работы. 
  </UiText>

  <UiText class="description">
    Если работа кажется ненужной и бесполезной, то он, по возможности, не будет её делать.
  </UiText>

  <UiText class="description">
    Не всегда понимает, сколько денег нужно брать с собой, не умеет вести быт и финансовую отчетность.
  </UiText>

  <UiText class="description">
    Старается совмещать приятное с полезным — работу с игрой, чтобы результат был более эффективным.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Нуждается в четких и конкретных методиках работы и советах по выбору эффективной технологии.
  </UiText>

  <UiText class="description">
    Чем подробнее поступающая информация о технологиях различных процессов, тем успешнее Советчик способен работать.
  </UiText>

  <UiText class="description">
    Он вообще готов трудиться всё время, если только здоровье позволяет.
  </UiText>

  <UiText class="description">
    Часть работы может выполнить дотошно и качественно, а часть халтурно; работать ровно, в одном ритме  затрудняется, его трудоспособность зависит от объема сенсорных впечатлений.
  </UiText>

</template>

<style lang="scss" scoped></style>
