<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Очень любит испытывать себя на прочность, проверять себя в экстремальных ситуациях.
  </UiText>

  <UiText class="description">
    Часто представители этого типа прыгают с парашютами, катаются на горных лыжах, путешествуют в самые отдаленные места Земли.
  </UiText>

  <UiText class="description">
    Умеет руководить людьми, он способен постоять за себя, ему хочется доказать всему миру, что он может (что конкретно может, зависит от амбиций и предпочтений представителя).
  </UiText>

  <UiText class="description">
    Для того, чтобы ему быть лидером, ему нужна эмоциональная отдача от людей, он не может заставить подчиняться кого-угодно, ему нужны близкие по духу коллеги.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Противостоять вышестоящим, более сильным и напористым людям умеет плохо.
  </UiText>

  <UiText class="description">
    Следовательно, был бы очень рад, если бы кто-то защитил его от посягательств или даже захватил «новую территорию».
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Упреки в слабости и безволии поднимают его тонус, вызывают желание наступать и продвигать себя «вверх».
  </UiText>

  <UiText class="description">
    Для того чтобы воля  активизировалась, необходимо показать ему, что возможная агрессия с его стороны справедлива.
  </UiText>


</template>

<style lang="scss" scoped></style>
