<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Активно интересуется бизнесом, работой, различной деятельностью.
  </UiText>

  <UiText class="description">
    Ему приятно быть занятым, много работать, быть успешным человеком. Сложно работать на скучной работе.
  </UiText>

  <UiText class="description">
    Часто посещают тренинги о том, как быть эффективным, как больше работать, как построить бизнес — для них эти темы действительно интересны.
  </UiText>

  <UiText class="description">
    Не всегда имея экспертное мнение о том, как стать лучшим работником, очень ценит опыт других людей, которые лучше в этом разбираются.
  </UiText>

  <br />
  
  <hr />

  <UiText class="description">
    Без советов со стороны, без помощи и подсказок ему работать трудно, в то же время он не понимает точных указаний.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Раздражается, если кто-то пытается навязать ему определенный порядок действий — нуждается в помощи извне только для отсева неэффективных методов работы.
  </UiText>

</template>

<style lang="scss" scoped></style>
