<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    В хорошем настроении способен быть оптимистом: если у него получается работа, он с энтузиазмом продолжает достигать цели.
  </UiText>

  <UiText class="description">
    Часто является поклонником быстрых видов спорта, любит побеждать, обожает азартные игры. Легко заключает пари «на слабо».
  </UiText>

  <UiText class="description">
    В тяжелой ситуации, когда не видит выхода, нуждается в партнере, который объяснит, что выход есть всегда, нужно лишь посмотреть слегка под другим углом.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Живет настоящим, ему некогда размышлять о перспективах, тем более далеких; всяческая новизна, с одной стороны, для него желанна, а, с другой, недоступна, поскольку не хватает времени даже на насущные дела, не говоря уже о размышлениях на отвлеченные темы. 
  </UiText>

  <UiText class="description">
    Он хотел бы научиться безошибочно отличать полезных ему в перспективе людей от вредных; внутренний потенциал человека от его взора скрыт.
  </UiText>

  <UiText class="description">
    Нуждается в моральных нормах, на которые сможет ориентироваться в оценке внутренней сути людей.
  </UiText>

</template>

<style lang="scss" scoped></style>
