<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Любит провести время в веселой и шумной компании, где можно покричать, громко посмеяться, эмоционально расслабиться.
  </UiText>

  <UiText class="description">
    При этом часто стесняется своих положительных эмоций и показывает их лишь под влиянием алкоголя.
  </UiText>

  <UiText class="description">
    Бывают вспыльчивы, причем всегда переживают после того, как не специально накричали на кого-то.
  </UiText>

  <UiText class="description">
    Не всегда может самостоятельно «отрегулировать» накал своих эмоций.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Ему трудно управлять своим эмоциональным состоянием, в этом он зависит от окружающих и от успеха (неуспеха) своих инициатив. 
  </UiText>

  <UiText class="description">
    В одно и то же время на одного может грубо накричать, с другим, напротив, повеселиться, а с третьим и вовсе спокойно беседовать.
  </UiText>

  <UiText class="description">
    Любая угроза его власти или достижениям рождает негативные эмоции.
  </UiText>

  <UiText class="description">
    Лучше всего себя чувствует, когда кто-то из близких следит за адекватностью его эмоций.
  </UiText>


</template>

<style lang="scss" scoped></style>
