<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Уделяет достаточное внимание сенсорному комфорту: ему важно быть сытым, чистым и отдохнувшим.
  </UiText>

  <UiText class="description">
    Когда ему неудобно, плохо или некомфортно, у него падает настроение и работоспособность.
  </UiText>

  <UiText class="description">
    Критически выбирает себе одежду, способен разбираться в качествах тканей и фасонов.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Крайне желательна практическая помощь в вопросах собственного оздоровления, в решении бытовых проблем, в эстетическом оформлении жилища.
  </UiText>

  <UiText class="description">
    Ему было бы очень приятно, если бы кто-то подсказал, как избежать неприятных ощущений, а возможно, сам бы взял на себя труд избавить его от сенсорных проблем.
  </UiText>

  <UiText class="description">
    Он может более или менее эффективно заботиться о себе, когда ему внушена или подсказана технология повседневной работы, когда у него есть дело, обеспечивающее его всем необходимым.
  </UiText>

</template>

<style lang="scss" scoped></style>
