<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Нужен хотя бы минимальный сенсорный комфорт для того, чтобы его работоспособность стала выше.
  </UiText>

  <UiText class="description">
    Ему приятно, когда дома чисто, еда вкусная, а кровать удобная.
  </UiText>

  <UiText class="description">
    Любит красиво и функционально одеваться, он чувствует гармоничные сочетания цветов и фактур.
  </UiText>

  <UiText class="description">
    При этом представители этого типа не любят роскошь, им достаточно иметь функциональный и удобный дом, в котором они смогут предаваться мыслям.
  </UiText>

  <UiText class="description">
    Если его окружить дискомфортом, то вскоре он начнет ругаться, злиться и быстрее уставать.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Очень ценит практическую помощь в создании уюта, комфорта: сам он, как правило, не любит готовить или обустраивать свое жилище.
  </UiText>

  <UiText class="description">
    Кроме того, основной потребитель «сексуального ликбеза», более других нуждается в том, чтобы его «расковывали» в постели; людей этого типа нужно учить искусству любви.
  </UiText>

</template>

<style lang="scss" scoped></style>
