<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Важно иметь людей, которые к нему хорошо относятся. 
  </UiText>

  <UiText class="description">
    Ему тяжело работать в коллективе, где царит напряженная психологическая атмосфера.
  </UiText>

  <UiText class="description">
    При том, что им нравится общение с друзьями, они стараются соблюдать дистанцию и вести себя сдержано.
  </UiText>

  <UiText class="description">
    Тем людям, которые хорошо относятся к Критику, он готов делать подарки и прощать многие вещи.
  </UiText>

  <UiText class="description">
    Любит рассуждать о взаимоотношениях между людьми, часто делится своими соображениями на этот счет.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    С трудом налаживает отношения с людьмии коллективами; ему нужна практическая помощь извне. 
  </UiText>

  <UiText class="description">
    Со всеми поддерживает ровные, прохладные, но дружелюбные отношения, не понимает, почему кто-то требует для себя исключений и ждет от Критика усиленного внимания.
  </UiText>

  <UiText class="description">
    При первой же возможности перекладывает ответственность за свои контакты, симпатии и антипатии на кого-то из близких.
  </UiText>

</template>

<style lang="scss" scoped></style>
