<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Любит быстрые решения, ему тяжело жить рядом с медленными людьми.
  </UiText>

  <UiText class="description">
    Если для дела не хватает времени, то он способен собраться и сделать работу максимально быстро.
  </UiText>

  <UiText class="description">
    Если для дела не хватает времени, то способен собраться и сделать работу максимально быстро.
  </UiText>

  <UiText class="description">
    Часто интересуется судьбами людей, анализирует ошибки прошлого, любит взглянуть на ситуацию глобально с точки зрения времени.
  </UiText>

  <br />
  
  <hr />

  <UiText class="description">
    С трудом оценивает и распределяет время. Если заранее не знает, какие дела в каком порядке нужно выполнять, то либо бесплодно суетится, либо теряет ориентацию во времени и останавливается.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Рекомендации по использованию времени для него должны быть как можно более конкретными, ситуативно ориентированными и однозначными.
  </UiText>

</template>

<style lang="scss" scoped></style>
