<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Очень не любит хаотичную информацию.
  </UiText>

  <UiText class="description">
    Ему приятно упорядочивать, создавать красивые таблицы, понимать, как конкретные примеры соотносятся с фундаментальными законами.
  </UiText>

  <UiText class="description">
    Часто у него самые красивые лекции в институте, с использованием фломастеров, схемок, подчеркиваний и других визуальных маячков.
  </UiText>

  <UiText class="description">
    Если ему четко объяснить, что от него нужно, а также нарисовать схему действий, то он с радостью начнет работу и скорее всего выполнит её лучшим образом.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Им трудно самостоятельно анализировать и беспристрастно оценивать ситуацию в окружающем мире.
  </UiText>

  <UiText class="description">
    Ему необходима практическая помощь и поддержка для обработки научно-технической информации, построения непротиворечивых алгоритмов.
  </UiText>

</template>

<style lang="scss" scoped></style>
