<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Живут в своем, довольно-таки размеренном режиме. 
  </UiText>

  <UiText class="description">
    Они не любят непунктуальность, срывы сроков, внезапные дела.
  </UiText>

  <UiText class="description">
    Может мобилизовать внезапная важная работа, которая должна быть сделана в короткий срок, при этом, по завершении этой работы, он снова расслабится и будет жить в своем темпе.
  </UiText>

  <UiText class="description">
    Очень любит читать исторические книги, его интересует течение времени, он верит в судьбу и мистические совпадения, часто увлекается эзотерикой.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Нужна действенная помощь в прогнозировании различных внешних процессов, в планировании времени и определении момента для начала действий.
  </UiText>

  <UiText class="description">
    Вполне достаточно, если ему подскажут глобальную тенденцию развития событий и обрисуют общие контуры складывающейся ситуации.
  </UiText>

</template>

<style lang="scss" scoped></style>
