<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Очень интересуют человеческие отношения.
  </UiText>

  <UiText class="description">
    Для него важно знать, что люди к нему относятся положительно, любят, ценят.
  </UiText>

  <UiText class="description">
    Ненавидят навязчивость в людях, они стараются установить границы в общении, которые переходить не стоит никому.
  </UiText>

  <UiText class="description">
    Мечтает о нейтрально-положительном эмоциональном фоне в его среде обитания.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Желал бы получить конкретную практическую помощь в налаживании отношений с окружающими. 
  </UiText>

  <UiText class="description">
    Сам он довольно замкнут и слабо осознает, к чему приведут те или иные его контакты.
  </UiText>

  <UiText class="description">
    Он способен научиться искусству общения в определенных пределах, если кто-то предоставит ему информацию о сравнительной перспективности тех людей, с которыми его сталкивает судьба. 
  </UiText>

  <UiText class="description">
    Методические рекомендации по выстраиванию отношений в социуме должны носить исключительно точный, детальный и алгоритмизированный характер, иначе не сможет ими воспользоваться.
  </UiText>

</template>

<style lang="scss" scoped></style>
