<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <div class="warning">
      <UiText preset="small" color="accent">
        Если вы не умеет воспринимать юмор, обидчивы или зависимы от мнений
        незнакомцев, пожалуйста, не читайте все что ниже.
      </UiText>

      <UiText preset="small" color="accent">
        Ненормативная лексика и сексуальные темы, оскорбление чувств всех
        причастных. Но весело и остроумно. Соблюдена авторская орфография и
        пунктуация.
      </UiText>
    </div>

    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Люркмор"
          subtitle="2 минуты"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Селютин"
          subtitle="4 минуты"
          target-content-id="tab-2"
        />

        <VariousTab
          title="Эльвира Фея"
          subtitle="2 минуты"
          target-content-id="tab-3"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText preset="small" color="accent">
            <i>
              быдло, жлоб, овуляшки, пикапер, кулинарный сноб, лирушечка,
              педовка
            </i>
          </UiText>

          <UiText preset="large" color="role">
            Ценят домашний уют и живут в своём мирке. Возвращают Новатора на
            землю. Чаще всего живут жизнью обычного жлоба, не глядя дальше
            своего носа. Добиваются признания у людей, создавая ореол
            «душевности» путём этических махинаций, например лести. Как и все
            иррационалы, страшные лентяи.
          </UiText>

          <UiText>
            Также любят давать всем без разбора, чего Новаторы чаще всего не
            замечают и по-прежнему позволяют называть себя Зайкой вне
            зависимости от пола, возраста, роста и веса.
          </UiText>

          <UiText>
            Отличаются очень низким интеллектом и узким кругозором который не
            уходит дальше чем поесть, поспать, потрахаться.
          </UiText>

          <UiText>Работать не любят и не умеют.</UiText>

          <UiText>Становятся художниками, дизайнерами.</UiText>

          <UiText>
            Иногда неадекватно ведут себя в обществе, ибо интровертные.
          </UiText>

          <UiText>Является интегральным социотипом Болгарии и Кубы.</UiText>

          <UiText>
            Характерный признак: любят готовить и есть плюшки (видимо, поэтому
            все дюмки после двадцати пяти превращаются в чмошных тётенек,
            набирающих вес в геометрической прогрессии).
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">Бочка меда</UiText>
          <UiText preset="large" color="role">
            Обаятельны и как никто другой способны создать приятную атмосфЭру.
            Могут стать художниками, пейсателями и режиссёрами.
          </UiText>
          <UiText preset="small" color="accent">Ложка дегтя</UiText>
          <UiText preset="large" color="accent">
            Как никто другой могут скатиться в полное социальное говно! Вполне
            вероятно, что знакомая вам педовка — Дипломат.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="large" color="role">
            Ленивый, хитрейший интриган, приторно сладкий, вязкий, липучий.
            Лицемер. Обволакивает. Через какое-то время тесно и душно.
          </UiText>

          <UiText>
            За обаятельной улыбкой часто не оказывается никаких настоящих
            эмоций.
          </UiText>

          <UiText>Завидует чужому успеху, особенно денежному.</UiText>

          <UiText preset="large" color="role">
            Упорный и настойчивый в достижении личного комфорта.
          </UiText>

          <UiText>
            Думает, что знает себе цену, но на самом деле абсурдно неадекватен в
            своей самооценке.
          </UiText>

          <UiText preset="large" color="role">
            Не верит ни одному слову, особенно когда выясняется, что без него
            вполне можно обойтись.
          </UiText>
        </section>

        <section>
          <UiText>
            Житейский пофигист, который живет в мирке, ограниченном семьей и
            близкими друзьями. Что происходит за пределами этого мирка, его мало
            волнует.
          </UiText>

          <UiText>
            Идеал Дипломата — мелкобуржуазный каминчик, шестеро детей и погреб с
            вареньем и домашними соленьями.
          </UiText>

          <UiText>Не задается сложными философскими вопросами.</UiText>

          <UiText preset="large" color="role">
            Принципы отсутствуют, помимо разве что библейских.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Работать не любят. Старательны, но беспомощны.
          </UiText>

          <UiText>
            Любой совет по делу воспринимают как бездушное издевательство,
            воспитанные — этически увещевают, невоспитанные — поднимают хай.
          </UiText>

          <UiText preset="large" color="role">
            Безалаберный. Суетный, суёт свой нос, куда не просят.
          </UiText>

          <UiText>
            «Толку с него, как с козла молока, но вреда однако ж тоже никакого.»
            А в общем, приятно помолчать рядом.
          </UiText>

          <UiText>
            Этот тип являет собой чисто декоративную деталь офиса: за его
            обаятельной, а зачастую приторно-сладкой улыбкой нет никаких
            настоящих эмоций, а сплошное лицемерие и беспринципность.
          </UiText>

          <UiText>
            Хитросплетения его интриг обволакивают, от чего становится тесно и
            душно, вязко и липко. Личный комфорт для него — всё. Фетиш.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            И этот ленивец думает, что знает себе цену?!
          </UiText>

          <UiText>
            Но ошибается, милашка: он пустышка, и в глазах окружающих
            неадекватен до абсурда в своей самооценке.
          </UiText>

          <UiText>
            И не дай бог сравнить его с другими, и если при этом сравнение будет
            не в его пользу, что, мол, он аутсайдер, то впадает в полное
            недоверие, и начинает завидовать чужим успехам, особенно денежным.
          </UiText>

          <UiText preset="large" color="role">
            Но отнимите у него булочку, и он заснет.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-3" class="tab">
        <section>
          <UiText preset="large" color="role">
            Потому что Дипломаты — они, сука, положительные такие, что оторопь
            берет.
          </UiText>

          <UiText>
            Непрошибаемые, как танк, спокойные, как айсберг перед встречей с
            «Титаником», лыбятся по-монолизовскив ответ на любой выебон, и все
            им как с гуся вода.
          </UiText>

          <UiText>
            Надо сказать, что ассоциации с названием возникают самые что ни на
            есть авантюрно-приключенческие — подвески, кони, люди, королевская
            милость, все за одного и прочая хуйня; а на самом деле скучнее, чем
            Дипломат, могут быть только Мастера.
          </UiText>

          <UiText>
            И то Мастера при желании можно приставить к делу, и он будет
            торчать, где оставили, а вот Дипломата фиг заставишь — при всей
            показной тихушности в голове у нее есть четкое представление об
            идеальном мире.
          </UiText>

          <UiText>
            И мир этот напоминает кухню с большой плазмой над плитой.
          </UiText>

          <UiText>
            Что мы можем сказать об этих идеальных существах? Раздражают они нас
            страшно, потому что отсутствие недостатков неизменно настораживает и
            заставляет подозревать неладное.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Никакого двойного дна в Дипломате нет, и не ищите; ни острых углов,
            ни пошлых желаний, ни даже тайной порочной любви к портрету Бори
            Моисеева.
          </UiText>

          <UiText>
            Несмотря на иррациональность, жизнь их протекает распланированно,
            спокойно и последовательно, будто на обложке журнала «Настоящая
            женщина» (кстати, пол особого значения в данном случае не имеет);
          </UiText>

          <UiText>
            А в промежутках между приготовлением обедов, воспитанием детей и
            работой в какой-нибудь неприметной организации они успевают еще
            подобрать пару брошенных щенков/котят/головастиков.
          </UiText>

          <UiText>
            Родились они явно с серебряной поварешкой в заднице и нимбом на
            башке, и потому вечно хотят принести пользу ни в чем неповинному
            человечеству, но эдак ненавязчиво, в отличие от своих прямых
            конкурентов-Гуманистов, чью помощь попробуй только не принять – мало
            не покажется.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
