<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <div class="warning">
      <UiText preset="small" color="accent">
        Если вы не умеет воспринимать юмор, обидчивы или зависимы от мнений
        незнакомцев, пожалуйста, не читайте все что ниже.
      </UiText>

      <UiText preset="small" color="accent">
        Ненормативная лексика и сексуальные темы, оскорбление чувств всех
        причастных. Но весело и остроумно. Соблюдена авторская орфография и
        пунктуация.
      </UiText>
    </div>

    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Люркмор"
          subtitle="2 минуты"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Селютин"
          subtitle="4 минуты"
          target-content-id="tab-2"
        />

        <VariousTab
          title="Эльвира Фея"
          subtitle="2 минуты"
          target-content-id="tab-3"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText color="accent">
            <i>
              быдло, ФГМ, ПГМ, самурай, неудачник, модератор, паладин, вахтёр,
              дачник, internet white knight, ТП
            </i>
          </UiText>

          <UiText preset="large" color="role">
            Моралфаг, как и Гуманист, но с кулаками. Часто отличается резкостью
            оценок. Из-за чего часто вначале огребает пиздюлей, а затем ВНЕЗАПНО
            начинает раздавать их сам.
          </UiText>

          <UiText>
            Чотким Лидерам это рвёт шаблон, да и Новатором тоже достаётся — их
            биореактор, видите ли, неэтичен. Впрочем, последние могут потравить
            в ответ беспощадным будущим и прочей эмергенцией.
          </UiText>

          <UiText>
            В новой компании это, обычно, тихий, скромный человек. Обладатели
            пронзительного, испепеляющего взгляда, на окружающих смотрят как на
            говно в кубе (но признаются в этом крайне неохотно), внутренне свято
            убеждены, что познали истину в Первой, она же Последняя инстанции
            (но в этом уж точно НИКОГДА не сознаются).
          </UiText>

          <UiText>
            Последние инквизиторы этого мира, готовы перебить половину
            человечества ради мира во всём мире (но признаются в этом только по
            пьяни), за добро любому пасть порвут. Почти все супергерои относятся
            именно к этому социотипу.
          </UiText>

          <UiText>
            Встречаются, как быдло, так и небыдло-варианты. ИЧСХ, оба ненавидят
            быдло чуть более, чем полностью.
          </UiText>

          <UiText>Считается интегральным типом Украины и Канады.</UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">Бочка меда</UiText>
          <UiText preset="large" color="role">
            А кто ещё будет ответственно выполнять должностные обязанности
            невзирая на копеечную зарплату? Чувство долга же!
          </UiText>
          <UiText preset="small" color="accent">Ложка дегтя</UiText>
          <UiText preset="large" color="accent">
            В их присутсвии нельзя ржать над лохами и троллить их. Сами же они
            могут пинать и дрючить кого угодно.
          </UiText>
          <UiText preset="large" color="accent">
            Никто не имеет права трогать моего младшего брата, кроме меня!
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="large" color="role">
            Недоверчив, молчалив и спокоен до бешенства окружающих. Нерасчетлив
            в делах, и оттуда необоснованный риск.
          </UiText>

          <UiText>Он просто мелкий тиран какой-то.</UiText>

          <UiText>
            Этот за доброту любому пасть порвёт, и единственное, на что
            Хранители годны, так это ходить по инстанциям и выбивать
            чего-нибудь.
          </UiText>

          <UiText>
            Молчаливый, недоверчивый, себе на уме, консерватор. Коллекционер
            типа Плюшкина, немного жадина. Очень любит преподавать, но
            совершенно не может передать свои знания другим (наверное, от
            жадности).
          </UiText>

          <UiText preset="large" color="role">
            Развратник-моралист. В зависимости от того, что преобладает в
            характере, может быть либо развратником на словах и моралистом на
            деле, либо развратником на деле и моралистом на словах.
          </UiText>

          <UiText>
            Завидует чужому семейному счастью. Любит создавать щекотливые
            ситуации и разговаривать по душам.
          </UiText>

          <UiText preset="large" color="role">
            Не любит разговоров за своей спиной.
          </UiText>

          <UiText>
            Бабник, гипнотизер, обломист по мелочам, тот, который громче всех
            смеется, и, самое главное, автор книги «Секс для чайников».
          </UiText>
        </section>

        <section>
          <UiText>
            С ним хорошо работать только черному логику — он суггестируется и
            делает тогда хоть что-то. Что он делает в остальное время,
            недоумеваю. Как его переносят другие типы — тоже.
          </UiText>

          <UiText preset="large" color="role">
            Вечно плачет. Непревзойденный талант портить настроение.
          </UiText>

          <UiText>
            Мытьём, едой его жизнь начинается... тем же и заканчивается. Кроме
            вышесказанного его может интересовать только «как на него посмотрели
            и что о нём сказали».
          </UiText>

          <UiText>
            Не тяните его за язык: он, язык его, имеет свойство развязываться…
            развратно, как в строчках книги «Секс для чайников».
          </UiText>

          <UiText preset="large" color="role">
            Но и мораль в то же самое время так и льется с его уст. Этот плачь
            его песней зовется.
          </UiText>

          <UiText>
            И песнь эта уж очень многим портит настроение, создавая щекотливые
            двусмысленные ситуации; и все ради того, что ему интересно, как на
            него посмотрели и что о нём скажут.
          </UiText>

          <UiText preset="large" color="role">
            Хотите немного адреналина в кровь — заведите бизнес-партнера
            Хранителя! Инфаркт вам обеспечен.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-3" class="tab">
        <section>
          <UiText preset="large" color="role">
            Хранитель — это пиздец от соционики, и этим все сказано.
          </UiText>

          <UiText>
            Приближаться к ним не рекомендуется никому, будь вы хоть
            активатором, хоть, не побоимся этого громкого слова, полудуалом —
            если Хранитель вас заметил, то мы вам не завидуем.
          </UiText>

          <UiText>
            Хранители — главные скандалисты, довести до истерики могут даже
            святого (сиречь Гуманиста), и понять, что будет поводом для
            скандала, невозможно.
          </UiText>

          <UiText>
            В качестве доводов Хранитель может привести, как-то: рассказ о том,
            как вы ужасны были, есть и будете; бритву; веревку с мылом; вопли на
            весь район. А все почему? Да просто все не так, как хочется этим
            чистым, голубиным душам, последним инквизиторам этого мира.
          </UiText>

          <UiText>
            Искренней бескорыстной ненавистью ненавидят всю эту гребаную жизнь,
            и хотя они честно учатся, работают, трахаются и рожают детей, в
            глубине души они знают, что ни к чему хорошему оно все равно не
            придет, потому что все это НЕПРАВИЛЬНО.
          </UiText>

          <UiText>
            К слову, трахаться Хранители любят, шо пиздец, и заебут, в прямом и
            переносном смысле, любого; на внешний вид партнера им по большому
            счету плевать, но за недокрашенный глаз или криво завязанный галстук
            вас ждет долгий пиздеж или маленькая разборка.
          </UiText>

          <UiText>
            Еще они, суки, ревнивые и эмоциональные, потому орать на вас будут
            долго, по-любому.
          </UiText>
        </section>

        <section>
          <UiText>
            Хранители, как и Аналитики, всегда и все знают лучше, чем вы, однако
            на Аналитиков вы можете наорать или заехать в ебало на крайняк;
          </UiText>

          <UiText preset="large" color="role">
            Хранитель поддается переубеждению лишь с помощью гаубицы, и то не
            всегда.
          </UiText>

          <UiText>
            Кроме того, они махровые идеалисты и ханжи, набитые принципами и
            моралью по самое не балуйся, из чего логически вытекает, что главный
            враг для нормального Хранителя — это Предприниматель, который любой
            принцип оценивает исключительно в величинах денежной единицы.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
