<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Прекрасно осознает течение времени. Может предчувствовать неприятные ситуации, почувствовать тревогу за будущее.
  </UiText>

  <UiText class="description">
    Часто интересуются судьбами других людей, особенно знаменитых. Очень любят рассуждать о судьбе человека, о мистических совпадениях, о перерождении, часто увлекаются эзотерикой.
  </UiText>

  <UiText class="description">
    Необходимо уединение, наедине с собой они думают о смысле жизни, о том, как меняются люди со временем, о том, что дало прошлое, а что ждать от будущего.
  </UiText>

  <UiText class="description">
    Философы, они рассматривают любое явление глобально.
  </UiText>

  <br />
  
  <hr />

  <UiText class="description">
    Часто стоит у «кнопки» различных общественных процессов.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Прирожденный идеолог, обладающий исключительным стратегическим чутьем.
  </UiText>

  <UiText class="description">
    Способен прогнозировать события даже очень крупного масштаба надолго вперед.
  </UiText>

  <UiText class="description">
    Смело манипулирует временем своим и окружающих; умеет «приближать нужный момент».
  </UiText>

  <UiText class="description">
    «Пустого», бесполезного времени у него не бывает.
  </UiText>

</template>

<style lang="scss" scoped></style>
