<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Всегда знают, что можно сказать человеку, а что нельзя.
  </UiText>

  <UiText class="description">
    Они умеют выбрать подходящее время, чтобы подойти к человеку и попросить что-то сделать, избежав отказа.
  </UiText>

  <UiText class="description">
    Прекрасные манипуляторы, способны добиться от любого человека чего-угодно с помощью разговоров, комплиментов, случайных фраз.
  </UiText>

  <UiText class="description">
    Видит, как кто к нему относится, понимает, что нужно сделать, чтобы это отношение улучшить.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Сформулировав перспективы и определив цели, начинает к ним приближаться, опираясь на личные контакты и связи с людьми.
  </UiText>

  <UiText class="description">
    К каждому человеку он умеет подобрать свой ключик, найти свой подход, обеспечить взаимопонимание. Мастер компромисса, он прирожденный дипломат, переговорщик, умеющий наилучшим образом отстоять свою линию.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    С бесполезным или бездарным человеком  контактировать не станет. 
  </UiText>

  <UiText class="description">
    Все отношения склонен систематизировать и алгоритмизировать; легко объясняет и учит других, как следует общаться и достигать взаимопонимания.
  </UiText>

  <UiText class="description">
    Если ему необходимо, он демонстрирует дружелюбие и лояльность, но может мастерски испортить отношения с кем угодно, организовать конфликт любой степени тяжести.
  </UiText>

</template>

<style lang="scss" scoped></style>
