<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Умеет и любит объяснять различные явления и ситуации.
  </UiText>

  <UiText class="description">
    Чем меньше известно однозначных концепций по вопросу, тем с большим интересом он будет выдвигать свои объяснения и выводы.
  </UiText>

  <UiText class="description">
    Он легко может увидеть связь между различными схемами, определениями, он умеет жонглировать понятиями и доказывать недоказуемое.
  </UiText>

  <UiText class="description">
    Всегда пытается найти причинно-следственные связи между общим и частным, отыскать единое объяснение различным вещам.
  </UiText>

  <br />
  
  <hr />

  <UiText class="description">
    Прекрасно справляется с абстрактным анализом, легко манипулирует различными классификациями, схемами, алгоритмами, умеет безупречно грамотно и находчиво доказать свою точку зрения.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Не любит разрабатывать детали алгоритмов и классификаций, предпочитает сформулировать главную идею, а её доработку предоставить коллегам или подчиненным.
  </UiText>

  <UiText class="description">
    Способен разглядеть и обосновать связи между любыми явлениями действительности.
  </UiText>

  <UiText class="description">
    Отличается ярко выраженным научным складом ума.
  </UiText>

</template>

<style lang="scss" scoped></style>
