<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Умеют работать руками и очень хозяйственны. Они умеют заботиться о близких, держат квартиру в чистоте.
  </UiText>

  <UiText class="description">
    Часто становятся прекрасными дачниками с лучшими урожаями.
  </UiText>

  <UiText class="description">
    Способны превратить в уютное местечко даже старый сарай — они смастерят мебель, повесят коврик, поставят цветы — и все сразу выглядит совсем иначе.
  </UiText>

  <UiText class="description">
    Любят вкусно покушать и хорошо отдохнуть.
  </UiText>

  <UiText class="description">
    Люди этого типа умеют одеваться, прекрасно сочетают ткани и фасоны, часто сами шьют одежду.
  </UiText>

  <br />
  
  <hr />

  <UiText class="description">
    Руководствуется в основном эмоциями, противопоставляя свои чувства чувствам окружающих.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    В критические моменты часто не способен контролировать свою эмоциональность, его буквально переполняет энергия.
  </UiText>

  <UiText class="description">
    Умеет навязать другим свое настроение; старается, чтобы вокруг него все были веселы и радостны, но не считает нужным заниматься эмоциональным состоянием отдельных личностей.
  </UiText>

</template>

<style lang="scss" scoped></style>
