<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Прекрасно видит, кто как к кому относится, и способен это отношение менять в выгодную для себя сторону.
  </UiText>

  <UiText class="description">
    Может очаровать человека, всегда знает, как к кому подступиться.
  </UiText>

  <UiText class="description">
    Легко может помириться с кем-угодно, вернуть отношения в предыдущее состояние, манипулировать отношениями.
  </UiText>

  <UiText class="description">
    Для них отношения — это инструмент для достижения целей. Сможет договориться с кем-угодно на выгодных ему условиях.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Не жалеет сил на установление выгодной системы отношений: жесткой, бескомпромиссной и не предусматривающей ни для кого никаких исключений. 
  </UiText>

  <UiText class="description">
    Каждому отводится свое место, в зависимости от его волевых качеств или энергетических ресурсов.
  </UiText>

  <UiText class="description">
    Он часто отговаривает окружающих от неэтичных поступков и аморальных действий, причем этика и мораль его весьма своеобразны — такие, как удобно ему.
  </UiText>

</template>

<style lang="scss" scoped></style>
