<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Умеет окружить себя комфортом, он не будет работать в аскетичной обстановке.
  </UiText>

  <UiText class="description">
    Для работы выберет удобный стол, удобный стул, подберет освещение и сделает все так, чтобы никакой сенсорный дискомфорт не отвлекал его от дела.
  </UiText>

  <UiText class="description">
    Часто прекрасный кулинар и гурман, умеет приготовить еду «из ничего».
  </UiText>

  <UiText class="description">
    В доме у него чисто и уютно, он сам всегда выглядит опрятно и ухоженно. Следит за собой, не позволяет себе выглядеть плохо.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Умеет в каждой конкретной ситуации создавать себе и окружающим комфортные условия работы и отдыха. 
  </UiText>

  <UiText class="description">
    Никаких неприятных ощущений при осуществлении технологии быть не должно, и он усердно заботится об этом.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Проблемы текущего момента имеют более высокий приоритет по сравнению со стратегическими перспективами.
  </UiText>

  <UiText class="description">
    Материальные нужды людей и производства в его сознании довлеют над абстрактными познавательными или духовными задачами.
  </UiText>

  <UiText class="description">
    Комфорт и удобство он воспринимает только в целом, как нечто противоположное хаосу, беспорядку и дискомфорту.
  </UiText>

  <UiText class="description">
    Приятные ощущения его мало интересуют, зато принципиально важно отсутствие негативных впечатлений от столкновения с действительностью.
  </UiText>

  <UiText class="description">
    Заботится об окружающих весьма традиционно, в «патриархальном» ключе: предоставляет всем стандартный набор материальных благ и услуг — без изысков, но безупречно высокого качества.
  </UiText>

</template>

<style lang="scss" scoped></style>
