<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Умеет жонглировать фактами и данными. С помощью анализа данных выбирает наиболее правильный путь решения проблем.
  </UiText>

  <UiText class="description">
    Среди близких и знакомых людей каждому отводит определенное место и ждет действий в соответствии с положением.
  </UiText>

  <UiText class="description">
    В сложной ситуации, требующей нетривиального решения, может растеряться и потерять хватку.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Исключительно внимателен к деталям материального мира. Прекрасно чувствует естественную иерархию объектов. 
  </UiText>

  <UiText class="description">
    Способен из мелких материальных фрагментов создать целую систему, производящую ощутимый энергетический эффект.
  </UiText>

  <UiText class="description">
    Склонен «выдергивать» из текста отдельные фрагменты (или даже слова) и, манипулируя ими, доказывать неправоту автора и утверждать свое превосходство.
  </UiText>

</template>

<style lang="scss" scoped></style>
