<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Умеет увидеть, в чем человек силен, в чем его возможности, подбодрить, показать сильные стороны, указать, в каком направлении нужно двигаться.
  </UiText>

  <UiText class="description">
    В сложной жизненной ситуации способен найти выход, часто нестандартный и неочевидный.
  </UiText>

  <UiText class="description">
    Любит неординарные идеи и не боится неизвестности.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Способен во всех людях и во всех видах взаимоотношений находить перспективное, «хорошее», нуждающееся в поощрении.
  </UiText>

  <UiText class="description">
    Каждый человек, с его позиции, способный, добрый, нравственный, следовательно, достоин любви и понимания. 
  </UiText>

  <UiText class="description">
    С его точки зрения, обществу всегда есть куда развиваться, при этом горизонты развития представляются ему весьма расплывчато: куда двигаться, он знает, а как конкретно — не интересуется.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Для него очень важно, чтобы окружающие его люди «росли», развивались духовно и интеллектуально, и он готов для этого прилагать значительные усилия.
  </UiText>

  <UiText class="description">
    Сам тоже постоянно изыскивает новые возможности внутреннего роста, для него не существует безвыходных, тупиковых ситуаций.
  </UiText>

  <UiText class="description">
    Он знает, как решить любую этическую проблему с минимальными потерями.
  </UiText>

</template>

<style lang="scss" scoped></style>
