<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Никогда не пропустит интересные идеи для своих систем и концепций.
  </UiText>

  <UiText class="description">
    Этот человек способен создать действительно оригинальные решения проблем, он может придумать что-то кардинально новое и необычное.
  </UiText>

  <UiText class="description">
    Множество идей к нему поступают интуитивно: он может лишь догадываться, но это будет верное начало мыслительного процесса.
  </UiText>

  <UiText class="description">
    Доставляют радость сложные задачи и запутанные ситуации, он всегда найдет из них выход, да, к тому же, красивый и элегантный.
  </UiText>

  <br />
  
  <hr />

  <UiText class="description">
    Его собственная система взглядов на мир почти всегда отличается от общепринятой и не подвластна конъюнктурным соображениям.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Постоянно ищет (и находит) вокруг себя закономерности — в основном материального характера.
  </UiText>

  <UiText class="description">
    Убежден в существовании «абсолютной истины» и остается верен ей всю жизнь.
  </UiText>

  <UiText class="description">
    Отличается ярко выраженным научным складом ума.
  </UiText>

</template>

<style lang="scss" scoped></style>
