<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Четко отделяет полезные дела от бесполезных.
  </UiText>

  <UiText class="description">
    Старается жить так, чтобы потратить минимальное количество времени на работу, обеспечив себя максимальным количеством времени на отдых и хобби.
  </UiText>

  <UiText class="description">
    Всегда находит кратчайший путь к цели, старается не перетруждаться, считая, что работа нужна лишь для того, чтобы обеспечить хорошую и комфортную жизнь.
  </UiText>

  <UiText class="description">
    Люди этого типа редко бывают трудоголиками.
  </UiText>

  <UiText class="description">
    Перед началом любой работы просчитывает, как бы сделать её максимально быстро и эффективно, не потратив все ресурсы.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Любую технологию переделывает «под себя» или создает новую, оригинальную. 
  </UiText>

  <UiText class="description">
    Хорошо представляет себе принцип работы любой технической системы. Не склонен прорабатывать детали, но способен оценить общую эффективность проектов или механизмов и безошибочно отличить перспективную разработку от бесполезной.
  </UiText>

  <UiText class="description">
    Никто и ничто не может его заставить заниматься неэффективным с его точки зрения делом.
  </UiText>

</template>

<style lang="scss" scoped></style>
