<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Умеет постоять за себя и за своих близких. В ситуации конфликта способен надавить на человека.
  </UiText>

  <UiText class="description">
    В повседневной жизни старается держать себя в руках, является человеком уравновешенным и спокойным.
  </UiText>

  <UiText class="description">
    Для важна моральная победа над человеком, который обидел его или его близких.
  </UiText>

  <UiText class="description">
    Никогда не позволят говорить плохо о близких людях, такие беседы обрываются, а говорящие становятся врагами.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Свои взгляды, интересы и моральные принципы отстаивает силой. 
  </UiText>

  <UiText class="description">
    Это жесткий и волевой человек, он способен держать себя в руках в любой ситуации и умеет давить на других, причем на каждого по-разному: одного отечески пожурит, другому пригрозит наказанием, на третьего укоризненно посмотрит, четвертого ударит…
  </UiText>

  <UiText class="description">
    Иными словами, в каждом конкретном случае его воля проявляется по-своему, но всегда максимально эффективно.
  </UiText>

</template>

<style lang="scss" scoped></style>
