<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Способен поддерживать приятный эмоциональный фон в компании.
  </UiText>

  <UiText class="description">
    Умеет повеселить гостей, заставит улыбнуться грустного человека, утешит того, кому это необходимо.
  </UiText>

  <UiText class="description">
    Он прекрасно видит эмоции людей и понимает, как нужно себя вести с каждым из своих близких.
  </UiText>

  <UiText class="description">
    Очень любит неформальное общение, посиделки со вкусной едой и позитивными разговорами, может хорошо и остроумно шутить.
  </UiText>

  <UiText class="description">
    Когда рядом с ним происходит ссора, он старается помирить обе стороны, чтобы люди могли и дальше излучать положительные эмоции.
  </UiText>

  <UiText class="description">
    Старается не заводить себе врагов и недоброжелателей.
  </UiText>

  <br />
  
  <hr />

  <UiText class="description">
    Выражает свои эмоции таким образом, чтобы не испортить настроение себе и окружающим.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Очень артистичен, умело пользуется этим, легко создает вокруг себя приятную эмоциональную атмосферу; способен развеселить, утешить любого.
  </UiText>

</template>

<style lang="scss" scoped></style>
