<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Обладает гибким видением пространственных соотношений и пропорций. 
  </UiText>

  <UiText class="description">
    Воспринимает мир как гармонию линий в пространстве, гармонию физических ощущений, которая есть равновесие между простотой и изяществом форм.
  </UiText>

  <UiText class="description">
    Видит богатство форм, их абсолютную и относительную ценность, включая как красивое так и безобразное.
  </UiText>

  <UiText class="description">
    Способен приспосабливаться к дискомфорту, устранять неудобство с учетом принятых норм эстетики, текущей ситуации и возможного развития ситуации в будущем.
  </UiText>

  <UiText class="description">
    Трезво оценивает и применяет технические средства и материалы для достижения требуемого результата, учитывая конкретные возможности материала и инструмента для заданной цели.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Исходя из своих ощущений, выстраивает оптимальный алгоритм работы. Он не в состоянии трудиться, если не обеспечен комфорт.
  </UiText>

  <UiText class="description">
    Способен создавать и обосновывать исключительно точные и работоспособные методики выполнения различных операций.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Не признает безыходных положений в работе, если она связана с функционированием механизмов или даже целых производственных комплексов.
  </UiText>

  <UiText class="description">
    Его методики ориентированы на конкретный процесс и всегда соответствуют реалиям производства.
  </UiText>

  <UiText class="description">
    Динамика материального объекта исследуется им до тонкостей и оформляется в виде вполне однозначных инструкций по использованию данного объекта в повседневной жизни.
  </UiText>

</template>

<style lang="scss" scoped></style>
