<template>
  <div class="text">
    <section>
      <UiText preset="body" color="accent">
        Описания не должны обязательно совпадать со всеми чертами характера
        личности.
      </UiText>

      <UiText preset="small" color="accent">
        Идея как раз описать наблюдаемые у среднего представителя типа
        особенности поведения и обработки информации психикой.
      </UiText>

      <UiText preset="small" color="accent">
        Автор описания — Велта Микелсоне
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="role">
        Самый мечтательный соционический тип. Представители этого типа часто
        уходят «в себя», в свои фантазии и мысли.
      </UiText>

      <br />

      <UiText>
        Эмоциональный, склонен анализировать себя и других. Легко существует
        между реальностью и миром фантазий. Воображаемый мир — смысл его жизни и
        источник радости.
      </UiText>

      <UiText preset="large" color="role">
        Он любит жизнь и радуется каждому дню.
      </UiText>

      <UiText>
        Ему необходимы впечатления, яркие события, чувствовать, что он погружен
        во все происходящее.
      </UiText>

      <UiText>
        Ждет перемен тогда, когда чувствует конец предшествующего периода. Но
        перемены не случаются так быстро.
      </UiText>

      <UiText>
        Иногда выбирает фантастическую литературу, поскольку находит там ключ к
        познанию других людей и их мировоззрений. Углубляется в другой образ,
        примеряя его на себя.
      </UiText>
    </section>

    <section>
      <UiText>
        Изучает новые теории. Он часто идеализирует какого нибудь персонажа,
        проникает в его образ и проживает его жизнь. Ему всегда необходима
        идеология — если она разрушена, ищет другую. Взгляд лирика направлен в
        будущее.
      </UiText>

      <UiText>
        Хорошо чувствует развитие событий, изменения в обществе и людях. Ощущает
        благоприятные перемены — в себе, в обществе и в людях с течением
        времени. В повседневной жизни не пропустит ни одно важное событие.
      </UiText>

      <UiText>
        Когда предчувствует еле заметные перемены в обществе и предупреждает об
        этом других, создается впечатление, будто он находится под влиянием
        высших сил.
      </UiText>

      <UiText preset="large" color="role">
        Чувствует угрозу и приближение роковых событий. Это помогает
        предотвратить опасности.
      </UiText>

      <UiText>
        Точно определяет момент начала какого-нибудь события или когда
        необходимо приступать к действиям. Это незаменимо в непредвиденных и
        опасных ситуациях, в государственных переворотах.
      </UiText>
    </section>

    <section>
      <UiText>
        Неосознанно управляет своим и чужим временем. Он не испытывает
        недостатка времени, поэтому не спешит. Время для него – относительное
        понятие, которое он умело приспосабливает к своим желаниям! Дефицит
        времени будет его беспокоить.
      </UiText>

      <UiText>
        Пейзажи реальной жизни он в своем воображении дополняет, тем самым
        замечает новые возможности. Верит в светлое будущее и убеждает в этом
        других.
      </UiText>

      <UiText preset="large" color="role">
        Оценивает ошибки прошлого, не упрекает себя и не сожалеет о содеянном,
        считает что так накапливается опыт.
      </UiText>

      <UiText>
        Вспоминает события, доставившие ему неприятные моменты, анализирует их,
        чтобы впредь не ошибиться. Часто размышляет, старается понять свои
        ощущения и чувства.
      </UiText>

      <UiText>
        Талантливо определяет личные качества других, однако стремится все
        идеализировать. Дает ценные советы, но при этом не вторгается грубо в
        чужую душу. Внушает доверие, и люди сами открываются ему. Однако
        выслушивая чужие беды, чувствует себя опустошенным и усталым.
      </UiText>
    </section>

    <section>
      <UiText>
        В хорошем настроении любезен, ведет себя непринужденно, говорит только
        приятное, покоряет окружающих. События воспринимает эмоционально.
      </UiText>

      <UiText>
        Он миролюбив, спокоен, дружелюбен, одарен чувством юмора. Творчески
        владеет своими эмоциями, при необходимости способен их даже
        театрализовать.
      </UiText>

      <UiText preset="large" color="role">
        Отзывчивый и осторожный, старается освободиться от неприятных ощущений и
        задач.
      </UiText>

      <UiText>
        Избегает напряженных ситуаций и конфликтов, старается создать гармонию в
        общении, с помощью своих эмоций. Ведет себя доброжелательно и отзывчиво.
        Показное и преувеличенное проявление чувств ему не свойственно. Хорошо
        разбирается в сфере эмоций, замечает наигранность и фальшь в выражении
        чувств других.
      </UiText>

      <UiText>
        Охотнее увидит правдивый поступок, даже горькую правду, нежели
        таинственность и молчание человека.
      </UiText>

      <UiText>
        Естественно выражает свою симпатию или неприязнь, может без стеснения
        расплакаться или разозлиться. Тревожный, часто внутри испытывает
        волнение, даже страх, но свои переживания скрывает. Легко подвергается
        влиянию, соблазну, завоеванию.
      </UiText>
    </section>

    <section>
      <UiText>
        Убежден в том, что нельзя подпускать к себе всех одинаково близко. Лирик
        — отличный дипломат. Он прекрасно чувствует — о чем и с кем говорить,
        какие выгоды возможны из отношений. Умеет попросить так, чтобы ему не
        отказали. Чтобы получить одобрение окружающих, может создать необходимую
        атмосферу.
      </UiText>

      <UiText preset="large" color="role">
        Поддержка других его подбадривает. Мастерски распознает слабые места
        каждого.
      </UiText>

      <UiText>
        Выглядит уязвимым и беззащитным, поэтому нуждается в опекуне, который
        будет заботиться о нем и защищать. Если такой поддержки не получает,
        неосознанно становится жестоким, чтобы защитить себя.
      </UiText>

      <UiText preset="large" color="role">
        Не терпит монотонности, ему необходимы разнообразные впечатления.
      </UiText>

      <UiText>
        Не судит о человеке по внешнему виду. Манера вести себя оставляет
        благоприятное впечатление у окружающих, так как он соблюдает все правила
        приличий.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Поддержание регулярного порядка и создание уюта требуют от него огромных
        усилий.
      </UiText>

      <UiText>
        Особенно трудно бывает, когда нужно поддерживать регулярный порядок в
        помещении. В случае, когда накапливается работа, он не знает с чего
        начать, не успевает все сделать, поэтому может стать ко всему
        безразличным и апатичным. Мелкая работа его раздражает.
      </UiText>

      <UiText>
        Стремится выглядеть элегантно, заботится о своем внешнем виде, но не
        всегда успешно. Ему необходимо чувствовать, что он не потерял
        привлекательность, что изящно одет.
      </UiText>

      <UiText>
        Однако без помощи сенсорного партнера ему не удаëтся выглядеть
        безупречно.
      </UiText>

      <UiText>
        Замечает и ценит в других проявление красоты — в манерах и во внешности.
        Старается соответствовать принятым нормам общества. Восхищается
        сильными, аккуратными и уверенными в себе людьми, от которых охотно
        выслушивает советы, не возражая против волевого воздействия. Но не
        терпит, когда слабые люди навязывают ему своё мнение.
      </UiText>

      <UiText>
        Чтобы понять, как улучшить своё самочувствие, здоровье, бытовую
        обстановку, он охотно советуется с другими и ищет ответ в
        соответствующей литературе.
      </UiText>

      <UiText preset="large" color="role">
        Защищает свои взгляды, если убежден в их правоте.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Бывает, что заключает брак по расчету. Иногда такой союз ему кажется
        более устойчивым, чем союз во имя любви.
      </UiText>

      <UiText>
        Личная жизнь часто складывается неудачно, поскольку принимает желаемое
        за действительное, в каждом партнере стараясь увидеть только
        положительное. Живет во внутренних противоречиях — его натура как бы
        требует создать семью по расчету, но если он не полюбил партнера, его
        душа всю жизнь страдает от недостатка любви.
      </UiText>

      <UiText>
        Другая крайность — в молодости влюбляясь, и не осуществляя свою любовь,
        до конца жизни остается ей верен.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Чтобы восстановить силы и собраться с мыслями, ему необходимы моменты
        уединения для размышлений.
      </UiText>

      <UiText>
        Часто бывает, что долгое время сидит или лежит, просто мечтая. Довольно
        быстро устает, становится медлительным и нерешительным, откладывает
        работу «на потом». Часто эмоции влияют на принятие решений, поэтому
        поступки Лирика не всегда целесообразны. Он может увлечься чем то
        другим, бросив начатую работу.
      </UiText>

      <UiText>
        Следует заметить, что он не рожден быть предпринимателем, поэтому может
        переоценить свои способности и потерпеть в этом деле неудачу.
      </UiText>

      <UiText>
        Он — человек системы, который прекрасно работает в уже созданном
        учреждении. Но создать самому систему сложно. Это объясняется
        отсутствием деловой активности и хватки.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        С трудом решает финансовые вопросы. Неэффективные действия, непонимание
        принципов, ведущих к успеху, часто загоняет его в тупик.
      </UiText>

      <UiText>
        Замечено, что некоторые представили этого социотипа не тратят лишние
        деньги на других. С трудом экономит собственные средства, но боится
        остаться без денег. Покупки по большей части делает во внезапном порыве,
        и не всегда покупает полезные вещи.
      </UiText>

      <UiText preset="large" color="role">
        Для него характерна низкая самооценка и отсутствие веры в свои силы.
      </UiText>

      <UiText>
        В обществе может открыто заявить: «Я не могу, не способен на это!» Самое
        худшее, что неуверенность в собственные силы он переносит на своих
        близких, в том числе на детей.
      </UiText>

      <UiText preset="large" color="role">
        Нуждается в присутствии рядом сильного человека.
      </UiText>

      <UiText>
        Плохо соображает, что ему выбрать — где учиться и работать. Охотно
        выслушивает советы сильных и целеустремленных людей.
      </UiText>
    </section>

    <section>
      <UiText>
        Его раздражают ситуации, когда от него требуют выполнения задания в
        короткий срок. Становится активен, если понимает, как достичь цели, и
        осознает свою роль в процессе.
      </UiText>

      <UiText>
        Необходимо, чтобы многие практические вопросы ему объяснили.
      </UiText>

      <UiText preset="large" color="role">
        Характерно, что он сохраняет и собирает «на всякий случай» разные
        предметы, которые непригодны для использования.
      </UiText>

      <UiText>
        Проблема в том, что он не умеет оценить, что действительно нужно, а что
        нет. С годами вещи накапливаются в его доме, в подсобных помещениях до
        потолка, когда уже сам не помнит, что именно скопилось в его квартире.
      </UiText>

      <UiText>
        Качество «копить» в его понятии помогает готовиться к непредвиденными
        ситуациям в будущем.
      </UiText>

      <UiText preset="large" color="role">
        Жизненную философию можно охарактеризовать так — все нужное надо держать
        под рукой — и людей, и вещи.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        В спорах уступает, если другой умеет аргументировать и является его
        авторитетом.
      </UiText>

      <UiText>
        Без строгого руководства расслабляется, становится рассеянным и
        неряшливым.
      </UiText>

      <UiText>
        Интуиция дает ему внутреннюю уверенность и позволяет понять скрытую
        сущность вещей и явлений, но слабая логика не позволяет принимать
        разумные решения сейчас и сразу.
      </UiText>

      <UiText>Ему необходимо время для обдумывания.</UiText>

      <UiText>
        В работе его вдохновляет точная, ясная, обоснованная и убедительная
        информация.
      </UiText>

      <UiText preset="large" color="role">
        Несобранность и хаотичность в действиях, недостаток мотивации, а также
        нехватка денег наводит на него печаль и хандру.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
