<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    

    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Велта Микелсоне"
          subtitle="12 минут"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Вера Стратиевская"
          subtitle="31 минута"
          target-content-id="tab-2"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText preset="subtitle" color="role">
            Самый мечтательный соционический тип. Представители этого типа часто
            уходят «в себя», в свои фантазии и мысли.
          </UiText>

          <br />

          <UiText>
            Эмоциональный, склонен анализировать себя и других. Легко существует
            между реальностью и миром фантазий. Воображаемый мир — смысл его
            жизни и источник радости.
          </UiText>

          <UiText preset="large" color="role">
            Он любит жизнь и радуется каждому дню.
          </UiText>

          <UiText>
            Ему необходимы впечатления, яркие события, чувствовать, что он
            погружен во все происходящее.
          </UiText>

          <UiText>
            Ждет перемен тогда, когда чувствует конец предшествующего периода.
            Но перемены не случаются так быстро.
          </UiText>

          <UiText>
            Иногда выбирает фантастическую литературу, поскольку находит там
            ключ к познанию других людей и их мировоззрений. Углубляется в
            другой образ, примеряя его на себя.
          </UiText>
        </section>

        <section>
          <UiText>
            Изучает новые теории. Он часто идеализирует какого нибудь персонажа,
            проникает в его образ и проживает его жизнь. Ему всегда необходима
            идеология — если она разрушена, ищет другую. Взгляд лирика направлен
            в будущее.
          </UiText>

          <UiText>
            Хорошо чувствует развитие событий, изменения в обществе и людях.
            Ощущает благоприятные перемены — в себе, в обществе и в людях с
            течением времени. В повседневной жизни не пропустит ни одно важное
            событие.
          </UiText>

          <UiText>
            Когда предчувствует еле заметные перемены в обществе и предупреждает
            об этом других, создается впечатление, будто он находится под
            влиянием высших сил.
          </UiText>

          <UiText preset="large" color="role">
            Чувствует угрозу и приближение роковых событий. Это помогает
            предотвратить опасности.
          </UiText>

          <UiText>
            Точно определяет момент начала какого-нибудь события или когда
            необходимо приступать к действиям. Это незаменимо в непредвиденных и
            опасных ситуациях, в государственных переворотах.
          </UiText>
        </section>

        <section>
          <UiText>
            Неосознанно управляет своим и чужим временем. Он не испытывает
            недостатка времени, поэтому не спешит. Время для него –
            относительное понятие, которое он умело приспосабливает к своим
            желаниям! Дефицит времени будет его беспокоить.
          </UiText>

          <UiText>
            Пейзажи реальной жизни он в своем воображении дополняет, тем самым
            замечает новые возможности. Верит в светлое будущее и убеждает в
            этом других.
          </UiText>

          <UiText preset="large" color="role">
            Оценивает ошибки прошлого, не упрекает себя и не сожалеет о
            содеянном, считает что так накапливается опыт.
          </UiText>

          <UiText>
            Вспоминает события, доставившие ему неприятные моменты, анализирует
            их, чтобы впредь не ошибиться. Часто размышляет, старается понять
            свои ощущения и чувства.
          </UiText>

          <UiText>
            Талантливо определяет личные качества других, однако стремится все
            идеализировать. Дает ценные советы, но при этом не вторгается грубо
            в чужую душу. Внушает доверие, и люди сами открываются ему. Однако
            выслушивая чужие беды, чувствует себя опустошенным и усталым.
          </UiText>
        </section>

        <section>
          <UiText>
            В хорошем настроении любезен, ведет себя непринужденно, говорит
            только приятное, покоряет окружающих. События воспринимает
            эмоционально.
          </UiText>

          <UiText>
            Он миролюбив, спокоен, дружелюбен, одарен чувством юмора. Творчески
            владеет своими эмоциями, при необходимости способен их даже
            театрализовать.
          </UiText>

          <UiText preset="large" color="role">
            Отзывчивый и осторожный, старается освободиться от неприятных
            ощущений и задач.
          </UiText>

          <UiText>
            Избегает напряженных ситуаций и конфликтов, старается создать
            гармонию в общении, с помощью своих эмоций. Ведет себя
            доброжелательно и отзывчиво. Показное и преувеличенное проявление
            чувств ему не свойственно. Хорошо разбирается в сфере эмоций,
            замечает наигранность и фальшь в выражении чувств других.
          </UiText>

          <UiText>
            Охотнее увидит правдивый поступок, даже горькую правду, нежели
            таинственность и молчание человека.
          </UiText>

          <UiText>
            Естественно выражает свою симпатию или неприязнь, может без
            стеснения расплакаться или разозлиться. Тревожный, часто внутри
            испытывает волнение, даже страх, но свои переживания скрывает. Легко
            подвергается влиянию, соблазну, завоеванию.
          </UiText>
        </section>

        <section>
          <UiText>
            Убежден в том, что нельзя подпускать к себе всех одинаково близко.
            Лирик — отличный дипломат. Он прекрасно чувствует — о чем и с кем
            говорить, какие выгоды возможны из отношений. Умеет попросить так,
            чтобы ему не отказали. Чтобы получить одобрение окружающих, может
            создать необходимую атмосферу.
          </UiText>

          <UiText preset="large" color="role">
            Поддержка других его подбадривает. Мастерски распознает слабые места
            каждого.
          </UiText>

          <UiText>
            Выглядит уязвимым и беззащитным, поэтому нуждается в опекуне,
            который будет заботиться о нем и защищать. Если такой поддержки не
            получает, неосознанно становится жестоким, чтобы защитить себя.
          </UiText>

          <UiText preset="large" color="role">
            Не терпит монотонности, ему необходимы разнообразные впечатления.
          </UiText>

          <UiText>
            Не судит о человеке по внешнему виду. Манера вести себя оставляет
            благоприятное впечатление у окружающих, так как он соблюдает все
            правила приличий.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Поддержание регулярного порядка и создание уюта требуют от него
            огромных усилий.
          </UiText>

          <UiText>
            Особенно трудно бывает, когда нужно поддерживать регулярный порядок
            в помещении. В случае, когда накапливается работа, он не знает с
            чего начать, не успевает все сделать, поэтому может стать ко всему
            безразличным и апатичным. Мелкая работа его раздражает.
          </UiText>

          <UiText>
            Стремится выглядеть элегантно, заботится о своем внешнем виде, но не
            всегда успешно. Ему необходимо чувствовать, что он не потерял
            привлекательность, что изящно одет.
          </UiText>

          <UiText>
            Однако без помощи сенсорного партнера ему не удаëтся выглядеть
            безупречно.
          </UiText>

          <UiText>
            Замечает и ценит в других проявление красоты — в манерах и во
            внешности. Старается соответствовать принятым нормам общества.
            Восхищается сильными, аккуратными и уверенными в себе людьми, от
            которых охотно выслушивает советы, не возражая против волевого
            воздействия. Но не терпит, когда слабые люди навязывают ему своё
            мнение.
          </UiText>

          <UiText>
            Чтобы понять, как улучшить своё самочувствие, здоровье, бытовую
            обстановку, он охотно советуется с другими и ищет ответ в
            соответствующей литературе.
          </UiText>

          <UiText preset="large" color="role">
            Защищает свои взгляды, если убежден в их правоте.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Бывает, что заключает брак по расчету. Иногда такой союз ему кажется
            более устойчивым, чем союз во имя любви.
          </UiText>

          <UiText>
            Личная жизнь часто складывается неудачно, поскольку принимает
            желаемое за действительное, в каждом партнере стараясь увидеть
            только положительное. Живет во внутренних противоречиях — его натура
            как бы требует создать семью по расчету, но если он не полюбил
            партнера, его душа всю жизнь страдает от недостатка любви.
          </UiText>

          <UiText>
            Другая крайность — в молодости влюбляясь, и не осуществляя свою
            любовь, до конца жизни остается ей верен.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Чтобы восстановить силы и собраться с мыслями, ему необходимы
            моменты уединения для размышлений.
          </UiText>

          <UiText>
            Часто бывает, что долгое время сидит или лежит, просто мечтая.
            Довольно быстро устает, становится медлительным и нерешительным,
            откладывает работу «на потом». Часто эмоции влияют на принятие
            решений, поэтому поступки Лирика не всегда целесообразны. Он может
            увлечься чем то другим, бросив начатую работу.
          </UiText>

          <UiText>
            Следует заметить, что он не рожден быть предпринимателем, поэтому
            может переоценить свои способности и потерпеть в этом деле неудачу.
          </UiText>

          <UiText>
            Он — человек системы, который прекрасно работает в уже созданном
            учреждении. Но создать самому систему сложно. Это объясняется
            отсутствием деловой активности и хватки.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            С трудом решает финансовые вопросы. Неэффективные действия,
            непонимание принципов, ведущих к успеху, часто загоняет его в тупик.
          </UiText>

          <UiText>
            Замечено, что некоторые представили этого социотипа не тратят лишние
            деньги на других. С трудом экономит собственные средства, но боится
            остаться без денег. Покупки по большей части делает во внезапном
            порыве, и не всегда покупает полезные вещи.
          </UiText>

          <UiText preset="large" color="role">
            Для него характерна низкая самооценка и отсутствие веры в свои силы.
          </UiText>

          <UiText>
            В обществе может открыто заявить: «Я не могу, не способен на это!»
            Самое худшее, что неуверенность в собственные силы он переносит на
            своих близких, в том числе на детей.
          </UiText>

          <UiText preset="large" color="role">
            Нуждается в присутствии рядом сильного человека.
          </UiText>

          <UiText>
            Плохо соображает, что ему выбрать — где учиться и работать. Охотно
            выслушивает советы сильных и целеустремленных людей.
          </UiText>
        </section>

        <section>
          <UiText>
            Его раздражают ситуации, когда от него требуют выполнения задания в
            короткий срок. Становится активен, если понимает, как достичь цели,
            и осознает свою роль в процессе.
          </UiText>

          <UiText>
            Необходимо, чтобы многие практические вопросы ему объяснили.
          </UiText>

          <UiText preset="large" color="role">
            Характерно, что он сохраняет и собирает «на всякий случай» разные
            предметы, которые непригодны для использования.
          </UiText>

          <UiText>
            Проблема в том, что он не умеет оценить, что действительно нужно, а
            что нет. С годами вещи накапливаются в его доме, в подсобных
            помещениях до потолка, когда уже сам не помнит, что именно скопилось
            в его квартире.
          </UiText>

          <UiText>
            Качество «копить» в его понятии помогает готовиться к
            непредвиденными ситуациям в будущем.
          </UiText>

          <UiText preset="large" color="role">
            Жизненную философию можно охарактеризовать так — все нужное надо
            держать под рукой — и людей, и вещи.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            В спорах уступает, если другой умеет аргументировать и является его
            авторитетом.
          </UiText>

          <UiText>
            Без строгого руководства расслабляется, становится рассеянным и
            неряшливым.
          </UiText>

          <UiText>
            Интуиция дает ему внутреннюю уверенность и позволяет понять скрытую
            сущность вещей и явлений, но слабая логика не позволяет принимать
            разумные решения сейчас и сразу.
          </UiText>

          <UiText>Ему необходимо время для обдумывания.</UiText>

          <UiText>
            В работе его вдохновляет точная, ясная, обоснованная и убедительная
            информация.
          </UiText>

          <UiText preset="large" color="role">
            Несобранность и хаотичность в действиях, недостаток мотивации, а
            также нехватка денег наводит на него печаль и хандру.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="small" color="accent">1 — Базовая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_time" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чутьё</UiText>
              <UiText preset="body">Интуиция времени</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Романтик и мечтатель. Время для него — это пластичный творческий
            материал, который можно «сжать» или «растянуть» по своему
            усмотрению.
          </UiText>

          <UiText>
            Лирик может остановить мгновение, потому что оно «прекрасно», и
            любоваться им столько, сколько ему захочется.
          </UiText>

          <UiText color="role">
            Лирик очень ценит свое время, особенно время своего приятного досуга
            и удовольствий. Время, проведенное недостаточно приятно и интересно,
            — это не просто потерянное время, это, в его понимании, некая
            досадная оплошность, которую надо по возможности не допускать.
          </UiText>

          <UiText>
            Любит жить по свободному графику, ему удобнее распоряжаться временем
            спонтанно. Очень переживает, если его приятные планы по чьей-либо
            вине реализуются не так, как ему хотелось бы.
          </UiText>

          <UiText preset="large" color="role">
            Если, не дай Бог, его не пригласили на праздник или в чем-нибудь
            ограничили его «веселье» — это уже повод для серьезного раздражения.
          </UiText>

          <UiText>
            Но еще болезненнее им переносится крушение глобальных позитивных
            планов: например, когда рушатся его расчеты и не оправдываются его
            надежды, когда близкая и желанная цель оказывается вдруг далекой и
            недостижимой, когда кто-либо отказывает ему в своей поддержке, в
            своем покровительстве и вытряхивает его из-под своего «крыла» — все
            это для Лирика тяжелейшие удары судьбы, с которыми он никак не может
            примириться и которых он постарается всеми силами не допускать, и в
            большинстве случаев — не допускает.
          </UiText>

          <UiText>
            Несмотря на кажущееся отстраненно-мечтательное отношение к жизни,
            Лирик способен достаточно реалистично оценивать окружающие его
            явления. Он умеет предвидеть нежелательное для себя развитие
            событий, умеет отвести от себя удар, умеет «заморозить» этот удар во
            времени и тем самым приглушить его силу.
          </UiText>

          <UiText>
            Умеет оттянуть время решающего объяснения и время назревающего
            конфликта. Он изменит тактику и постарается взять ситуацию в свои
            руки так, чтобы успеть подготовиться к неприятному для себя исходу
            Например, найдет себе другое «крыло» или другой источник доходов.
          </UiText>

          <UiText preset="large" color="role">
            Лирик задает темпы развития отношений сообразно собственным
            интересам и собственным перспективным планам.
          </UiText>

          <UiText color="role">
            Лирик «дирижирует» временем — и своим собственным, и чужим. Он всех
            подчиняет своим темпам — всех втягивает в свой жизненный ритм.
          </UiText>

          <UiText>
            Если ему лично некуда спешить, то и его собеседник никуда спешить не
            будет: он просто увязнет в навязанном ему медленном темпе.
          </UiText>

          <UiText preset="large" color="role">
            Лирик — как та фея из сказки, которая способна превратить жизнь
            любого человека в «сладкий сон», причем, «проснувшись», человек
            может почувствовать себя отброшенным во времени далеко назад, с
            сознанием непоправимо упущенных возможностей.
          </UiText>

          <UiText>
            Лирик — хороший партнер только тому, кто постоянно продвигается
            вперед, к намеченным целям - именно таковым является его дуал Лидер.
          </UiText>

          <UiText>
            Лирика раздражает, когда не подчиняются его «дирижерским» указаниям.
            Особенно, когда наступает «критический момент», который он всегда
            хорошо видит: тут он любого «пробудит от спячки» и заставит
            действовать, особенно если это и в его интересах.
          </UiText>

          <UiText>
            У Лирика всегда есть ровно столько времени, сколько ему нужно. Он не
            ставит перед собой непосильных задач и нереальных целей, его день не
            перегружен делами. Он всегда успевает туда, куда ему нужно.
          </UiText>

          <UiText preset="large" color="role">
            Не любит жестко планировать свой день, не любит быть в плену у
            собственных планов — ни ближайших, ни далеких.
          </UiText>

          <UiText>
            Лирику совсем не обязательно быть пунктуальным, особенно если ему
            это не нужно, но он может без труда приходить вовремя, если только
            пожелает.
          </UiText>

          <UiText>
            Время Лирика служит только его интересам. Он умеет «пересидеть»
            смутное время в какой-нибудь «тихой гавани» или устроить себе
            «инкубационный период» под чьим-нибудь «крылом» — теплее всего Лирик
            себя чувствует под «крылом» своего дуала Лидера.
          </UiText>

          <UiText preset="large" color="role">
            Лирик часто производит впечатление человека, которому удача «сама
            идет в руки». Благодаря своей исключительной интуиции, он никогда не
            упустит время «подловить» свой шанс — качество, которому многие
            завидуют и благодаря которому представителям этого типа удаëтся
            очень неплохо устроиться в жизни.
          </UiText>

          <UiText color="role">
            Всегда в курсе всех событий, всех новостей. Всегда знает направление
            общественного мнения, знает, «в какую сторону ветер дует». Все новые
            веяния, все новые направления — все это ему известно.
          </UiText>

          <UiText>
            Не верит в стабильность неприятностей — знает, что они преходящи.
            Всегда радуется наступлению критического момента. Поэтому даже о
            самых, казалось бы, мрачных событиях Лирик сообщает с улыбкой.
            Всегда надеется и очень много ожидает от перемен, наступающих после
            кризиса. Старается их выгодно для себя использовать.
          </UiText>

          <UiText preset="large" color="role">
            Отчаянно сопротивляется, когда ему навязывают вынужденную,
            нецелесообразную, в его понимании, трату времени. Всегда старается
            доказать ненужность этой траты времени.
          </UiText>

          <UiText>
            Переубедить его бывает очень трудно, иногда — бесполезно, потому что
            в этом случае он склонен поступать только по-своему.
          </UiText>

          <UiText>
            Время Лирика всегда принадлежит только ему. Даже рабочее время Лирик
            считает своим собственным: хочет — работает, хочет — отвлекается на
            какие-то свои личные дела или разговоры. Лирик очень ценит свое
            время, и даже если уделяет его другим, рассматривает это как щедрый
            подарок со своей стороны, за который ему должны быть благодарны.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">2 — Творческая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_emotions" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Желание</UiText>
              <UiText preset="body">Этика эмоций</UiText>
            </span>
          </div>

          <UiText>
            Второй своей ценностью, которой он щедро одаривает окружающих, Лирик
            считает умение создавать приятное настроение и доставлять
            удовольствие своим обществом.
          </UiText>

          <UiText preset="large" color="role">
            Ко всем наблюдаемым явлениям Лирик постоянно проявляет чрезвычайно
            живое эмоциональное отношение. Казалось бы, не существует в природе
            такого объекта, субъекта или события, которое бы оставило его
            равнодушным.
          </UiText>

          <UiText>
            Это качество необычайно располагает к нему людей. Кажется немыслимым
            оттолкнуть человека, который так искренне восхищается всем, что в
            тебе есть хорошего, который видит в тебе столько интересного,
            сколько раньше тебе самому и не представлялось.
          </UiText>

          <UiText>
            А как он умеет слушать, восторженно глядя в глаза собеседнику, так,
            что кажется ничего в своей жизни мудрее не слышал!
          </UiText>

          <UiText>
            А его милая, добрая, скромная улыбка — как «солнечный зайчик» на
            лице. Иногда мечтательная, иногда лукавая, но такая
            доброжелательная, оптимистичная и ободряющая.
          </UiText>

          <UiText>
            Настроение Лирика — тоже, как солнечный лучик: приветливый,
            уступчивый, ласковый, беззаботно-веселый, в романтическо
            мечтательном состоянии души, он фантазирует на какую-нибудь
            отвлеченную тему, и весь мир как будто окрашивается яркими красками,
            наполняется солнечным светом и «сверкает росой».
          </UiText>

          <UiText>
            Блаженное, как сладкий дурман состояние, сказочный сон, который
            хочется продлевать до бесконечности, но который закончится именно
            тогда, когда Лирика сочтет нужным его оборвать.
          </UiText>

          <UiText>
            Лирика не любит, когда какой-то внешний раздражитель разрушает его
            миражно-воздушную гармонию — в такую минуту он чувствует себя
            художником загубленного творения.
          </UiText>

          <UiText>
            Было бы неправильным воспринимать Лирика как некую дурман-траву,
            призванную задурить голову или усыпить бдительность всех окружающих
            его людей. Вовсе нет! Первейшая его психологическая задача
            заключается в том, чтобы максимально расслабить своего дуала Лидера,
            вечно напряженного и склонного к перегрузкам.
          </UiText>

          <UiText preset="large" color="role">
            Лирик — художник настроения: какую «картину» нарисует — так тому и
            быть.
          </UiText>

          <UiText color="role">
            Настроение — инструмент его воздействия на окружение. Настроением он
            может «одарить», а может и наказать. В его понимании, настроение —
            это всегда нечто материальное, это своего рода произведение
            искусства.
          </UiText>

          <UiText>
            В случае, когда созданное им настроение «безмятежного покоя» не
            оценивается и должным образом не вознаграждается, Лирик считает
            нужным «нарисовать другую картинку», в других эмоциональных красках,
            но не менее ярких и насыщенных. Настроение для Лирика — это еще и
            способ манипулировать окружением.
          </UiText>

          <UiText preset="large" color="role">
            Мало кто умеет так нещадно злословить и исступлённо скандалить,
            наращивая силу своего эмоционального воздействия, как Лирик.
          </UiText>

          <UiText>
            Вот уж кто может прижечь словом, как раскалённым железом, —
            припечатает, мало не покажется! Лирик — один из самых злоязычных
            типов!
          </UiText>

          <UiText>
            Уж, если сразит, так наверняка, чтобы партнер сумел получше усвоить
            полученный урок, сделать вывод из собственных ошибок и постарался
            как можно скорее их исправить, с тем чтобы не повторять впредь.
          </UiText>

          <UiText>
            Опять же, эта болезненная этическая манипуляция психологически
            рассчитана только на Лидера, на его инертную эмоциональность и
            несколько неуклюжую этику. Но то, что для Лидера не более, чем
            эффективный способ эмоциональной активации, для других, особенно
            эмоционально ранимых типов личности, может обернуться совершенно
            нестерпимой пыткой.
          </UiText>

          <UiText preset="large" color="role">
            В общении Лирик берет довольно близкую психологическую дистанцию,
            вследствие чего может ощущать себя слишком уязвимым и слишком
            зависимым от партнера.
          </UiText>

          <UiText color="role">
            Поэтому его скандалы — это не более чем вынужденная мера, цель
            которой, с одной стороны, отрегулировать психологическую дистанцию,
            с другой — привлечь внимание к своим проблемам и выразить свои
            требования в той форме, в какой они удобнее всего воспринимаются его
            дуалом.
          </UiText>

          <UiText>
            Лирик не способен говорить о своих проблемах «деловым тоном» — это в
            его понимании слишком грубо и бестактно: ведь он сориентирован на
            уязвимую эмоциональность и демонстративную прагматичность Лидера.
            Поэтому считает, что достаточно тонкого и тактичного полунамека,
            чтобы партнер его правильно понял и сам предложил свои услуги.
          </UiText>

          <UiText color="role">
            Лирик чувствует себя очень неловко, когда заданный им эмоциональный
            тон не находит должного отклика и поддержки у окружающих: у Лирика
            начинаются резкие перепады настроения, которые также выливаются в
            скандал.
          </UiText>

          <UiText preset="large" color="role">
            Лирик очень легко умеет настроиться на собеседника, почувствовать
            его. И если у него почему-либо не налаживается контакт, это его
            всегда настораживает.
          </UiText>

          <UiText>
            Лирик начинает размышлять, по каким таким причинам его «не
            подпускают», возможно этот человек не так прост, как кажется, или
            может быть даже опасен, срабатывает его отрицательная интуиция
            времени — стремление уйти от опасности.
          </UiText>

          <UiText>
            Выставляя эмоциональную оценку этическим качествам окружающих, Лирик
            делает это сообразно своему настроению: находясь в хорошем
            расположении духа, восторгается теми, кто ему симпатичен, в плохом —
            «перемывает косточки» всем остальным.
          </UiText>

          <UiText>
            В состоянии раздражения у него возникает непреодолимое желание
            говорить «в лицо» самые вздорные и неприятные вещи
          </UiText>

          <UiText color="role">
            Периодически Лирик может проявлять себя как зачинщик конфликтов —
            способ, необходимый ему для выяснения собственного положения в
            системе отношений.
          </UiText>

          <UiText>
            Вся многообразная гамма чувств и настроений Лирика — это не только
            его «художественная палитра», это еще и его «инструментарий», и его
            «оружейный склад».
          </UiText>

          <UiText preset="large" color="role">
            Лирик уверен в своем обаянии, в своей привлекательности, в арсенале
            своих очень милых и симпатичных масок, которыми он великолепно
            пользуется.
          </UiText>

          <UiText color="role">
            Причем это не внешние маски: любая из них — как бы своеобразное
            состояние его души.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">3 — Ролевая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_comfort" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Комфорт</UiText>
              <UiText preset="body">Сенсорика ощущений</UiText>
            </span>
          </div>

          <UiText>
            Аспект сенсорики ощущений тем лучше воспринимается представителями
            этого типа, чем ярче и определеннее выстраивается эмоциональный
            образ, сопутствующий этим ощущениям.
          </UiText>

          <UiText preset="large" color="role">
            Именно поэтому они с большим успехом занимаются теми видами
            искусства, где вся их «эмоциональная палитра» находит наиболее яркое
            применение — музыка, театр, поэзия.
          </UiText>

          <UiText color="accent">
            Например музыканты-Лирики часто воспринимают красоту звука именно
            через его выразительность: красивый звук — эмоционально насыщенный,
            богатый обертонами, некрасивый звук — невыразительный, «пустой». То
            же относится и к восприятию цветовых сочетаний: красивое сочетание —
            то, которое рождает какой-то эмоциональный образ или эмоциональные
            ассоциации.
          </UiText>

          <UiText color="accent">
            Например дизайнер-Лирик, долго и безуспешно подбирал сочетания
            цветов для своего проекта, потом, вдруг, «под настроение» нарисовал
            какую-то картинку, и цвета из этого рисунка перевел на свою работу.
          </UiText>

          <UiText>
            Представители этого типа обычно считают себя эстетами, хотя
            эстетический вкус развивают на протяжении всей своей жизни.
          </UiText>

          <UiText color="role">
            С удовольствием пробуют себя в разных областях искусства, посещают
            выставки, концерты, премьеры. Кем бы он ни был — художником, актером
            или музыкантом, Лирик никогда не замыкается только на одной области
            искусства.
          </UiText>

          <UiText preset="large" color="role">
            Яркие впечатления, которые он набирает в различных областях
            искусства, реализует в сфере своей профессиональной деятельности.
          </UiText>

          <UiText>
            Внимательно следит за всевозможными новшествами в искусстве и в
            эстетике. Моднейшие журналы, проспекты и рекламные каталоги — все
            это можно увидеть в избытке в его доме.
          </UiText>

          <UiText>
            Лирики могут подолгу сохранять даже случайные рекламки, попавшие к
            ним в дом. Просто потому, что нравится картинка, или они
            действительно мечтают купить когда-нибудь такую вещь.
          </UiText>

          <UiText color="role">
            Как уже говорилось, Лирик очень любит мечтать и часто мысленно
            материализует свою мечту, поэтому рекламная картинка — тоже
            своеобразная форма материализации его мечты: «Когда-нибудь я куплю
            себе такую машинку!»
          </UiText>

          <UiText>
            В эстетических ориентирах представителям этого типа свойственно
            некоторое противоречие: с одной стороны, они консервативны в своих
            вкусах, с другой — открыты для всего нового и наимоднейшего. В
            одежде носят либо то, к чему традиционно привыкли, либо то, что «все
            сейчас носят», независимо от того, идет это им или нет.
          </UiText>

          <UiText>
            Так же и в области вкусовых ощущений: наравне с традиционной и
            довольно однообразной едой могут приготовить по новейшему рецепту
            экстравагантное кушанье весьма сомнительных вкусовых сочетаний.
          </UiText>

          <UiText color="role">
            Когда Лирику становится тесно в установившихся сенсорных рамках или
            приедается уже много раз испытанное, он не прочь попробовать для
            себя какие-то новые, иногда эстетически противоречивые ощущения.
          </UiText>

          <UiText preset="large" color="role">
            Лирик любит блеснуть галантными манерами, выходя «в свет», стремится
            выглядеть изящно и элегантно. Хорошо себя чувствует в обстановке
            роскоши и комфорта.
          </UiText>

          <UiText>
            Любит окружать себя красивыми вещами, любит дарить себе и другим
            маленькие «прелестные пустячки».
          </UiText>

          <UiText color="accent">
            Конечно, Лирик не будет возражать и против подарка «деньгами» — но
            он их быстро растратит, так и не вспомнив, на что. Лирику всегда
            приятно получить на память дорогую и красивую вещь, о которой потом
            можно сказать: «Твой сервиз всем так нравится! Все говорят: «Боже,
            какая прелесть!..» Ну, раз все говорят, можно быть уверенным, что
            так оно и есть. Эстетический вкус Лирика часто формируется под
            влиянием общественного мнения.
          </UiText>

          <UiText>
            Некоторые затруднения представляют для Лирика организация
            собственного быта, наведение в нем уюта и особенно поддержание
            порядка. Обычно, с энтузиазмом принимаясь за решение этой проблемы,
            он довольно быстро охладевает, столкнувшись с первыми трудностями.
          </UiText>

          <UiText>
            А поскольку, как уже говорилось, Лирик не любит тратить время на
            неприятные дела, ему довольно редко удаëтся собственными силами
            организовать «уютное гнездышко» и поддерживать в нем порядок.
            Подсознательно он полагается на возможность, что за него это сделает
            кто-то другой.
          </UiText>

          <UiText>
            Такая возможность действительно предоставляется в лице его дуала
            Лидера, который со свойственной ему этической непосредственностью
            способен, будучи первый раз в доме, прямо «с порога» сказать: «А
            ничего у вас квартирка, тут надо бы паркет поменять, тут мы
            покрасим...» Может, кого другого и насторожило бы такое проявление
            инициативы — только не Лирика: он наоборот будет счастлив
            воспользоваться предложенной помощью.
          </UiText>

          <UiText>
            Лирик с удовольствием полагается на умение Лидера организовать
            добротный и удобный быт, оставляя за собой право одухотворить его
            собственными эстетическими «фантазиями».
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">4 — Болевая функция.</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_business" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Практика</UiText>
              <UiText preset="body">Деловая логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Лирик никак не попадает в разряд деловых, инициативных и энергичных
            людей. И на это у него есть много причин.
          </UiText>

          <UiText>
            Первая из них — Лирик не любит тратить время на работу, если она не
            доставляет ему удовольствий или как-то с ними не совмещается. Лирика
            можно увидеть работающим за компьютером и одновременно слушающим
            музыку; аккомпанирующим на пианино и одновременно читающим книгу,
            разучивающим музыкальное произведение, не отрываясь от спортивной
            передачи по телевизору.
          </UiText>

          <UiText>
            Вторая причина — «не следует спешить с выполнением работы: может
            быть, она вообще никому не понадобится, а может быть, ее захочет
            сделать кто-нибудь другой». Другими словами — нужно работать
            заниженными темпами, чтобы не попасть под завышенную норму.
          </UiText>

          <UiText color="role">
            Собственное желание поработать у Лирика появляется крайне редко.
            Выполнение работы Лирик часто откладывает до последней минуты,
            иногда так, что не делает ее совсем. Иногда это ему сходит с рук,
            иногда он из-за этого теряет работу. Впрочем, довольно быстро
            находит другую, а если нет — найдет того, кто о нем позаботится.
          </UiText>

          <UiText preset="large" color="role">
            Для того чтобы работать, Лирику нужно рабочее настроение. А где его
            взять, если он находится то в блаженно-восторженном состоянии души,
            то в напряженно-раздраженном?
          </UiText>

          <UiText>
            Чаще всего он бывает просто расслаблен, а заодно расслабляет и
            окружающих, так что и «волевой импульс» задать ему некому, а
            собственными усилиями загнать себя на рабочее место ему очень
            трудно.
          </UiText>

          <UiText color="role">
            Кроме того, что-то странное творится с организмом Лирика: как только
            он садится работать, ему сразу хочется то кушать, то перекурить, то
            выпить чего-нибудь, а то просто клонит в сон.
          </UiText>

          <UiText>
            Лирик знает за собой эту особенность, и поэтому старается создать
            себе все условия для продуктивной работы. Иногда у себя дома
            организует отдельную комнату под рабочий кабинет: принесет туда
            огромный письменный стол с массой канцелярских принадлежностей,
            расставит книги по полкам, развесит календарики по стенам, потом
            внесет туда телевизор, потом диван-кровать…
          </UiText>

          <UiText>
            А какие «завалы» на рабочем столе у Лирика! Это даже не «завалы» -
            это настоящие «скифские курганы», где можно раскопать вещь,
            считавшуюся много лет утерянной.
          </UiText>

          <UiText>
            Лирик не любит, когда его вещи залеживаются в чужом доме, поскольку
            всегда опасается, что они к нему больше не вернутся.
          </UiText>

          <UiText>
            Но он очень любит оставлять у себя то, что ему не принадлежит. Лирик
            часто подшучивает над тем, что слишком быстро привыкает к чужим
            вещам, прямо как к своим собственным. И чем нужнее ему чужая вещь,
            тем быстрее он к ней привыкает и тем труднее ему с ней расстаться.
          </UiText>

          <UiText color="role">
            Так же и с деньгами: Лирик может купить себе огромный и дорогой
            бумажник со множеством отделений, чтобы хранить там деньги и
            квитанции. Но деньги в его карманах не залеживаются.
          </UiText>

          <UiText color="accent">
            Особенно, если он живет не один и не с дуалом, у него возникает
            непреодолимое желание их потратить. Иногда он как бы соревнуется в
            этом со своим партнером, предпочитая лучше потратить на себя, чем
            дожидаться, пока их отберут «в общий котел».
          </UiText>

          <UiText color="accent">
            Еще один вариант комплекса «шестерки» — сделать все возможное, чтобы
            не остаться в накладе.
          </UiText>

          <UiText preset="large" color="role">
            Очень не любит брать на себя ответственность.
          </UiText>

          <UiText>
            Этим качеством он хорошо дополняет своего дуала Лидера,
            предпочитающего самостоятельно все решать и за все отвечать). Именно
            поэтому Лирик всегда старается переложить ответственность на
            кого-нибудь другого — качество очень неприятное и создающее массу
            проблем, когда представители этого типа занимают ответственную
            должность.
          </UiText>

          <UiText>
            Лирик часто затягивает с вынесением резолюции по вопросу, решение
            которого зависит только от него: все ему кажется, что время
            подскажет ему нужное решение, или кто-то устанет ждать и повлияет на
            его решение, и тогда и ответственность можно будет свалить на него.
          </UiText>

          <UiText>
            То он боится дать своим посетителям «дефицитную информацию» — ему
            легче прикинуться некомпетентным, чем быть обвиненным в том, что он
            «выболтал» какие-то секреты своего ведомства. То перепутает
            последовательность делопроизводства, то дезинформирует своих
            посетителей, то сам упустит из виду какую-то важную информацию.
          </UiText>

          <UiText>
            Ошибки Лириков-чиновников очень дорого обходятся посетителям.
          </UiText>

          <UiText>
            Тем более, что Лирик очень не любит проверять результаты своей
            работы. Лирик-бухгалтер преспокойно может потерять какие-то цифры
            или документы, не отметить какой-то платеж и тем самым повесить на
            ни в чем не повинного человека астрономический долг, который еще
            будет обрастать процентами.
          </UiText>

          <UiText>
            Лирику бывает иногда так скучно заниматься своим непосредственным
            делом, что он пользуется любой возможностью отвлечься на постороннее
            общение, а если такового нет - охотно займется «общественными
            нагрузками».
          </UiText>

          <UiText color="role">
            Представителям этого типа довольно часто удаëтся сделать неплохую
            карьеру, причем далеко не всегда благодаря своим деловым качествам.
          </UiText>

          <UiText>
            И все же сказать, что Лирик совершенно не способен сделать что-то
            полезное, тоже нельзя. Встречаются среди людей этого типа и умельцы,
            и труженики.
          </UiText>

          <UiText>
            Скажем так, Лирик может сделать все, что ему нужно. Проблема в том,
            что далеко не всегда у него возникает на это желание. А постоянно
            заставлять его тоже невозможно.
          </UiText>

          <UiText>
            И не только потому, что ни у какого партнера, кроме Лидера, на это
            не хватит ни сил, ни здоровья, а еще и потому, что, попадая на
            длительное время в неудобный для себя рабочий режим, Лирик просто
            начинает заболевать. Нельзя Лирик «запрячь и пахать на нем», потому
            что это далеко не самый сильный и выносливый тип личности: у него
            слабая сенсорика, а это очень серьезно.
          </UiText>

          <UiText>
            Положение спасает только наличие в доме его дуала Лидера.
          </UiText>

          <UiText>
            Представители других типов рискуют увязнуть в «расслаблении» Лирика,
            поскольку он еще и парализует деловую активность своего окружения.
          </UiText>

          <UiText>
            Только Лидер с его исключительной работоспособностью и
            целенаправленностью может позволить себе под его влиянием чуть-чуть
            расслабиться, равно как и заставить Лирика работать в самом
            продуктивном и самом оптимальном для себя режиме. Лидер —
            единственный из всех типов личности, кто на это способен.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">5 — Внушаемая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_will" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Воля</UiText>
              <UiText preset="body">Волевая сенсорика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Лирик не просто уважает сильных и целеустремленных людей, он не
            только восхищается ими. Он стремится стать частью их, быть «перышком
            под их крылом».
          </UiText>

          <UiText>
            Он стремится быть нужным и полезным им. Он всегда счастлив завоевать
            их дружбу и доверие и с восторгом принимает их покровительство.
          </UiText>

          <UiText>
            У Лирик есть способность находить себе сильных покровителей. У него
            есть своего рода тактика естественного отбора покровителей: есть те,
            кто послабее, но чьими услугами он пока еще пользуется, а есть
            действительно сильные и влиятельные люди, расположения которых он
            еще только добивается.
          </UiText>

          <UiText color="role">
            Лирик не любит дружить со «слабаками» и «неудачниками». Не уважает
            людей, которые не умеют налаживать полезные связи, не способны
            «работать локтями» или даже не могут за себя «попросить», не говоря
            уже о том, чтобы «за себя постоять».
          </UiText>

          <UiText>
            Таких людей Лирик вообще не понимает. Иногда, вследствие этого
            качества, Лирик попадает под влияние людей, великолепно умеющих
            «блефовать» и создавать иллюзию престижа, людей, которые могут
            подолгу держать его «на крючке» и использовать как «шестерку».
          </UiText>

          <UiText>
            И хотя такого развития событий Лирика всегда старается избегать, он
            иногда попадается в эту ловушку, поскольку часто принимает желаемое
            за действительное. Кроме того, «на всякого мудреца довольно
            простоты»: находятся «интуиты» и посильнее Лирика.
          </UiText>

          <UiText>
            Собственной силой Лирик никогда не похваляется, никогда ее не
            демонстрирует, в силовых состязаниях предпочитает не участвовать.
          </UiText>

          <UiText>
            Лирика «на слабо» не возьмешь — он не в той «весовой категории»: он
            не стесняется казаться слабым, потому что он умеет пользоваться
            своей слабостью. Он не видит ничего страшного в том, чтобы иной раз
            «поприбедняться» или разыграть из себя «сироту казанскую», а иначе,
            кто же ему будет помогать?
          </UiText>

          <UiText preset="large" color="role">
            Если интересы того требуют, Лирик может без особого труда
            разжалобить кого угодно. Взрослый мужчина может расплакаться как
            ребенок, если ему отказывают в помощи.
          </UiText>

          <UiText>
            Причем слезы в данном случае не будут им рассматриваться как признак
            слабости, ему не будет за них стыдно — пусть будет стыдно тому, кто
            проявляет равнодушие к его проблемам.
          </UiText>

          <UiText>
            Лирик прекрасно умеет и плакать, и упрекать одновременно. Причем
            безразличия к своим страданиям Лирик никогда и никому не прощает.
          </UiText>

          <UiText color="accent">
            Он вообще никогда и никому ничего не прощает. Добро может и забыть,
            но зло — никогда! Равно как и зло, причиненное его близким людям, о
            чем считает своим долгом вовремя напомнить: «Ты забыл, как он с
            тобой поступил? Ты уже ему помогать собираешься?»
          </UiText>

          <UiText>
            Слабость Лирика имеет ту же подоплеку, что и сила Лидера: если Лидер
            старается казаться сильнее, чтобы не отдать ничего лишнего, то Лирик
            по той же причине старается казаться слабее, чтобы им лишний раз не
            воспользовались, чтобы не держали его «за фрайера». Здесь
            проявляется тот же самый «комплекс шестерки», но только в
            интуитивной интерпретации.
          </UiText>

          <UiText>
            У Лирика есть свои методы «грести под себя» и строятся они на тонком
            эмоциональном воздействии и точном интуитивном расчете. Всегда
            интересно наблюдать, как Лирик заставляет других опекать себя:
            например, придя за компанию в ресторан, или в магазин, с милой
            непосредственностью может заявить, что у него сейчас нет денег,
            причем сделает это именно в тот момент, когда нужно расплачиваться.
          </UiText>

          <UiText>
            И опять же, «объявит» не просто так, а будучи уверенным, что у
            кого-то из его товарищей деньги действительно есть, и этот «кто-то»
            настолько хорошо к нему относится, что не сочтет за труд за него
            заплатить.
          </UiText>

          <UiText>
            Лирик может даже не объявлять о своей неплатежеспособности, а с
            самым невинным и скромным видом спокойно выждать, пока этот
            деликатный вопрос не уладится сам собой без его участия.
          </UiText>

          <UiText>
            Причем его собственная платежеспособность в данном случае не имеет
            значения: даже если у него и есть деньги, почему бы не позволить
            кому-то себя облагодетельствовать? Может, человеку этого очень
            хочется, тем более, что он уже доставил ему удовольствие своим
            обществом.
          </UiText>

          <UiText preset="large" color="role">
            Уместно напомнить, что Лирик всегда, а в молодости особенно, уверен
            в своем обаянии.
          </UiText>

          <UiText>
            В плане денежных расходов Лирик производит впечатление человека,
            хоть и непрактичного, но, что называется «себе на уме», который
            никогда не пойдет против собственной выгоды и которого очень нелегко
            «раскрутить» на какую-то «лишнюю», с его точки зрения, трату.
          </UiText>

          <UiText>
            Хотя сам себя Лирик обычно считает «широкой натурой». Необходимо
            заметить, что такая подсознательная тактика ориентирована на то,
            чтобы «раскрутить» Лидера, дуала Лирика, — тоже довольно
            прижимистого. Хотя именно с ним она «работает» не слишком долгое
            время: ровно столько, сколько потребуется Лирику на то, чтобы
            оценить истинные достоинства своего дуала и решить не размениваться
            на мелочи, дабы не потерять большего — его дружбы и покровительства.
          </UiText>

          <UiText>
            В свою очередь Лидер, который действительно не любит, когда его
            «выставляют» на лишние траты, не считает расходы на Лирика большой
            потерей, особенно, если действительно получает удовольствие от
            общения с ним, а если не получает, то легко и без сожаления с ним
            расстается, и никто не в обиде.
          </UiText>

          <UiText preset="large" color="role">
            Умение пользоваться чужой силой вовсе не исключает его желания
            развивать свою. Но как и все, Лирик делает это только для
            собственного удовольствия.
          </UiText>

          <UiText>
            Собственной физической силе Лирик довольно редко находит применение,
            хотя иногда (под настроение) может разыграть роль защитника, иногда
            может полезть в драку «за компанию», но на тяжелую физическую работу
            не подрядится и чудеса силы воли тоже не проявит.
          </UiText>

          <UiText>
            Лирику бывает трудно сделать над собой волевое усилие. Иногда, как
            бы подшучивая над собой, Лирик берет себя «за шкирку» — в буквальном
            смысле слова, сзади, за воротник, и «тащит» себя на рабочее место.
            Но лучше, когда необходимый «волевой импульс». Ему задает его дуал
            Лидер.
          </UiText>

          <UiText>
            Лирик, так же как и Лидер, уважает систему власти и никогда не
            пойдет против сильных мира сего. Так же как и Лидер, Лирику
            примыкает к оппозиции только в случае безопасной и определенной для
            себя выгоды. Он так же конформен. И предпочитает не
            противопоставлять свое личное мнение мнению большинства. Способен, в
            силу необходимости, отказаться от своих убеждений или поменять их.
          </UiText>

          <UiText color="role">
            С удовольствием будет работать в общественной системе, особенно на
            идеологической работе и в условиях свободного рабочего графика.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">
            6 — Активационная функция
          </UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_logic" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Теория</UiText>
              <UiText preset="body">Структурная логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Лирик очень активизируется, когда предоставляется возможность
            собрать важную для себя информацию. При всей кажущейся рассеянности
            он достаточно наблюдателен и всегда с легкостью находит людей, у
            которых может выведать что-либо для себя интересное.
          </UiText>

          <UiText>
            Так же как и Лидер, он считает, что информация — это огромная
            ценность, овладев которой, человек получает огромные преимущества.
          </UiText>

          <UiText>
            Лирик великолепно осуществляет сбор информации. Собирает ее по всем
            каналам — всестороннюю и самую достоверную.
          </UiText>

          <UiText>
            Лирик никому ничего не позволит от себя утаить, причем делает это
            очень естественно и непринужденно.
          </UiText>

          <UiText>
            Любопытство Лирика не знает границ, и именно потому, что никакими
            приличиями оно не ограничивается. С самым невинным видом Лирик может
            задать самый бестактный вопрос — «А кто вам помог с пропиской?»,
            причем будет абсолютно уверен, что ему на этот вопрос ответят.
          </UiText>

          <UiText preset="large" color="role">
            Отбор информации и анализ ее проводится им очень тщательно: самую
            ценную информацию Лирик оставляет только для себя и для тех, к кому
            он относится так же хорошо, как к себе.
          </UiText>

          <UiText>
            От Лирика очень трудно что-либо скрыть, но еще труднее выспросить у
            него то, чего он говорить не желает. Лирик очень боится высказать
            какую-то важную информацию во вред себе.
          </UiText>

          <UiText>
            Очень не любит, когда его дезинформируют или несвоевременно
            информируют, хотя сам он может сделать и то, и другое: Лирик очень
            не любит, когда по отношению к нему применяют его же собственные
            хитрости.
          </UiText>

          <UiText>
            Таких вещей никогда никому не прощает, и именно в таких случаях в
            его лице можно нажить врага, а это очень опасно!: Лирик начинает
            понимать, что его кто-то перехитрил, что его кто-то здесь за
            «фрайера держит». У него тут же «включается» его комплекс «шестерки»
            и он начинает резко портить отношения с обидчиком.
          </UiText>

          <UiText>
            Собирая информацию, Лирик оказывает особо ценную услугу своему дуалу
            Лидеру, для которого «знание» — это всегда сила и защита.
          </UiText>

          <UiText>
            Лирику трудно быть логически последовательным, да он к этому и не
            стремится. Может сколько угодно себе противоречить, но при этом
            будет считать, что рассуждает достаточно стройно.
          </UiText>

          <UiText color="role">
            Для того чтобы логически переспорить Лирика, не нужно подбирать
            особо весомых контраргументов. Лирик побеждает в споре не логикой, а
            этикой. И переспорить его исключительно трудно. Он слишком хорошо
            умеет уводить спор в сторону, «переводить на личности» и на
            выяснение отношений.
          </UiText>

          <UiText>
            Лирику бывает трудно проследить весь ход логических рассуждений —
            ему трудно сосредоточить внимание на широко развернутом логическом
            анализе.
          </UiText>

          <UiText>
            Поэтому ему удобнее всего воспринимать доходчивую и целенаправленную
            логику Лидера, способного объяснить самые сложные понятия, самыми
            доступными средствами, способного найти самые убедительные аргументы
            и выстроить их в том порядке, в котором они более всего убеждают.
          </UiText>

          <UiText>
            Формы логического изложения других типов-логиков Лирик никак не
            подходят. Для него они кажутся либо слишком запутанными и
            нагроможденными, либо слишком отвлеченными и не относящимися к делу,
            что его, кстати сказать, очень раздражает. Логика Лидера в этом
            плане ему представляется самой оптимальной и убедительной.
          </UiText>

          <UiText>
            Высказываясь о чем-либо, Лирик не претендует на объективность
            собственного мнения — для него гораздо важнее совпадение его мнения
            с мнением окружающих.
          </UiText>

          <UiText>
            Любит порассуждать на отвлеченные темы, но глубоким философом себя
            не считает: делает это «под настроение», для собственного
            удовольствия.
          </UiText>

          <UiText>
            Заучивать учебный материал, разбираться в логических понятиях Лирика
            очень трудно. Дать логическое определение собственными словами… — с
            этим к нему лучше вообще не обращаться.
          </UiText>

          <UiText>
            Лекции на научную тему — тоже не по его части. Если когда-либо
            Лирику приходится делать научный доклад, читать лекцию или сдавать
            экзамен по теоретическим или техническим дисциплинам, всегда
            старается с юмором «обыграть» собственную беспомощность.
          </UiText>

          <UiText>Правда, это его не всегда выручает.</UiText>

          <UiText color="accent">
            Например: во время преддипломного экзамена по электронике
            студент-Лирик, получив от преподавателя транзистор, имел
            неосторожность воскликнуть: «Ой, какие у него проволочки! Как усики
            у муравьишки!»
          </UiText>

          <UiText>
            Редко случается встретить представителя этого типа, преподающего
            теоретические дисциплины. Разве что, на самом примитивном уровне,
            для детей младших классов.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">7 — Функция защиты</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_ideas" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Мысль</UiText>
              <UiText preset="body">Интуиция возможностей</UiText>
            </span>
          </div>

          <UiText>
            Лирику нравятся люди «с возможностями», люди «с потенциалом». Любое
            новое знакомство Лирика в первую очередь оценивает именно с этих
            позиций. Человек, не умеющий себя преподнести, ему не интересен.
            Зато от знакомства с интересным для себя человеком Лирик возьмет все
            — и интересное общение, и приятное времяпрепровождение, и помощь в
            нужном деле, и ценную информацию, и ценные связи — словом, все.
          </UiText>

          <UiText>
            У Лирика есть потрясающий «нюх» на неудачников. Неудачники Лирика не
            интересуют. Общение с ними он считает непозволительной для себя
            роскошью.
          </UiText>

          <UiText>
            Прекрасно оценивает перспективные возможности человека, причем
            оценивает не только то, кем он является сейчас, но и кем он может и,
            главное, хочет быть.
          </UiText>

          <UiText>
            Именно поэтому Лирик с таким уважением относится к перспективным
            планам, целям и задачам своего дуала Лидера, именно поэтому
            чувствует себя с ним защищенным.
          </UiText>

          <UiText>
            Со своей стороны Лирику тоже есть, что предложить: он тоже умеет
            представить свои способности в самом выгодном свете, причем, нередко
            в этом блефует. Даже говоря о своих проблемах, Лирик не боится
            показаться неудачником: он всегда найдет способ списать свои неудачи
            на кого-то другого и представить себя человеком, несправедливо
            обделенным заслуженным вниманием.
          </UiText>

          <UiText>
            Лирик подсознательно наблюдает, какие возможности предоставляют ему
            та или иная ситуация, те или иные отношения.
          </UiText>

          <UiText>
            Всегда и везде завязывает массу знакомств. Важных или незначительных
            - не имеет значения: любое из них может оказаться для него полезным.
          </UiText>

          <UiText>
            С возрастом Лирик становится избирательнее в выборе окружения. Сразу
            оценивает потенциальные возможности каждого, стараясь избегать
            обременительных в будущем отношений, чтобы не пришлось тратить время
            на ненужное общение.
          </UiText>

          <UiText>
            Держит в памяти огромное количество сведений о каждом из своих
            знакомых, постоянно пополняет их новой, самой разнообразной
            информацией, чем иногда создает впечатление патологически
            любопытного человека.
          </UiText>

          <UiText preset="large" color="role">
            Любит рекламировать таланты, способности и возможности своих
            знакомых. Не упускает случая упомянуть о важных связях, но как бы
            вскользь, чтобы не заострять на этом внимания собеседника.
          </UiText>

          <UiText>
            Старается быть предусмотрительным и не рассказывать о себе ничего
            лишнего.
          </UiText>

          <UiText>
            Неприятно себя чувствует, когда его напрямую просят оказать какую-то
            протекцию. С одной стороны, неудобно отказать человеку в помощи, с
            другой — страшно делиться ценными связями, как бы не пришлось потом
            самому оказаться «не у дел».
          </UiText>

          <UiText color="role">
            Именно поэтому Лирик очень осторожен в обещаниях и предложении
            услуг. Не огорчается, если к нему редко обращаются за помощью, хотя
            часто выражает по этому поводу сожаление. Охотно помогает только в
            том случае, если это не мешает его собственным планам, и только тем
            людям, на чью помощь и поддержку рассчитывает сам.
          </UiText>

          <UiText>
            Охотнее всего Лирик помогает своему дуалу Лидер, чьи достоинства он
            довольно быстро оценивает и чьей дружбой почти сразу начинает
            дорожить.
          </UiText>

          <UiText>
            Лирик строго следит не только за тем, чтобы его не «обошли», но и
            чтобы не «обнесли» шансом. Он всегда живо интересуется
            перспективными планами своего окружения и особенно тем, какое место
            в этих планах отведено лично ему.
          </UiText>

          <UiText>
            Лирик не будет просить за себя — он просто «творчески» обидится,
            если о нем не позаботятся. Заставит «вписать» себя в любую программу
            и не потерпит, чтобы его оттуда «вычеркнули». «Вписавшись в
            программу», Лирик иногда начинает «тянуть шансы» на себя, —
            старается обратить максимум внимания, занять максимум времени, не
            оставляя места другим у Лирика есть свои способы «работать локтями».
          </UiText>

          <UiText preset="large" color="role">
            Иногда у него возникает желание быть одновременно в разных местах —
            ему вдруг кажется, что он слишком долго сидит на одном месте и тем
            самым упускает возможности, которыми, может быть, сейчас пользуется
            кто-то другой.
          </UiText>

          <UiText color="role">
            Иногда ему хочется узнать границы дозволенного и он позволяет себе
            более чем смелые выходки. Всегда радуется и с восторгом
            рассказывает, если какая-то шалость благополучно сошла ему с рук.
          </UiText>

          <UiText>
            Лирик подсознательно как бы зондирует почву любой ситуации, как бы
            нащупывает ее «критическую точку».
          </UiText>

          <UiText>
            Подсознательно «дирижируя» ситуацией, Лирик может обострить кризис,
            может его сгладить, может приблизить, может оттянуть. Этим он
            «работает» не только на себя, но и на своего дуала Лидер. Лидер
            «заведует» расстановкой сил в пространстве, Лирик — расстановкой сил
            во времени.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">8 — Фоновая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_people" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чувство</UiText>
              <UiText preset="body">Этика отношений</UiText>
            </span>
          </div>

          <UiText>
            Лирик не берет на себя роль этического аналитика, не утруждает себя
            рассуждениями о морали и нравственности. В случае, если сталкивается
            с откровенно неэтичным поступком, с удовольствием предоставит его на
            обсуждение окружающим, и уже по их оценке составляет о нем
            собственное мнение.
          </UiText>

          <UiText>
            Лирик способен сколько угодно обсуждать этику поведения окружающих и
            выражать свое отношение к происходящему, но на тему морали и
            нравственности предпочитает не высказываться.
          </UiText>

          <UiText>
            По большому счету аспект этики отношений у Лирика сводится к двум
            планам: этика поведения и эмоциональное отношение к субъекту.
            Собственный моральный кодекс Лирика либо рассредотачивается между
            этими двумя направлениями, либо вообще ни в одно из них не
            вписывается.
          </UiText>

          <UiText color="role">
            Поведение Лирика отличается демонстративно выраженным
            «прекраснодушием». Особенно ярко это проявляется, когда отношения
            еще только начинают формироваться.
          </UiText>

          <UiText preset="large" color="role">
            Лирик стремится показать себя с самой наилучшей стороны: выражает
            искреннее восхищение талантами партнера, равно как и глубочайшую
            доброжелательность, радушие, участие, соболезнование, расположение.
          </UiText>

          <UiText>
            Разумеется, такой активный расход душевных сил заставляет Лирика как
            можно скорее и точнее оценить потенциальные возможности своего
            партнера и развивать свои с ним отношения соответственно сделанному
            выводу. Этические взаимоотношения для Лирика — это всегда еще и
            поиск «крыла», поиск покровителя, защитника и заступника.
          </UiText>

          <UiText>
            Лирик не видит ничего предосудительного в том, чтобы окружающие
            оказывали возможную помощь в решении его проблем. Поэтому он их не
            считает нужным скрывать и не мешает всем желающим принимать в них
            посильное участие. О собственном благополучии Лирик говорит очень
            осторожно, «с оглядкой», в то время как о своих проблемах говорит
            много и охотно. Но только с теми, кто может ему реально помочь.
          </UiText>

          <UiText>
            Лирик может сколько угодно говорить о собственном одиночестве, но он
            не позволит себе быть действительно одиноким — это занижает его
            самооценку: невозможно, чтобы человек такого яркого обаяния, такого
            сильного эмоционального воздействия не создал себе достойного
            окружения, способного оценить его духовную красоту и одарить взамен
            «красотой физической».
          </UiText>

          <UiText preset="large" color="role">
            Нельзя также исключать и те многочисленные связи, которые Лирик в
            изобилии завязывает и на уровне дружбы, и на уровне знакомств,
            благодаря которым он никогда не испытывает дефицита общения.
          </UiText>

          <UiText color="role">
            И тем не менее, Лирик ищет в любых отношениях стабильности, хотя со
            своей стороны не всегда считает возможным, или нужным, ее
            предоставить. Развитие этических взаимоотношений Лирика зависит от
            того, насколько стабильны его интерес и симпатия к партнеру.
          </UiText>

          <UiText>
            Лирик уважает в партнере силу, уверенность в себе и стремление не
            останавливаться на достигнутом. Поэтому Лидер — единственный, кто
            может рассчитывать на стабильность этических отношений с Лириком.
          </UiText>

          <UiText>
            У представителей других типов мало шансов надолго завоевать его
            расположение. Именно Лидер Лирика оказывает самую действенную
            поддержку: создает удобный эмоциональный фон, разряжает излишнее
            напряжение, расслабляет его, выстраивает ему этическую защиту,
            предостерегает относительно «подозрительных» и возможно опасных
            людей.
          </UiText>

          <UiText>
            Таким образом, Лидеру остается только распределять свои силы
            соответственно «наводке» Лирика. Представители других типов
            оценивают такую «наводку» как пустую сплетню или совершенно ненужные
            сведения. Лидер — единственный, кто может оценить эту информацию по
            достоинству и отплатить за нее доверием и признательностью.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
