<template>
  <div class="text g-page">
    <section>
      <UiText preset="subtitle" color="accent">Сильные стороны</UiText>

      <UiText preset="large" color="role">
        Отличается лидерским характером. Человек волевой, мобилизованный,
        энергичный. Обладает быстрой реакцией, сочетающейся с хорошей выдержкой.
      </UiText>

      <UiText>
        Умеет управлять людьми, быстро ориентируется в изменившихся
        обстоятельствах. Способен быстро принимать кардинальные решения.
      </UiText>

      <UiText>
        Настроен на реальные близлежащие цели — гибкий стратег. Энергичен и
        деятелен, в периоды подъема развивает незаурядную работоспособность.
      </UiText>

      <UiText preset="large" color="role">
        Имеет критический склад ума. Активно отстаивает интересы свои и своей
        группы. Стремится к высокому материальному уровню жизни.
      </UiText>

      <UiText>
        Любит действовать по-крупному, все тщательно взвесив и разработав
        конкретный план действий.
      </UiText>

      <UiText>Очень целеустремлен и практичен в делах.</UiText>

      <UiText>
        Живет разумом, дело ставит выше личных симпатий. Стрессоустойчив,
        мобилизуется в экстремальных ситуациях.
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">Проблемы</UiText>

      <UiText>
        Довольно агрессивен, ему с трудом даются ровные, бесконфликтные
        отношения с окружающими.
      </UiText>

      <UiText>
        Не любит нерешительных людей, уклоняющихся от смелого действия. Не
        выносит приказного тона: если на него оказывают давление, дает сильный
        отпор.
      </UiText>

      <UiText preset="large" color="role">
        Самолюбив, в гневе проявляет нетерпимость к чужим промахам и ошибкам.
      </UiText>

      <UiText>Неугодным людям может создать неблагоприятную обстановку.</UiText>

      <UiText>
        В личных отношениях неуступчив, все хочет устроить по-своему. Недоверчив
        к новым людям, стремится при помощи осторожных вопросов выяснить их
        положение, связи и возможности.
      </UiText>

      <UiText preset="large" color="role">
        Идет к своей цели, не считаясь с интересами других.
      </UiText>

      <UiText>
        У него бывают периоды спадов и подъемов настроения и работоспособности.
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Нельзя требовать и ожидать
      </UiText>

      <UiList iconName="chevron-right" iconColor="accent" iconSize="16">
        <UiListItem>Последовательности во всем.</UiListItem>

        <UiListItem>
          Мягкости, уступчивости, отсутствии какой-либо агрессии.
        </UiListItem>

        <UiListItem>
          Того, что он будет работать бесплатно, «за идею».
        </UiListItem>

        <UiListItem>Прогностических способностей.</UiListItem>
      </UiList>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Подходящие виды деятельности
      </UiText>

      <UiText>
        Лидер хорошо руководит другими людьми, распределяет обязанности.
      </UiText>

      <UiText preset="large" color="role">
        Способен в деталях продумать необходимую организационную структуру и
        последовательно внедрить ее.
      </UiText>

      <UiText>
        Может не только тщательно отобрать людей, проверив их предварительно в
        деле, но и держать всех своих подчиненных в жестких рамках, прибегая по
        необходимости к непопулярным мерам, волевому воздействию.
      </UiText>

      <UiText preset="large" color="role">
        Практичен, хорошо разбирается в выгодности затеваемого дела. Может
        хорошо работать руками, мастерить что-либо.
      </UiText>

      <UiText>
        Оптимальное применение находят в области управления, техники, милиции,
        военном деле.
      </UiText>

      <UiText>
        Из них получаются хорошие руководители разных уровней, вплоть до самых
        высоких.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
