<template>
  <div class="text g-page">
    <section>
      <UiText preset="subtitle" color="accent">Сильные стороны</UiText>

      <UiText preset="large" color="role">
        Хороший организатор и тщательный исполнитель. Нетерпим к расхлябанности
        и безответственности.
      </UiText>

      <UiText>
        Последователен в своих делах и решениях, всегда доводит начатое до
        конца. Любит во всем порядок, точность и конкретность, доверяет только
        официальным или проверенным источникам информации.
      </UiText>

      <UiText>
        Хороший исследователь узких проблем. Вникает во все детали и не упускает
        из виду мелочей. Аккуратно ведет документацию, любит уточнять факты,
        охотно информирует тех, кто обращается к нему по поводу каких-либо
        инструкций и законов, которые обычно хорошо знает.
      </UiText>

      <UiText preset="large" color="role">
        Будучи администратором, умеет наладить четкую работу, дисциплину и
        порядок, всегда контролирует выполнение своих поручений. Дело ставит
        выше личных отношений и настроений.
      </UiText>

      <UiText>
        Очень работоспособен, обладает развитым чувством долга, требователен к
        себе и подчиненным. Знания предпочитает внедрять в практику. Ко всему
        готовится заранее, не любит экспромтов.
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">Проблемы</UiText>

      <UiText>Бескомпромиссен в том, что считает важным.</UiText>

      <UiText>
        Периодически напускает на себя официальный и неприступный вид,
        придерживается субординации.
      </UiText>

      <UiText>
        Довольно нетерпим к другим точкам зрения. Недостаточно гибок в
        отношениях с людьми, плохо учитывает их индивидуальные способности. Его
        практически невозможно заставить изменить свои убеждения.
      </UiText>

      <UiText>
        Не любит, когда ему возражают, навязывают свою волю или методы работы.
        Боится перемен и нестабильности.
      </UiText>

      <UiText preset="large" color="role">
        Плохо разбирается в отношениях других к себе. Не переносит, когда кто-то
        трогает его вещи, вмешивается без разрешения в дела.
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Нельзя требовать и ожидать
      </UiText>

      <UiList iconName="chevron-right" iconColor="accent" iconSize="16">
        <UiListItem>Тонкой индивидуальной подстройки к людям.</UiListItem>

        <UiListItem>
          Постоянного учета индивидуальных способностей людей.
        </UiListItem>

        <UiListItem>Быстрой перестройки соответственно ситуации.</UiListItem>

        <UiListItem>
          Уступчивости и мягкости в принципиальных вопросах.
        </UiListItem>

        <UiListItem>Генерации концептуальных идей.</UiListItem>
      </UiList>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Подходящие виды деятельности
      </UiText>

      <UiText>
        Инспектор хорошо распределяет обязанности и следит за их выполнением,
        поэтому может эффективно осуществлять конкретное руководство, особенно
        если группа не превышает 8-10 человек.
      </UiText>

      <UiText>
        Отличный руководитель подразделений. Также способен качественно
        выполнять оформительскую работу, мастерить что-либо руками. Хорошо
        работает с техникой.
      </UiText>

      <UiText>
        Может быть инструктором, контролером, оформителем документов, налоговым
        инспектором, следователем.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>