<template>
  <div class="text">
    <section>
      <UiText preset="body" color="accent">
        Описания не должны обязательно совпадать со всеми чертами характера
        личности.
      </UiText>

      <UiText preset="small" color="accent">
        Идея как раз описать наблюдаемые у среднего представителя типа
        особенности поведения и обработки информации психикой.
      </UiText>

      <UiText preset="small" color="accent">
        Автор описания — Велта Микелсоне
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="role">
        Мастер логического анализа, человек, способен разложить по полочкам все
        на свете. Искатель истины и справедливости.
      </UiText>

      <br />

      <UiText>
        Для него характерно ярко выраженное аналитическое мышление, которое дает
        ему социальную роль аналитика. Он доходчиво и уверенно выражает свои
        мысли и точно оценивает происходящее. Однако его мышление главным
        образом носит абстрактный характер.
      </UiText>

      <UiText preset="large" color="role">
        С раннего детства он в своих мыслях старается обхватить весь мир,
        выявить причины и следствия всего происходящего.
      </UiText>

      <UiText>
        Может запутаться в своих изложениях, но серьезной ошибкой это не
        считает, поскольку он строит свою концепцию. Рационализатор, которому
        важно развить свои разработки и самому усовершенствоваться.
      </UiText>

      <UiText preset="large" color="role">
        Его интересуют всеобщие закономерности.
      </UiText>

      <UiText>
        Он часто является основателем новых систем и реорганизатором устаревших.
        Теоретик, способный умело выявить недостатки и дать объективную оценку,
        которая не всегда приятна.
      </UiText>

      <UiText>
        В ссорах отстаивает своё мнение, неуступчив и непримирим. При этом ему
        не важен статус и авторитет оппонента. Часто представители этого
        социотипа занимаются научной работой.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        В основном их интересует обсуждение теоретических вопросов и создание
        новых теорий.
      </UiText>

      <UiText>
        За свои истинные убеждения сражается в словесных битвах, умело
        аргументируя и оспаривая противоположные взгляды.
      </UiText>

      <UiText>
        Если ему не разрешают свободно выразиться, не будет драться с кулаками
        или поднимать голос, в таких случаях отстранится.
      </UiText>

      <UiText>
        Считает, что он действует по общепринятым нормам. Но при принятии
        решений полагается только на себя и на свой опыт.
      </UiText>

      <UiText>
        Ему трудно выслушивать людей, которые не излагают свои мысли
        последовательно и пренебрегают фактами.
      </UiText>

      <UiText preset="large" color="role">
        Легко воспринимает ясную и лаконичную информацию, перерабатывает её и
        разъясняет. Глобальное видение мира и всесторонний анализ.
      </UiText>

      <UiText>
        Понимает суть происходящих событий и явлений в окружение. Улавливает,
        что должно усовершенствоваться в обществе, чтобы обеспечить прогресс.
      </UiText>

      <UiText>
        Человек с глобальным мышлением, держит в уме как проблему в целом, так и
        отдельные её аспекты. Он незаменим при «мозговых штурмах» — при
        разработке проектов, создании новых гипотез.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Постоянно ищет новые возможности.
      </UiText>

      <UiText>
        Неопределенность его не пугает, он за короткое время может найти выход
        из сложной ситуации. Голова его, как правило, полна новыми идеями. Он
        предлагает подходящие и удобные методы для выполнения работы.
      </UiText>

      <UiText preset="large" color="role">
        Быстро оценивает успешность и перспективность в конкретных областях
        деятельности, избегает бессмысленных действий.
      </UiText>

      <UiText>
        Ведет себя вежливо и тактично. Обычно сдержан и осторожен. Соблюдает
        нормы нравственности в отношениях с другими.
      </UiText>

      <UiText>
        У него развито чувство собственной справедливости, которая ему важнее,
        чем личные отношения. Но если задеты его профессиональные интересы и
        взгляды на жизнь, может стать резким и категоричным.
      </UiText>

      <UiText>
        В личной жизни не допускает чужого вмешательства. Открывается лишь
        совсем близким людям. Того, кто вторгается в его личную жизнь, может
        вычеркнуть из круга знакомых на долгое время. Сам не станет первым
        искать контакт.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Он – самодостаточен, одиночество ему необходимо больше чем неподходящая
        компания.
      </UiText>

      <UiText>
        Ему тяжело понять характер человека, его желания, но при возможности он
        старается это исследовать, а также понять как развиваются многообразные
        отношения между людьми.
      </UiText>

      <UiText>
        С незнакомыми людьми чувствует себя напряженно, сомневается по поводу
        правильности своих действий. Построить неформальные отношения самому ему
        сложно.
      </UiText>

      <UiText>
        В общении внимательный слушатель. Разговор поддерживает в том случае,
        когда тема касается его интересов. Уходит от пустых разговоров.
      </UiText>

      <UiText>
        Считает, что детей следует воспитывать строго, воспитывая в них
        справедливость и нравственность.
      </UiText>

      <UiText preset="small" color="accent">
        Иногда его методы могут быть слишком строгие и даже жестокие. Поскольку
        маленький ребенок нуждается в ласковых прикосновениях и в нежных словах
        о любви, случается так, что женщина такого типа не способна дать малышу
        это, в чем он так нуждается. Позднее контакт налаживается с ребенком,
        когда он становится подростком.
      </UiText>

      <UiText>
        Характерны независимость, самостоятельность и способность защищаться. Он
        не применяет силовое воздействие и не стремится захватить власть.
      </UiText>

      <UiText>
        Также не приемлет силового воздействия на себя. Предпочитает
        демократичный стиль управления.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Он не оказывает давления на других, поскольку умеет убеждать.
      </UiText>

      <UiText>
        В его голосе нет повышенных и категоричных интонаций. Иногда считает это
        проявлением собственной слабостью.
      </UiText>

      <UiText>
        Сложно продвигать свои идеи, поэтому великий потенциал часто не
        реализуется в жизнь.
      </UiText>

      <UiText>
        В ситуациях стресса ведет себя сдержанно. Снаружи не заметно, что он
        психологически сломлен, больше физически (замечается покраснение лица,
        меняется осанка, ноги стоят на ширине плеч).
      </UiText>

      <UiText>
        Осознает свои ошибки, но открыто признать их ему бывает трудно.
      </UiText>

      <UiText>
        Случается так, что однажды принятое решение или своё мнение может резко
        изменить, что свидетельствует о его нерешительности. Но если он свою
        цель наметил и ясно осознал, тогда упорно добивается своего.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Эмоции строго подчинены разуму.
      </UiText>

      <UiText>
        Этим объясняется, что любовь для него — это не словесное подтверждение,
        и не излишние ласки, а повседневная забота о партнере.
      </UiText>

      <UiText>
        Посочувствовать другому — это означает для него помочь конкретным делом.
        При этом он якобы ожидает встречную помощь. Так он понимает дружбу и
        хорошие отношения.
      </UiText>

      <UiText preset="large" color="role">
        Не умеет самостоятельно справляться со своими отрицательными эмоциям.
      </UiText>

      <UiText>
        Старается не выяснять отношений, поскольку считает, что ссоры и скандалы
        создают неловкое, иногда безвыходное положение, которое только отнимает
        силы.
      </UiText>

      <UiText preset="large" color="role">
        Периодически его нагнетает депрессия, тогда он ждет помощи со стороны.
      </UiText>

      <UiText>
        Когда его эмоционально стабилизируют, разгоняя пассивность. Лишь тогда
        он расслабляется, получает энергию и становится привлекательным и
        интересным собеседником.
      </UiText>
    </section>

    <section>
      <UiText>
        Бережет уже сложившиеся отношения, предпочитает их не прерывать.
      </UiText>

      <UiText preset="large" color="role">
        Если отношения складываются неудачно, первым прерывать их не станет.
        Если партнер захочет расторгнуть отношения, не будет сопротивляться.
      </UiText>

      <UiText>
        На первый взгляд он нетребовательный, скромный и умеренный. Плохо
        владеет своим телом, не разбирается в своем здоровье, неумело
        контролирует своё самочувствие, потому что у него низкая физическая
        чувствительность.
      </UiText>

      <UiText preset="large" color="role">
        Для него важно вести здоровый образ жизни, чтобы сохранить физическую
        форму.
      </UiText>

      <UiText>
        Его раздражают бытовые проблемы: создание комфорта и поддерживание
        порядка в доме. При этом он деятельный, смело берется за любую работу,
        быстро осваивает навыки.
      </UiText>

      <UiText>
        В быту он неприхотлив, его устраивает невысокий уровень комфорта, может
        жить в простых условиях. Одевается неброско, не склонен следить за
        модой, предпочитает нейтральные и спокойные тона и простой крой.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Предпочитает только такую работу, которою возможно делать автоматически
        — такая ситуация ему не помешает думать.
      </UiText>

      <UiText>
        Особое внимание придает образованию. Диплому, подтверждающему
        образование или квалификацию, он верит больше чем практическим навыкам.
      </UiText>

      <UiText preset="small" color="accent">
        По этой причине, как руководитель, очень часто терпит поражения,
        например, когда приходится увольнять нового сотрудника, убедившись в
        своем неправильном выборе.
      </UiText>

      <UiText preset="large" color="role">
        Трудоголик, поскольку автоматически выполняет работу, не чувствует
        нагрузку.
      </UiText>

      <UiText>
        Но его высокая работоспособность не всегда дает значительные результаты.
      </UiText>
    </section>

    <section>
      <UiText>
        Будучи руководителем, вырабатывает нормы «под себя», выполнение которых
        требует от других, и не доволен, если ему возражают. Человек, который
        высоко ценит распределение времени. Обычно выбирает такой метод работы,
        который позволяет сэкономить время.
      </UiText>

      <UiText preset="large" color="role">
        Планирует как свою работу, так и отпуск.
      </UiText>

      <UiText>
        При выполнении работы не допускает, чтобы время проходило впустую. Ему
        не свойственны бессмысленная суета и беспокойство.
      </UiText>

      <UiText>
        Умеет полезно заполнить своё свободное время – захватывающие занятия,
        самообучение, повышение квалификации. Ему важно и в работе удовлетворять
        свои личные интересы. Человек с хорошей памятью, пунктуальный.
      </UiText>

      <UiText preset="large" color="role">
        Своевременно замечает и оценивает социальные проблемы, возникающие в
        обществе, предупреждает об этом других, прорабатывает оптимальные методы
        решения.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
