<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <div class="warning">
      <UiText preset="small" color="accent">
        Описания не должны обязательно совпадать со всеми чертами характера
        личности.
      </UiText>

      <UiText preset="small" color="accent">
        Идея как раз описать наблюдаемые у среднего представителя типа
        особенности поведения и обработки информации психикой.
      </UiText>
    </div>

    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Велта Микелсоне"
          subtitle="9 минут"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Вера Стратиевская"
          subtitle="26 минут"
          target-content-id="tab-2"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText preset="subtitle" color="role">
            Мастер логического анализа, человек, способен разложить по полочкам
            все на свете. Искатель истины и справедливости.
          </UiText>

          <br />

          <UiText>
            Для него характерно ярко выраженное аналитическое мышление, которое
            дает ему социальную роль аналитика. Он доходчиво и уверенно выражает
            свои мысли и точно оценивает происходящее. Однако его мышление
            главным образом носит абстрактный характер.
          </UiText>

          <UiText preset="large" color="role">
            С раннего детства он в своих мыслях старается обхватить весь мир,
            выявить причины и следствия всего происходящего.
          </UiText>

          <UiText>
            Может запутаться в своих изложениях, но серьезной ошибкой это не
            считает, поскольку он строит свою концепцию. Рационализатор,
            которому важно развить свои разработки и самому усовершенствоваться.
          </UiText>

          <UiText preset="large" color="role">
            Его интересуют всеобщие закономерности.
          </UiText>

          <UiText>
            Он часто является основателем новых систем и реорганизатором
            устаревших. Теоретик, способный умело выявить недостатки и дать
            объективную оценку, которая не всегда приятна.
          </UiText>

          <UiText>
            В ссорах отстаивает своё мнение, неуступчив и непримирим. При этом
            ему не важен статус и авторитет оппонента. Часто представители этого
            социотипа занимаются научной работой.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            В основном их интересует обсуждение теоретических вопросов и
            создание новых теорий.
          </UiText>

          <UiText>
            За свои истинные убеждения сражается в словесных битвах, умело
            аргументируя и оспаривая противоположные взгляды.
          </UiText>

          <UiText>
            Если ему не разрешают свободно выразиться, не будет драться с
            кулаками или поднимать голос, в таких случаях отстранится.
          </UiText>

          <UiText>
            Считает, что он действует по общепринятым нормам. Но при принятии
            решений полагается только на себя и на свой опыт.
          </UiText>

          <UiText>
            Ему трудно выслушивать людей, которые не излагают свои мысли
            последовательно и пренебрегают фактами.
          </UiText>

          <UiText preset="large" color="role">
            Легко воспринимает ясную и лаконичную информацию, перерабатывает её
            и разъясняет. Глобальное видение мира и всесторонний анализ.
          </UiText>

          <UiText>
            Понимает суть происходящих событий и явлений в окружение.
            Улавливает, что должно усовершенствоваться в обществе, чтобы
            обеспечить прогресс.
          </UiText>

          <UiText>
            Человек с глобальным мышлением, держит в уме как проблему в целом,
            так и отдельные её аспекты. Он незаменим при «мозговых штурмах» —
            при разработке проектов, создании новых гипотез.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Постоянно ищет новые возможности.
          </UiText>

          <UiText>
            Неопределенность его не пугает, он за короткое время может найти
            выход из сложной ситуации. Голова его, как правило, полна новыми
            идеями. Он предлагает подходящие и удобные методы для выполнения
            работы.
          </UiText>

          <UiText preset="large" color="role">
            Быстро оценивает успешность и перспективность в конкретных областях
            деятельности, избегает бессмысленных действий.
          </UiText>

          <UiText>
            Ведет себя вежливо и тактично. Обычно сдержан и осторожен. Соблюдает
            нормы нравственности в отношениях с другими.
          </UiText>

          <UiText>
            У него развито чувство собственной справедливости, которая ему
            важнее, чем личные отношения. Но если задеты его профессиональные
            интересы и взгляды на жизнь, может стать резким и категоричным.
          </UiText>

          <UiText>
            В личной жизни не допускает чужого вмешательства. Открывается лишь
            совсем близким людям. Того, кто вторгается в его личную жизнь, может
            вычеркнуть из круга знакомых на долгое время. Сам не станет первым
            искать контакт.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Он – самодостаточен, одиночество ему необходимо больше чем
            неподходящая компания.
          </UiText>

          <UiText>
            Ему тяжело понять характер человека, его желания, но при возможности
            он старается это исследовать, а также понять как развиваются
            многообразные отношения между людьми.
          </UiText>

          <UiText>
            С незнакомыми людьми чувствует себя напряженно, сомневается по
            поводу правильности своих действий. Построить неформальные отношения
            самому ему сложно.
          </UiText>

          <UiText>
            В общении внимательный слушатель. Разговор поддерживает в том
            случае, когда тема касается его интересов. Уходит от пустых
            разговоров.
          </UiText>

          <UiText>
            Считает, что детей следует воспитывать строго, воспитывая в них
            справедливость и нравственность.
          </UiText>

          <UiText preset="small" color="accent">
            Иногда его методы могут быть слишком строгие и даже жестокие.
            Поскольку маленький ребенок нуждается в ласковых прикосновениях и в
            нежных словах о любви, случается так, что женщина такого типа не
            способна дать малышу это, в чем он так нуждается. Позднее контакт
            налаживается с ребенком, когда он становится подростком.
          </UiText>

          <UiText>
            Характерны независимость, самостоятельность и способность
            защищаться. Он не применяет силовое воздействие и не стремится
            захватить власть.
          </UiText>

          <UiText>
            Также не приемлет силового воздействия на себя. Предпочитает
            демократичный стиль управления.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Он не оказывает давления на других, поскольку умеет убеждать.
          </UiText>

          <UiText>
            В его голосе нет повышенных и категоричных интонаций. Иногда считает
            это проявлением собственной слабостью.
          </UiText>

          <UiText>
            Сложно продвигать свои идеи, поэтому великий потенциал часто не
            реализуется в жизнь.
          </UiText>

          <UiText>
            В ситуациях стресса ведет себя сдержанно. Снаружи не заметно, что он
            психологически сломлен, больше физически (замечается покраснение
            лица, меняется осанка, ноги стоят на ширине плеч).
          </UiText>

          <UiText>
            Осознает свои ошибки, но открыто признать их ему бывает трудно.
          </UiText>

          <UiText>
            Случается так, что однажды принятое решение или своё мнение может
            резко изменить, что свидетельствует о его нерешительности. Но если
            он свою цель наметил и ясно осознал, тогда упорно добивается своего.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Эмоции строго подчинены разуму.
          </UiText>

          <UiText>
            Этим объясняется, что любовь для него — это не словесное
            подтверждение, и не излишние ласки, а повседневная забота о
            партнере.
          </UiText>

          <UiText>
            Посочувствовать другому — это означает для него помочь конкретным
            делом. При этом он якобы ожидает встречную помощь. Так он понимает
            дружбу и хорошие отношения.
          </UiText>

          <UiText preset="large" color="role">
            Не умеет самостоятельно справляться со своими отрицательными
            эмоциям.
          </UiText>

          <UiText>
            Старается не выяснять отношений, поскольку считает, что ссоры и
            скандалы создают неловкое, иногда безвыходное положение, которое
            только отнимает силы.
          </UiText>

          <UiText preset="large" color="role">
            Периодически его нагнетает депрессия, тогда он ждет помощи со
            стороны.
          </UiText>

          <UiText>
            Когда его эмоционально стабилизируют, разгоняя пассивность. Лишь
            тогда он расслабляется, получает энергию и становится
            привлекательным и интересным собеседником.
          </UiText>
        </section>

        <section>
          <UiText>
            Бережет уже сложившиеся отношения, предпочитает их не прерывать.
          </UiText>

          <UiText preset="large" color="role">
            Если отношения складываются неудачно, первым прерывать их не станет.
            Если партнер захочет расторгнуть отношения, не будет сопротивляться.
          </UiText>

          <UiText>
            На первый взгляд он нетребовательный, скромный и умеренный. Плохо
            владеет своим телом, не разбирается в своем здоровье, неумело
            контролирует своё самочувствие, потому что у него низкая физическая
            чувствительность.
          </UiText>

          <UiText preset="large" color="role">
            Для него важно вести здоровый образ жизни, чтобы сохранить
            физическую форму.
          </UiText>

          <UiText>
            Его раздражают бытовые проблемы: создание комфорта и поддерживание
            порядка в доме. При этом он деятельный, смело берется за любую
            работу, быстро осваивает навыки.
          </UiText>

          <UiText>
            В быту он неприхотлив, его устраивает невысокий уровень комфорта,
            может жить в простых условиях. Одевается неброско, не склонен
            следить за модой, предпочитает нейтральные и спокойные тона и
            простой крой.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Предпочитает только такую работу, которою возможно делать
            автоматически — такая ситуация ему не помешает думать.
          </UiText>

          <UiText>
            Особое внимание придает образованию. Диплому, подтверждающему
            образование или квалификацию, он верит больше чем практическим
            навыкам.
          </UiText>

          <UiText preset="small" color="accent">
            По этой причине, как руководитель, очень часто терпит поражения,
            например, когда приходится увольнять нового сотрудника, убедившись в
            своем неправильном выборе.
          </UiText>

          <UiText preset="large" color="role">
            Трудоголик, поскольку автоматически выполняет работу, не чувствует
            нагрузку.
          </UiText>

          <UiText>
            Но его высокая работоспособность не всегда дает значительные
            результаты.
          </UiText>
        </section>

        <section>
          <UiText>
            Будучи руководителем, вырабатывает нормы «под себя», выполнение
            которых требует от других, и не доволен, если ему возражают.
            Человек, который высоко ценит распределение времени. Обычно выбирает
            такой метод работы, который позволяет сэкономить время.
          </UiText>

          <UiText preset="large" color="role">
            Планирует как свою работу, так и отпуск.
          </UiText>

          <UiText>
            При выполнении работы не допускает, чтобы время проходило впустую.
            Ему не свойственны бессмысленная суета и беспокойство.
          </UiText>

          <UiText>
            Умеет полезно заполнить своё свободное время – захватывающие
            занятия, самообучение, повышение квалификации. Ему важно и в работе
            удовлетворять свои личные интересы. Человек с хорошей памятью,
            пунктуальный.
          </UiText>

          <UiText preset="large" color="role">
            Своевременно замечает и оценивает социальные проблемы, возникающие в
            обществе, предупреждает об этом других, прорабатывает оптимальные
            методы решения.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="small" color="accent">1 — Базовая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_logic" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Теория</UiText>
              <UiText preset="body">Структурная логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            «Справедливость — мое ремесло». Представитель этого типа всегда
            страстный борец за справедливость. Считает, что все в мире должно
            быть логично и, следовательно, — справедливо…
          </UiText>

          <UiText>
            Часто размышляет о создании государства абсолютной справедливости,
            об установлении власти, которая должна начать свою деятельность с
            суровой кары всех, кто ведет неправедную жизнь, то есть нарушает
            принципы справедливости. Идея «страшного суда».
          </UiText>

          <UiText color="role">
            Любой из представителей этого типа разделяет мысль, высказанную в
            американской Декларации независимости: «Все люди созданы равными,
            наделены Богом некоторыми неотъемлемыми правами, среди которых
            жизнь, свобода, стремление к счастью».
          </UiText>

          <UiText>
            По натуре глубоко демократичен, поскольку понимает демократию как
            возможность выбора. Считает, что только тогда общество имеет право
            требовать от человека полной ответственности за его поступки, когда
            каждый член общества получает полное право свободы выбора в своих
            действиях.
          </UiText>

          <UiText preset="large" color="role">
            Считает, что дисциплина в обществе должна быть основана не на
            страхе, а на совести.
          </UiText>

          <UiText>
            Поэтому и наказание «правонарушителя» рассматривает как воспитание
            его совести — для его же блага. Аналитик обычно придерживается
            мнения, что любое наказание только тогда действует эффективно, когда
            человек осознает свою вину.
          </UiText>

          <UiText>
            Аналитик старается продуманно и целенаправленно выбирать меры
            дисциплинарного воздействия.
          </UiText>

          <UiText>
            Обычно его наказание заключает в себе элемент воспитания:
            провинившемуся обязательно должна быть убедительно доказана его
            вина. Доказательство вины Аналитик обычно выстраивает настолько
            логично и настолько четко его аргументирует, что, как правило, очень
            трудно ему в этом возражать.
          </UiText>

          <UiText color="accent">
            Хотя бы потому, что все доказательства Аналитика, по сути, сводятся
            к идее «высшей справедливости» и понятию «объективной истины», а
            переубедить его и доказать, что его идеи — всего лишь абстрактные
            понятия, по которым нельзя мерить конкретные условия и
            обстоятельства ситуации, невозможно, поскольку такая точка зрения,
            по его мнению, приводит к неразберихе и хаосу, что он считает очень
            опасным для общества.
          </UiText>

          <UiText color="role">
            Свою правоту всегда только доказывает. Уговаривать, а тем более
            просить — не любит.
          </UiText>

          <UiText>
            Повышенные требования к другим обычно предъявляет только тогда,
            когда сам им соответствует.
          </UiText>

          <UiText preset="large" color="role">
            «Мыслю — следовательно, существую». Аналитик от природы наделен
            сильно развитой логикой и способностями к аналитическому мышлению.
            Любит рассуждать о различных моделях, структурах, схемах и
            классификациях.
          </UiText>

          <UiText>
            В любых явлениях ищет и находит первопричины существующих
            противоречий и нелогичностей. Стремится к логической гармонии и
            логическому порядку.
          </UiText>

          <UiText>
            Главное требование его логической программы — объективная истина,
            критерием которой считает не столько практику, сколько целостность и
            логическую стройность. «Истина — это целое» © Гегель.
          </UiText>

          <UiText>
            Все житейские и этические ситуации рассматривает с точки зрения
            логики. Причем лишние, по его мнению, подробности обычно
            отбрасывает, обращая большее внимание на общие закономерности.
            «Глобальная логика».
          </UiText>

          <UiText color="role">
            Высоко развито чувство защиты справедливости. Защищая несправедливо
            обиженного, нередко пренебрегает собственной выгодой и
            безопасностью.
          </UiText>

          <UiText color="accent">
            Из соображений защиты справедливости он может отказаться от
            блестящей профессиональной карьеры и переключиться на общественную
            деятельность.
          </UiText>

          <UiText>
            Аналитику свойственно ставить интересы истины и справедливости выше
            своих личных интересов и интересов своей семьи.
          </UiText>

          <UiText>
            Принимая решение, Аналитик в первую очередь считается со своей
            собственной совестью и менее всего склонен зависеть от чужого мнения
            и признанных в обществе авторитетов.
          </UiText>

          <UiText preset="large" color="role">
            Принимая для себя какую-либо идею, Аналитик становится ее
            последовательным сторонником и служит ей самым фанатичным образом:
            подчиняет этой идее все свои мысли и действия, подчиняет ей весь
            свой образ жизни.
          </UiText>

          <UiText color="accent">
            С общественным мнением в такой ситуации он, как правило, менее всего
            склонен считаться. Если в результате борьбы за идею он попадает в
            условия, при которых его идея совпадает с преобладающим мнением
            общества, в этом случае он испытывает некоторое разочарование
            необходимостью жить «как все».
          </UiText>

          <UiText>
            Аналитик чувствует себя несколько опустошенным, когда из его жизни
            уходит элемент «борьбы за идею». Состояние борьбы для него уже
            становится слишком привычным, оно ему уже необходимо как норма
            жизни.
          </UiText>

          <UiText>
            В этом случае Аналитик готовится к поиску новой, прогрессивной идеи,
            способной «осчастливить» общество. И даже если новая идея не так
            грандиозна, как предыдущая, и не требует такого самоотречения, он с
            готовностью заполняет ею образовавшуюся пустоту.
          </UiText>

          <UiText color="role">
            Аналитик, как правило, не отвлекается на мелкие «игрушечные» идеи.
            Если не находит для себя достаточно «масштабной» идеи, позволяет
            себе жить «как все».
          </UiText>

          <UiText>
            Аналитик всегда политически активен — качество, присущее всем
            представителям первой и второй квадры. Его всегда волнуют проблемы
            общества, в котором он живет, волнуют социально-гуманитарные
            проблемы окружающей его среды.
          </UiText>

          <UiText color="role">
            Аналитик обычно непоколебим в своих суждениях. Уверен, что разумное
            не может быть плохим.
          </UiText>

          <UiText preset="large" color="role">
            «Знания спасут мир». Аналитик — специалист не столько по расширению
            человеческих знаний, сколько по их углублению.
          </UiText>

          <UiText>
            Постоянно находится в поиске новой информации, обращает внимание на
            достоверность источников информации. Если нужно узнать что-то
            важное, то предпочитает не расспрашивать знакомых, а обратиться к
            справочнику, книге, расписанию… Опасается пользоваться сомнительной
            информацией.
          </UiText>

          <UiText color="role">
            Общение с книгой для него иногда бывает предпочтительнее, чем
            общение с друзьями.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">2 — Творческая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_ideas" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Мысль</UiText>
              <UiText preset="body">Интуиция возможностей</UiText>
            </span>
          </div>

          <UiText>
            Выступая как созидатель проекта абсолютной справедливости и
            созидатель теории объективной истины, Аналитик в каждой конкретной
            ситуации ищет и находит возможности для реализации своей логической
            программы. Можно создать общество идеально справедливого строя,
            если…
          </UiText>

          <UiText>
            Далее выстраивается проект условий, которые нужно искусственно
            создать в обществе и к которым нужно подтянуть каждого из его
            членов.
          </UiText>

          <UiText preset="large" color="role">
            Логическая программа Аналитика всегда реализуется посредством поиска
            возможностей, приспосабливающих конкретные существующие условия к
            некоему абстрактному проекту.
          </UiText>

          <UiText>
            Генерируя свои социальные идеи, Аналитик абстрагируется от частных
            обстоятельств, считая, что их можно и изменить и приспособить.
          </UiText>

          <UiText preset="large" color="role">
            В результате его идеализированные теории сталкиваются с реальными
            противоречиями конкретных социальных условий и часто реализуются в
            искаженной, иногда и извращенной форме, если вообще реализуются.
          </UiText>

          <UiText>
            Социальные идеи Аналитика тем лучше и успешней реализуются, чем
            слабее противоречие между его теорией и реально существующими в
            обществе условиями.
          </UiText>

          <UiText color="accent">
            История показывает: чем выше уровень материального благосостояния
            общества, тем легче прививаются в нем идеи всеобщего равенства и
            справедливости.
          </UiText>

          <UiText preset="large" color="role">
            Логическая программа Аналитика тем успешнее реализуется, чем
            успешнее идет поиск возможностей в каждой конкретной ситуации.
          </UiText>

          <UiText>
            Что достигается благодаря гибкости и манипулятивности Аналитика
            «интуиции возможностей», которая творчески использует такие
            «инструменты», как «метод индивидуального подхода» и «метод
            выравнивания возможностей», которые сводятся к координации
            индивидуальных возможностей.
          </UiText>

          <UiText>
            Слабый подтягивается до сильного, «последний да будет первым», «кто
            был никем, тот станет всем». Возможности же сильного, в свою
            очередь, ограничиваются настолько, что становятся доступны слабому.
          </UiText>

          <UiText preset="large" color="role">
            В результате такой координации общество превращается в социальный
            строй, при котором «пышным цветом расцветает посредственность»: нет
            ярко выраженных противоречий, но зато редки и ярко выраженные
            индивидуальности.
          </UiText>

          <UiText>
            Аналитик координирует возможности в окружающем его обществе всегда
            относительно собственного представления о «справедливости» и
            «объективной истине».
          </UiText>

          <UiText color="role">
            В силу этой причины оба эти понятия приобретают глубоко субъективную
            окраску.
          </UiText>

          <UiText color="accent">
            Один посчитает необходимым дать своим детям всестороннее
            образование, не хуже, чем у других, и тем самым предоставить им
            достаточное количество возможностей найти свое место в жизни.
          </UiText>

          <UiText color="accent">
            Другой посчитает для себя нормальным обеспечить каждого взрослого
            члена своей семьи личным автомобилем, но дорогостоящее всестороннее
            образование для своих детей сочтет непозволительной роскошью, да еще
            и будет осуждать соседа, который тратит последние деньги на
            эстетическое воспитание.
          </UiText>

          <UiText>
            У каждого из представителей этого типа свое субъективное
            представление о «норме» и о «роскоши», сформировавшееся под влиянием
            полученного воспитания и сложившейся ментальности, относительно
            которого он и координирует распределение возможностей, и
            распределение материальных благ, как для себя, так и для своего
            окружения.
          </UiText>

          <UiText color="role">
            «Человек сам себя воспитывать обязан» — развитию личных способностей
            Аналитики обычно уделяют довольно серьезное внимание, но, как
            правило, всегда стараются это делать с учетом реальных возможностей
            применения индивидуальных способностей.
          </UiText>

          <UiText>
            Например, если взрослый человек переквалифицируется на какую-либо
            «практичную» специальность, Аналитик это только приветствует. Но
            если человек в зрелом возрасте тратит последние деньги на свое
            личное обучение музыке или рисованию, такое поведение ему покажется,
            мягко говоря, легкомысленным.
          </UiText>

          <UiText color="role">
            Обычно Аналитик довольно точно оценивает объективные условия в
            каждой конкретной ситуации, равно как умеет оценить и индивидуальные
            возможности человека.
          </UiText>

          <UiText>
            Умеет просчитывать объективные и субъективные шансы, исходя из
            оценки ситуации, всегда знает, кому и что «светит» и при каких
            условиях.
          </UiText>

          <UiText preset="large" color="role">
            Прекрасно умеет оценить собственные возможности.
          </UiText>

          <UiText>
            Если нет подходящих условий для применения своих способностей и нет
            возможности повлиять на эти условия, Аналитик ждет более
            благоприятных обстоятельств, либо пытается адаптировать свои
            субъективные возможности к уже существующим объективным условиям.
          </UiText>

          <UiText>
            В любом случае, никогда не позволяет себе ныть из-за собственной
            неудачливости, хотя чужой, незаслуженной, по его мнению, везучести
            вполне может позавидовать.
          </UiText>

          <UiText color="role">
            Может анализировать опыт собственных неудач, но старается не
            признавать их открыто.
          </UiText>

          <UiText>
            Качество, свойственное многим интуитам. Смысл его заключается в том,
            чтобы не таскать за собой груз прежних неудач, — это мешает будущему
            успеху, занижает самооценку человека, «комплексует» его.
          </UiText>

          <UiText preset="large" color="role">
            К своим неудачам и жизненным неурядицам умеет относиться
            «философски».
          </UiText>

          <UiText>
            Представитель этого типа обычно считает, что кроме уже известных
            условий и обстоятельств, кроме видимых закономерностей, в мире
            существуют скрытые, невидимые законы, влияющие на реальный ход
            событий и составляющие с видимыми закономерностями единое целое.
          </UiText>

          <UiText preset="large" color="role">
            Аналитик умеет за отдельными фактами увидеть общие закономерности.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">3 — Ролевая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_people" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чувство</UiText>
              <UiText preset="body">Этика отношений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            В общении Аналитик достаточно отзывчивый, вежливый и
            доброжелательный человек. Старается быть корректным и учтивым со
            всеми без исключения. Видит в этом этическую норму, обязательную для
            себя и для всех.
          </UiText>

          <UiText>
            Старается никому не мешать и не создавать дополнительных проблем.
            Защищает как свои, так и чужие права.
          </UiText>

          <UiText color="role">
            Отгораживается от неудобных отношений. Неприятному общению
            предпочитает приятное, интеллектуально содержательное уединение.
          </UiText>

          <UiText>
            В общении прост, не любит условностей и церемоний. Если человек ему
            несимпатичен, не считает нужным этого скрывать. Терпеть не может
            вынужденного общения, «визитов вежливости»: для этого он слишком
            дорожит своим временем и душевными силами.
          </UiText>

          <UiText preset="large" color="role">
            Не любит, когда насильно домогаются его дружбы. Очень восприимчив к
            любому проявлению фальши и лицемерия, это вычисляет логически и
            чувствует интуитивно — с такими людьми очень холоден, моментально
            устанавливает далекую дистанцию.
          </UiText>

          <UiText color="role">
            Очень памятлив на обиду, на любое проявление бестактности и
            несправедливости по отношению к себе и другим…
          </UiText>

          <UiText preset="large" color="role">
            Формировать собственные этические отношения Аналитику довольно
            трудно.
          </UiText>

          <UiText>
            Трудно разобраться в сути этической ситуации сверх того, что
            предписывает нормативная этика поведения. Понятие «этично» у него
            довольно часто подменяется понятием «справедливо», вследствие чего,
            борясь за «справедливую этику», он нередко попадает в крайне
            неэтичную ситуацию.
          </UiText>

          <UiText color="accent">
            Например, ни у кого не вызывает сомнений, что «попрекать куском
            хлеба» неэтично, но ведь это можно рассматривать и как попытку
            восстановить справедливость. Зачем давать кому-то возможность на
            себе паразитировать?!
          </UiText>

          <UiText color="role">
            Аналитик часто пытается поставить знак равенства между двумя этими
            понятиями, абстрагируясь от таких «этических условий», как личное
            право на добрую услугу, за которую можно ожидать ответных услуг, но
            нельзя их требовать.
          </UiText>

          <UiText>
            Возводя «объективную справедливость» в эталон этики, Аналитик
            абстрагируется от этических прав, но настаивает на выполнении
            этических обязательств.
          </UiText>

          <UiText color="role">
            Добрая услуга, в его понимании, обязана быть соответственно
            вознаграждена, в противном случае это будет несправедливо.
          </UiText>

          <UiText color="accent">
            Например, одна из представительниц этого типа, работающая на
            маленьком частном предприятии, якобы от имени всех служащих,
            потребовала, чтобы праздничные премиальные выдавались не в форме
            мелких и дешевых подарков, а в форме солидных денежных
            вознаграждений, как это делается в крупных государственных
            компаниях: «Чем мы хуже других? Почему другие на праздники получают
            денежные премии, а мы — карамельки и домашнее печенье?! Разве это
            справедливо?!»
          </UiText>

          <UiText>
            Аналитику свойственно не допускать никаких этических уступок, если
            по отношению к нему, равно и к кому-либо другому, поступают
            несправедливо.
          </UiText>

          <UiText>
            Если же при всем старании ему не удаëтся восстановить справедливость
            в условиях ее вопиющего нарушения, постарается выйти из ситуации с
            наименьшими для себя потерями: в некоторых случаях сам себе
            компенсирует ущерб — самовольно забирает то, на что, как ему
            кажется, он имеет право. «Джунгли есть джунгли».
          </UiText>

          <UiText preset="large" color="role">
            В случае, если не удаëтся самому взять «компенсацию», может открыто
            потребовать возмещения убытка, поскольку ни при каких
            обстоятельствах не желает его терпеть. Именно поэтому у Аналитика
            понятия материального и морального ущерба часто подменяются одно
            другим.
          </UiText>

          <UiText color="accent">
            Пример: студенты устроили вечеринку «вскладчину». Девушка-Аналитик
            оценила аппетит своих товарищей и, почувствовав себя материально (и
            морально) обделенной, попросила компенсировать ей «переплату» в
            общий вклад на основании того, что алкогольных напитков она не
            употребляет, а мясного и сладкого не ест вообще. В результате
            девушку выставили из компании, причем она так и не поняла, за что.
          </UiText>

          <UiText>
            Разумеется, этичность Аналитика во многом зависит от ментальности,
            от полученного воспитания и от тех этических ценностей, на которые
            он психологически сориентирован.
          </UiText>

          <UiText>
            Но он также сориентирован и на этику своего дуала Энтузиаста,
            которая как раз и базируется на принципах этической справедливости,
            поскольку рассчитана на восприятие ее Аналитика, и в первую очередь
            контролирует этичность в распределении возможностей, будучи
            наделенным равными правами нельзя злоупотреблять неравными
            возможностями — грубо говоря: тот, кто может есть быстро, обязан
            считаться с возможностями того, кто ест медленно.
          </UiText>

          <UiText>
            В противном случае общество начинает жить по закону «джунглей».
            Аналитик никогда не позволит себе первым злоупотребить собственными
            возможностями — это противоречит его логической программе.
          </UiText>

          <UiText>
            Аналитик считает неэтичным злоупотребление не только индивидуальными
            возможностями, но и индивидуальными правами, даже если они, казалось
            бы, распределены одинаково справедливо для всех:
          </UiText>

          <UiText color="accent">
            «Нам пришлось поменять квартиру из-за этой музыкальной семейки!
            Конечно, это их право играть с утра до вечера, но мы тоже хотим жить
            спокойно!.. Нашему ребенку разве не нужно засыпать вовремя?!»
          </UiText>

          <UiText color="role">
            К чести Аналитика следует отметить: решая свои проблемы, он всегда
            считается с правами и удобствами окружающих.
          </UiText>

          <UiText>
            Исходя из этических соображений, Аналитик контролирует справедливое
            (равное) распределение материальных благ для всех членов общества
            без исключения.
          </UiText>

          <UiText color="accent">
            Например, если в его семье воспитываются приемные дети, они
            наделяются в точности такими же правами и обязанностями, как и его
            собственные. «…Мы с сестрой устроили пикник для детей: всю еду
            разделили на равное количество — каждому досталось по две котлеты и
            одному пирожку. Так вот, моему племяннику одного пирожка показалось
            мало и он потребовал добавки, да еще и истерику закатил!»
          </UiText>

          <UiText>
            В любой этической ситуации Аналитик опирается на принципы,
            построенные на взаимном уважении, соотношении и соизмерении
            собственных прав с правами и возможностями окружающих.
          </UiText>

          <UiText>
            И именно поэтому лучшим партнером для Аналитика является его дуал
            Энтузиаст, чья этика отношений базируется на тех же этических
            принципах.
          </UiText>

          <UiText>
            Именно поэтому Энтузиаст — единственный из всех социотипов-этиков,
            кому Аналитик может полностью доверять, с кем он не чувствует себя
            обделенным, ущемленным в правах или несправедливо обиженным. С
            представителями других психологических типов Аналитик не находит
            полного взаимопонимания.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">4 — Болевая функция.</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_will" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Воля</UiText>
              <UiText preset="body">Волевая сенсорика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Аналитик нетерпим к любому проявлению насилия и произвола, поскольку
            считает их первопричиной несправедливости, а следовательно, и
            первопричиной всех бед.
          </UiText>

          <UiText>
            Нетерпимый противник несправедливых, по его мнению, основанных на
            насилии диктатур Аналитик повсеместно насаждает «диктатуру
            справедливости», основанную на воспитании «этически справедливого»
            самосознания.
          </UiText>

          <UiText>
            Насилие применяется только к тем, кто не в состоянии воспитать в
            себе таковое этическое качество, то есть только по отношению к
            «хищникам».
          </UiText>

          <UiText preset="large" color="role">
            Аналитик считает, что волевое воздействие правомерно, если оно
            справедливо. Злоупотребление силой, властью, влиянием осуждает.
          </UiText>

          <UiText color="role">
            Не терпит грубого нажима, авторитарности, командного тона.
            Сопротивляется любой попытке насильственного влияния — и волевого, и
            этического.
          </UiText>

          <UiText>
            Очень критичен к методам грубого и дешевого воздействия. Аналитика
            невозможно подчинить волевому давлению. Всякая попытка надавить на
            него неминуемо ведет к конфликту. Не поддается грубому нажиму даже
            тогда, когда это угрожает его жизни. Не позволит унизить себя, не
            позволит «взять себя за горло» — лучше умрет.
          </UiText>

          <UiText color="role">
            Не позволит ущемить себя в правах — сразу демонстративно
            сопротивляется этому. Своего рода предупредительная мера.
          </UiText>

          <UiText>
            Аналитик не только не терпит насилия — он постоянно старается
            оградить себя от насильственного воздействия. Поэтому мера его
            защиты обычно намного превышает меру воздействия на него.
          </UiText>

          <UiText color="accent">
            Например, Аналитик может отказать ближайшему родственнику в
            единичной, пустяковой услуге только из предположения, что таковые
            услуги могут войти в систему отношений и тогда его уступчивость
            станет для всех нормой поведения, а это уже несправедливо по
            отношению к нему..
          </UiText>

          <UiText>
            Защита своих территориальных прав для Аналитик также очень важный
            вопрос. Аналитик согласен выглядеть сколь угодно негостеприимным,
            невежливым и неучтивым, но он не позволит постороннему войти в свой
            дом «чемоданом вперед».
          </UiText>

          <UiText preset="large" color="role">
            Опасается непрошеных визитеров, поскольку они крадут его время, его
            место, посягают на его личную свободу.
          </UiText>

          <UiText color="role">
            Аналитик чувствует себя беззащитным в ситуации внезапного волевого
            давления. В этом случае он часто неожиданно для себя проявляет
            «непростительную уступчивость», которую впоследствии анализирует,
            стараясь впредь быть предусмотрительным и не повторять подобных
            ошибок.
          </UiText>

          <UiText>
            Аналитик боится подать повод к волевому воздействию на себя, поэтому
            иногда стремится выглядеть человеком без слабостей. Не любит, когда
            играют на его слабостях. Терпеть не может нытиков, не позволяет
            разжалобить себя, не любит дешевых этических трюков.
          </UiText>

          <UiText preset="large" color="role">
            Никогда не позволяет себе проявлять силу по отношению к слабому.
            Старается воздействовать словом и убеждением. Физическое наказание
            применяется им как самая крайняя мера.
          </UiText>

          <UiText>
            Аналитику трудно говорить приказным тоном, властные интонации ему не
            свойственны, хотя когда вспылит, бывает резковат.
          </UiText>

          <UiText preset="large" color="role">
            Перед начальством не робеет, держится с достоинством, не заискивает.
            «Служить бы рад, прислуживаться тошно».
          </UiText>

          <UiText>
            Демонстративно игнорирует назойливые советы и нравоучения, особенно
            опасается и недолюбливает тех, которые всегда «знают, как надо».
          </UiText>

          <UiText color="role">
            Обычно испытывает неловкость всякий раз, когда его волевые качества
            обсуждаются посторонними людьми. Как правило, старается избегать
            разговоров на эту тему.
          </UiText>

          <UiText>
            Борьба за свои права требует от Аналитика постоянного перенапряжения
            сил, что в свою очередь нередко приводит его к физическому
            переутомлению — состояние, которое ему очень неприятно и которого он
            старается не допускать.
          </UiText>

          <UiText>
            Регулирует режим своих нагрузок: старается рассчитывать свои силы и
            возможности, сопротивляется перегрузкам, чувствуя упадок сил,
            старается своевременно отдохнуть (инстинкт самосохранения). Аналитик
            сопротивляется даже перенасыщенной развлекательной программе.
          </UiText>

          <UiText>
            В случае, когда партнером Аналитика становится его дуал Энтузиаст,
            проблемы перегрузок, перенапряжения, волевого напора, волевой защиты
            решаются самым естественным образом: Энтузиаст заряжает Аналитика
            своей энергией, своей активностью, постоянно поддерживает в нем
            эмоциональный и физический тонус.
          </UiText>

          <UiText>
            Подбадривает его, не позволяет ему раскисать. Задает ему очень
            гибкий режим физических и эмоциональных нагрузок, поддерживает в нем
            состояние оптимальной активности и возбуждения.
          </UiText>

          <UiText>
            Энтузиаст — единственный, кто может очень точно и естественно
            возбудить активность Аналитика, единственный, кто может его легко
            расшевелить, раззадорить, раздразнить и развлечь. Может легко
            расслабить, легко успокоить, может создать ему оптимальные условия
            для полноценной работы и отдыха.
          </UiText>

          <UiText>
            Защищая интересы Аналитика, отстаивая его идеи и взгляды, Энтузиаст
            способен с легкостью преодолеть самые, казалось бы, непреодолимые
            трудности. Когда Энтузиаст и Аналитик отстаивают интересы
            справедливости, для них просто не существует преград и препятствий.
          </UiText>

          <UiText color="accent">
            Как показывает история, идеи Аналитика легко завоевывают
            популярность при поддержке волевого напора Энтузиаст.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">5 — Внушаемая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_emotions" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Желание</UiText>
              <UiText preset="body">Этика эмоций</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Свойственно подчинять свои эмоции рассудку. Часто он производит
            впечатление человека твердого, несгибаемого, рассудительного и
            подчеркнуто сдержанного.
          </UiText>

          <UiText>
            Очень не любит состояния эмоционального перенапряжения. Тяжело
            переносит ссоры, истерики, скандалы — это стоит ему большого расхода
            сил.
          </UiText>

          <UiText>
            На начальном этапе отношений Аналитику свойственно соблюдать далекую
            дистанцию, которая сокращается только тогда, когда он убеждается в
            совпадении этических принципов партнера с его собственными
            убеждениями.
          </UiText>

          <UiText>
            Если информация не кажется ему достаточно убедительной, склонен
            испытывать чувства своего партнера. Доверяет тому человеку, который
            не только выражает ему свою симпатию, но и проявляет заботу о нем.
          </UiText>

          <UiText preset="large" color="role">
            Любит заботясь и заботится любя.
          </UiText>

          <UiText>
            Аналитик не любит выяснять отношения — зачем? Он и так знает, как
            человек поступит в следующую минуту, хорошая интуиция, всегда
            чувствует, как к нему относятся, по тому эмоциональному индикатору,
            который заложен в его подсознании и настроен на эмоциональный режим
            его дуала Энтузиаста.
          </UiText>

          <UiText color="role">
            Эмоции, не выдерживающие проверки его «индикатором», воспринимаются
            как неадекватные: кажутся либо преувеличенными, либо недостаточно
            выраженными, либо слишком демонстративными, либо неискренними или
            фальшивыми.
          </UiText>

          <UiText>
            Иногда Аналитик производит обманчивое впечатление человека
            бесчувственного и не способного к состраданию.
          </UiText>

          <UiText>
            На самом деле он способен сопереживать даже малознакомому и
            совершенно постороннему человеку, хотя может и члену своей семьи
            отказать в помощи, если видит, что эта помощь расценивается не так,
            как надо. Например как уступка, продиктованная слабостью, либо
            используется не так, как надо. Например для покупки предметов
            роскоши.
          </UiText>

          <UiText preset="large" color="role">
            К настроению окружающих подключается очень осторожно. В компании
            малосимпатичных ему людей держится скованно и замкнуто.
          </UiText>

          <UiText>
            Только попадая в обстановку непринужденного веселья, искреннего
            радушия, душевного тепла и уюта, начинает «оттаивать»,
            расслабляется, заряжается общим настроением, становится обаятельным
            и интересным собеседником.
          </UiText>

          <UiText>
            Начинает буквально искриться весельем, улыбается обаятельнейшей,
            «солнечной» улыбкой, тонко и изящно шутит, с удовольствием
            развлекает компанию всякими забавными историями, которые обычно
            хочется запомнить и потом еще кому-нибудь пересказать.
          </UiText>

          <UiText>
            Пребывая в состоянии эмоционального подъема, Аналитик очень быстро
            завоевывает симпатии, с легкостью становится душой компании и
            способен любой вечер сделать незабываемым.
          </UiText>

          <UiText preset="large" color="role">
            Внешняя холодность и суровость Аналитика — это не более, чем
            защитная оболочка его легко ранимой души.
          </UiText>

          <UiText>
            И лучше всего это понимает именно дуал Аналитика — Энтузиаст.
            Неприступная сдержанность Аналитика не только возбуждает любопытство
            Энтузиаста, который нередко находит удовольствие в том, чтобы
            преодолевать, казалось бы, непреодолимые трудности. Она служит
            своего рода «пробным камнем» для поиска психологически совместимого
            партнера. Для того чтобы растопить эти внешние «льды», требуется
            огромное душевное тепло, выраженное в эмоциональном потоке
            определенного качества и характера.
          </UiText>

          <UiText>
            Со свойственным ему душевным пылом и энергией Энтузиаст штурмует эту
            «неприступную твердыню» так, что вся «холодность» Аналитика
            рассеивается как дым.
          </UiText>

          <UiText>
            Энтузиаст, хотя и не сдерживает себя в проявлении эмоций, все-таки
            делает это достаточно тактично. Аналитик не допускает насилия над
            собой. Энтузиаст проявляет свои эмоции очень эстетично,
            интеллигентно, со вкусом, с постоянной заботой о чувствах и об
            удобствах своего партнера.
          </UiText>

          <UiText>
            Энтузиаст — единственный из всех типов «этиков-сенсориков»,
            способный эмоционально воздействовать на Аналитика самым оптимальным
            образом. Только в обществе Энтузиаста Аналитик чувствует себя
            по-настоящему спокойным, защищенным. Только рядом с ним он может
            по-настоящему расслабиться.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">
            6 — Активационная функция
          </UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_comfort" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Комфорт</UiText>
              <UiText preset="body">Сенсорика ощущений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Аналитику очень важно чувствовать постоянную заботу со стороны
            партнера. В его понимании любить — значит заботиться.
          </UiText>

          <UiText color="role">
            Если партнер не проявляет должного (по его мнению) внимания к его
            ощущениям, удобствам и комфорту, чувствам такого партнера Аналитик
            не верит.
          </UiText>

          <UiText>
            Чем больше заботы и опеки он получает, тем с большей готовностью
            исполняет желания своего партнера, тем активнее участвует в решении
            его проблем.
          </UiText>

          <UiText color="accent">
            Аналитика крайне раздражает необходимость самому заниматься
            организацией быта, комфорта, уюта — это отвлекает его от более
            важной, творческой работы.
          </UiText>

          <UiText preset="large" color="role">
            В бытовых мелочах уступчив, неприхотлив, старается не вникать
            слишком глубоко в домашние дела.
          </UiText>

          <UiText color="accent">
            Женщина-Аналитик (даже если она только домохозяйка) также считает
            домашнюю работу делом второстепенной важности. Необходимость
            поддерживать порядок на должном уровне ее часто раздражает: ей
            всегда кажется, что она тратит на это слишком много сил и времени,
            кроме того, ей часто кажется несправедливым брать на себя все заботы
            по дому — пусть другие тоже помогают.
          </UiText>

          <UiText>
            Может с удовольствием заниматься домашними делами при условии, что
            они не мешают ему думать. Среди представительниц этого типа много
            рукодельниц и кулинарок, которые неплохо справляются со своим делом
            на том уровне, когда автоматическое выполнение работы не наносит
            особого ущерба ее качеству:
          </UiText>

          <UiText color="accent">
            «Руки работают, а голова думает свою думу».
          </UiText>

          <UiText color="accent">
            Хозяйка-Аналитик может целый день выполнять какую-то несложную
            автоматическую работу и не почувствует себя усталой. С удовольствием
            готовит праздничный стол, хотя в гости приглашает только
            ограниченный круг самых близких людей.
          </UiText>

          <UiText color="role">
            Представители этого типа одеваются неброско, часто консервативно по
            стилю, в одежде предпочитают нейтральные и сдержанные тона.
          </UiText>

          <UiText>
            «Неброскость» одежды Аналитика иногда переходит в раздражающую
            тусклость. Как и все интуиты, они часто используют не самое удачное
            сочетание цветов — серое с тускло-оранжевым, серое с
            болотно-зеленым…
          </UiText>

          <UiText>
            Аналитик совершенно преображается, когда его гардеробом начинает
            заниматься Энтузиаст: одежда подбирается с таким расчетом, чтобы
            самым выгодным образом подчеркнуть его естественную
            привлекательность. Без эстетической опеки Энтузиаста Аналитик часто
            выглядит этакой невзрачной «серой мышкой».
          </UiText>

          <UiText>
            Здоровый образ жизни для Аналитика не самоцель, а непременное
            условие хорошей работоспособности. Если способен много работать и не
            уставать, значит здоровье в порядке и нечего об этом много думать.
          </UiText>

          <UiText>
            Предпочитает, чтобы о его здоровье заботился партнер, поскольку
            подсознательно настроен на сенсорику ощущений своего дуала
            Энтузиаста, для которого забота о здоровье своих близких — дело
            первостепенной важности.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">7 — Функция защиты</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_business" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Практика</UiText>
              <UiText preset="body">Деловая логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Идеи всеобщего равенства и справедливости Аналитик переносит и в
            сферу деловых отношений.
          </UiText>

          <UiText>
            Поэтому область его наблюдений в первую очередь касается вопросов
            справедливого распределения материальных благ и справедливых
            производственных отношений.
          </UiText>

          <UiText color="role">
            Вопросы соблюдения взаимных обязательств, вопросы справедливости
            трудовых соглашений, защита прав трудящихся, справедливые условия
            труда — именно это его волнует и интересует в первую очередь.
          </UiText>

          <UiText>
            Аналитик в числе тех, кто независимо от личных условий и удобств
            будет всегда отстаивать права коллектива. Именно он по собственной
            инициативе будет требовать от работодателя улучшения условий труда и
            повышения заработной платы для всех членов коллектива соответственно
            изменению индекса цен и повышению производительности труда.
          </UiText>

          <UiText>
            Будет добиваться справедливого распределения норм выработки, будет
            требовать справедливой выплаты «больничных» и «отпускных».
          </UiText>

          <UiText>
            Защита прав человека для Аналитика имеет первостепенную значимость.
            Но в некоторых случаях, когда Аналитик окончательно убеждается, что
            честными методами ему свои права не защитить, он начинает
            чувствовать себя своего рода Робин Гудом и позволяет себе
            отвоевывать причитающиеся ему блага не вполне законными и не вполне
            честными методами.
          </UiText>

          <UiText>
            Причем в этом Аналитику помогает его сильная интуиция времени.
          </UiText>

          <UiText color="accent">
            Пример: одна из представительниц этого типа, отчаявшись отстоять
            свои права, вынудила себя уволить именно в такое время, когда по
            закону ее никто не имел права увольнять, в результате чего фирме
            пришлось выплатить ей компенсацию в размере ее полуторагодовой
            зарплаты.
          </UiText>

          <UiText>
            Руководя коллективом, Аналитик делает упор на воспитание творческой
            инициативы служащих и на раскрытие их способностей. Тщательно
            анализирует уровень квалификации, стаж, опыт работы, образование.
          </UiText>

          <UiText>
            Знает, от кого, какой уровень работы потребовать, и требует в
            соответствии с индивидуальными способностями. Любую инициативу
            старается поощрять и использовать в интересах всего коллектива.
          </UiText>

          <UiText preset="large" color="role">
            Быстро находит самый рациональный метод выполнения работы и охотно
            делится своим опытом с окружающими.
          </UiText>

          <UiText color="role">
            Обмен опытом и профессиональную взаимопомощь считает нормой
            отношений в коллективе. Свои производственные предложения никому не
            навязывает, но часто высказывается на эту тему.
          </UiText>

          <UiText>
            Отсутствие взаимопонимания и взаимопомощи в коллективе резко
            осуждает. Всегда старается поддерживать с сослуживцами ровные и
            корректные отношения. Считает, что психологический климат в
            коллективе не должен отрицательно влиять на его работоспособность.
          </UiText>

          <UiText preset="large" color="role">
            За хорошую работу хвалит редко. О хорошем много не говорит, считает
            это само собой разумеющимся. Часто обращает внимание на недостатки и
            нерешенные проблемы.
          </UiText>

          <UiText color="role">
            Отчитываясь за проделанную работу, не забывает упомянуть о
            позитивных результатах.
          </UiText>

          <UiText>
            Очень методичен, во всем старается найти систему — считает ее
            непременным условием успешного выполнения работы.
          </UiText>

          <UiText color="role">
            В работе отличается точностью, скрупулезно прорабатывает детали.
            Просто так никому не доверяет, проверяет как себя, так и партнеров.
            Проверять его самого обычно излишне.
          </UiText>

          <UiText>
            Последовательный и упорный. Любое дело стремится довести до конца,
            на середине бросать не любит.
          </UiText>

          <UiText>
            Не терпит, когда при одной незаконченной работе ему поручают другую.
            Не может вести несколько дел параллельно.
          </UiText>

          <UiText color="role">
            Не любит выносить промежуточный результат своей работы на всеобщее
            обсуждение. Умеет рассчитать время выполнения своей работы. Всегда
            успевает ее сделать к назначенному сроку.
          </UiText>

          <UiText>
            Сопротивляется завышенным нормам дневной выработки. Он их просто
            игнорирует. Старается взять такое количество работы, которое сможет
            без перенапряжения выполнить к концу рабочего дня.
          </UiText>

          <UiText color="role">
            От работы не отлынивает, свое рабочее время ценит и использует очень
            продуктивно и рационально, но эксплуатировать себя не позволяет и не
            позволит ужесточить себе условия труда.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">8 — Фоновая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_time" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чутьё</UiText>
              <UiText preset="body">Интуиция времени</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Время Аналитика принадлежит его интеллектуальному творчеству.
            Поэтому он очень ценит и свое и чужое время.
          </UiText>

          <UiText>
            Пунктуален и очень ценит пунктуальность в других. Расчетливо и
            предусмотрительно планирует свой день. Его планы чаще всего
            реализуются именно так, как он их задумывает. Не любит спешки.
          </UiText>

          <UiText preset="large" color="role">
            Чувствует время и умеет разумно его распределять.
          </UiText>

          <UiText>
            Не любит суеты, живет в оптимальном жизненном ритме. В его движениях
            наблюдаются такая размеренность и такой рациональный автоматизм,
            что, казалось бы, работая не спеша, он успевает сделать очень много.
          </UiText>

          <UiText>
            Живя по принципу «Поспешай медленно», Аналитик везде поспевает и
            многое успевает. Его кажущаяся медлительность глубоко рациональна и
            чаще всего оказывается самым оптимальным темпом.
          </UiText>

          <UiText>
            Благодаря этому качеству Аналитик избавляет своего дуала Энтузиаста
            от излишнего напряжения, спешки и суеты, задает ему оптимальный ритм
            действий, оптимальный временной режим. И тем самым расслабляет и
            успокаивает его.
          </UiText>

          <UiText color="role">
            Аналитик умеет выгодно использовать для себя возможности, которые
            ему предоставляет тот или иной период времени.
          </UiText>

          <UiText color="accent">
            Например, период вынужденной безработицы он может использовать на
            повышение квалификации, на приобретение другой профессии, на
            изучение иностранных языков или юридическое самообразование.
          </UiText>

          <UiText>
            Аналитик очень ценит свое свободное время. Для него это всегда
            подарок самому себе. И предпочитает использовать его на то, на что
            раньше у него не хватало времени: на свои творческие увлечения, на
            самообразование, на отдых, на приятный и интеллектуально насыщенный
            досуг.
          </UiText>

          <UiText>
            Забирать у Аналитика его свободное время все равно, что лишать его
            этого подарка. Энтузиаст, сориентированный на интуицию времени
            Аналитика, умеет ценить чужое время и умеет защищать свое.
          </UiText>

          <UiText preset="large" color="role">
            Хорошо видит исторические закономерности в жизни общества, видит
            «связь времен».
          </UiText>

          <UiText>
            Для Аналитика характерно обращать внимание на негативные тенденции в
            окружающей его действительности. Со свойственной ему интуитивной
            проницательностью Аналитик способен своевременно понять и глубоко
            проанализировать зарождающиеся социальные проблемы.
          </UiText>

          <UiText color="role">
            Способен своевременно предостеречь от них общество и предложить
            самые оптимальные решения этих проблем.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
