<template>
  <div class="text">
    <section>
      <UiText preset="body" color="accent">
        Описания не должны обязательно совпадать со всеми чертами характера
        личности.
      </UiText>

      <UiText preset="small" color="accent">
        Идея как раз описать наблюдаемые у среднего представителя типа
        особенности поведения и обработки информации психикой.
      </UiText>

      <UiText preset="small" color="accent">
        Автор описания — Велта Микелсоне
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="role">
        Очень логичный тип, для которого жизнь — это система. Его миссия —
        избавить мир от хаоса и навести в нем порядок.
      </UiText>

      <br />

      <UiText>
        Порядок во всем для него — самый высокий приоритет в жизни. Суть Максима
        признает только две категории — порядок или беспорядок, что-то
        посередине не существует.
      </UiText>

      <UiText>
        Под проявлением хаоса понимает разгильдяйство, халатность,
        недобросовестность, расхлябанность, притворство, обман …
      </UiText>

      <UiText preset="large" color="role">
        Чем строже порядок в семье, на работе и государстве, тем спокойнее и
        увереннее он будет себя чувствовать.
      </UiText>

      <UiText>
        Как традиционалист, он верен своим моральным принципам и живет в
        соответствии с законом. Он пытается создать условия, необходимые для
        выживания и стабильности, обеспечивающие уверенность и безопасность.
      </UiText>

      <UiText>
        Для установления контроля за порядком создает и усовершенствует системы,
        иерархию, принципы, нормы, законы, правила, инструкции. То, что
        установлено, обычно не подлежит обсуждению, поскольку благодаря этому
        образовывается стабильность.
      </UiText>

      <UiText preset="large" color="role">
        Он — человек правильный и аккуратный, поэтому требует этого от других.
        Его девиз — говори, что думаешь, и думай, что говоришь.
      </UiText>

      <UiText>
        Даже речь другого человека должна быть грамотной, четкой и ясной.
        Хороший слушатель.
      </UiText>
    </section>

    <section>
      <UiText>
        Человек с сильной логикой. Ему интересно решать сложные серьезные
        вопросы, абстрактные теории его мало интересуют — он доверяет только
        тому, что проверенно на практике.
      </UiText>

      <UiText>
        Однако если теоретические вопросы усвоены и введены в общество, он их
        легко принимает и успешно использует.
      </UiText>

      <UiText>
        Полученную информацию раскладывает в строгом порядке. Почти
        автоматически знает положение вещей, устройство механизмов, и часто не
        нуждается в инструкциях. Умело пользуется сложными инструкциями и
        руководствами.
      </UiText>

      <UiText preset="large" color="role">
        Хороший организатор, успешно распределяет обязанности, умело отделяет
        главное от второстепенного.
      </UiText>

      <UiText>
        Снисходителен к тем, кто поддерживает его взгляды. Спокойный,
        благоразумный, обладает замечательной памятью на детали.
      </UiText>

      <UiText preset="large" color="role">
        Ему свойственна поразительная способность концентрироваться.
      </UiText>

      <UiText>
        Старательны, решительный и целеустремленный, скрупулезно изучает факты,
        быстро замечает связь между ними. Свои обязанности выполняет серьезно,
        ответственно и честно, за это желает получить соответствующее
        вознаграждение.
      </UiText>

      <UiText preset="large" color="role">
        Ему важно личное благополучие.
      </UiText>
    </section>

    <section>
      <UiText>
        Самостоятельный человек, он убежден в правильности своих мнений и
        принятых решений. В несущественных ситуациях ограждается от
        происходящего, но в принципиальных вопросах неуступчив.
      </UiText>

      <UiText preset="large" color="role">
        В решающий момент может оперативно действовать, не волнуется и не теряет
        хладнокровия
      </UiText>

      <UiText>
        Часто представители данного социотипа занимают ведущие должности,
        благодаря развитой силой воли. Если занимает руководящий пост, то по его
        соображению, можно любого бескомпромиссно подчинить своим правилам и
        заставить действовать.
      </UiText>

      <UiText preset="large" color="role">
        При необходимости окажет психологическое давление.
      </UiText>

      <UiText>
        Соблюдает субординацию, поэтому исполнит то, что от него требуют
        вышестоящие, несмотря на личное мнение. Переубедить его могут лишь те,
        авторитет которых он признает.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Вещи Инспектора нельзя трогать, передвигать, а также нарушать его
        порядок. Никогда.
      </UiText>

      <UiText>
        Его территория — неприкосновенная крепость. Армейская дисциплина — стиль
        жизни.
      </UiText>

      <UiText>
        Не станет давать обещаний, если не уверен, что способен их выполнить. В
        обществе ведет себя вежливо и скромно. Не позволяет себе фамильярности —
        общение на «ты», где это неуместно.
      </UiText>

      <UiText>Терпеливо, вежливо и осторожно выслушивает собеседника.</UiText>

      <UiText>
        Ему необходимо предварительная рекомендация человека. Если она
        отсутствует, тогда сокращает общение до минимума. Пользуется моментами,
        когда деловые встречи можно делегировать другому.
      </UiText>

      <UiText preset="large" color="role">
        Большинство считает его холодным, равнодушным и малоразговорчивым
        человеком.
      </UiText>

      <UiText>
        На самом деле, если он в компании молчалив, это не означает, что ему
        неинтересно. Начнет говорить лишь тогда, когда будет полностью уверен в
        своих знаниях, или когда услышал что-то интересующее, захватывающее,
        полезное.
      </UiText>

      <UiText>
        Чаще всего разговорчивость проявляется только в узком небольшом кругу
        знакомых. Но, если привык разговаривать с публикой, согласно требованиям
        должности, будет намного разговорчивее других представителей данного
        социотипа, поскольку усовершенствованы его коммуникационные навыки.
      </UiText>

      <UiText>
        Не станет внезапно прерывать разговор других своими мыслями и заметками,
        высоко ценит в людях воспитанность и галантность, которые соблюдает он
        сам.
      </UiText>

      <UiText>
        Сперва он оценит ситуацию, из-за интровертности не склонен выступать
        перед большой аудиторией, кроме ситуаций, когда слышит неправду.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        С трудом разбирается в чувствах, не умеет их выразить.
      </UiText>

      <UiText>
        Его поведение с партнером бывает недоверчивым. Он с трудом понимает
        нужды другого, особенно те, что не похожи на его собственные.
      </UiText>

      <UiText>
        Стремится уяснить механизмы взаимоотношений, но не уверен, что правильно
        их понимает. Может выразить симпатию, но при этом будет скрытен и
        предельно сдержан. Рад, если ему удаëтся сохранить хорошие отношения с
        людьми, которых он уважает.
      </UiText>

      <UiText preset="large" color="role">
        Он — хороший семьянин, в семье обычно верный и преданный, изменить
        сложившийся порядок ему сложно.
      </UiText>

      <UiText>
        Семья для него подобно государству, где царит иерархия, которая требует
        подчинения.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Больше других боится перемен. Остается верен своим привычкам и
        традициям.
      </UiText>

      <UiText>
        Друзей выбирает осторожно. Ко всему готовится заранее, не терпит
        случайностей и изменений в планах.
      </UiText>

      <UiText>
        Часто сомневается в своих способностях. Его тревожит публичное
        обсуждение его способностей, например, во время интервью при приеме на
        работу. Также категорически сопротивляется углубленному самоанализу,
        раскрытию своих качеств. Других оценивает по форме, а не по содержанию.
      </UiText>

      <UiText>
        Часто меняется настроение. Ему необходимы яркие впечатления и сильные
        переживания.
      </UiText>

      <UiText>
        Чем острее чувства и эмоции, тем более интересной ему кажется жизнь.
        Если этих ощущений не достает в его жизни, он начинает действовать
        вызывающе.
      </UiText>

      <UiText preset="large" color="role">
        Ему нелегко освободиться от источников отрицательных эмоций и ощущения
        беспомощности.
      </UiText>

      <UiText>
        Если не получил удовлетворение в семейной жизни, он часто дарит свою
        любовь животным. В них он видит друга, собеседника и объект любви. Также
        ищет позитивные эмоции, посещая культурные мероприятия — выставки, кино
        и театр.
      </UiText>
    </section>

    <section>
      <UiText>
        Четко определен распорядок дня, в том числе и в свободное время.
      </UiText>

      <UiText>
        Его раздражает, если кто-то нарушает установленный ритм жизни. Он плохо
        переносит внезапные вмешательства со стороны, не обладает способностью
        быстро перестраиваться, поскольку тем самым нарушаются его личные планы.
      </UiText>

      <UiText preset="large" color="role">
        Быстро мобилизуется, когда испытает недостаток времени, он незаменим в
        аварийных и чрезвычайных ситуациях.
      </UiText>

      <UiText>
        Считает, что работа важнее, чем личные симпатии, и нельзя быть зависимым
        от настроения. Не терпит вокруг себя вялых, бездеятельных,
        легкомысленных, а также неискренних людей.
      </UiText>

      <UiText preset="large" color="role">
        Обладает удивительной выносливостью, но в состоянии стресса теряется его
        моральная и физическая сила.
      </UiText>

      <UiText>
        В выбранной профессии стремится достичь совершенства, редко её меняет.
        Также редко осваивает другую профессию.
      </UiText>

      <UiText>
        Он с удовольствием выполняет ручную работу, и она всегда выполнена
        качественно. На мелкие, кропотливые, оформительские работы ему не
        хватает терпения, и они ему не так важны.
      </UiText>
    </section>

    <section>
      

      <UiText>
        Свою квартиру обставляет практичными, но не всегда роскошными вещами. Ценность предметов не всегда измеряет в денежном выражении. Однако у него развито эстетическое чувство. Дорогие и качественные предметы в своем владении особенно бережет.
      </UiText>

      <UiText preset="large" color="role">
        Не придает особого внимания застольной культуре, руководствуется случаем.
      </UiText>

      <UiText>
        Заботится о своем внешнем виде, аккуратен в выборе одежды, но одевается неброско. В быту, как и на работе — педантичный и чистый, и требует того же от других. Хозяйственный человек, в доме у которого находиться все необходимое для быта.
      </UiText>

      <UiText>
        Мужчины предпочитают деловой и армейский стиль, женщины сливаются с толпой, им не свойственно выделяться одеждой.
      </UiText>

      <UiText preset="large" color="role">
        Болезнь — проявление слабости.
      </UiText>

      <UiText>
        Он строго соблюдает профилактику, противник вредных для здоровье привычек. Также он заботится о здоровье близких людей.
      </UiText>      
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
