<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Велта Микелсоне"
          subtitle="10 минут"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Вера Стратиевская"
          subtitle="24 минута"
          target-content-id="tab-2"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText preset="body" color="accent">
            Описания не должны обязательно совпадать со всеми чертами характера
            личности.
          </UiText>

          <UiText preset="small" color="accent">
            Идея как раз описать наблюдаемые у среднего представителя типа
            особенности поведения и обработки информации психикой.
          </UiText>

          <UiText preset="small" color="accent">
            Автор описания — Велта Микелсоне
          </UiText>
        </section>

        <section>
          <UiText preset="subtitle" color="role">
            Очень логичный тип, для которого жизнь — это система. Его миссия —
            избавить мир от хаоса и навести в нем порядок.
          </UiText>

          <br />

          <UiText>
            Порядок во всем для него — самый высокий приоритет в жизни. Суть
            Максима признает только две категории — порядок или беспорядок,
            что-то посередине не существует.
          </UiText>

          <UiText>
            Под проявлением хаоса понимает разгильдяйство, халатность,
            недобросовестность, расхлябанность, притворство, обман …
          </UiText>

          <UiText preset="large" color="role">
            Чем строже порядок в семье, на работе и государстве, тем спокойнее и
            увереннее он будет себя чувствовать.
          </UiText>

          <UiText>
            Как традиционалист, он верен своим моральным принципам и живет в
            соответствии с законом. Он пытается создать условия, необходимые для
            выживания и стабильности, обеспечивающие уверенность и безопасность.
          </UiText>

          <UiText>
            Для установления контроля за порядком создает и усовершенствует
            системы, иерархию, принципы, нормы, законы, правила, инструкции. То,
            что установлено, обычно не подлежит обсуждению, поскольку благодаря
            этому образовывается стабильность.
          </UiText>

          <UiText preset="large" color="role">
            Он — человек правильный и аккуратный, поэтому требует этого от
            других. Его девиз — говори, что думаешь, и думай, что говоришь.
          </UiText>

          <UiText>
            Даже речь другого человека должна быть грамотной, четкой и ясной.
            Хороший слушатель.
          </UiText>
        </section>

        <section>
          <UiText>
            Человек с сильной логикой. Ему интересно решать сложные серьезные
            вопросы, абстрактные теории его мало интересуют — он доверяет только
            тому, что проверенно на практике.
          </UiText>

          <UiText>
            Однако если теоретические вопросы усвоены и введены в общество, он
            их легко принимает и успешно использует.
          </UiText>

          <UiText>
            Полученную информацию раскладывает в строгом порядке. Почти
            автоматически знает положение вещей, устройство механизмов, и часто
            не нуждается в инструкциях. Умело пользуется сложными инструкциями и
            руководствами.
          </UiText>

          <UiText preset="large" color="role">
            Хороший организатор, успешно распределяет обязанности, умело
            отделяет главное от второстепенного.
          </UiText>

          <UiText>
            Снисходителен к тем, кто поддерживает его взгляды. Спокойный,
            благоразумный, обладает замечательной памятью на детали.
          </UiText>

          <UiText preset="large" color="role">
            Ему свойственна поразительная способность концентрироваться.
          </UiText>

          <UiText>
            Старательны, решительный и целеустремленный, скрупулезно изучает
            факты, быстро замечает связь между ними. Свои обязанности выполняет
            серьезно, ответственно и честно, за это желает получить
            соответствующее вознаграждение.
          </UiText>

          <UiText preset="large" color="role">
            Ему важно личное благополучие.
          </UiText>
        </section>

        <section>
          <UiText>
            Самостоятельный человек, он убежден в правильности своих мнений и
            принятых решений. В несущественных ситуациях ограждается от
            происходящего, но в принципиальных вопросах неуступчив.
          </UiText>

          <UiText preset="large" color="role">
            В решающий момент может оперативно действовать, не волнуется и не
            теряет хладнокровия
          </UiText>

          <UiText>
            Часто представители данного социотипа занимают ведущие должности,
            благодаря развитой силой воли. Если занимает руководящий пост, то по
            его соображению, можно любого бескомпромиссно подчинить своим
            правилам и заставить действовать.
          </UiText>

          <UiText preset="large" color="role">
            При необходимости окажет психологическое давление.
          </UiText>

          <UiText>
            Соблюдает субординацию, поэтому исполнит то, что от него требуют
            вышестоящие, несмотря на личное мнение. Переубедить его могут лишь
            те, авторитет которых он признает.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Вещи Инспектора нельзя трогать, передвигать, а также нарушать его
            порядок. Никогда.
          </UiText>

          <UiText>
            Его территория — неприкосновенная крепость. Армейская дисциплина —
            стиль жизни.
          </UiText>

          <UiText>
            Не станет давать обещаний, если не уверен, что способен их
            выполнить. В обществе ведет себя вежливо и скромно. Не позволяет
            себе фамильярности — общение на «ты», где это неуместно.
          </UiText>

          <UiText>
            Терпеливо, вежливо и осторожно выслушивает собеседника.
          </UiText>

          <UiText>
            Ему необходимо предварительная рекомендация человека. Если она
            отсутствует, тогда сокращает общение до минимума. Пользуется
            моментами, когда деловые встречи можно делегировать другому.
          </UiText>

          <UiText preset="large" color="role">
            Большинство считает его холодным, равнодушным и малоразговорчивым
            человеком.
          </UiText>

          <UiText>
            На самом деле, если он в компании молчалив, это не означает, что ему
            неинтересно. Начнет говорить лишь тогда, когда будет полностью
            уверен в своих знаниях, или когда услышал что-то интересующее,
            захватывающее, полезное.
          </UiText>

          <UiText>
            Чаще всего разговорчивость проявляется только в узком небольшом
            кругу знакомых. Но, если привык разговаривать с публикой, согласно
            требованиям должности, будет намного разговорчивее других
            представителей данного социотипа, поскольку усовершенствованы его
            коммуникационные навыки.
          </UiText>

          <UiText>
            Не станет внезапно прерывать разговор других своими мыслями и
            заметками, высоко ценит в людях воспитанность и галантность, которые
            соблюдает он сам.
          </UiText>

          <UiText>
            Сперва он оценит ситуацию, из-за интровертности не склонен выступать
            перед большой аудиторией, кроме ситуаций, когда слышит неправду.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            С трудом разбирается в чувствах, не умеет их выразить.
          </UiText>

          <UiText>
            Его поведение с партнером бывает недоверчивым. Он с трудом понимает
            нужды другого, особенно те, что не похожи на его собственные.
          </UiText>

          <UiText>
            Стремится уяснить механизмы взаимоотношений, но не уверен, что
            правильно их понимает. Может выразить симпатию, но при этом будет
            скрытен и предельно сдержан. Рад, если ему удаëтся сохранить хорошие
            отношения с людьми, которых он уважает.
          </UiText>

          <UiText preset="large" color="role">
            Он — хороший семьянин, в семье обычно верный и преданный, изменить
            сложившийся порядок ему сложно.
          </UiText>

          <UiText>
            Семья для него подобно государству, где царит иерархия, которая
            требует подчинения.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Больше других боится перемен. Остается верен своим привычкам и
            традициям.
          </UiText>

          <UiText>
            Друзей выбирает осторожно. Ко всему готовится заранее, не терпит
            случайностей и изменений в планах.
          </UiText>

          <UiText>
            Часто сомневается в своих способностях. Его тревожит публичное
            обсуждение его способностей, например, во время интервью при приеме
            на работу. Также категорически сопротивляется углубленному
            самоанализу, раскрытию своих качеств. Других оценивает по форме, а
            не по содержанию.
          </UiText>

          <UiText>
            Часто меняется настроение. Ему необходимы яркие впечатления и
            сильные переживания.
          </UiText>

          <UiText>
            Чем острее чувства и эмоции, тем более интересной ему кажется жизнь.
            Если этих ощущений не достает в его жизни, он начинает действовать
            вызывающе.
          </UiText>

          <UiText preset="large" color="role">
            Ему нелегко освободиться от источников отрицательных эмоций и
            ощущения беспомощности.
          </UiText>

          <UiText>
            Если не получил удовлетворение в семейной жизни, он часто дарит свою
            любовь животным. В них он видит друга, собеседника и объект любви.
            Также ищет позитивные эмоции, посещая культурные мероприятия —
            выставки, кино и театр.
          </UiText>
        </section>

        <section>
          <UiText>
            Четко определен распорядок дня, в том числе и в свободное время.
          </UiText>

          <UiText>
            Его раздражает, если кто-то нарушает установленный ритм жизни. Он
            плохо переносит внезапные вмешательства со стороны, не обладает
            способностью быстро перестраиваться, поскольку тем самым нарушаются
            его личные планы.
          </UiText>

          <UiText preset="large" color="role">
            Быстро мобилизуется, когда испытает недостаток времени, он незаменим
            в аварийных и чрезвычайных ситуациях.
          </UiText>

          <UiText>
            Считает, что работа важнее, чем личные симпатии, и нельзя быть
            зависимым от настроения. Не терпит вокруг себя вялых, бездеятельных,
            легкомысленных, а также неискренних людей.
          </UiText>

          <UiText preset="large" color="role">
            Обладает удивительной выносливостью, но в состоянии стресса теряется
            его моральная и физическая сила.
          </UiText>

          <UiText>
            В выбранной профессии стремится достичь совершенства, редко её
            меняет. Также редко осваивает другую профессию.
          </UiText>

          <UiText>
            Он с удовольствием выполняет ручную работу, и она всегда выполнена
            качественно. На мелкие, кропотливые, оформительские работы ему не
            хватает терпения, и они ему не так важны.
          </UiText>
        </section>

        <section>
          <UiText>
            Свою квартиру обставляет практичными, но не всегда роскошными
            вещами. Ценность предметов не всегда измеряет в денежном выражении.
            Однако у него развито эстетическое чувство. Дорогие и качественные
            предметы в своем владении особенно бережет.
          </UiText>

          <UiText preset="large" color="role">
            Не придает особого внимания застольной культуре, руководствуется
            случаем.
          </UiText>

          <UiText>
            Заботится о своем внешнем виде, аккуратен в выборе одежды, но
            одевается неброско. В быту, как и на работе — педантичный и чистый,
            и требует того же от других. Хозяйственный человек, в доме у
            которого находиться все необходимое для быта.
          </UiText>

          <UiText>
            Мужчины предпочитают деловой и армейский стиль, женщины сливаются с
            толпой, им не свойственно выделяться одеждой.
          </UiText>

          <UiText preset="large" color="role">
            Болезнь — проявление слабости.
          </UiText>

          <UiText>
            Он строго соблюдает профилактику, противник вредных для здоровье
            привычек. Также он заботится о здоровье близких людей.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="small" color="accent">1 — Базовая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_logic" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Теория</UiText>
              <UiText preset="body">Структурная логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Инспектор внутренне стремится к стабильности, к миру, который не
            изменяется, к отношениям, которые не меняются, — логически стройным,
            просчитанным, продуманным.
          </UiText>

          <UiText>
            Именно поэтому из всех типов интеллекта Инспектор — самый
            социально-ориентированный. Поскольку его социальная направленность
            предполагается самой программой его интеллекта — логикой конкретных
            систем. Равно как и тем способом внедрения, на который может быть
            ориентирована такая программа, — волевым административным давлением.
          </UiText>

          <UiText color="role">
            Логическая программа Инспектора по своей социальной сущности
            призвана быть альтернативой всякого рода дестабилизации окружающей
            его среды, окружающих его структур — социальных, политических,
            физических, биологических.
          </UiText>

          <UiText>
            Именно поэтому представление о логичности, разумности,
            рациональности у Инспектора связано в первую очередь с организацией
            структурного порядка («порядка вещей») в рамках конкретно
            существующей системы.
          </UiText>

          <UiText preset="large" color="role">
            Вне системы Инспектор никогда и ничего не рассматривает — таков
            склад его интеллекта.
          </UiText>

          <UiText>
            Любое явление рассматривается им как часть некоей существующей
            системы, в которой действуют определенные закономерности и
            определенный логический порядок, понять который Инспектора считает
            себя обязанным.
          </UiText>

          <UiText>
            Воспринимая окружающую его реальность с точки зрения ее системности,
            логической продуманности, Инспектор постоянно анализирует
            существующие вокруг него системы — системы логических и этических
            взаимоотношений, системы социальных укладов, системы взглядов,
            системы жизненных ценностей.
          </UiText>

          <UiText>
            Смысл любого явления Инспектор понимает через осознание его
            «системности», как бы задавая себе вопрос: это единичный факт или он
            приписывается к какой-то системе? Это частный поступок или это
            модель поведения? Если это частный поступок, то какие мотивы за ним
            стоят? Это единичные, случайные мотивы или за ними стоит какая-то
            система взглядов и отношений?
          </UiText>

          <UiText color="role">
            Понять глубинную суть явлений, установить причинно-следственные
            связи между явлениями самого различного порядка, проанализировать
            наблюдаемое явление, систематизировать выводы, вывести какое-то
            более общее определение и вписать его в уже существующую систему
            взглядов, выбрать из всех существующих систем наиболее подходящую
            для конкретных целей и задач и усовершенствовать ее, приспособить к
            конкретным социальным условиям, продумав и проработав ее в малейших
            деталях.
          </UiText>

          <UiText>
            Все это сфера активнейшей интеллектуальной деятельности любого из
            представителей этого типа.
          </UiText>

          <UiText preset="large" color="role">
            В силу определенного склада интеллекта представителю этого типа
            легче воспринимать окружающую его реальность как некую
            централизованную систему.
          </UiText>

          <UiText color="accent">
            «Одно солнце озаряет нас, один Бог на небе, одна церковь на земле и
            Папа Римский — ее наместник!»
          </UiText>

          <UiText>
            Но даже если такое восприятие существенно ограничивает способ и
            форму его мышления, оно в то же время выражает и специфическую
            направленность интеллекта его типа, а именно — социальную
            ориентацию, расстановку сил в социальной системе.
          </UiText>

          <UiText>
            Инспектор никогда не существует вне системы социальных отношений,
            так как круг и характер его личных взаимоотношений уже сам по себе
            систематизирован и предполагает четкое иерархическое подразделение,
            поскольку такое легче всего вписывается в его представление о
            логической стройности и изначальном «порядке вещей».
          </UiText>

          <UiText color="role">
            Другую точку зрения представителю этого типа вообще трудно себе
            представить, она просто не укладывается в его собственную
            психическую структуру, в его систему взглядов.
          </UiText>

          <UiText>
            Ни при каких обстоятельствах Инспектор не может быть «сам по себе»,
            «сам с усам», «сам только за себя» — это слишком глубоко
            противоречит программе его интеллекта.
          </UiText>

          <UiText>
            Которая так же, как и программа его дуала Наставника ставит своей
            задачей пережить смутное время, упорядочить его, выжить в
            экстремальных условиях. И именно поэтому Инспектор всегда очень
            конформен и лоялен по отношению к существующему режиму, искренне
            старается найти себе применение в условиях господствующего
            социального строя. Даже если вообразить представителя этого типа в
            качестве «антиобщественного» элемента, все равно он не может быть
            «сам по себе».
          </UiText>

          <UiText>
            Инспектору трудно быть «волком-одиночкой», у него для этого
            недостаточно сильная интуиция, поэтому он обязательно будет
            организован в рамках какой-то другой социальной структуры, где и
            будет выполнять все возложенные на него обязанности и нести
            ответственность за свои поступки — иной формы поведения для
            Инспектора просто не существует.
          </UiText>

          <UiText preset="large" color="role">
            Именно потому, что представители этого типа рассматривают себя,
            равно как и каждого индивида, как часть существующей системы
            отношений.
          </UiText>

          <UiText>
            Любое проявление индивидуализма они считают для себя в принципе
            неприемлемым, как явление, выходящее за рамки допустимого,
            расшатывающее общественные устои и привносящее хаос и анархию в
            существующий уклад.
          </UiText>

          <UiText>
            Поэтому особую социальную значимость они видят в такой деятельности,
            как составление правил, положений, методик, инструкций, общественных
            и юридических законов, установление эталонов и стандартов. К работе
            на этом поприще Инспекторы относятся с большой ответственностью и
            потому особенно в ней преуспевают.
          </UiText>

          <UiText color="role">
            Расстановка сил в системе, по мнению Инспектора, должна быть
            стройной, логичной, продуманной, справедливой. Должна предполагать
            четкое распределение обязанностей и соответствующие им меры
            ответственности.
          </UiText>

          <UiText>
            Так же, как и Аналитик, Инспектор считает необходимым воспитание
            общественного сознания, направление которого определяется целями и
            задачами существующей социальной системы.
          </UiText>

          <UiText>
            Именно поэтому представителям этого типа свойственна не только
            социальная, но и идеологическая ориентация.
          </UiText>

          <UiText>
            Именно поэтому так же, как и его дуала Наставника, Инспектора
            отличает активная гражданская позиция. Представители этого типа
            склонны видеть свое социальное предназначение в
            идейно-воспитательной работе, в воспитании нужного, заказанного
            социального сознания у подрастающего поколения
          </UiText>

          <UiText preset="large" color="role">
            Показателем качества и жизнеспособности любой системы, равно как и
            гарантией ее стабильности, Инспектор считает взаимозаменяемость всех
            ее частей.
          </UiText>

          <UiText>
            Человек, как часть социальной системы, тоже должен быть
            взаимозаменяем: при таких условиях каждый сможет найти свое место в
            уже существующей социальной системе. И сама система будет уже тем
            хороша, что каждому человеку обеспечит полную занятость.
          </UiText>

          <UiText color="role">
            Последнее положение Инспектору особенно удобно ввиду его слабой
            интуиции возможностей.
          </UiText>

          <UiText preset="large" color="role">
            По мнению Инспектора, в совершенной системе не должно быть
            уникальных, незаменимых элементов.
          </UiText>

          <UiText>
            В этом лишний раз проявляется критическое отношение Инспектора к
            откровенно индивидуалистической позиции: человек может быть сколько
            угодно яркой индивидуальностью, но это еще не дает ему права считать
            себя в принципе незаменимым.
          </UiText>

          <UiText>
            В трудовом коллективе не должно быть незаменимых специалистов, равно
            как и ярко выраженных индивидуальностей, поскольку это порождает
            неравенство во взаимоотношениях, привносит в них сумбур и
            неопределенность, и именно поэтому в критической ситуации становится
            опасным для жизнедеятельности коллектива.
          </UiText>

          <UiText preset="large" color="role">
            Мышление Инспектора очень систематизировано. Все происходящее
            пытается объяснить только с логической точки зрения. В вопросах
            логики его нелегко переубедить и невозможно сбить с толку.
          </UiText>

          <UiText>
            Умеет оценить интеллектуальный потенциал собеседника, хотя его
            оценки часто имеют критическую тенденцию. В диспутах старается
            захватить инициативу — последний аргумент должен быть непременно за
            ним. Сенсорик.
          </UiText>

          <UiText color="role">
            Великолепно разрабатывает методики, высчитывает таблицы, графики,
            составляет учебники…
          </UiText>

          <UiText>
            Хороший докладчик; излагает материал поэтапно, чтобы прослеживалась
            вся логическая цепочка его вывода. Выступая перед аудиторией, ставит
            вопросы и сам на них отвечает.
          </UiText>

          <UiText>
            В выражении своей точки зрения крайне педантичен. Отстаивает свою
            систему взглядов, высказываясь с крайним максимализмом. Мало
            сказать, что Инспектор с уважением относится к иерархическим
            социальным системам, где каждый обязан знать свое место: других
            систем он просто не приемлет.
          </UiText>

          <UiText color="role">
            По мнению Инспектора, поведение человека обязано соответствовать его
            положению, в противном случае общественное сознание будет
            дезориентировано образцами «неподобающего» поведения, что опять же
            приведет к дестабилизации социальной системы.
          </UiText>

          <UiText preset="large" color="role">
            Уважение к авторитетам — одна из важнейших ценностей его
            интеллектуальной структуры. Ориентация на авторитет — немаловажный
            мотив многих его поступков, во многом определяющий характер его
            взаимоотношений и поведения.
          </UiText>

          <UiText>
            От природы наделенный феноменальной наблюдательностью, Инспектор
            тщательно собирает и скрупулезно обрабатывает факты, умея находить в
            потоке информации именно то, что ему нужно.
          </UiText>

          <UiText>
            Очень педантичен: не одобряет, когда игнорируются якобы
            «несущественные» мелкие факты и допускают даже незначительные
            логические просчеты — в этом Инспектор очень щепетилен и придирчив.
          </UiText>

          <UiText color="role">
            Представителя этого типа раздражают люди, не умеющие логически
            стройно излагать свои мысли, сбивающиеся на частности и
            отвлекающиеся от основной темы.
          </UiText>

          <UiText color="role">
            Их раздражает небрежное отношение к изложению формулировок, путаница
            в терминах, в определениях; а самое ужасное — путаница в изложении
            мысли.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">2 — Творческая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_will" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Воля</UiText>
              <UiText preset="body">Волевая сенсорика</UiText>
            </span>
          </div>

          <UiText>
            Конкретная логическая программа должна внедряться конкретными
            методами, а что может быть конкретнее метода волевого воздействия?
          </UiText>

          <UiText preset="large" color="role">
            Назначив Инспектора теоретиком конкретных систем, природа вооружила
            его таким мощным инструментом, как гибкое и манипулятивное волевое
            воздействие — целенаправленное влияние на окружающих посредством
            ощущения своей силы, значимости, посредством ощущения правомерности
            своего волевого нажима.
          </UiText>

          <UiText>
            Принадлежность к реально существующим общественным структурам дает
            Инспектору ощущение собственной социальной значимости, которую он
            видит в служении идеалам своей системы: создает ей теоретическую
            базу, выстраивает крепкие административные структуры, незыблемые на
            все времена.
          </UiText>

          <UiText color="accent">
            Главенствующая система может развалиться, а ее административная
            структура способна быстро переформироваться и продолжать
            функционировать под другим флагом и другим лозунгом.
          </UiText>

          <UiText preset="large" color="role">
            Инспектора отличает высокая требовательность и к себе, и к
            окружающим, нетерпимость ко всякого рода проявлениям беспорядка в
            рамках его системы, к насаждению в ней анархии и хаоса.
          </UiText>

          <UiText>
            Инспектор искренне восхищается таким качеством, как
            работоспособность. Самоотверженный труд на благо общества, на благо
            коллектива — это норма человеческой деятельности, которая одна
            только и может быть допустима в здоровой и жизнеспособной социальной
            системе.
          </UiText>

          <UiText>
            И наоборот, всякая расхлябанность, безответственность и
            разгильдяйство подрывают общественные устои, приводят общество к
            разрушению, социальным бедствиям и катастрофам; поэтому с этими
            явлениями, он считает, необходимо бороться всеми силами, без жалости
            и снисхождения.
          </UiText>

          <UiText preset="large" color="role">
            Инспектор всегда готов к борьбе с проявлениями безалаберности в
            обществе.
          </UiText>

          <UiText color="accent">
            Он может потратить время своего отпуска на борьбу с недостатками в
            системе санаторного обслуживания и общественного питания; и
            вернуться домой уставшим, но счастливым — еще один очаг
            разгильдяйства ликвидирован его усилиями, и теперь отдыхающие смогут
            получать полноценное обслуживание.
          </UiText>

          <UiText>
            В рамках системы Инспектора не может быть просто группы людей — есть
            коллектив, объединенный общим интересом и иерархически
            организованный; независимо от численности и возраста его членов
            всегда назначается кто-нибудь, отвечающий за руководство на
            «вверенном участке» — «командир звездочки», «ответственный по
            коридору».
          </UiText>

          <UiText>
            Волевая сенсорика Инспектора, в отличие от
            воинственно-морализаторской сенсорики Хранителя и
            административно-«мафиозной» сенсорики Лидера, носит
            «военно-административный» характер — в силу социальной специфики
            диады Наставник — Инспектор. Это отчасти объясняет, почему в рамках
            социальной системы Инспектора группа детей превращается в
            «звездочку», в «звено» или в «отряд октябрят».
          </UiText>

          <UiText>
            Инспектор может удобно устроиться на любом уровне социальной
            иерархии. Для него главное — занять место в этой системе.
          </UiText>

          <UiText color="role">
            Он с одинаковым рвением может выполнять любую должностную работу, и
            свои деловые отношения строит согласно занимаемому положению:
            требует с подчиненных и старается не спорить с начальством.
          </UiText>

          <UiText color="accent">
            «Начальству видней» — самая популярная поговорка Инспектора, а
            аргумент: «Я только подчинялся приказу» — самый убедительный. И ему
            непонятно, как это можно оспаривать. По его логике, в его системе
            нижестоящий подчиняется вышестоящему, младший — старшему.
          </UiText>

          <UiText>
            Вежливо строг в обращении, всегда дисциплинирован, подтянут,
            аккуратен, исполнителен, обязателен, пунктуален: все эти качества
            идеально соответствуют социальной функции Инспектора — работе на
            благо общественной системы.
          </UiText>

          <UiText color="role">
            Свой дом он тоже рассматривает, как вверенный ему участок системы.
            Поэтому там все подчиняется ее законам и правилам. Распределение
            семейного бюджета, поведение членов семьи — все должно подвергаться
            строгому контролю и учету.
          </UiText>

          <UiText>
            «Порядок вещей» в доме приобретает особую значимость, и в прямом и в
            переносном смысле — это не только определенное место для каждой
            вещи, но и определенное место каждого члена семьи в семейной
            иерархии.
          </UiText>

          <UiText preset="large" color="role">
            Инструментом волевого воздействия для Инспектора является творчески
            применяемая им система поощрения и наказания — система «кнута и
            пряника».
          </UiText>

          <UiText color="role">
            В рамках вверенного ему участка системы Инспектор не потерпит даже
            малейшего сопротивления его воле. Чем ближе дистанция его
            взаимоотношений, тем более жесткие меры волевого воздействия он
            применяет.
          </UiText>

          <UiText>
            Надо отдать должное, Инспектор, прежде чем наказать, имеет
            обыкновение объяснять, за что он наказывает и почему (надо же
            воспитывать сознательность у члена общества), но если «проступок»
            повторяется слишком часто, Инспектор наказывает и без
            предупреждения. Более того, внезапность его наказания бывает
            неожиданной и потому пугающей:
          </UiText>

          <UiText color="accent">
            «Занятия музыкой были для меня самой настоящей пыткой. Они
            начинались с того, что отец сам настраивал скрипку, аккуратно
            раскладывал ноты и, самое главное, вывешивал на спинку стула ремень.
            Стоило мне только отвлечься или пропустить фальшивую ноту, мне тут
            же попадало ремнем... Зато потом, после таких занятий отец был
            особенно ласков, подкладывал мне конфеты под подушку... Любил
            рассказывать, что по такой же системе обучались многие великие
            музыканты...»
          </UiText>

          <UiText preset="large" color="role">
            Инспектор любит пользоваться проверенными методиками, особенно если
            они совпадают с его собственной точкой зрения и известны своими
            позитивными результатами.
          </UiText>

          <UiText>
            Система «поощрения и наказания» Инспектора действительно строится на
            перепаде сенсорных ощущений, а в ощущениях он, как всякий сенсорик,
            великолепно разбирается — знает и что такое настоящая боль, и что
            такое настоящее наслаждение. А если не знает, то может захотеть из
            чисто познавательных соображений испытать это на себе или на других.
          </UiText>

          <UiText>
            Следует заметить, что такая форма волевого воздействия рассчитана в
            первую очередь на то, чтобы активизировать и дисциплинировать
            Наставника, а также на его слабую, а иногда и довольно инертную
            сенсорику, которая без соответствующего импульса Инспектора в работу
            не включится.
          </UiText>

          <UiText>
            Без уверенности в том, что рядом с ним находится сильная и жесткая
            рука, без сознания того, что есть граница его вседозволенности, без
            перепадов сенсорных ощущений Наставник себя очень плохо чувствует —
            он как бы теряет стержень, тонус, опору и ориентиры, начинает
            хандрить, раздражаться, вредничать, начинает провоцировать партнера
            на ссору, как бы требуя, чтобы тот доказал, на что он способен.
          </UiText>

          <UiText>
            Наставник уважает силу и презирает слабаков и слюнтяев, поэтому с
            Инспектором он довольно быстро находит общий язык, чувствуя в нем
            партнера, во всех отношениях его достойного.
          </UiText>

          <UiText preset="large" color="role">
            Кроме того, на этом этапе в работу уже включается и аспект сенсорики
            ощущений, который у Инспектора реализуется подсознательно —
            соответственно перепадам его собственного настроения.
          </UiText>

          <UiText>
            Поэтому Инспектор и сам не всегда может осознать, почему ему вдруг
            захотелось кому-то сделать больно и что его на это побудило,
            поскольку это желание у него возникает довольно часто, а при
            малейшем раздражении, чуть ли не инстинктивно.
          </UiText>

          <UiText>
            Зато потом он может подвести под свой поступок логическую базу и
            объяснить, что сделал это в воспитательных целях.
          </UiText>

          <UiText color="role">
            Если Инспектор посчитает, что слишком переусердствовал в мерах
            своего воздействия, обязательно найдет способ каким-нибудь добрым
            поступком загладить свою вину.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">3 — Ролевая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_people" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чувство</UiText>
              <UiText preset="body">Этика отношений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Инспектор обычно легко завоевывает симпатии и расположение
            окружающих.
          </UiText>

          <UiText>
            Дисциплинированный с начальством, строгий с подчиненными,
            добродушный и услужливый с товарищами, жестокий и бескомпромиссный с
            врагами «своего лагеря», милый и обходительный с дамами,
            расположения которых он добивается тактикой «осады и штурма
            неприступной крепости», преданный и заботливый семьянин.
          </UiText>

          <UiText color="role">
            Систему своих этических взаимоотношений он также строит на принципах
            социально-справедливой, социально-оправданной этики, которая
            выражается в следующем соотношении: степень ответственности
            определяет меру прав.
          </UiText>

          <UiText>
            Этику поведения Инспектор рассматривает в первую очередь с точки
            зрения правомерности действий человека.
          </UiText>

          <UiText preset="large" color="role">
            Поэтому у Инспектора характер всех форм взаимоотношений определяется
            степенью взаимных обязательств.
          </UiText>

          <UiText color="role">
            В рамках его этики личному желанию и личному праву уделяется самое
            последнее место. Рассматривается только соотношение прав и
            обязанностей: только в том случае, если ты выполняешь свои
            обязанности, ты имеешь право на удовлетворение своих желаний и
            потребностей.
          </UiText>

          <UiText preset="large" color="role">
            Мера удовлетворения потребностей определяется опять же мерой
            распределения обязанностей и степенью возложенной ответственности:
            «То, что позволено Юпитеру, не позволено быку».
          </UiText>

          <UiText>
            Принцип этической справедливости Инспектора (так же, как и
            Аналитика) в первую очередь исходит из принципа справедливого
            распределения материальных благ в рамках общественной системы —
            распределение прав по труду, по личному вкладу в общее дело.
          </UiText>

          <UiText>
            Поскольку этика Инспектора базируется на принципе соотношения
            взаимных обязательств, он считает вполне этичным и справедливым
            распределение привилегий по степени ответственности.
          </UiText>

          <UiText color="role">
            Вследствие этого этика Инспектора глубоко иерархична по своей сути.
            В ней присутствует логический порядок централизованной системы
            отношений. Глава социальной структуры — глава семьи — должен быть
            наделен самыми большими полномочиями и привилегиями, и это не
            обсуждается.
          </UiText>

          <UiText>
            Беспрекословное подчинение признанному авторитету, «большинству» и
            «старшинству» — краеугольная основа максимовской этики.
          </UiText>

          <UiText color="role">
            Принцип взаимных обязательств переносится Инспектора и на область
            его личных взаимоотношений, но выполняется при одном условии:
            человек, с которым он формирует свои отношения, должен быть
            сопричастен к его социальной системе.
          </UiText>

          <UiText color="role">
            Он должен кем-то быть по отношению к Инспектору — в противном случае
            нет оснований для этического равенства.
          </UiText>

          <UiText color="accent">
            Если Инспектор встречается с девушкой, которая хотя бы только
            считается его подругой, это уже налагает на нее определенные
            обязательства: она обязана быть верной и преданной ему, и идеалам
            его системы, она не имеет права легкомысленно разорвать с ним
            отношения, она не имеет права вести себя так, «как ей хочется».
          </UiText>

          <UiText>
            Словом, она не имеет права компрометировать Инспектора перед
            остальными членами его системы — его родственниками, друзьями,
            сослуживцами. В противном случае это будет несправедливо по
            отношению к нему.
          </UiText>

          <UiText>
            И в этом случае у Инспектора могут быть по отношению к ней
            совершенно справедливые, с его точки зрения, претензии: он ее ввел в
            свой круг, может, даже в чем-то «возвысил» до себя, она могла
            пользоваться помощью и поддержкой его окружения, а это налагает и на
            него какую-то ответственность за ее поступки.
          </UiText>

          <UiText preset="large" color="role">
            Именно поэтому разрыв семейных отношений Инспектор рассматривает как
            пятно на своей репутации.
          </UiText>

          <UiText color="accent">
            Мало ли, а вдруг люди скажут: «Где уж ему коллективом руководить,
            если он с женой поладить не может!»
          </UiText>

          <UiText>
            Кроме того, разрыв отношений с Инспектором — это, в его понимании,
            еще и разрыв с его системой, что в его глазах как раз самое
            страшное, поскольку непричастность человека к его социальной системе
            дает Инспектору достаточное основание позволять себе по отношению к
            нему все, что угодно, поскольку в данном случае человек в его глазах
            не имеет никакой социальной значимости.
          </UiText>

          <UiText color="accent">
            А к этой категории Инспектор считает себя вправе причислить и
            социального преступника, и изменившую ему жену, и сослуживца,
            халатно выполняющего свои обязанности, и, что немаловажно,
            представителя враждебного ему лагеря.
          </UiText>

          <UiText>
            Сам будучи прекрасным и любящим семьянином, Инспектор может быть
            беспощаден и жесток к семьям врагов своей системы. В этом случае его
            этика строится по принципу: «Око за око, зуб за зуб».
          </UiText>

          <UiText preset="large" color="role">
            В своих личных взаимоотношениях Инспектор, как всякий сенсорик,
            часто проявляет инициативу на самом начальном этапе их формирования.
          </UiText>

          <UiText>
            Но если не получает своевременной поддержки со стороны партнера,
            довольно быстро сталкивается с этическими проблемами, чего обычно не
            происходит в партнерстве с его дуалом Наставником.
          </UiText>

          <UiText>
            Этические установки Инспектора полностью разделяются только его
            дуалом, поскольку оба они сориентированы на одинаковые этические
            ценности и на одинаковые логические принципы. Вне этих этических
            установок Инспектору трудно найти близких себе по духу людей, трудно
            быть правильно понятым. При всем своем изначальном оптимизме и
            общительности Инспектор удаляется от общества каждый раз, когда не
            находит взаимопонимания и должной моральной поддержки.
          </UiText>

          <UiText>
            Именно поэтому представителям этого типа удобнее формировать свои
            личные отношения в рамках группы единомышленников, где все
            окружающие разделяют его взгляды и он может быть более уверен в
            преданности своих друзей.
          </UiText>

          <UiText>
            В аспекте этики самому Инспектору наиболее понятна область
            взаимоотношений деловых. Ему удобнее, и он часто это делает,
            переносить стереотип деловых отношений в сферу отношений сугубо
            личных.
          </UiText>

          <UiText>
            Это, как ему иногда кажется, — единственная возможность «навести
            порядок» в том, что воспринимается им как нечто изначально
            непонятное, и, по сути своей, нелогичное, поскольку базируется на
            таких субъективных понятиях, как чувства и эмоции.
          </UiText>

          <UiText preset="large" color="role">
            Инспектор обычно не понимает, какая может быть логика в том, что
            касается области эмоций и чувств.
          </UiText>

          <UiText>
            Мотивацию поступков он старается понять по наблюдаемым внешним
            эмоциональным проявлениям, умеет очень точно и образно их описать,
            или сценически обыграть, но понять ему это трудно.
          </UiText>

          <UiText>
            Инспектор считает, и совершенно справедливо, что средствами его
            интеллекта это вообще не поддается пониманию: ведь ему столько раз
            приходилось наблюдать отсутствие всякой логики в поступках
            окружающих его людей.
          </UiText>

          <UiText>
            В силу этого рассуждения, а также вследствие слабой интуиции
            Инспектору как раз и удобен принцип этической справедливости, как
            своего рода рациональный этический эталон. Всякое отступление от
            этого «эталона» Инспектор оценивает крайне негативно, причем во всех
            формах отношений, которые, по его мнению, складываются «не по
            правилам».
          </UiText>

          <UiText preset="large" color="role">
            В силу своей уязвимой этики и проблемной интуиции Инспектор чаще
            всего склонен предполагать в поступках людей именно худшие мотивы.
          </UiText>

          <UiText color="accent">
            «Он специально без спросу взял мой велосипед, чтобы его сломать!»
          </UiText>

          <UiText>
            Переубедить Инспектора бывает довольно трудно, иногда почти
            невозможно, поскольку этические категории логически не
            просчитываются, Инспектор не всегда считает для себя возможным их
            понять.
          </UiText>

          <UiText>
            Случается, что Инспектор иногда позволяет себе поверить в то, что,
            допустим, сейчас отношения складываются «по правилам», но он еще
            пока в них чего-то не понимает.
          </UiText>

          <UiText>
            Если Инспектор логически не убеждается в том, что отношения
            складываются «честно», он считает себя вправе им не верить.
          </UiText>

          <UiText>
            Поскольку убежден, что степень возложенной на него ответственности
            обязывает его быть бдительным. В силу своей слабой интуиции
            Инспектор боится быть доверчивым.
          </UiText>

          <UiText color="role">
            Считает доверчивость непозволительной для себя роскошью, за которую
            впоследствии ему придется слишком дорого расплачиваться. Поэтому он
            часто считает свою недоверчивость, подозрительность, оправданной и
            правомерной.
          </UiText>

          <UiText preset="large" color="role">
            Раз составив негативное мнение о человеке, Инспектор его обычно не
            меняет.
          </UiText>

          <UiText>
            Наставник — единственный из всех типов-«этиков», который полностью
            разделяет аналогичную этическую установку, так как сориентирован на
            партнера именно с таким, проблематичным в этико-интуитивном плане
            восприятием.
          </UiText>

          <UiText>
            И именно в том, чтобы сориентировать своего партнера и этически, и
            интуитивно в нужном направлении, Наставник и видит свое основное
            предназначение.
          </UiText>

          <UiText>
            Своевременно разоблачить потенциального злоумышленника и дать о нем
            всю необходимую информацию своему дуалу — именно для этого Наставник
            выстраивает свою интригу, именно поэтому может на основании
            малейшего своего предположения сфабриковать «убедительные» факты:
            ведь всегда «лучше перебдеть, чем недобдеть». Лишняя
            предосторожность никогда не помешает, а подозрения на пустом месте
            не бывает, как не бывает дыма без огня.
          </UiText>

          <UiText>
            Этими же целями определяется и социальная функция Наставника —
            наблюдение за правомерностью поведения в рамках этических отношений
            существующей социальной структуры.
          </UiText>

          <UiText>
            В общении с психологически несовместимым партнером Инспектор не
            получает интересующей его информации об этическом потенциале своего
            ближайшего окружения, поэтому часто без видимой причины и по любому
            поводу у него возникает желание испытать преданность и послушание
            своего партнера, а заодно и всех членов своей семьи, причем в этом
            он проявляет исключительную изобретательность.
          </UiText>

          <UiText>
            Этими же целями определяется и социальная функция Наставника —
            наблюдение за правомерностью поведения в рамках этических отношений
            существующей социальной структуры.
          </UiText>

          <UiText>
            Если, к примеру, у него возникает подозрение, что заданное поручение
            выполнено недостаточно добросовестно, он пошлет кого-нибудь другого
            (кому он больше доверяет), с тем чтобы это поручение перепроверить:
          </UiText>

          <UiText color="accent">
            «Отец послал меня в булочную за хлебом. Я пришел ни с чем — булочная
            была закрыта на обед. Он мне не поверил, послал сестру. Сестра
            вернулась с хлебом — булочную к тому времени уже открыли. Отец
            решил, что я ему соврал и здорово мне всыпал». Другой случай:
            представитель этого типа решил испытать свою жену на предмет
            супружеской верности и потому поручил своему приятелю активно за ней
            поухаживать, а потом доложить ему о результатах.
          </UiText>

          <UiText>
            Разумеется, в партнерстве с Наставником у Инспектора нет оснований
            для такого поведения — в преданности Наставника Инспектор обычно не
            сомневается.
          </UiText>

          <UiText>
            Как бы ни складывались личные отношения Инспектора, они, по его
            мнению, ни в коем случае не должны мешать отношениям деловым, так
            же, как и чувства не должны мешать рассудку.
          </UiText>

          <UiText>
            Поэтому очень нежелательно вынуждать Инспектора отказываться от
            своей карьеры в угоду семейным интересам — для него это непосильная
            жертва.
          </UiText>

          <UiText>
            Наставник, кстати сказать, никогда не поставит Инспектора перед
            таким выбором, поскольку и сам разделяет аналогичные убеждения.
          </UiText>

          <UiText color="role">
            Но если Инспектор все же соглашается пожертвовать своей карьерой,
            для него это тяжелейшая душевная травма и обида на всю жизнь,
            которая потом обязательно скажется на его личных взаимоотношениях.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">4 — Болевая функция.</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_ideas" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Мысль</UiText>
              <UiText preset="body">Интуиция возможностей</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Основательная конкретность логики Инспектора не оставляет ему
            особого простора для фантазии и свободного полета мысли.
          </UiText>

          <UiText>
            Это обстоятельство часто заставляет его сожалеть о том, что самые
            интересные решения и самые смелые идеи выдвигаются не им, а кем-то
            другим, а сам он до этого не додумался.
          </UiText>

          <UiText>
            Бывают моменты, когда Инспектор очень остро чувствует ограниченность
            своих интеллектуальных возможностей. У него возникает ощущение
            тупика, из которого выход только один — яркая и свежая идея, о
            которой, как ему кажется, он вот-вот догадается, но почему-то это
            все никак не происходит.
          </UiText>

          <UiText preset="large" color="role">
            Иногда его пугает мысль о слабости собственного интеллектуального
            потенциала, которая, наверняка, сейчас всем видна, пугает
            невозможность найти выход самому — ощущение собственной никчемности
            и полного провала.
          </UiText>

          <UiText color="role">
            Также очень неприятные ощущения испытывает Инспектор и тогда, когда
            своевременно не получает информацию по сверх-значимому для себя
            вопросу: о соотношении сил в системе и о своем собственном положении
            в ней на данный момент или в будущем.
          </UiText>

          <UiText>
            Инспектор болезненно переживает состояние неизвестности и
            неопределенности своего положения в любом плане: в плане работы,
            карьеры и в плане взаимоотношений с окружающими его людьми, — ему
            страшно остаться «не у дел» в сложившейся вокруг него системе
            отношений, страшно оказаться «выброшенным за борт».
          </UiText>

          <UiText color="role">
            Именно поэтому Инспектор так ценит стабильность в рамках любой
            системы отношений, так старается приспособиться к самым трудным и
            неудобным обстоятельствам: он готов работать со сверхнагрузками, в
            самых авральных условиях, за самый скудный паек, только бы не
            выпасть за рамки системы.
          </UiText>

          <UiText>
            Ему непонятно, например, как можно не дорожить местом работы или как
            можно не видеть преимуществ системы, обеспечивающей населению полную
            занятость.
          </UiText>

          <UiText color="accent">
            Возможно, поэтому первейшим наказанием в советской, максимовской,
            системе являлось сообщение о проступке по месту работы.
          </UiText>

          <UiText>
            Инспектор предпочитает пореже менять места работы: ведь, «прыгая с
            места на место», никогда приличной карьеры не сделаешь. Кроме того,
            ему сам по себе неприятен процесс поиска новой работы — неприятны
            конкурсы, собеседования, анкетирование и прочее; неприятно думать,
            что вместо него предпочтут кого-нибудь другого.
          </UiText>

          <UiText preset="large" color="role">
            Опять же пугает и неизвестность, связанная с неопределенностью
            условий работы на новом месте, пугает неопределенность
            взаимоотношений с новым коллективом и новым начальством.
          </UiText>

          <UiText color="role">
            Так же как Инспектор боится развала отношений на «вверенном ему
            участке», он боится и развала отношений в семье. Если распадаются
            добрачные отношения, которые он, кстати говоря, и сам воспринимает
            не всегда серьезно — это обидно, это стыдно, это больно, но это еще
            не беда; настоящая трагедия, когда разваливается семья.
          </UiText>

          <UiText>
            В момент разрыва именно Инспектор старается быть инициатором
            примирения. А когда воссоединение невозможно, в крайне конфликтных
            ситуациях, впадает в такое отчаяние, что может пойти на самые
            исключительные меры.
          </UiText>

          <UiText preset="large" color="role">
            Обычно предполагая худшую мотивацию в поступках людей, Инспектор
            очень не любит, когда кто-то по отношению к нему поступает нечестно,
            некрасиво, недостойно или попросту бестактно.
          </UiText>

          <UiText>
            Например, даже такой, казалось бы, пустяк: Инспектору очень
            неприятно, когда кто-либо без спроса берет его вещи.
          </UiText>

          <UiText color="accent">
            Ему ведь Бог знает, какие мысли в голову придут, пока он эту вещь
            ищет!
          </UiText>

          <UiText preset="large" color="role">
            Инспекторы также не симпатизируют и тем, кто не имеет привычки
            вовремя возвращать чужую вещь, — такой человек его всегда
            настораживает.
          </UiText>

          <UiText>
            Кстати сказать, Наставники не позволяют себе взять чужую вещь без
            спроса, разве что только намеренно, в порядке мести.
          </UiText>

          <UiText color="accent">
            К примеру: Наставник-ребенок решил «наказать» сестренку и утром,
            перед выходом в школу спрятал ее пионерский галстук; в результате
            она опоздала на урок и получила замечание — «наказание»,
            рассчитанное именно на пунктуального и педантичного Инспектора.
          </UiText>

          <UiText>
            Инспекторы стараются избегать общества людей, способных на
            непредсказуемые поступки, экстравагантные выходки, эксцентричные
            шутки, фамильярность, бестактные розыгрыши, словом, всех тех, кто
            способен причинять неудобства, создавать дополнительные проблемы,
            или просто поставить его в глупое и неприличное положение.
          </UiText>

          <UiText color="role">
            Инспекторы не симпатизируют людям, предпочитающим добиваться успеха
            легким путем, не любят пронырливых выскочек. Сами они не верят в
            легкий успех. Считают, что талант — это в первую очередь труд.
          </UiText>

          <UiText preset="large" color="role">
            Не любят, когда обсуждают их способности или возможности.
          </UiText>

          <UiText>
            Не любят, когда им ставят в пример чужую удачливость. Недолюбливают
            «везунчиков». Тему успеха и везучести в присутствии Инспектора
            вообще лучше не обсуждать, поскольку в этот момент он будет
            испытывать очень неприятные ощущения и воспринимать все сказанное
            исключительно как «камешки в свой огород».
          </UiText>

          <UiText>
            Успех в понимании Инспектора может быть только в труде и только
            заслуженный; все остальное, по его мнению, не более, чем авантюра
            или фальшивка, которая когда-нибудь обязательно раскроется.
          </UiText>

          <UiText>
            Сфабрикованных фальшивок, подтасованных фактов сами Инспекторы очень
            опасаются; боятся быть разоблаченными, и по этой же причине сами
            боятся обманывать, поскольку сориентированы на подозрительного и
            проницательного Наставника.
          </UiText>

          <UiText>
            Поэтому даже в самой неловкой ситуации Инспектору гораздо удобнее
            сослаться на какое-то общепринятое положение, на некую объективную
            информацию, за достоверность которой будет отвечать кто-нибудь
            другой, чем соврать и взять на себя всю ответственность за
            последствия.
          </UiText>

          <UiText>
            Инспектор предпочитает доверять тем фактам, которые ему
            предоставляются, но за их достоверность, по его мнению, должен
            отвечать тот, кто их предоставил. Если подтасовка фактов выгодна его
            системе и делается с одобрения его начальства, Инспектор может
            посчитать это для себя вполне допустимым — главное, что за
            достоверность фактов отвечает не он.
          </UiText>

          <UiText preset="large" color="role">
            Много неприятностей доставляет Инспектору его привычка высказываться
            предельно конкретно, постоянно поясняя свою мысль.
          </UiText>

          <UiText>
            Если в официальном докладе ему иногда удаëтся отделаться общими
            фразами, то в частной беседе он иногда выбалтывает слишком много
            лишнего. Но, к счастью, у него есть такой дуал, как Наставник,
            который один только и способен отучить Инспектора от этой опасной
            привычки.
          </UiText>

          <UiText>
            Обычно после таких «откровений» Наставник рисует Инспектору самые
            мрачные перспективы, самые страшные последствия его необдуманных
            слов. Причем такие предостережения, хотя они и не всегда бывают ему
            приятны, Инспектор воспринимает с благодарностью, поскольку
            понимает, что партнер это делает не из желания просто так напугать
            его, а именно из опасений за его жизнь, его судьбу, его положение в
            системе.
          </UiText>

          <UiText color="role">
            Инспекторы не считают себя доверчивыми людьми и очень удивляются
            тому, что несмотря на все старания быть дальновидными и
            предусмотрительными, они из всех возможных вариантов почему-то
            выбирают самый проигрышный.
          </UiText>

          <UiText>
            Почему-то даже при самом тщательном анализе своих и чужих ошибок
            умудряются «быстрее всех залезть в любой капкан». Иногда именно в
            «капкане» Инспектору видится выход из тупика — такую злую шутку
            играет с ним его «проблемная» интуиция.
          </UiText>

          <UiText>
            Именно поэтому Инспектор очень боится быть облапошенным, но часто,
            особенно в молодости, становится жертвой собственной
            неосмотрительности.
          </UiText>

          <UiText preset="large" color="role">
            Именно поэтому ему очень важно быть уверенным в верности, честности
            и преданности своего ближайшего окружения.
          </UiText>

          <UiText>
            Инспектору очень важно, чтобы рядом с ним был человек, которому бы
            он мог всецело доверять и на которого мог бы полагаться как на
            самого себя (а в экстремальных условиях, на которые сориентирована
            его социальная деятельность, это жизненно необходимо).
          </UiText>

          <UiText>
            Поэтому самой природой Инспектору предназначен такой партнер в лице
            его дуала Наставника.
          </UiText>

          <UiText>
            Именно Наставник, подсознательно сориентированный на интуитивную
            слепоту и этическую незащищенность Инспектора, постоянно проводит
            своего рода «чистку» как в своем ближайшем окружении, так и в
            окружении близких и дорогих ему людей.
          </UiText>

          <UiText>
            Никаких подозрительных личностей Наставник в своем ближайшем кругу
            не потерпит, а если такой появится в окружении его партнера, он
            будет немедленно разоблачен и изгнан.
          </UiText>

          <UiText>
            Достаточно малейшего повода, чтобы Наставник настоятельно потребовал
            разрыва отношений с подозрительным субъектом: Наставник будет
            интриговать, сплетничать, наушничать, лжесвидетельствовать, грозить,
            ставить ультиматум, но он сделает все от него зависящее, чтобы
            опасные для его друзей отношения были порваны незамедлительно и
            бесповоротно, то есть непоправимо испорчены.
          </UiText>

          <UiText color="accent">
            «Немедленно, вот сейчас же, при мне позвони ему и скажи, что ты не
            желаешь иметь с ним ничего общего! Иначе с тобой больше никто не
            будет иметь дело! Выбирай — либо он, либо мы!»
          </UiText>

          <UiText>
            Понятно, что именно с таким партнером Инспектор чувствует себя
            всесторонне защищенным: за него в этическом и интуитивном плане все
            решают, продумывают и просчитывают, а ему остается делать только то,
            что от него требуется.
          </UiText>

          <UiText>
            Только чувствуя такую защиту, Инспектор может позволить себе
            расслабиться, стать общительным, открытым и раскрепощенным в своих
            словах, поступках и отношениях, но, разумеется, его личные,
            доверительные отношения при этом будут ограничиваться только самым
            близким кругом, что, собственно, его как интроверта вполне
            устраивает.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">5 — Внушаемая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_emotions" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Желание</UiText>
              <UiText preset="body">Этика эмоций</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Очень любит Инспектор жить эмоционально ярко и насыщенно. Ему
            нравятся люди с беспокойной и мятежной душой, способные задать яркие
            эмоциональные ощущения, наполнить жизнь сильными, но приятными
            переживаниями.
          </UiText>

          <UiText>
            Без этих ощущений Инспектор довольно быстро скисает, становится
            чопорным и скучным. Иногда чувствует себя больным, вялым, лишенным
            тонуса; начинает хандрить, впадает в ипохондрию, мизантропию.
          </UiText>

          <UiText>
            Зато под гамлетовским эмоциональным воздействием Инспектор чувствует
            себя великолепно — расцветает как цветок, омытый дождем. Начинает
            буквально искриться эмоциями.
          </UiText>

          <UiText>
            Общение с дуализированным Инспектором может доставить редкое
            удовольствие — интереснейший собеседник, обаятельный, остроумный, а
            какой талантливый: и поет, и пародирует, и стихи экспромтом сочиняет
            — сказка!
          </UiText>

          <UiText color="accent">
            Дуализированные представители этого типа уже давно завоевали общие
            симпатии, став популярнейшими киноактерами, ведущими популярных и
            развлекательных телепередач, капитанами сильнейших команд КВН.
          </UiText>

          <UiText preset="large" color="role">
            Инспектору очень важно, чтобы жизнь его была наполнена яркими
            эмоциональными событиями. Он быстро заряжается общим эмоциональным
            подъемом, особенно, если это сильные и искренние эмоции.
          </UiText>

          <UiText>
            Ему нравится ощущение массового праздника, где он себя чувствует
            частью общего торжества. Инспекторам нравятся праздники с яркими
            зрелищными ритуалами.
          </UiText>

          <UiText color="role">
            Они любят пышно оформленные торжественные церемонии: открытие
            фестивалей, олимпиад, торжества по случаю принятия присяги.
          </UiText>

          <UiText>
            Последнее — особенно священно и трепетно в этой диаде: союз
            Инспектором и Наставника — союз силы и идеологии. Ритуал клятвы,
            даже для детей в такой семье обставляется очень торжественно, как
            праздник преданности и верности — качеств, которые и Инспектор и
            Наставник особенно ценят.
          </UiText>

          <UiText>
            Инспектор часто испытывает потребность в смене настроений. Возможно
            поэтому, особенно в отсутствие Наставника, старается сам задавать
            эмоциональный тон в своей компании.
          </UiText>

          <UiText preset="large" color="role">
            Иногда, в разгар праздника, у недуализированного Инспектора может
            вдруг возникнуть потребность острых грустных ощущений.
          </UiText>

          <UiText color="accent">
            Хорошо, если при этом он сам споет или сыграет что-нибудь грустное,
            а то ведь, достоверный случай, может и поставить гостям пластинку с
            похоронным маршем Шопена. Похожую выходку можно ожидать и от
            Наставника, но Инспектор это скорее всего сделает неосознанно —
            просто ему вдруг захотелось взгрустнуть.
          </UiText>

          <UiText>
            Подсознательная потребность в смене настроений, в острых
            эмоциональных ощущениях, а также постоянная потребность увидеть
            чувства партнера именно в той форме, в которой он только и способен
            их разглядеть, делает иногда Инспектора неосознанным инициатором
            семейных скандалов. В том случае, разумеется, если он не живет в
            дуальной паре, где ему обычно не дают скучать.
          </UiText>

          <UiText>
            Очень важно понимать это его свойство, и, как бы ни был вам дорог
            внешний мир и покой в семье, а может быть, именно ради него,
            желательно удовлетворить потребность любимого супруга в острых
            эмоциональных ощущениях, причем именно теми средствами, которые он
            сам так очевидно подсказывает, провоцируя на скандал.
          </UiText>

          <UiText>
            Полезно вспомнить, что Инспектор очень уважает силу — одну из
            основных ценностей его социотипа. Уважает умение дать отпор его
            иногда намеренно жестоким или неразумным требованиям, которыми он
            специально испытывает своего партнера, чтобы проверить его систему
            взглядов и быть уверенным, что партнер его действительно достоин.
            Этим, возможно, объясняется задиристость и драчливость Инспекторов
            еще в раннем детстве: не только стремлением навязать свою систему
            отношений, но и своеобразным способом поиска дуала, поскольку тем же
            недостатком грешат и маленькие Наставники.
          </UiText>

          <UiText color="role">
            Искренность выражения чувств — одна из важнейших ценностей этой
            диады. Поэтому настоящие чувства Инспектор себе представляет именно
            в интерпретации Наставника.
          </UiText>

          <UiText>
            Настоящие чувства, по мнению членов этой диады, должны пройти
            испытание болью и страданием, что еще больше их облагораживает,
            делает сильными, по-настоящему красивыми и жизнестойкими.
          </UiText>

          <UiText>
            Причем таким испытаниям должны подвергаться не одна только любовь,
            но и дружба, и верность долгу, и патриотизм.
          </UiText>

          <UiText>
            Инспектора с его чуткой и критичной наблюдательностью убеждают
            именно эмоции Наставника — искренние, тонкие. Их трогательность, их
            грусть очень его располагают, дают пищу его интеллекту; через них он
            получает наиболее точную этическую ориентацию.
          </UiText>

          <UiText>
            Никакой другой партнер, кроме Наставника, не способен убедить
            Инспектора в искренности и глубине своих переживаний. Наставник —
            единственный, кому Инспектор доверяет полностью.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">
            6 — Активационная функция
          </UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_time" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чутьё</UiText>
              <UiText preset="body">Интуиция времени</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Инспектора, как и всех рациональных сенсориков, отличает
            перенасыщенность делами текущего момента времени. Словосочетание
            «текущий момент» — само по себе уже термин Инспектора.
          </UiText>

          <UiText color="role">
            Постоянно наблюдает и анализирует «текущий момент» — вычерчивает
            графики, составляет доклады, проводит совещания о положении дел «на
            текущий момент».
          </UiText>

          <UiText>
            Сверхзначимость «текущего момента» держит его в постоянном
            напряжении, в постоянной готовности отдать все свои силы во имя
            важности «текущего момента».
          </UiText>

          <UiText preset="large" color="role">
            Создается впечатление, что в жизни Инспектора нет никаких других
            временных категорий, кроме «текущего момента» — и это на самом деле
            так.
          </UiText>

          <UiText>
            Формально у него есть еще абстрактное понятие далекого «светлого
            будущего», в которое, если он находится в рамках системы, он смотрит
            относительно уверенно, но о котором, на самом деле, думает не
            больше, чем о загробной жизни.
          </UiText>

          <UiText>
            Есть недалекое прошлое, которое еще совсем недавно было «текущим
            моментом» и от сегодняшнего «текущего момента» оно отличается только
            статистическими показателями.
          </UiText>

          <UiText>
            И есть еще понятие далекого прошлого, о котором он знает понаслышке
            и даже готов этому верить, но сам судить не может, потому что это
            понятие означает все, что было до его рождения; а с момента рождения
            для него опять же есть только «текущий момент».
          </UiText>

          <UiText preset="large" color="role">
            Время Инспектора принадлежит его работе в системе, поэтому его
            временные категории напрямую связаны с «временными показателями»
            этой системы.
          </UiText>

          <UiText>
            Его собственные временные ориентиры подменяются ориентирами системы,
            в которой он работает: конец квартала — начало квартала, время
            летних отпусков, начало смены, рабочее время…
          </UiText>

          <UiText color="role">
            «Время рабочего дня» принадлежит не ему, а его делам и обязанностям;
            он считает, что рабочий день всегда есть чем заполнить, и не
            позволит ни себе, ни подчиненным уйти с работы раньше назначенного
            часа — мало ли, вдруг чьи-либо услуги еще понадобятся.
          </UiText>

          <UiText>
            Инспектор умеет и любит устраивать проверки своим подчиненным: когда
            они заступили на работу, когда ушли. Если его работники слишком
            быстро выполняют норму, он может организовать комиссию для проверки,
            сделать хронометраж, изменить план, снизить расценки.
          </UiText>

          <UiText>
            Будучи хронически неспособным к ожиданию в рамках своей частной
            жизни, в рамках рабочего времени Инспектор готов ждать столько,
            сколько потребуется: ему некуда спешить, он уже на работе.
          </UiText>

          <UiText>
            Временные отношения Инспектора в рамках системы определяются его
            положением в ней. Он не будет торопить начальство с принятием
            решения, но он заставит подчиненных реализовать это решение в
            «сжатые сроки», разумеется, требуя высокого качества выполняемой
            работы, хотя именно оно при этом и пострадает.
          </UiText>

          <UiText color="role">
            Инспектор по-своему игнорирует фактор времени — он его подменяет
            фактором «энтузиазма трудящихся масс».
          </UiText>

          <UiText>
            Инспектор и сам подключается к тому ритму, который ему задает
            производство. Наиболее продуктивно работает именно в сжатые сроки,
            что делает его незаменимым в авральных ситуациях.
          </UiText>

          <UiText>
            Для Инспектора важно указание сроков выполнения работы. Если,
            например, существует инструкция, согласно которой он обязан ответить
            на запрос в двухнедельный срок, это будет выполнено, но если у него
            нет контролируемых сроков выполнения, тогда происходит то, что
            называется «бюрократический беспредел».
          </UiText>

          <UiText>
            Время Инспектора статично, оно для него не меняется и оно его не
            изменяет. Как бы ни видоизменялись исторические эпохи, пока в них
            существуют системы администрирования, Инспектор будет жить и
            работать в рамках этих систем.
          </UiText>

          <UiText>
            А когда эпоха главенствующих иерархий проходит и Инспектор выпадает
            из системы, он живет вне времени: он не видит себя в будущем и
            тоскует по прошлому…
          </UiText>

          <UiText>
            В этом случае он реанимирует остатки развалившихся систем,
            восстанавливает их структурные связи и работает в рамках этих
            связей, как бы хрупки они ни были, пока его дуал Наставник не
            наполнит их новой, соответствующей духу времени идеей.
          </UiText>

          <UiText color="role">
            И вот тогда уже Инспектор будет с полной отдачей укреплять и
            совершенствовать эту систему, чтобы не только внедрить ее в
            общество, но и сделать преобладающей в нем.
          </UiText>

          <UiText color="role">
            Глобальные временные ориентиры Инспектор видит с «подачи» своего
            дуала Наставника.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">7 — Функция защиты</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_business" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Практика</UiText>
              <UiText preset="body">Деловая логика</UiText>
            </span>
          </div>

          <UiText>
            Аспект деловой логики Инспектора можно рассмотреть в двух планах:
            относительно его положения в общественной системе и относительно его
            положения вне ее, в сфере частной инициативы.
          </UiText>

          <UiText preset="large" color="role">
            Работа в общественной системе для Инспектора, безусловно,
            предпочтительнее.
          </UiText>

          <UiText color="role">
            И именно в этом направлении он старается приложить максимум усилий,
            в то время как в условиях частной инициативы ему работать очень
            трудно: и не только потому, что от природы он наделен слабой
            интуицией возможностей, но и потому, что частная инициатива
            противоречит его логической программе, ставит его вне системы
            вообще.
          </UiText>

          <UiText>
            Инициатива вне системы антиобщественна, это — криминальная
            инициатива. Что и происходит, когда Инспектор выпадает из
            главенствующей социальной системы. Противопоставляя себя обществу,
            он автоматически образует «антисистему».
          </UiText>

          <UiText>
            Поэтому в социальном плане деловая активность Инспектора направлена
            на совершенствование его замкнутой и статичной системы и заключается
            в мучительном поиске решения постоянно актуальной проблемы — как
            сделать эту систему самодостаточной.
          </UiText>

          <UiText>
            Ее решение Инспектор видит в разумном, справедливом и социально
            оправданном распределении материальных благ по всем уровням
            системной иерархии. С тем чтобы укреплять те уровни, которые
            контролируют и руководят распределением, и стимулировать те, которые
            эти блага производят.
          </UiText>

          <UiText>
            В этом вопросе Инспектор — виртуоз непревзойденнейший. Чего стоит
            только один такой трюк, как искусственное создание товарного
            дефицита! Куда ты денешься от системы и как обойдешься без пайка,
            если «пиво — только для членов профсоюза»?
          </UiText>

          <UiText>
            С возрастом Лирик становится избирательнее в выборе окружения. Сразу
            оценивает потенциальные возможности каждого, стараясь избегать
            обременительных в будущем отношений, чтобы не пришлось тратить время
            на ненужное общение.
          </UiText>

          <UiText preset="large" color="role">
            Инспектор умеет не только творчески «загнать» в систему, он умеет
            заставить в ней работать.
          </UiText>

          <UiText color="accent">
            Грош цена была бы всей его волевой сенсорике, а заодно и всей его
            конструктивно-инструктивной логике, если бы он этого не умел!
          </UiText>

          <UiText>
            Все «методы экономического стимулирования» и «материального
            поощрения», все эти «доски почета» и «окна сатиры», все эти «слеты»
            и «съезды» со «спецбуфетом» — весь этот праздник трудового
            энтузиазма, почет «передовикам производства» и «рационализаторам» —
            все это не более, чем способы максимального использования внутренних
            резервов в условиях закрытой иерархической социальной системы,
            методом перераспределения материальных благ.
          </UiText>

          <UiText color="accent">
            Кстати, только проблемной интуицией, не способной увидеть дальше
            «текущего момента», можно объяснить внедрение «рацпредложений»,
            дающих сомнительную сию-минутную выгоду, но оборачивающихся
            экологическими катастрофами.
          </UiText>

          <UiText color="accent">
            Спрашивается, а где же внедрение прогрессивных технологий, где
            поощрение частного предпринимательства?
          </UiText>

          <UiText>
            В таковых социальных условиях деловая логика попадает в область
            вытесненных ценностей, представляется, как сфера личных интересов,
            противопоставленных интересам общества, и потому вредных и опасных
            для него.
          </UiText>

          <UiText color="role">
            Социальная роль деловой логики Инспектора выражается в разработке и
            внедрении систем экономического стимулирования и осуществлении
            контроля за распределением материальных благ.
          </UiText>

          <UiText preset="large" color="role">
            К вопросам контроля Инспектор относится с особым уважением и считает
            должным и нужным применение методов контроля и к нему самому.
          </UiText>

          <UiText color="role">
            Там, где контроль не осуществляется достаточно основательно,
            Инспектор склонен перераспределять материальные блага с учетом своих
            личных, первоочередных интересов, справедливо считая: если
            начальство так халатно осуществляет контроль, значит, ему эти
            «блага» не так уж нужны, следовательно, нет большой беды, если оно
            чего-нибудь из этих благ недополучит.
          </UiText>

          <UiText>
            Во всяком случае, имея дело с Инспектором, нелишне помнить, что
            система строгого учета и контроля его никак не обидит.
          </UiText>

          <UiText color="role">
            В быту представители этого типа довольно практичны, умеют
            распределять и контролировать семейный бюджет, но не всегда
            дальновидны — за мелкой, сиюминутной выгодой не видят возможные
            большие потери в будущем.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">8 — Фоновая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_comfort" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Комфорт</UiText>
              <UiText preset="body">Сенсорика ощущений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Произведение, созданное Инспектором, всегда наглядно демонстрирует и
            сильные, и слабые стороны его социотипа.
          </UiText>

          <UiText>
            Логически продуманное, высокопрофессионально выполненное,
            основательно проработанное в деталях, оно еще непременно должно быть
            ярко идеологически или социально сориентированно.
          </UiText>

          <UiText>
            Последнее обстоятельство особенно важно для Инспектора, которому
            трудно творить лично для себя, но легко для того, кто заказывает ему
            эту работу.
          </UiText>

          <UiText>
            Похожее качество, присущее и демонстративной сенсорике Хранителя,
            объясняется тем, что фоновая функция активнее работает не столько
            для самого индивида, сколько для поддержки наиболезнейшей функции
            его дуала.
          </UiText>

          <UiText>
            Инспектор может безуспешно размышлять над эмблемой собственной
            визитной карточки, но быстро и легко сделает это для заказчика по
            заданной ему теме.
          </UiText>

          <UiText>
            Инспектору легче оформить выставочный павильон или праздничную
            площадь, поскольку там есть конкретная тема и символы, чем
            разработать типовой проект жилого дома, где нет ни символики, ни
            тематики, а есть только заданный параллелепипед, с которым трудно
            придумать что-либо интересное, — проявление слабой интуиции
            возможностей.
          </UiText>

          <UiText color="accent">
            Архитектура павильонов ВДНХ — типичный образец дизайна Инспектора.
          </UiText>

          <UiText>
            Эстетика Инспектора формируется под влиянием сенсорики Дипломата, но
            направлена на «обслуживание» слабой и уязвимой сенсорики Гамлета.
          </UiText>

          <UiText>
            От Дипломата — ее праздничная изысканность, от Наставника —
            идеологическая наполненность и театральная декоративность —
            достаточно вспомнить декоративные гирлянды из овощей-фруктов,
            пшеничных колосьев и лент времен «сталинского ампира»; от себя
            Инспектор добавляет «эстетику силы и порядка» — строгую
            симметричность и монументальность форм.
          </UiText>

          <UiText>
            Эстетика Инспектора — это «социальное явление», это эстетика его
            системы, его эпохи. Которая, как уже говорилось, имеет способность
            «законсервироваться» в ожидании своего часа, что проявляется в
            своеобразном «ретро»—стиле Инспектора, ностальгирующем по эпохам
            тоталитарных систем.
          </UiText>

          <UiText preset="large" color="role">
            Инспектор — «художественный оформитель» своей эпохи и своей системы
            — в этом и заключается социальная роль демонстративной функции его
            интеллекта.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
