<template>
  <div class="text g-page">
    <section>
      <UiText preset="subtitle" color="accent">Сильные стороны</UiText>

      <UiText preset="large" color="role">
        Хорошо разбирается во взаимоотношениях между людьми.
      </UiText>

      <UiText>
        Стремится к самоусовершенствованию, проявляет интерес к
        морально-философским проблемам.
      </UiText>

      <UiText>
        Может оценить способности людей. Проявляет понимание, терпимость. Может
        идти на компромиссы ради мира и согласия.
      </UiText>

      <UiText preset="large" color="role">
        Отзывчив и внимателен. Принимает людей такими, какие они есть: прощает
        им их слабости и не пытается переделать насильно. Очень устойчив в своих
        привязанностях.
      </UiText>

      <UiText>
        С пониманием относится к проявлению бурных эмоций другого человека.
        Старается его успокоить, дать дельный совет.
      </UiText>

      <UiText>
        Если это не помогает, умеет терпеливо ждать, пока тот не успокоится сам.
        Любит во всем тщательность и основательность.
      </UiText>

      <UiText>Кропотлив в труде.</UiText>

      <UiText>
        Исполнителен, добросовестен и пунктуален. Старается вести здоровый образ
        жизни, избегает вредных привычек. Стремится во всем придерживаться
        принципов гуманизма и справедливости.
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">Проблемы</UiText>

      <UiText>
        Впечатлителен и раним. Тяжело переживает конфликты и недоразумения,
        стрессонеустойчив. Очень щепетилен, не любит обременять собой других.
      </UiText>

      <UiText>
        Вместе с тем плохо переносит одиночество, нуждается во внимании близких
        людей.
      </UiText>

      <UiText>
        Увязая в деталях дела, часто переутомляет себя. Ему с трудом дается
        оценка качества своей работы и затраченного на нее времени.
      </UiText>

      <UiText>
        Доверчив и искренен, о чем приходится порой сожалеть, так как его
        добротой злоупотребляют.
      </UiText>

      <UiText preset="large" color="role">
        Довольно самодостаточен, малоинициативен и инертен в своем поведении. Не
        вникает в то, что не касается круга его интересов.
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Нельзя требовать и ожидать
      </UiText>

      <UiList iconName="chevron-right" iconColor="accent" iconSize="16">
        <UiListItem>Предприимчивости и инициативности в делах.</UiListItem>

        <UiListItem>
          Решительного поведения в экстремальной ситуации.
        </UiListItem>

        <UiListItem>Высокой степени мобилизованности.</UiListItem>

        <UiListItem>
          Быстрого и качественного выполнения рутинной работы, которая ему
          неинтересна.
        </UiListItem>

        <UiListItem>Организаторских способностей.</UiListItem>
      </UiList>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Подходящие виды деятельности
      </UiText>

      <UiText>
        Лучше всего Гуманист реализует себя в области психотерапии, в
        воспитательной работе «кружкового» характера с подростками.
      </UiText>

      <UiText>
        Успешно применяет свои способности в философско-гуманитарных сферах, а
        также в портретной и сюжетной фотографии
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
