<template>
  <div class="text g-page">
    <section>
      <UiText preset="subtitle" color="accent">Сильные стороны</UiText>

      <UiText preset="large" color="role">
        Активный, оптимистичный, доброжелательный человек. Внимателен к людям,
        заботлив. Стремится помочь всем, кто просит об этом.
      </UiText>

      <UiText>
        Хорошо чувствует эмоциональное состояние других людей. Легко заводит
        новые знакомства личного и делового характера.
      </UiText>

      <UiText>
        Противник пустой траты времени, всегда занят неотложными делами.
        Восприимчив к перспективным идеям, которые можно применять на практике.
      </UiText>

      <UiText preset="large" color="role">
        Обаятельный, располагающий к себе собеседник. Обладает хорошим вкусом.
        Многое умеет делать своими руками.
      </UiText>

      <UiText>
        В жизни всего добивается сам, не надеясь на других. Любит все делать
        быстро, но без свидетелей.
      </UiText>

      <UiText>
        Настойчив и решителен в действиях, особенно в экстремальной ситуации,
        когда против него направлена агрессия или ощущается острый недостаток
        времени. К советам других прислушивается, но поступает по-своему.
      </UiText>

      <UiText>
        С успехом занимается любой практической деятельностью, но любит, чтобы
        его усилия и находчивость ценили. Стремится к стабильности, высокому
        материальному уровню жизни, уважению коллег по работе.
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">Проблемы</UiText>

      <UiText>
        Накапливает отрицательные эмоции, которые способен некоторое время
        сдерживать. Но если их слишком много — выходит из себя, переживает,
        может даже заболеть.
      </UiText>

      <UiText>
        Не может действовать без эмоционального контакта с собеседником, поэтому
        ему трудно взаимодействовать с людьми, которые никак не проявляют своего
        отношения к происходящему.
      </UiText>

      <UiText>
        Неэкономен, не всегда оценивает выгодность и полезность того, что
        делает. Долго колеблется перед принятием важного решения по сложному
        вопросу.
      </UiText>

      <UiText>
        Плохо рассчитывает время, с трудом отделяет главное от второстепенного,
        перегружая себя делами.
      </UiText>

      <UiText preset="large" color="role">
        Переоценивает свои деловые способности. Не умеет ждать, ему хочется
        сделать как можно больше дел и как можно скорее.
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Нельзя требовать и ожидать
      </UiText>

      <UiList iconName="chevron-right" iconColor="accent" iconSize="16">
        <UiListItem>
          Безэмоционального, всегда разумного и объективного отношения к делу, к
          людям.
        </UiListItem>

        <UiListItem>
          Гибкости в поведении и быстрой адаптации к ситуации.
        </UiListItem>

        <UiListItem>Безвозмездного альтруизма.</UiListItem>

        <UiListItem>
          Жесткости и бескомпромиссности в отношениях с людьми.
        </UiListItem>

        <UiListItem>
          Хороших стратегических и технологических способностей.
        </UiListItem>

        <UiListItem>Пунктуальности в соблюдении сроков.</UiListItem>
      </UiList>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Подходящие виды деятельности
      </UiText>

      <UiText>
        Ему хорошо удаëтся налаживание инфраструктуры социума, реклама,
        социологические опросы.
      </UiText>

      <UiText>
        Успешно работает в области медицины, здравоохранения. Может проявить
        себя в сфере дизайна, оформительской работы, а также в сфере
        обслуживания, торговли.
      </UiText>

      <UiText>
        Благоприятна организаторская деятельность в социальной и научной сферах
        — организация ярмарок, симпозиумов, отдыха, праздничных мероприятий.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
