<template>
  <div class="text g-page">
    <section>
      <UiText preset="subtitle" color="accent">Сильные стороны</UiText>

      <UiText preset="large" color="role">
        Обладает хорошим вкусом, чувством меры. Может хорошо оценить качество
        любого продукта, в деталях объяснить, чем оно устраивает либо не
        устраивает его.
      </UiText>

      <UiText>
        Заботлив и внимателен к людям, очень считается с их удобствами.
        Дипломатичен, хорошо умеет уговорить кого-либо на нужное или выгодное
        дело. Может отлично наладить комфорт в близком окружении. Умеет
        отдыхать, ценит удовольствия и житейские радости.
      </UiText>

      <UiText>
        Если дело ему нравится и будет хорошо оплачено, делает его качественно,
        со вкусом и душой. Старается при любых обстоятельствах не терять чувство
        меры. Многое умеет делать своими руками
      </UiText>

      <UiText preset="large" color="role">
        Хорошо чувствует состояние других людей, способен мягко пристраиваться к
        собеседнику. Со всеми очень приветлив, внимателен и участлив. Стремится
        к хорошему материальному уровню жизни.
      </UiText>

      <UiText>
        Обычно никому не навязывает свою волю, не критикует сам и не любит,
        когда при нем критикуют других людей. В коллективе занимает позицию
        золотой середины.
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">Проблемы</UiText>

      <UiText>
        Ему с трудом дается напряженная деловая активность, трудно долгое время
        быть подвижным, динамичным. Бывает расслаблен и несобран. Скрытен и
        раним. Может проявлять явное недовольство, если его покой нарушают. В
        такие минуты может возмутиться, резко ответить.
      </UiText>

      <UiText>
        Если задача слишком сложна для него или слишком трудоемка, он склонен её
        откладывать.
      </UiText>

      <UiText>
        Не видит смысла в пустой суете и напрасной трате сил. Не любит
        преувеличений, нуждается в фактах и доказательствах.
      </UiText>

      <UiText>
        Старается избегать начальства, уклоняется от скучных, сугубо деловых
        разговоров. Ему трудно проявлять волю и настойчивость, отстаивать
        интересы дела.
      </UiText>

      <UiText preset="large" color="role">
        Плохое самочувствие сильно снижает его работоспособность. Часто делает
        вид, что многое может сделать, хотя это и не всегда возможно.
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Нельзя требовать и ожидать
      </UiText>

      <UiList iconName="chevron-right" iconColor="accent" iconSize="16">
        <UiListItem>Постоянно высокой деловой активности.</UiListItem>

        <UiListItem>Последовательности и организованности в делах.</UiListItem>

        <UiListItem>Бескомпромиссного отстаивания интересов дела.</UiListItem>

        <UiListItem>
          Умения руководить большим коллективом, распределять обязанности.
        </UiListItem>

        <UiListItem>Участия в рискованных атакующих операциях.</UiListItem>
      </UiList>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Подходящие виды деятельности
      </UiText>

      <UiText>
        Лучше всего реализует себя в социальной сфере. Может хорошо налаживать и
        поддерживать коммерческие контакты, успешно работает там, где нужно
        обслуживать конкретного, отдельно взятого человека.
      </UiText>

      <UiText>
        Дипломат — это специалист по налаживанию и поддержанию инфраструктуры
        социума. Поэтому он — лучший снабженец, торговец мелким оптом,
        коммерческий директор небольшой фирмы, дипломат-менеджер.
      </UiText>

      <UiText>
        Неплохо работают в области рекламы и издательства, медицине, сфере
        услуг. Из них получаются неплохие оценщики качества, дизайнеры,
        организаторы отдыха.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
