<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Необходим порядок в жизни. Ему нравится, когда его близкие могут разложит по полочкам любую ситуацию.
  </UiText>

  <UiText class="description">
    Нравится заниматься работой, в которой необходимо быть сосредоточенным.
  </UiText>

  <UiText class="description">
    В целом, стоит жить по плану или по схеме, ему так будет гораздо проще, чем в мире хаоса и беспорядка.
  </UiText>

  <UiText class="description">
    Любит упорядочивать предметы в своем доме, складывать книжки в одну полку, а тетрадки – в другую, наводить порядок, превращая кучи вещей в строгую систему.
  </UiText>

  <br />
  
  <hr />

  <UiText class="description">
    Слаб в точных расчетах, систематизации, объективном анализе действительности.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Своего чувства взаимосвязи явлений и событий у него изначально нет: здесь необходимо программирование извне.
  </UiText>

  <UiText class="description">
    В отличие от Энтузиаста, ему недостаточно абстрактных тезисов; ему нужны точные данные, жестко «привязанные» к объектам окружающей среды.
  </UiText>

</template>

<style lang="scss" scoped></style>
