<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Очень любит слушать о том, как кто к кому относится.
  </UiText>

  <UiText class="description">
    Его интересует тема взаимодействия людей, ему важно знать, любят его или нет, при этом сам он с трудом понимает истинное отношение других людей.
  </UiText>

  <UiText class="description">
    Очень любит душевные посиделки в тесной компании, ему не хватает стабильности в отношениях с людьми, часто он слишком доверяет малознакомым личностям.
  </UiText>

  <UiText class="description">
    Нужен человек, который сможет объяснить ему, как стоит себя вести, а как нет, с кем общаться, а с кем нет — и с этой ролью прекрасно справляется его дуал — Хранитель.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Трудно самому разобраться в хитросплетениях межличностных отношений — он делит их только на «хорошие» и «плохие».
  </UiText>

  <UiText class="description">
    Естественно, он не заботится о «выстраиванию» связей и общается, не задумываясь о последствиях, перекладывая такого рода размышления на партнера.
  </UiText>

</template>

<style lang="scss" scoped></style>
