<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    В области ощущения своего тела и его потребностей может быть очень неуверенным.
  </UiText>

  <UiText class="description">
    Этот человек нуждается в помощи, он хочет учиться понимать своё тело: в этом ему отлично поможет его дуал, у которого сенсорика ощущений — базовая функция, он в ней эксперт.
  </UiText>

  <UiText class="description">
    Чтобы чувствовать себя отлично, нужен некий комфорт, которым он сам себя обеспечить не может.
  </UiText>

  <UiText class="description">
    Ему приятно, когда он приходит с работы, а его ждет вкусный ужин и тëплая постель.
  </UiText>

  <br />
  
  <hr />

  <UiText class="description">
    Нуждается в информации о том, как доставлять себе и другим приятные ощущения, грамотно расслабляться и наслаждаться жизнью.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Во всем, что касается уюта, комфорта и обеспечения хорошего самочувствия, наивен и доверчив.
  </UiText>

  <UiText class="description">
    В то же время — любитель неожиданностей и экспериментов, будь то лечение, питание, одежда, косметика или секс.
  </UiText>

</template>

<style lang="scss" scoped></style>
