<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Очень любят, когда в голове и дома порядок. Лучше всего, если во всей жизни царит порядок.
  </UiText>

  <UiText class="description">
    Если нужно осознать сложную информацию, ему нужно её преподнести в виде структуры, системы или наглядной таблицы, что отлично умеет делать его дуал Аналитик.
  </UiText>

  <UiText class="description">
    Когда выполняет задания начальства, то часто переживает, что сделал что-то не так, как положено.
  </UiText>

  <UiText class="description">
    Любит слушать людей, которые могут разложить по полочкам и проанализировать любую ситуацию.
  </UiText>

  <UiText class="description">
    Представителям этого типа интересна соционика, поскольку эта наука позволяет разложить по полочкам отношения и характеры.
  </UiText>

  <br />
  
  <hr />

  <UiText class="description">
    Ему интересна любая сколько-нибудь стройная, логичная система.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Нуждается в научно-технической информации со стороны, в рассказах об устройстве внешнего мира.
  </UiText>

  <UiText class="description">
    Результаты научных исследований, выраженные системно и однозначно, обычно производят на него глубокое впечатление.
  </UiText>

</template>

<style lang="scss" scoped></style>
