<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Очень хочет разбираться в отношениях между людьми, понимать, как к кому кто относится.
  </UiText>

  <UiText class="description">
    В вопросах отношений ему нужен проводник, которым с легкостью может стать его дуал Гуманист.
  </UiText>

  <UiText class="description">
    Очень тяжело работать в коллективе, где отношения не налажены.
  </UiText>

  <UiText class="description">
    Нуждается в искренних отношениях с людьми, ему необходимо доверять своим друзьям и близким.
  </UiText>

  <UiText class="description">
    Если человек относится хорошо, то тот обязательно оценит это и постарается отблагодарить.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Ему трудно самостоятельно формировать или видоизменять этические нормы.
  </UiText>

  <UiText class="description">
    Ему необходимо, чтобы информация об отношениях между людьми, о том, что «морально», а что «некрасиво» была представлена ему в законченном виде.
  </UiText>

  <UiText class="description">
    Хочет конкретно знать, как необходимо общаться с тем или иным человеком в любой ситуации.
  </UiText>

  <UiText class="description">
    Получив от партнера такой этический «кодекс» в готовом виде, он без изменений использует его в повседневном общении, а если ошибается, то возлагает ответственность на автора нравоучений.
  </UiText>

</template>

<style lang="scss" scoped></style>
