<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Имеет высокую работоспособность, он хочет быть эффективным и полезным членом общества.
  </UiText>

  <UiText class="description">
    Когда вокруг все работают, он тоже старается занять себя чем-то полезным.
  </UiText>

  <UiText class="description">
    Доставляет радость комфортный и слаженный труд, когда он видит, что приносит пользу коллективу.
  </UiText>

  <UiText class="description">
    Часто задерживается на работе, поскольку не понимает, когда пора закончить и отложить дела на следующий день.
  </UiText>

  <UiText class="description">
    Ему нужен человек, который объяснит, как эффективно работать, при этом отдыхая без угрызений совести.
  </UiText>

  <UiText class="description">
    Таким человеком является его дуал Администратор.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Ему трудно самому выстроить технологию каких-либо практических действий, он ждет готовых рецептов со стороны и без рассуждения им следует.
  </UiText>

  <UiText class="description">
    Инструкции должны быть подробными, детально проработанными и рассчитанными на любую сколько-нибудь вероятную ситуацию.
  </UiText>

  <UiText class="description">
    Рабочая активность для  самоценна, он готов очень много и интенсивно трудиться, но если технологию выполнить не удается, он склонен подсознательно обвинять в этом других, которые «не помогли, не подсказали, не поддержали».
  </UiText>

</template>

<style lang="scss" scoped></style>
