<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Не всегда понимает, какие эмоции он испытывает.
  </UiText>

  <UiText class="description">
    Ему нравятся эмоциональные, открытые люди, от которых он может подзарядиться настроением. К таким людям относится его дуал — Наставник.
  </UiText>

  <UiText class="description">
    Очень плохо воспринимает эмоциональные обвинения — крики, истерики, может отреагировать на них слишком резко.
  </UiText>

  <UiText class="description">
    В глубине души очень чувствительный человек, но он считает это слабостью, поэтому делится своими переживаниями только с самыми близкими людьми, и то редко.
  </UiText>

  <UiText class="description">
    При недостатке эмоций, получаемых от людей, Инспектор может сам провоцировать эмоции у близких: раздражать их, веселить, шутить.
  </UiText>

  <UiText class="description">
    Лишь получив эмоциональный отклик (положительный или отрицательный, не важно), успокоится.
  </UiText>

  <br />
  
  <hr />

  <UiText class="description">
    Не имеет собственного эмоционального поля — оно должно быть внушено извне.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Нуждается в эмоциональном программировании со стороны, иначе не способен определить для себя чувства окружающих.
  </UiText>

  <UiText class="description">
    Его собственные чувства инертны, настроение зависит от того, с кем он общается.
  </UiText>

</template>

<style lang="scss" scoped></style>
