<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Любит людей увлекающихся, интересующихся миром вокруг, таких как его дуал Советчик.
  </UiText>

  <UiText class="description">
    Приятно, когда его посвящают в свои наблюдения, рассказывают любопытные вещи.
  </UiText>

  <UiText class="description">
    Им нужно, чтобы партнер вытягивал их из рутины в необычную жизнь, и именно благодаря таким «вылазкам» он расцветает.
  </UiText>

  <UiText class="description">
    Ему важно иметь интересные цели впереди, без них он не видит смысла в жизни и начинает грустить.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Ему крайне трудно самому увидеть смысл своего существования и разглядеть суть происходящего.
  </UiText>

  <UiText class="description">
    Он предпочитает не мучиться разгадкой сложных явлений, не строить стратегических планов и уж тем более не ставить далеких целей.
  </UiText>

  <UiText class="description">
    По его мнению, близкие должны заботиться о его осведомленности в актуальных вопросах и снабжать информацией о перспективах и шансах на успех.
  </UiText>

  <UiText class="description">
    К такого рода сведениям  относится некритично, легко принимает на веру, если только в них нет лишней конкретики и перегруза научно-техническими «примочками».
  </UiText>

</template>

<style lang="scss" scoped></style>
