<script lang="ts" setup>
import { UiText } from "@shared/ui";
</script>

<template>

  <UiText class="attributes" preset="large" color="role">
    Особенности
  </UiText>

  <UiText>
    С детства проявляет гордость и независимость в поступках и суждениях.
  </UiText>

  <UiText>
    Может не сразу находить общий язык со сверстниками, порой замыкается в себе.
  </UiText>

  <UiText>
    Одновременно стремится к вниманию – через эффектные манеры, выразительную речь и артистичное поведение.
  </UiText>

  <UiText>
    Тянется к искусству – любит декламировать стихи, петь, танцевать.
  </UiText>

  <UiText>
    Отлично копирует манеры окружающих, подмечает смешные стороны их поведения.
  </UiText>

  <UiText>
    Резко меняет настроение – от безудержного веселья до меланхолии.
  </UiText>

  <UiText>
    Неразборчив в еде, склонен к вредным пищевым привычкам.
  </UiText>
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Сказочный персонаж
  </UiText>

  <UiText class="description" color="black">
    🎭 Пьеро — «Золотой ключик» <i>(Алексей Толстой)</i>.
Чувствительный, артистичный, погруженный в свои эмоции.
  </UiText>

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Рекомендации по воспитанию
  </UiText>

  <UiText class="description" color="black">
    Будьте тактичны и ласковы, хвалите за хорошо выполненную работу.
  </UiText>

  <UiText class="description" color="black">
    Не давите и не заставляйте через грубость – реакция может быть обратной.
  </UiText>

  <UiText class="description" color="black">
    Объясняйте необходимость работы – лучше через просьбу о помощи, чем через приказ.
  </UiText>

  <UiText class="description" color="black">
    Используйте стимулы – небольшие подарки, обещания покупки желанной вещи.
  </UiText>

  <UiText class="description" color="black">
    Можно применять мягкий социальный стимул – стыдить за невыполненные просьбы, ставя в пример других.
  </UiText>

  <UiText class="description" color="black">
    Говорите о некрасивости лени и безвольности, ему важно, чтобы его уважали.
  </UiText>

  <UiText class="description" color="black">
    Личный пример работает лучше всего – покажите, что соблюдать правила и доводить дела до конца полезно и удобно.
  </UiText>

  <UiText class="description" color="black">
    Давайте ему радости и поощрения – иначе он быстро теряет мотивацию.
  </UiText>

  <UiText class="description" color="black">
    Научите соблюдать порядок – объясняйте, что это делает жизнь легче и приятнее.
  </UiText>

  <hr />

  <UiText class="description" color="black">
    Этот ребенок яркий, эмоциональный и внушаемый. Мягкое руководство и вдохновляющий пример для него работают лучше, чем давление.
  </UiText>

</template>
