<template>
  <div class="text g-page">
    <section>
      <UiText preset="large" color="role">
        Ваша сильная сторона — предчувствие событий будущего: вы можете
        предсказать развитие ситуации во времени и дать своевременный полезный
        совет, предупредить о грядущих неприятностях или трудностях.
      </UiText>

      <UiText>
        У вас прекрасно развито воображение. Вы можете воссоздать увиденное или
        прочитанное вами до мельчайших подробностей.
      </UiText>

      <UiText>
        Вы любознательны, умеете накапливать информацию по интересующим вас
        вопросам, отличаясь завидной эрудицией. Вы осторожны и предусмотрительны
        в принятии важных решений, что дает повод окружающим считать вас мудрым
        и дальновидным человеком.
      </UiText>

      <UiText>
        Вы обладаете способностью создавать себе обстановку, в которой есть все
        необходимое для рациональной организации труда и отдыха. Вы очень цените
        комфорт и удобства.
      </UiText>

      <UiText>
        Вы умеете стимулировать других к проявлению деловой активности и
        предприимчивости в целях достижения высокого материального уровня.
        Хорошие тактические способности позволяют вам находить много методов и
        путей для достижения нужной вам цели
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Ваша основная проблема — излишний скептицизм в отношении новых идей и
        начинаний,которые требуют для своего воплощения больших затрат энергии и
        энтузиазма. Это может породить некоторый консерватизм и пассивность в
        проведении необходимых мероприятий.
      </UiText>

      <UiText>
        Вы цените свой душевный покой и стабильность, что само по себе ценно. Но
        в кризисных ситуациях необходимо проявлять активность. Преодолевайте в
        себе апатию и склонность к созерцательности.
      </UiText>

      <UiText>
        Политика страуса, прячущего голову в песок, может привести вас к потере
        вкуса к жизни, а также отрицательно сказаться на вашей деловой
        активности.
      </UiText>

      <UiText preset="large" color="role">
        Излишняя ворчливость может вызывать недовольство окружающих людей и даже
        потерю интереса к общению с вами.
      </UiText>

      <UiText>
        Развивайте в себе чувство такта, воздерживайтесь от неуместных
        замечаний. Старайтесь отмечать достоинства людей и больше хвалить их за
        хорошие качества и поступки.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Другая ваша жизненная проблема — это излишняя щепетильность и педантизм.
        Вы вникаете порой в каждую мелочь, слишком скрупулезны в выполнении
        конкретной работы.
      </UiText>

      <UiText>
        Эти нерациональные затраты времени и энергии могут привести к общему
        переутомлению и даже потере интереса к выполняемой работе. Вы можете
        встать перед дилеммой: бросить работу вам трудно из-за потери стимулов и
        желания. В таком случае помните о причинах, приведших к такой
        нежелательной ситуации.
      </UiText>

      <UiText preset="large" color="role">
        Вы проявляете иногда чрезмерные требования к качеству и свежести пищи.
      </UiText>

      <UiText>
        Вы отличаетесь устоявшимися вкусами и привычками в быту (интерьер,
        ассортимент питания и т. д.). Более внимательно относитесь к советам,
        касающимся разнообразия вкусов, привычек и взглядов на жизненный уклад.
      </UiText>

      <UiText preset="large" color="role">
        Избегайте стереотипов во всем.
      </UiText>

      <UiText>
        Из-за чрезмерной мнительности в период недомогания вы можете
        злоупотреблять лекарствами и недооценивать значения активного образа
        жизни, занятий спортом, особенно на свежем воздухе.
      </UiText>

      <UiText preset="large" color="role">
        Стремитесь к здоровому образу жизни, соблюдайте баланс приятных
        физических и интеллектуальных ощущений.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
