<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <div class="warning">
      <UiText preset="small" color="accent">
        Если вы не умеет воспринимать юмор, обидчивы или зависимы от мнений
        незнакомцев, пожалуйста, не читайте все что ниже.
      </UiText>

      <UiText preset="small" color="accent">
        Ненормативная лексика и сексуальные темы, оскорбление чувств всех
        причастных. Но весело и остроумно. Соблюдена авторская орфография и
        пунктуация.
      </UiText>
    </div>

    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Люркмор"
          subtitle="2 минуты"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Селютин"
          subtitle="1 минута"
          target-content-id="tab-2"
        />

        <VariousTab
          title="Эльвира Фея"
          subtitle="2 минуты"
          target-content-id="tab-3"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText color="accent">
            <i>
              жлоб, быдло, настоящий мужык, УГ, хикки, руссо туристо, бард,
              шансонье, не такой как все
            </i>
          </UiText>

          <UiText preset="large" color="role">
            Мастер рождается, живёт и умирает на диване. Там же он много ест и
            изготавливает произведения искусства. Всё норовит пощупать и
            облапать. Если ему покажут какую-либо вещь, но не позволят
            прикоснуться к ней, Мастер посчитает, что никакой вещи вовсе не
            было. Показалось!
          </UiText>

          <UiText>
            Элитист, не без этого. Поэтому при удобном случае будет доказывать,
            что 95% населения — идиоты и чел-овеки, а он сам суровый и серьёзный
            анхуман.
          </UiText>

          <UiText>
            Упрямый, замкнутый. Любит прикидываться тюфяком и просто васей, но
            потом ВНЕЗАПНО оказывается, что он уже что-то эдакое
            налепил-натворил; мало того, результат всегда кажется больше
            затраченных усилий. Ненавидит людей с ОБВМ, особенно Наставников.
          </UiText>

          <UiText preset="large" color="role">
            Считается интегральным типом Японии и Сингапура.
          </UiText>

          <UiText>
            Есть мнение, что большинство маньяков являются Мастерами. Этот ваш
            Чикатило отличный пример.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">Бочка меда</UiText>
          <UiText preset="large" color="role">
            Создаёт тонны комфорта, коего с лихвой перепадает и окружающим.
            Вообще, определение «золотые руки» — это про них, Мастер же!
          </UiText>
          <UiText preset="small" color="accent">Ложка дегтя</UiText>
          <UiText preset="large" color="accent">
            Действительно, хер поднимешь с дивана: пойдут на погуляшки если
            только им там что-то реально надо. Для своей, конечно, задницы.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="large" color="role">
            Немножко честности мне не повредит. Льстец.
          </UiText>

          <UiText>
            Спит двадцать четыре часа в сутки. С ним можно общаться, пока он не
            начнет капризничать. Не следует обращать на него слишком много
            внимания.
          </UiText>

          <UiText>
            Мастеров мужиков надо сразу после типирования в тюрягу сажать —
            бандюги не меньше Лидеров. Но если Лидер хоть бандюга откровенный,
            то Мастеру иногда удаётся чисто случайно приличным человеком
            казаться.
          </UiText>

          <UiText preset="large" color="role">
            Ну и тормоз, конечно, тот ещё, но тормозит он не из принципа, а от
            ограниченности своей....
          </UiText>

          <UiText>
            И сами немного похожи на изделия материального мира — прочные,
            качественные, плотные, требующие внимательного обращения к себе.
            Ленивец с криминальным складом ума и с не приложенной инструкцией по
            пользованию им.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Лежит по уши в дерьме и мечтает о высших материях.
          </UiText>

          <UiText>
            При том даже мечты у него какие-то глупые, нелогичные... а как
            начнёт говорить, то заснуть можно, я уже минут 20 назад его мысль
            понял, он ещё ни как не может её сформулировать...
          </UiText>

          <UiText preset="large" color="role">
            Он не стремиться к обществу, сотрудничеству, абсолютно автономен и
            независим.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-3" class="tab">
        <section>
          <UiText preset="large" color="role">
            Ведь Мастера — они, сука, тихие как мыши, и сидят по жизни в уголку,
            прикрывшись ветошью.
          </UiText>

          <UiText>
            Сидят, починяют примус, конструируют вечный двигатель (вот руки у
            них не из жопы, что есть, того не отнять), готовят кремовый штрудель
            или делают еще что-нибудь не менее полезное для мироздания и для вас
            в частности.
          </UiText>

          <UiText>
            Однако не рассчитывайте, что в один прекрасный день Мастер вдруг
            выпрыгнет из угла, расфуфырится и оборотится принцем на белом
            мерседесе — не выпрыгнет.
          </UiText>

          <UiText>
            Ему в своем углу спокойно и хорошо. Людей, особенно ярких
            Энтузиастов и гиперуверенных Политиков, он тихо ненавидит, не
            осмеливаясь выразить свои чувства вслух.
          </UiText>

          <UiText>
            Логика подсказывает, что Советчика, прыгающую вокруг него, как
            заводной мячик, ненавидит больше всего, но сказать пужается.
          </UiText>
        </section>

        <section>
          <UiText>
            Мастер вообще всегда молчит, и на лице его застыла робкая улыбка,
            которая безумно раздражает любого, кто способен связать два слова с
            третьим, в отличие от.
          </UiText>

          <UiText>
            Зато Мастер хозяйственный, сука, и работящий, гвоздь там забить или
            паяльником поработать — это ему как два пальца.
          </UiText>

          <UiText>
            В постели Мастер тоже работящ и активен, как электродрель, и
            примерно так же блещет фантазией.
          </UiText>

          <UiText preset="large" color="role">
            Добавим, что Мастера женского пола порой косят под «идеального
            Лирика», играя тургеневских трепетных барышень, краснеющих от
            матерного анекдота.
          </UiText>

          <UiText>
            А при близком рассмотрении вместо нежного стыдливого румянца и
            расцветающего цветка невинности вы обнаруживаете все того же
            смертельно скучного тихушника, которого все пятьсот позиций из
            Камасутры не излечат от робкой улыбки, за которую отчетливо хочется
            двинуть по услужливой роже.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
