<template>
  <div class="text g-page">
    <section>
      <UiText preset="large" color="role">
        Вашей сильной стороной является глубокое понимание людей и человеческих
        взаимоотношений.
      </UiText>

      <UiText>
        Вы интересуетесь мотивами поступков, душевными качествами, отношениями
        между людьми, за которыми наблюдаете длительное время.
      </UiText>

      <UiText>
        И чем дольше длится это изучение, тем безошибочнее вы определяете
        характер человека: каков он есть на самом деле,а не каким хочет казаться
      </UiText>

      <UiText>
        Вы стремитесь к теплым, дружеским отношениям между людьми, не переносите
        грубости и насилия. В этом проявляется гуманистическая направленность
        вашей личности, за это вас ценят и уважают окружающие.
      </UiText>

      <UiText>
        Ваше знание людей и жизненный опыт всегда помогут вам найти своё место в
        коллективе. Другое ваше преимущество, благодаря которому вы заслуживаете
        признательность людей, — неизменная чуткость, доброта и внимательность к
        людям.
      </UiText>

      <UiText>
        Своё сострадание к ним вы стараетесь проявить на деле, а не только на
        словах. Вы, не жалея собственных сил и времени, помогаете каждому, кто
        действительно нуждается в вашей помощи.
      </UiText>

      <UiText>
        Конечная цель вашей деятельности — создание спокойной, гармоничной,
        бесконфликтной обстановки, в которой каждый мог бы раскрыть свои
        способности.
      </UiText>

      <UiText>
        Вы — лучший утешитель и примиритель. Прощая людям их отрицательные
        поступки и прегрешения, вы воздействуете на их совесть, заставляете
        задуматься над нравственными основами нашей жизни.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Проблемой, тревожащей вас, является недостаток решительности и
        инициативности, неумение требовать в волевой форме.
      </UiText>

      <UiText>
        Этому способствует и некоторая застенчивость или даже робость, присущая
        вашему характеру в той или иной степени. Вы очень щепетильны, боитесь
        показаться навязчивым, неуместно вызывающим внимание к себе.
      </UiText>

      <UiText>
        Вы — человек скромный, неагрессивный. Вы не решаетесь активно
        отреагировать на вызов, предпочитаете свои обиды таить в себе.
      </UiText>

      <UiText>
        Вам даже неудобно принять защиту от других. Вы считаете, что человек,
        обидевший вас, сам должен все осознать и раскаяться. Если же он этого не
        делает, вы стараетесь избегать общения с ним, наказывая его молчанием.
      </UiText>

      <UiText>
        Вам рекомендуется развивать в себе самозащиту: прямо высказывать своё
        осуждение непорядочности и бесчестности, не проявлять жалости к людям,
        не способным исправиться или раскаяться, не давать использовать себя в
        чьих-то корыстных целях.
      </UiText>

      <UiText preset="large" color="role">
        Учитесь вовремя сказать «нет». Поменьше сочувствуйте посторонним людям и
        побольше уделяйте внимания близким.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Другой вашей проблемой является очень тщательная проработка деталей
        любого дела, порождающая медлительность и безэмоциональность.
      </UiText>

      <UiText>
        Увязая в мелочах, вы едва ли находите время для полноценного отдыха на
        природе или в компании друзей, что может плохо сказаться на вашем
        самочувствии.
      </UiText>

      <UiText>
        Вы тщательно и глубоко анализируете все, что касается вас и ваших
        знакомых. Результаты подобного объективного анализа часто бывают
        неутешительными, из-за чего вы испытываете порой чувство глубокой печали
        и пессимизма.
      </UiText>

      <UiText>
        Вас излишне удручает все, что выходит за рамки порядочности,
        нравственности и духовности.
      </UiText>

      <UiText preset="large" color="role">
        Не идите на поводу у своей жалости,чтобы потом не бичевать себя за
        отступление от честности и справедливости.
      </UiText>

      <UiText>
        Помните, что истинная справедливость не допускает компромиссов с
        совестью.
      </UiText>

      <UiText preset="large" color="role">
        Ускорьте темп работы, концентрируйтесь, чтобы ваше внимание скользило
        мимо мелочей, останавливаясь только на главном, существенном.
      </UiText>

      <UiText>
        Попробуйте скорочтение — это поможет вам научиться видеть общую картину
        явления или события.
      </UiText>

      <UiText>
        Анализируя факты, стремитесь не к уточнению, а к обобщению. Знание общих
        закономерностей избавит вас от затрат сил и нервов на неоправданные,
        мало кого интересующие аспекты дела.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
