<template>
  <div class="text g-page">
    <section>
      <UiText preset="subtitle" color="accent">Сильные стороны</UiText>

      <UiText preset="large" color="role">
        Эмоционален, обаятелен. Мягкий, тактичный человек.
      </UiText>

      <UiText>
        Обладает утонченностью в восприятии мира. Часто имеет развитые
        гуманитарные интересы. Чуток и внимателен к людям, старается со всеми
        поддерживать ровные отношения.
      </UiText>

      <UiText>Проявляет терпимость к недостаткам и слабостям других.</UiText>

      <UiText preset="large" color="role">
        Романтичен и оптимистичен, верит в светлое будущее. Готов идти на
        компромиссы: умеет терпеливо ждать и прощать.
      </UiText>

      <UiText>
        Хорошо развито предчувствие, тревожится за исход дела, хотя внешне этого
        не показывает. Уважает сильных авторитетных людей, которые могут выдать
        конкретные указания.
      </UiText>

      <UiText>
        В интересах дела может проявлять хорошие дипломатические способности,
        располагая людей к себе своей скромностью и обаянием. Обладает неплохим
        чувством юмора.
      </UiText>

      <UiText>
        Искусен в умении нравиться. К каждому умеет найти индивидуальный подход.
        Демонстрирует изысканность, хорошие манеры, грациозен в движениях. Со
        вкусом одевается, элегантен.
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">Проблемы</UiText>

      <UiText>Внутренне раним, противоречив.</UiText>

      <UiText>
        Несколько неуверен в себе, склонен к сомнениям и колебаниям в выборе
        решения. Его нужно вовлекать в дело.
      </UiText>

      <UiText>
        Нуждается в моральной, физической и материальной поддержке. Из-за
        рассеянности иногда забывает выполнять обещания.
      </UiText>

      <UiText>
        В работе склонен утопать в деталях, отвлекаться на мелочи и при этом не
        успевать сделать в срок более важные дела.
      </UiText>

      <UiText preset="large" color="role">
        Не любит строгих порядков, бездумного подчинения регламентам и
        инструкциям.
      </UiText>

      <UiText>
        Ему с трудом даются экономия и трезвый расчет в делах. На рабочем месте
        и в быту может допускать «художественный» беспорядок.
      </UiText>

      <UiText>
        Не любит людей, которые скупятся в мелочах. Болезненно воспринимает
        критику своей работы. Охотно делится своими проблемами с окружающими,
        ищет понимания, сочувствия и поддержки.
      </UiText>

      <UiText>
        Его работоспособность имеет явно выраженные периоды спадов и подъемов.
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Нельзя требовать и ожидать
      </UiText>

      <UiList iconName="chevron-right" iconColor="accent" iconSize="16">
        <UiListItem>Постоянно высокой работоспособности.</UiListItem>

        <UiListItem>Пунктуальности и организованности.</UiListItem>

        <UiListItem>Быстрой конкретной отдачи в делах.</UiListItem>

        <UiListItem>Умения хорошо анализировать ситуацию.</UiListItem>

        <UiListItem>
          Умения руководить большим коллективом, распределять обязанности.
        </UiListItem>
      </UiList>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Подходящие виды деятельности
      </UiText>

      <UiText>
        Лучше всего, если работа Лирика носит гуманитарную направленность.
      </UiText>

      <UiText>
        Он может хорошо работать там, где нужно элегантно общаться с не очень
        большим количеством людей.
      </UiText>

      <UiText>
        Получаются неплохие секретари, особенно под началом у Лидеров,
        переводчики, библиотекари, литераторы, журналисты, редакторы текстов.
      </UiText>

      <UiText>
        Они также хорошо могут себя реализовать в сфере искусства — в качестве
        театральных критиков, поэтов.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
