<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <div class="warning">
      <UiText preset="small" color="accent">
        Если вы не умеет воспринимать юмор, обидчивы или зависимы от мнений
        незнакомцев, пожалуйста, не читайте все что ниже.
      </UiText>

      <UiText preset="small" color="accent">
        Ненормативная лексика и сексуальные темы, оскорбление чувств всех
        причастных. Но весело и остроумно. Соблюдена авторская орфография и
        пунктуация.
      </UiText>
    </div>

    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Люркмор"
          subtitle="2 минуты"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Селютин"
          subtitle="4 минуты"
          target-content-id="tab-2"
        />

        <VariousTab
          title="Эльвира Фея"
          subtitle="2 минуты"
          target-content-id="tab-3"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText color="accent">
            <i>
              админ, инженер, альфа-самец, мент, политрук, прапорщик, ФГМ,
              самурай, поцреот, строгая госпожа, вахтёр, пафос, монархист,
              угнетатель, совок, уг, ымперец, выживальщик, мужик, казак,
              граммар-наци, модератор
            </i>
          </UiText>

          <UiText>
            Симбиоз Лидера и Аналитика в одном лице. От первого взял стремление
            командовать людьми, от второго — страсть к иерархиям и системам. В
            результате получается машина подчинения, довящая людей не в личных
            собственных целях (как это может сделать Лидер), а за несоблюдение
            правил. Отсюда ещё одно название — Инспектор.
          </UiText>

          <UiText preset="large" color="role">
            Диктаторы по своей натуре. При этом сами Инспекторы охотно слушаются
            тех, кого они искренне считают выше себя в развитии или в социальной
            иерархии. Правда, добиться от него такого отношения очень и очень
            сложно. Обычно это удаётся более продвинутым Инспекторам или
            Лидерам.
          </UiText>

          <UiText>
            Часто увлекается BDSM, ввиду своего патологического стремления к
            доминированию, а также страсти к силе в любых её проявлениях. Может
            защищать слабых (читай Наставников и Лириков), чтобы показать, что
            он (она) — хороший годный и добрый человек.
          </UiText>

          <UiText>
            Среди Инспекторов порой попадаются редкие мудаки, отличающиеся
            неимоверной вредностью и упёртостью. Они строго соблюдают усвоенные
            правила и очень не любят их менять. Наверное, поэтому многие из них
            — консерваторы, тоскующие по тоталитарным системам. Нередко они
            устраиваются на такую работу, где синдром вахтёра лишь
            приветствуется.
          </UiText>

          <UiText>
            Часто идут в модераторы. Велик процент «Максимов» среди корректоров,
            редакторов, и таки IT-шников. Также очень часто встречается в
            военных или государственных структурах. Любых.
          </UiText>

          <UiText>
            Замечено также, что Инспекторов много среди простых школьных
            учителей (любят дрючить), искусствоведов/нумизматов/антикварщиков
            (любят что-нибудь коллекционировать, в том числе красивые и дорогие
            вещи), а также представителей творческих профессий вроде дизайнеров,
            музыкантов, художников (видимо, так проявляется сенсорика во второй
            творческой функции). Так-то.
          </UiText>

          <UiText>
            Часто проповедник идеологии «Добро должно быть с кулаками». И
            попробуй, сука, откажись от этого бобра, мало не покажется!
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">Бочка меда</UiText>
          <UiText preset="large" color="role">
            Таки погонщики рабов и надзиратели нужны этому миру. Никто не
            переплюнет Инспектора на этих должностях. В быту часто может
            показаться, что мало что умеют, ибо не заморачиваются на нём, как
            Администраторы, но если вдруг приспичит, то обнаруживают невъебенные
            способности и познания. В отличие от Аналитика, который будет
            скулить и рассказывать, как надо, но сам делать ничего не захочет.
          </UiText>
          <UiText preset="small" color="accent">Ложка дегтя</UiText>
          <UiText preset="large" color="accent">
            Злые мудаки. Никого, кроме себя, не слушают, ибо всегда сами знают
            «как надо». Хронически не выносят безалаберных мечтателей/распиздяев
            (вроде Советчика и Новатора) и, при случае, находят какой-нибудь
            садистский способ их наказать («в воспитательных целях»). В
            недуальных отношениях срутся по поводу и без, ибо всегда найдут к
            чему придраться.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="large" color="role">
            Логический подтип — уж больно неприступен, когда умён, и когда...
            трезв. Властолюбец. С ним не договоришься.
          </UiText>

          <UiText>
            Готов послать других на смерть за принципы. Сам может быть
            бесстрашен до глупости, но обычно остается в живых.
          </UiText>

          <UiText>
            Презирает теневые структуры, не поддается силовому нажиму. Не любит
            размениваться по мелочам, но и общую картину видит криво и однобоко.
          </UiText>

          <UiText preset="large" color="role">
            Неразборчив и стеснителен в чувствах.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">Считает, что всегда прав.</UiText>

          <UiText>Завидует творческим неординарным личностям.</UiText>

          <UiText>
            Ещё один из коллекции тормозов: тормозит Макс агрессивно и
            глобально, везде залезет, всё проконтролирует, всё по его должно
            быть.
          </UiText>

          <UiText>
            И что самое худшее — сил у него достаточно для насаждения своего
            маразма!
          </UiText>

          <UiText>
            А уж отношения к родственникам так и вообще за гранью всего — ради
            своих каких-то там схем готовы всю свою семью положить, да ещё и
            гордятся этим...
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Полностью автономная замкнутая система с кондиционером и
            микроволновкой.
          </UiText>

          <UiText>
            Квадратное колесо — собирается тяжело, но не долго, включается —
            словно барьер взял. Когда все идет хорошо — это только его заслуга,
            когда все идет плохо — все кругом виноваты.
          </UiText>

          <UiText preset="large" color="role">
            Он один только понимает, что коллективу на пользу, всех построит и
            прижмет к ногтю.
          </UiText>

          <UiText>
            Параноик по жизни. Никогда не будет делать ничего, что не принесет
            ему материальной или моральной выгоды, причем материальная
            преобладает, как более существенная: если не расплатиться с ним в
            вещественной форме за работу, тут же заподозрит, что его дураком
            считают, и вмажет от всей души.
          </UiText>

          <UiText>
            Основная функция — всем мешать. Что угодно, лишь бы мир не
            изменился. Человек, по его мнению, — недоделанный робот.
          </UiText>

          <UiText>
            Не могут оторваться от правил, которые сами для себя и
            устанавливают.
          </UiText>

          <UiText>
            Скупы. Не способны поддаваться душевным порывам и сами от этого
            страдают. Занудны.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Шаг вперед и два назад, что касается чувств. Не умеют выражать свои
            чувства.
          </UiText>

          <UiText>
            Грешат перепадами настроения, склонны к депрессии. Все взвешивают,
            часто страхуются, где это не нужно делать, замкнуты, недоверчивы.
          </UiText>

          <UiText preset="large" color="role">
            Страдают комплексом неполноценности, но тщательно это скрывают.
          </UiText>

          <UiText>
            В сексе нуждаются в дополнительных стимулах (и стимуляторах).
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Верят в своё особенное предназначение.
          </UiText>

          <UiText>
            Не уверены в себе, но производят диаметрально противоположное
            впечатление на окружающих.
          </UiText>

          <UiText preset="large" color="role">
            Резки и грешат бестактностью. Окружающие часто не понимают их.
          </UiText>

          <UiText>
            Зациклен на слове «правильно». У Инспектора все должно быть
            правильно, все, «как у людей», не имеет значения, удобно ли это,
            выгодно ли это, нужно ли это кому-нибудь. И вообще, он лучше знает
            «как удобно».
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Самая большая мечта — регламентировать все стороны человеческой
            жизни. И неусыпно контролировать исполнение установленных правил.
          </UiText>

          <UiText>
            За сон на четыре минуты дольше установленного срока — штраф, за
            принятие пищи в не установленное регламентом время — пятнадцать
            суток ареста и т.д.
          </UiText>

          <UiText preset="large" color="role">
            На лице написано: «Два наряда вне очереди!»
          </UiText>

          <UiText>
            Прорехи в логике, которые он только кулаками и в состоянии
            «залатать».
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-3" class="tab">
        <section>
          <UiText preset="large" color="role">
            Инспекторы — они просто суки, и добавить к этому нечего.
          </UiText>

          <UiText>
            В глубине души они знают, что мир устроен неправильно, и уж они-то,
            как его исправить — а потому вся их деятельность направлена на то,
            что портить жизнь окружающим, активно их исправляя.
          </UiText>

          <UiText>
            В отличие от Хранителей, он не будет зря орать и биться в истерике —
            он просто прикажет, и попробуйте не подчиниться: таких беспогонных
            генералов, придирающихся к любой фигне, надо поискать.
          </UiText>

          <UiText>
            У Инспектора все должно быть так, как надо, но вместо того, чтоб
            тихо организовывать свой рациональный рай самостоятельно, они
            активно припахивают к работе всех, кто под руку попадется.
          </UiText>

          <UiText>
            Несмотря на сенсорику, вкус в Инспекторе отсутствует от рождения,
            зато имеется смекалка, благодаря которой на люди он выходит всегда в
            строгом костюме, руководствуясь, видимо, тем мнением, что хороший
            костюм даже владельцем не испортишь.
          </UiText>

          <UiText>
            К слову, в личном романтики в Максе ни на грош, зато формальности он
            соблюдет с удовольствием — правда, после свадьбы этот сухарь не
            преобразится в любящего супруга, он так и останется сукой, которого
            может вывести из себя криво сложенная салфетка.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Еще они корыстны до неприличия, что удачно сочетается с почти полным
            отсутствием интереса к делам сердечным, помимо удовлетворения
            физиологических нужд.
          </UiText>

          <UiText>
            Брак по расчету — то, что нужно их страждущей рациональной душе.
          </UiText>

          <UiText>
            А вот что они любят, так это работать — с утра и до поздней ночи,
            дятлы-энтузиасты страшные, тот тип одержимого начальника, который
            оштрафует на пол-зарплаты за пятиминутное опоздание, а за любой
            промах сначала наорет, а потом сделает все сам.
          </UiText>

          <UiText>
            С первого взгляда кажется, что Инспектор логичен до неприличия, но
            по сути он настолько зациклен на себе любимом, что вывести его из
            состояния вечной медитации на собственный мозг может только что-то
            действительно из ряда вон выходящее, например, такое чудо в перьях,
            как Наставник.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
