<template>
  <div class="text">
    <section>
      <UiText preset="body" color="accent">
        Описания не должны обязательно совпадать со всеми чертами характера
        личности.
      </UiText>

      <UiText preset="small" color="accent">
        Идея как раз описать наблюдаемые у среднего представителя типа
        особенности поведения и обработки информации психикой.
      </UiText>

      <UiText preset="small" color="accent">
        Автор описания — Велта Микелсоне
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="role">
        Прирожденный лидер, человек, который умеет брать на себя ответственность
        не только за себя, но и за других.
      </UiText>

      <br />

      <UiText>
        Врожденные способности руководителя и вождя. Умело и быстро оценивает
        сферу деятельности и сразу понимает, какая роль представлена ему в
        данной ситуации.
      </UiText>

      <UiText>
        Обычно он не работает в узком профиле, но если начал, обдумывает
        возможности расширения. Не позволяет себе расслабляться, работает изо
        всех сил, чтобы достичь максимального результата.
      </UiText>

      <UiText preset="large" color="role">
        Отлично понимает, что следует изменить, чтобы достичь цели.
      </UiText>

      <UiText>
        Даже будучи обыкновенным рабочим, его деятельность и напористость
        позволяет ему достичь высоких результатов.
      </UiText>

      <UiText>
        Обычно он заметен в толпе. Эти качества позволяют ему выдвигаться и
        подниматься по служебной лестнице до самого высокого уровня.
      </UiText>

      <UiText>
        Все сделанное его руками или под его надзором является
        высококачественной работой,это доказывает его талант мастера.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Обладает хорошей зрительной памятью — что однажды увидел (форму, цвет,
        цену, количество, качество), отлично запоминает.
      </UiText>

      <UiText>
        От своих планов не отступается. Он прекрасно оценивает ситуацию
        всеобщего замешательства — экономических, политических и социальных
        скандалов — и умело использует их. Находясь на высоком посту, способен
        захватывать власть.
      </UiText>

      <UiText>
        Даже обыкновенный Лидер-сотрудник способен умело распорядиться всеми.
        Независим в оценках, если он что-то задумал, его трудно остановить.
      </UiText>

      <UiText preset="large" color="role">
        Речь бодрая, жизнерадостная, голос громкий, тон повелительный, в нем
        присутствует чувство собственного достоинства.
      </UiText>

      <UiText>
        В общении прямой и энергичный. Всегда оставляет за собой последнее
        слово.
      </UiText>

      <UiText>
        Он рожден быть вождем, захватить власть для него — естественный процесс.
        Способен командовать даже вышестоящими людьми, поскольку ему
        несвойственно подчиняться.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        У него нет чувства меры, ему бывает трудно остановиться.
      </UiText>

      <UiText>
        Не достигнув желаемого результата, способен переметнуться на другую
        «сторону фронта». Может спокойно перейти в «лагерь» противника или
        заключить кратковременное перемирие, если ему взамен предложат высокий
        пост.
      </UiText>

      <UiText preset="large" color="role">
        Если не удаëтся добиться цели прямым воздействием, может талантливо
        воспользоваться хитростью или помощью другого человека.
      </UiText>

      <UiText>
        Чем сложнее цель, тем больше он к ней стремится. В сложных ситуациях
        мобилизуется. Чем опаснее ситуация, тем быстрее он может собрать силы и
        принять решение.
      </UiText>

      <UiText>
        Умеет находить слабое место каждого, применяя свою тактику и стратегию
        действия, попадает точно в цель. Упрямый и непреклонный. Не допустит,
        чтобы за него решали.
      </UiText>

      <UiText preset="large" color="role">
        Он быстро наведет и будет поддерживать порядок в неслаженном коллективе.
      </UiText>

      <UiText>
        Объясняет просто и ясно, использует убедительные примеры. Выслушивает
        мнение каждого, но окончательное решение принимает сам. Свои взгляды
        логически обосновывает и ловко манипулирует фактами, потому что обладает
        хорошей памятью. В ссоре ищет не правду, а победу.
      </UiText>
    </section>

    <section>
      <UiText>
        Признает, что образование имеет важную роль, но убежден, что более
        важную роль играет собрать максимальную информацию из окружения.
      </UiText>

      <UiText>
        Если он — человек широкого размаха, он пробирается к цели благодаря
        собранной информации извне. Всегда любопытный и в курсе всех дел Лирик —
        как раз тот человек, который необходим ему рядом.
      </UiText>

      <UiText>
        Чтобы его планы и лидерские позиции не разрушились, необходима
        дальновидность, осмотрительность и осторожность.
      </UiText>

      <UiText preset="large" color="role">
        Он плохой дипломат, часто терпит неудачи из-за своего языка, потому что
        говорит слишком конкретно, жестко, и бывает, даже оскорбительно.
      </UiText>

      <UiText>
        Если ему приходится терять свои позиции, то главная причина — это слабая
        интуиция и этика.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Замечает слабости и недостатки других, быстро понимает деловые качества
        каждого.
      </UiText>

      <UiText>
        При правильном выборе профессии и отрасли успешно создает команду,
        распределяет обязанности соответственно возможностям каждого и
        добивается, чтобы все работали с наибольшей отдачей.
      </UiText>

      <UiText>
        Если кто-то сомневается в его возможностях, смело и уверенно
        сопротивляется.
      </UiText>

      <UiText preset="large" color="role">
        Ему сложно понять характер людей и найти подход к ним.
      </UiText>

      <UiText>
        Всегда требует, чтобы окружающие соблюдали нормы поведения и
        установленный им порядок,и не устает следить за этим.
      </UiText>

      <UiText preset="large" color="role">
        Охотно строит отношения с уступчивыми и миролюбивыми людьми, которых
        легко подчинить.
      </UiText>

      <UiText>
        Он нуждается, чтобы другие были с ним открыты. Интересуется проблемами
        другого, сложные ситуации не решает словами, избегает разговоров на темы
        этики, а предлагает конкретную помощь. К своим близким может быть
        щедрым. Своими проблемами других не загружает.
      </UiText>

      <UiText>
        Не вовремя и неуместно высказанная фраза может его разозлить. Обычно он
        сразу дает отпор, что другой раз создает дискомфорт в дальнейшем
        развитии отношений.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Он не способен долго держать обиду, потому что это может помешать делу.
      </UiText>

      <UiText>
        С трудом идет на примирение. Ожидает от другого человека полного
        послушания и покорности, если это соблюдается, то может сохранить с ним
        длительные отношения.
      </UiText>

      <UiText>
        Нельзя сказать, что Лидера интересует лишь власть и диктат. Он человек
        порядка и своей системы. Сильнее других типов, не позволит себя обидеть.
      </UiText>

      <UiText>
        Также рьяно он защищает свою территорию — никто без согласия не должен
        переступать её порок, даже чужой кот, собака… Те, кто нарушают этот
        закон, считает почти врагами.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Жизнерадостный и гостеприимный человек.
      </UiText>

      <UiText>
        В выборе новых знакомых осторожен и подозрителен. Обычно у него не
        широкий круг знакомых, к нему принадлежат близкие родственники, а также
        люди, которые легко его воспринимают и считают полезным.
      </UiText>

      <UiText>
        Не всегда в круг близких людей включаются все родственники. Умело
        выдерживает дистанцию в отношениях на работе и с теми, с которыми
        складываются доброжелательные отношения, личную дружбу не заводит.
      </UiText>

      <UiText>
        Семья — это его собственность, от которой требуется полное подчинение.
        Также как и на работе, все должно происходить по его команде и быть под
        контролем.
      </UiText>

      <UiText>
        Потерпев поражение в отношениях, с годами понимает, что необходимо
        научиться ладить с людьми. Не терпит неопределенности и напрасную трату
        своего времени. Также ему не приятны ленивые, нерешительные и
        нецелеустремленные люди.
      </UiText>
    </section>

    <section>
      <UiText>
        Обычно азартно хватается за работу и не умеет вовремя остановиться.
        Перегрузка организма плохо отражается на его здоровье.
      </UiText>

      <UiText preset="large" color="role">
        Хотя умело составляет свой график, но плохо чувствует течение времени.
      </UiText>

      <UiText>
        Случается, Лидер выбирает творческую профессию, и ему удаëтся быть
        удивительным шутом, актером, певцом.
      </UiText>

      <UiText>
        Несмотря на то, что он не умеет в повседневной жизни показывать свои
        чувства и эмоции, ему прекрасно удаëтся сыграть их на сцене.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Бесстрашный, на него не влияют чужая ненависть и прочие эмоции.
      </UiText>

      <UiText>
        Ничему не удивляется и никому не завидует. Ему нравятся веселые
        компании, где он освобождается от переполняющей его энергии.
      </UiText>

      <UiText>
        Чтобы возобновить душевное спокойствие, ему необходима поддержка и
        признательность близких. Не замечает лицемерия и притворства.
      </UiText>

      <UiText>
        Предпочитает выслушать советы, но если это не соответствует его видению,
        действует, как считает нужным.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Терпеливый, но не тратит много времени для создания комфорта.
      </UiText>

      <UiText>
        Частые перегрузки могут вызывать серьезные заболевания, на которых он
        старается не обращать внимание, запускает их, даже скрывает.
      </UiText>

      <UiText>
        Для женщины — важен домашний комфорт, чистота, порядок, она
        хозяйственная. Заботится о том, чтобы дома было всё необходимое для
        быта. Одевается скромно, но со вкусом и часто дорого.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Самый практичный и экономичный социотип, каждому явлению находит
        эффективное применение.
      </UiText>

      <UiText>
        Работает проверенными методами. Если необходимо, умеет выжить при
        маленьком бюджете. Без особых усилий достигает того, что другим кажется
        невозможным. Не берется за бессмысленную работу.
      </UiText>

      <UiText>
        Неохотно меняет работу, но если его не устраивает статус и зарплата,
        если не видит возможности продвигаться вперед — уволится сам.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
