<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Велта Микелсоне"
          subtitle="10 минут"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Вера Стратиевская"
          subtitle="24 минута"
          target-content-id="tab-2"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText preset="body" color="accent">
            Описания не должны обязательно совпадать со всеми чертами характера
            личности.
          </UiText>

          <UiText preset="small" color="accent">
            Идея как раз описать наблюдаемые у среднего представителя типа
            особенности поведения и обработки информации психикой.
          </UiText>

          <UiText preset="small" color="accent">
            Автор описания — Велта Микелсоне
          </UiText>
        </section>

        <section>
          <UiText preset="subtitle" color="role">
            Прирожденный лидер, человек, который умеет брать на себя
            ответственность не только за себя, но и за других.
          </UiText>

          <br />

          <UiText>
            Врожденные способности руководителя и вождя. Умело и быстро
            оценивает сферу деятельности и сразу понимает, какая роль
            представлена ему в данной ситуации.
          </UiText>

          <UiText>
            Обычно он не работает в узком профиле, но если начал, обдумывает
            возможности расширения. Не позволяет себе расслабляться, работает
            изо всех сил, чтобы достичь максимального результата.
          </UiText>

          <UiText preset="large" color="role">
            Отлично понимает, что следует изменить, чтобы достичь цели.
          </UiText>

          <UiText>
            Даже будучи обыкновенным рабочим, его деятельность и напористость
            позволяет ему достичь высоких результатов.
          </UiText>

          <UiText>
            Обычно он заметен в толпе. Эти качества позволяют ему выдвигаться и
            подниматься по служебной лестнице до самого высокого уровня.
          </UiText>

          <UiText>
            Все сделанное его руками или под его надзором является
            высококачественной работой,это доказывает его талант мастера.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Обладает хорошей зрительной памятью — что однажды увидел (форму,
            цвет, цену, количество, качество), отлично запоминает.
          </UiText>

          <UiText>
            От своих планов не отступается. Он прекрасно оценивает ситуацию
            всеобщего замешательства — экономических, политических и социальных
            скандалов — и умело использует их. Находясь на высоком посту,
            способен захватывать власть.
          </UiText>

          <UiText>
            Даже обыкновенный Лидер-сотрудник способен умело распорядиться
            всеми. Независим в оценках, если он что-то задумал, его трудно
            остановить.
          </UiText>

          <UiText preset="large" color="role">
            Речь бодрая, жизнерадостная, голос громкий, тон повелительный, в нем
            присутствует чувство собственного достоинства.
          </UiText>

          <UiText>
            В общении прямой и энергичный. Всегда оставляет за собой последнее
            слово.
          </UiText>

          <UiText>
            Он рожден быть вождем, захватить власть для него — естественный
            процесс. Способен командовать даже вышестоящими людьми, поскольку
            ему несвойственно подчиняться.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            У него нет чувства меры, ему бывает трудно остановиться.
          </UiText>

          <UiText>
            Не достигнув желаемого результата, способен переметнуться на другую
            «сторону фронта». Может спокойно перейти в «лагерь» противника или
            заключить кратковременное перемирие, если ему взамен предложат
            высокий пост.
          </UiText>

          <UiText preset="large" color="role">
            Если не удаëтся добиться цели прямым воздействием, может талантливо
            воспользоваться хитростью или помощью другого человека.
          </UiText>

          <UiText>
            Чем сложнее цель, тем больше он к ней стремится. В сложных ситуациях
            мобилизуется. Чем опаснее ситуация, тем быстрее он может собрать
            силы и принять решение.
          </UiText>

          <UiText>
            Умеет находить слабое место каждого, применяя свою тактику и
            стратегию действия, попадает точно в цель. Упрямый и непреклонный.
            Не допустит, чтобы за него решали.
          </UiText>

          <UiText preset="large" color="role">
            Он быстро наведет и будет поддерживать порядок в неслаженном
            коллективе.
          </UiText>

          <UiText>
            Объясняет просто и ясно, использует убедительные примеры.
            Выслушивает мнение каждого, но окончательное решение принимает сам.
            Свои взгляды логически обосновывает и ловко манипулирует фактами,
            потому что обладает хорошей памятью. В ссоре ищет не правду, а
            победу.
          </UiText>
        </section>

        <section>
          <UiText>
            Признает, что образование имеет важную роль, но убежден, что более
            важную роль играет собрать максимальную информацию из окружения.
          </UiText>

          <UiText>
            Если он — человек широкого размаха, он пробирается к цели благодаря
            собранной информации извне. Всегда любопытный и в курсе всех дел
            Лирик — как раз тот человек, который необходим ему рядом.
          </UiText>

          <UiText>
            Чтобы его планы и лидерские позиции не разрушились, необходима
            дальновидность, осмотрительность и осторожность.
          </UiText>

          <UiText preset="large" color="role">
            Он плохой дипломат, часто терпит неудачи из-за своего языка, потому
            что говорит слишком конкретно, жестко, и бывает, даже оскорбительно.
          </UiText>

          <UiText>
            Если ему приходится терять свои позиции, то главная причина — это
            слабая интуиция и этика.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Замечает слабости и недостатки других, быстро понимает деловые
            качества каждого.
          </UiText>

          <UiText>
            При правильном выборе профессии и отрасли успешно создает команду,
            распределяет обязанности соответственно возможностям каждого и
            добивается, чтобы все работали с наибольшей отдачей.
          </UiText>

          <UiText>
            Если кто-то сомневается в его возможностях, смело и уверенно
            сопротивляется.
          </UiText>

          <UiText preset="large" color="role">
            Ему сложно понять характер людей и найти подход к ним.
          </UiText>

          <UiText>
            Всегда требует, чтобы окружающие соблюдали нормы поведения и
            установленный им порядок,и не устает следить за этим.
          </UiText>

          <UiText preset="large" color="role">
            Охотно строит отношения с уступчивыми и миролюбивыми людьми, которых
            легко подчинить.
          </UiText>

          <UiText>
            Он нуждается, чтобы другие были с ним открыты. Интересуется
            проблемами другого, сложные ситуации не решает словами, избегает
            разговоров на темы этики, а предлагает конкретную помощь. К своим
            близким может быть щедрым. Своими проблемами других не загружает.
          </UiText>

          <UiText>
            Не вовремя и неуместно высказанная фраза может его разозлить. Обычно
            он сразу дает отпор, что другой раз создает дискомфорт в дальнейшем
            развитии отношений.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Он не способен долго держать обиду, потому что это может помешать
            делу.
          </UiText>

          <UiText>
            С трудом идет на примирение. Ожидает от другого человека полного
            послушания и покорности, если это соблюдается, то может сохранить с
            ним длительные отношения.
          </UiText>

          <UiText>
            Нельзя сказать, что Лидера интересует лишь власть и диктат. Он
            человек порядка и своей системы. Сильнее других типов, не позволит
            себя обидеть.
          </UiText>

          <UiText>
            Также рьяно он защищает свою территорию — никто без согласия не
            должен переступать её порок, даже чужой кот, собака… Те, кто
            нарушают этот закон, считает почти врагами.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Жизнерадостный и гостеприимный человек.
          </UiText>

          <UiText>
            В выборе новых знакомых осторожен и подозрителен. Обычно у него не
            широкий круг знакомых, к нему принадлежат близкие родственники, а
            также люди, которые легко его воспринимают и считают полезным.
          </UiText>

          <UiText>
            Не всегда в круг близких людей включаются все родственники. Умело
            выдерживает дистанцию в отношениях на работе и с теми, с которыми
            складываются доброжелательные отношения, личную дружбу не заводит.
          </UiText>

          <UiText>
            Семья — это его собственность, от которой требуется полное
            подчинение. Также как и на работе, все должно происходить по его
            команде и быть под контролем.
          </UiText>

          <UiText>
            Потерпев поражение в отношениях, с годами понимает, что необходимо
            научиться ладить с людьми. Не терпит неопределенности и напрасную
            трату своего времени. Также ему не приятны ленивые, нерешительные и
            нецелеустремленные люди.
          </UiText>
        </section>

        <section>
          <UiText>
            Обычно азартно хватается за работу и не умеет вовремя остановиться.
            Перегрузка организма плохо отражается на его здоровье.
          </UiText>

          <UiText preset="large" color="role">
            Хотя умело составляет свой график, но плохо чувствует течение
            времени.
          </UiText>

          <UiText>
            Случается, Лидер выбирает творческую профессию, и ему удаëтся быть
            удивительным шутом, актером, певцом.
          </UiText>

          <UiText>
            Несмотря на то, что он не умеет в повседневной жизни показывать свои
            чувства и эмоции, ему прекрасно удаëтся сыграть их на сцене.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Бесстрашный, на него не влияют чужая ненависть и прочие эмоции.
          </UiText>

          <UiText>
            Ничему не удивляется и никому не завидует. Ему нравятся веселые
            компании, где он освобождается от переполняющей его энергии.
          </UiText>

          <UiText>
            Чтобы возобновить душевное спокойствие, ему необходима поддержка и
            признательность близких. Не замечает лицемерия и притворства.
          </UiText>

          <UiText>
            Предпочитает выслушать советы, но если это не соответствует его
            видению, действует, как считает нужным.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Терпеливый, но не тратит много времени для создания комфорта.
          </UiText>

          <UiText>
            Частые перегрузки могут вызывать серьезные заболевания, на которых
            он старается не обращать внимание, запускает их, даже скрывает.
          </UiText>

          <UiText>
            Для женщины — важен домашний комфорт, чистота, порядок, она
            хозяйственная. Заботится о том, чтобы дома было всё необходимое для
            быта. Одевается скромно, но со вкусом и часто дорого.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Самый практичный и экономичный социотип, каждому явлению находит
            эффективное применение.
          </UiText>

          <UiText>
            Работает проверенными методами. Если необходимо, умеет выжить при
            маленьком бюджете. Без особых усилий достигает того, что другим
            кажется невозможным. Не берется за бессмысленную работу.
          </UiText>

          <UiText>
            Неохотно меняет работу, но если его не устраивает статус и зарплата,
            если не видит возможности продвигаться вперед — уволится сам.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="small" color="accent">1 — Базовая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_will" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Воля</UiText>
              <UiText preset="body">Волевая сенсорика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            «К сильному прислушиваются даже тогда, когда он говорит шепотом».
          </UiText>

          <UiText>
            Сила, власть, целеустремленность, упорство и настойчивость —
            основные программные ценности представителей этого типа. Именно
            поэтому они великолепно оценивают силу и «волевой потенциал» каждого
            человека. Обращают особое внимание на тех, кто стремится к власти, и
            стараются никому не уступать «волевую инициативу».
          </UiText>

          <UiText color="role">
            Основной ориентир, занимающий внимание Лидера, — силовое соотношение
            в сложившейся социальной структуре и собственный силовой приоритет.
            Иными словами, на протяжении всей своей жизни осознанно или
            подсознательно, независимо от рода занятий и интересов представитель
            этого типа постоянно задается вопросом: «кто-кого?».
          </UiText>

          <UiText>
            Вся волевая сенсорика Лидер рассматривается в аспекте: «Либо я - их,
            либо они — меня». «Я был маленький — меня отец «тюкал», теперь я
            вырос - я его «тюкаю».
          </UiText>

          <UiText preset="large" color="role">
            Ощущение своей физической силы, ощущение собственной власти,
            собственных полномочий имеют для Лидера исключительную значимость.
          </UiText>

          <UiText>
            Он уважает власть, уважает силу, уважает любую иерархическую
            систему, потому что там все держится на «правильной», в его
            понимании, расстановке сил.
          </UiText>

          <UiText>
            Лидер всегда старается найти себе применение в рамках уже
            существующей, главенствующей системы. Это — первая стадия в любых
            его начинаниях, это его «программа-минимум», его первая цель. «Цель
            оправдывает средства».
          </UiText>

          <UiText>
            Конечная цель Лидера — занять в системе иерархий главенствующее
            место. Не важно, кем он сейчас является, — лидером оппозиции,
            начальником отдела или «командиром звездочки»: он всегда ощущает
            себя человеком, наделенным властью и полномочиями.
          </UiText>

          <UiText>
            В рамках вверенного ему участка он неуязвим, он — беспрекословный
            авторитет, он — Бог и царь. Даже работая в отделе рядовым служащим,
            Лидер, поставивший перед собой «высокие цели», может в кратчайший
            срок подчинить своему влиянию начальство, иногда это ему выгоднее,
            чем самому возглавлять отдел.
          </UiText>

          <UiText color="role">
            Лирик «дирижирует» временем — и своим собственным, и чужим. Он всех
            подчиняет своим темпам — всех втягивает в свой жизненный ритм.
          </UiText>

          <UiText>
            Организация силовых структур и лидерство в ней — одна из социальных
            функций представителя этого типа.
          </UiText>

          <UiText color="role">
            Внедрение в систему, поиск единомышленников в рамках системы,
            внедрение в сферу важнейших влияний и важнейших деловых интересов с
            последующим введением туда «своих людей», деятельность которых он
            будет контролировать, координировать и которые в нужный момент будут
            ему подчиняться, — все это не что иное, как создание собственной
            структуры в рамках уже существующей системы: последовательный и
            поэтапный захват власти методом «постепенно сжимающегося железного
            обруча».
          </UiText>

          <UiText preset="large" color="role">
            На цели, не отвечающие конечным задачам, Лидер не разменивается.
            Более того, он не даст себя сбить с толку.
          </UiText>

          <UiText color="accent">
            Например, оппозиционная система его заинтересует только в том
            случае, если она имеет реальные шансы захватить власть. К
            диссидентскому движению он примкнет, если увидит для себя реальную и
            безопасную возможность заработать «политический капитал» или
            последующую возможность возглавить оппозицию.
          </UiText>

          <UiText>
            Положение «шестерки» для Лидера абсолютно неприемлемо — этого он
            больше всего боится и будет стараться всеми силами не допустить.
            Лидер совершенно не способен кого-либо просить об услуге: он ощущает
            себя в этот момент униженным. Поэтому он старается всегда так
            построить ситуацию, чтобы заставить других сделать то, что ему нужно
            — метод «железного обруча» в миниатюре.
          </UiText>

          <UiText preset="large" color="role">
            Совершенно немыслима для Лидера ситуация, когда его. «держат за
            фрайера» — это больше, чем удар по самолюбию, это крах всей его
            программы.
          </UiText>

          <UiText>
            Часто создается впечатление, что он «зациклен» на понятии «уважение
            — неуважение». Он постоянно и повсеместно требует признания
            собственного приоритета, что само по себе уже является признаком его
            внутренней неуверенности в себе.
          </UiText>

          <UiText>
            Чем больше он внутренне ощущает себя «шестеркой», тем большего
            внимания и почтения к себе требует.
          </UiText>

          <UiText preset="large" color="role">
            Очень боится быть зависимым. Зависимость для него — показатель
            слабости. Умеет заставить зависеть от себя — считает это показателем
            силы.
          </UiText>

          <UiText color="role">
            Любит предлагать свои «ценные» услуги, любит быть «нужным»
            человеком, умеет «припомнить» оказанную услугу и умеет востребовать
            должок.
          </UiText>

          <UiText>
            Постоянное его стремление захватить большую власть и расширить
            область своего влияния диктуется не только неудовлетворенными
            амбициями, но и внутренним требованием застраховать себя от ситуации
            вынужденного подчинения.
          </UiText>

          <UiText preset="large" color="role">
            Либо я — его, либо он — меня.
          </UiText>

          <UiText>
            Всю свою жизнь он как бы нарабатывает дополнительный «запас
            прочности». Он не просто «притесняет на пустом месте»: он старается
            захватить побольше «впрок» — на случай, если его заставят что-либо
            уступить, ему будет не так обидно - он уступает вроде как чужое, а
            не свое.
          </UiText>

          <UiText color="role">
            Качество, повсеместно проявляющееся у представителей этого типа, —
            захват административных, материальных и, главное, территориальных
            преимуществ.
          </UiText>

          <UiText>
            Завоевание пространства для Лидера — задача первостепенной
            значимости, причем осуществляется им самым естественным и потому не
            всегда осознаваемым образом.
          </UiText>

          <UiText>
            Будет ли это захват лишнего места на коммунальной кухне или лишнего
            метра на бельевой веревке, Лидер будет глубоко неудовлетворен, если
            вместо него это сделает кто-то другой.
          </UiText>

          <UiText>
            Для представителей этого типа заполнять собой пространство — самое
            естественное состояние.
          </UiText>

          <UiText color="accent">
            Часто, сам того не замечая, Лидер выбирает для себя центральное
            место в пространстве — может, например, выдвинуть для себя кресло на
            середину комнаты и, общаясь с теми, кто сидит вдоль стен, очень
            хорошо себя чувствует — как на троне.
          </UiText>

          <UiText preset="large" color="role">
            Иногда Лидер подготавливает себе «поле деятельности» вполне
            осознанно.
          </UiText>

          <UiText>
            Например, задумав съездить «на разведку» в чужой город или чужую
            страну, набирает себе «поручения от знакомых своих знакомых», что
            дает ему возможность нанести визит совершенно чужим людям,
            расспросить их про житье-бытье, про себя рассказать, нужные
            знакомства завязать, пожить у кого-нибудь денек-другой, а там
            глядишь, он уже свой человек, и в следующий раз приезжает сюда как к
            близким родственникам.
          </UiText>

          <UiText preset="large" color="role">
            В быту Лидер довольно часто завоевывает пространство с помощью шумов
            и звуков.
          </UiText>

          <UiText>
            Для Лидера-ребенка характерно перекрикиваться с родителями через
            весь двор — в эту минуту он чувствует, что владеет всем окружающим
            пространством.
          </UiText>

          <UiText>
            Для Лидеров-новоселов, особенно жителей южных стран, очень
            характерно сразу же по вселении «врубить» музыку на полную
            громкость, да еще и дверь своей квартиры настежь распахнуть, чтобы у
            соседей не оставалось иллюзий относительно того, кто здесь хозяин.
          </UiText>

          <UiText>
            По той же причине некоторые Лидеры сами очень недолюбливают
            «музыкальных» соседей: могут по всему дому организовать сбор
            подписей для того, чтобы их выселить.
          </UiText>

          <UiText>
            Расстановка сил у Лидера всегда очень примитивная: «или — или»,
            другой альтернативы нет. Объясняется это тем, что он всегда
            сосредоточен на одной, близкой цели — либо он ее берет, либо нет —
            «Либо пан — либо пропал».
          </UiText>

          <UiText>
            Этому, по большому счету, и подчиняется вся его система отношений:
            «Либо лидер — либо «шестерка»; «Либо хозяин — либо никто». В его
            системе расстановки сил есть только два силовых полюса: сильный и
            слабый. Лидер предпочитает быть в сильном полюсе, но оказавшись в
            слабом, умеет признавать свое поражение и подчиняться победившей его
            силе.
          </UiText>

          <UiText>
            Лидер отличается исключительной работоспособностью и настойчивостью,
            которая возрастает пропорционально количеству препятствий.
          </UiText>

          <UiText>
            Никому не позволяет сомневаться в своем праве руководить людьми.
            Говорит, как декларирует - уверенным, командным голосом. Не
            позволяет себе быть снисходительным, считает, что это ему может
            слишком дорого обойтись.
          </UiText>

          <UiText preset="large" color="role">
            Предпочитает только требовать. Пользуется любой возможностью
            проявлять свои волевые качества — решительность, настойчивость,
            непреклонность, заявляя о себе, как о строгом, но справедливом
            лидере.
          </UiText>

          <UiText>
            Лидер великолепно проявляет себя как руководитель-организатор: точно
            оценивает уровень квалификации каждого и с каждого спрашивает по
            максимуму.
          </UiText>

          <UiText>
            Распределяет работу так, чтобы расстановка сил была оптимальной.
            Задает самый интенсивный темп работы, с тем чтобы получить наиболее
            продуктивную отдачу за минимальное время.
          </UiText>

          <UiText>
            В обычных условиях Лидер чувствует себя как бы «не в своем режиме»,
            но в экстремальной ситуации активизируется и мобилизуется.
          </UiText>

          <UiText>
            По это же причине любит создавать атмосферу психологического
            напряжения — это его как бы развлекает. Любит рассказывать страшные
            истории, любит «сгущать краски», насаждать паническое настроение, с
            удовольствием распространяет слухи, которые часто бывают
            преувеличены.
          </UiText>

          <UiText>
            Обстановка экстремальности Лидера приятно тонизирует, именно поэтому
            он иногда специально ужесточает дисциплинарные условия и держит
            своих подчиненных в постоянном напряжении. Даже в спокойную
            будничную работу Лидер-руководитель часто привносит обстановку ничем
            не обоснованной экстремальности: так удобнее ему самому, а
            следовательно, как он считает, удобно и другим.
          </UiText>

          <UiText>
            Предпочитает коллегиальное обсуждение решений, но окончательное
            решение, равно как и ответственность за него, принимает сам.
          </UiText>

          <UiText color="accent">
            «Выиграл сражение не тот, кто дал хороший совет, а тот, кто взял на
            себя ответственность за его выполнение и приказал выполнить».
          </UiText>

          <UiText preset="large" color="role">
            «Выиграл сражение не тот, кто дал хороший совет, а тот, кто взял на
            себя ответственность за его выполнение и приказал выполнить».
          </UiText>

          <UiText>
            Быстро схватывает создавшуюся ситуацию и расстановку сил, принимает
            решение и действует. Умеет рисковать, идти «ва-банк». Мало подвержен
            страху. Чем опаснее ситуация, тем он собраннее и решительнее.
          </UiText>

          <UiText>
            В экстремальных условиях его воля, решительность, смелость и
            практичное мышление помогают найти выход.
          </UiText>

          <UiText>
            В критических ситуациях призывает к решительным действиям, к
            «наращиванию силового потенциала».
          </UiText>

          <UiText>
            Легкомыслие и беспечность — качества, с которыми, по его мнению,
            надо бороться.
          </UiText>

          <UiText color="role">
            Предпочитает действовать хладнокровно и предельно энергично, отвечая
            на удар двойным ударом. В случае внешней физической опасности
            склонен предусмотрительно ретироваться.
          </UiText>

          <UiText color="role">
            Но если, в силу обстоятельств, пришлось ввязаться в конфликтную
            ситуацию, предпочитает не отступать, а бороться до конца, даже в
            ущерб собственным интересам.
          </UiText>

          <UiText>
            Не склонен приспосабливаться к партнеру, только диктовать. Обычно
            старается быть вежливым и выдержанным, но если задевается его
            самолюбие, не в состоянии скрыть своего раздражения. Находясь в
            «ущемленном» состоянии, внутренне нервничает и упорно ищет выхода из
            создавшегося положения.
          </UiText>

          <UiText>
            В коллективе часто берет на себя функции неформального лидера,
            тайного контролера за ситуацией, в критическую минуту
            предпочитающего оставаться в тени.
          </UiText>

          <UiText preset="large" color="role">
            О целесообразности действий, о волевых качествах, о необходимости
            мобилизовать свои силы говорит тоном, не терпящим возражений.
          </UiText>

          <UiText>
            Требовательный по отношению к себе и другим: людей, не выполняющих
            своих обещаний, не уважает. В его глазах они ровным счетом ничего не
            значат. Своего презрения к ним не считает нужным скрывать.
          </UiText>

          <UiText>
            Уверен в собственной силе и значимости, равно как и в своем
            общественном предназначении.
          </UiText>

          <UiText preset="large" color="role">
            Азартен, склонен к соперничеству и соревнованию.
          </UiText>

          <UiText>
            Всем повсеместно и постоянно навязывает свои жизненные ценности как
            некую, не подлежащую сомнению, абсолютную истину.
          </UiText>

          <UiText>
            Часто и с удовольствием говорит о «грубой реальности», ценит в себе
            умение воспринимать жизнь такой, «как она есть».
          </UiText>

          <UiText color="role">
            Охотно делится своим жизненным опытом, часто слишком назойливо
            поучает тому, «как надо жить«. Всегда знает «как надо» и «как не
            надо».
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">2 — Творческая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_logic" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Теория</UiText>
              <UiText preset="body">Структурная логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">«Знание — сила»</UiText>

          <UiText>
            В системе основных ценностей, присущих интеллекту этого типа, аспект
            логики соотношений является одним из важнейших — он реализует
            программу интеллекта, а следовательно, самым органичным образом в
            нее вписывается.
          </UiText>

          <UiText>
            Сведущий человек, по мнению Лидера, защищен. Человек, не имеющий
            необходимой информации, беззащитен. Поэтому сбор нужной информации
            для Лидера так же важен, как и наращивание силового потенциала. Для
            Лидера во многих случаях — это одно и то же.
          </UiText>

          <UiText>
            Особо важную для себя информацию Лидер может и купить, и получить
            обманом или хитростью. Может заполучить ее ценой «незначительного»,
            для себя, волевого давления, например «взять на испуг».
          </UiText>

          <UiText preset="large" color="role">
            Информация — это всегда ценность, независимо от того, нужна она или
            нет.
          </UiText>

          <UiText>
            Огромную услугу в сборе информации оказывает Лидеру его дуал Лирик,
            который всегда в курсе всех событий, имеет массу нужных и ненужных
            знакомств, способен с ненавязчивой легкостью разговорить самого
            некоммуникабельного человека и со свойственной ему исключительной
            любознательностью выспросить у того все, что ему нужно, и все, что
            ему может пригодиться.
          </UiText>

          <UiText>
            Волевое давление Лидера часто реализуется методом логического
            убеждения. Для этого он от природы наделен гибкой, манипулятивной
            логикой, которая в первую очередь служит целям и интересам его
            волевой программы.
          </UiText>

          <UiText>
            Вынося свое суждение о каком-либо предмете, Лидера далеко не всегда
            бывает объективен, поскольку прежде всего исходит из собственной,
            «программной» расстановки сил, из личных интересов и собственных
            целей.
          </UiText>

          <UiText>
            Поэтому, дискутируя с Лидером, нужно постоянно иметь в виду, что
            приводимые им факты служат не для объективного выяснения истины, а
            для неоспоримого признания его личной точки зрения и его системы
            взглядов.
          </UiText>

          <UiText preset="large" color="role">
            Спорить с Лидером и неприятно и нецелесообразно.
          </UiText>

          <UiText color="role">
            Сразу становятся очевидными тенденциозность и спекулятивность его
            доводов, склонность к упрощенным выводам, стремление решить проблему
            методом «Да — нет». Создается впечатление, что для него нет
            полутонов. Есть только «черное» и «белое».
          </UiText>

          <UiText color="accent">
            Например, неприятно обсуждать с Лидером какие-то личные планы, он
            всегда будет сопоставлять их со своими собственными целями и
            исходить из возможностей своих собственных успехов.
          </UiText>

          <UiText>
            Лидер никому не позволит себя обскакать хоть на полголовы, никому не
            позволит «застолбить» ту «золотую жилу», до которой у него лично еще
            не дошли руки. Вся его логика, все его аргументы, вся сила его
            убеждений будет направлена на то, чтобы доказать человеку, что этого
            делать не надо. Никогда ни одного совета он, Лидер, не даст в ущерб
            собственным интересам.
          </UiText>

          <UiText color="role">
            Объективные истины используются им не для абстрактного размышления,
            а как средство целенаправленной аргументации.
          </UiText>

          <UiText>
            Свою точку зрения он будет навязывать и доказывать наперекор общему
            мнению, используя для этого все допустимые и, скорее всего,
            недопустимые формы ведения спора: способен повышать голос,
            использовать эмоциональное или физическое давление: в споре ищет не
            истины — ищет победы.
          </UiText>

          <UiText preset="large" color="role">
            Когда не находит средств убедить оппонента, обращается к свидетелям
            спора, чтобы высмеять или скомпрометировать противника. Считает себя
            обязанным одерживать победу любым путем.
          </UiText>

          <UiText color="role">
            Часто находит возможность оставить последнее слово за собой,
            разгромив противника одной репликой или фразой, сказанной в
            подходящий момент.
          </UiText>

          <UiText>
            От природы наделен хорошей памятью. Имеет собственное представление
            по каждому вопросу и умеет его обосновать.
          </UiText>

          <UiText>
            Широко применяет известные факты, статистические данные, примеры из
            истории. При рассмотрении вопроса не упускает из виду даже самые
            незначительные детали.
          </UiText>

          <UiText color="role">
            Если готовится к спору, заранее выбирает лучший вариант
            доказательств, старается все предусмотреть и проработать, часто даже
            математически просчитать. Большое внимание обращает на достоверность
            источников информации.
          </UiText>

          <UiText color="role">
            Если нужно, может подбирать информацию исключительно аккуратно и
            педантично. Сомнительными источниками информации предпочитает не
            пользоваться.
          </UiText>

          <UiText>
            Разумеется, знания нужны представителям этого типа не только для
            того, чтобы побеждать в споре и любыми средствами завоевывать
            авторитет. Умение логически мыслить — важнейший инструмент его
            интеллекта.
          </UiText>

          <UiText>
            Представители этого типа охотно и с удовольствием учатся всю жизнь —
            постоянно и повсеместно. К любому начинанию подходят очень
            обстоятельно, собирают и анализируют всю необходимую информацию,
            повышают уровень своей квалификации.
          </UiText>

          <UiText>
            Следует заметить, что такая форма волевого воздействия рассчитана в
            первую очередь на то, чтобы активизировать и дисциплинировать
            Наставника, а также на его слабую, а иногда и довольно инертную
            сенсорику, которая без соответствующего импульса Инспектора в работу
            не включится.
          </UiText>

          <UiText color="role">
            Много и с удовольствием работают над собой. Имеют широчайший круг
            интересов.
          </UiText>

          <UiText>
            Далеко не всегда научные изыскания Лидера стимулируются ожиданием
            чинов и наград, хотя документальные подтверждения его авторитета —
            дипломы, грамоты и другие знаки отличия, безусловно, очень важны.
          </UiText>

          <UiText preset="large" color="role">
            Лидер очень внушается признанными авторитетами и очень любит
            подтверждать свой авторитет документально, хотя качество полученного
            образования для него гораздо важнее, чем свидетельствующий об этом
            документ.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">3 — Ролевая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_ideas" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Мысль</UiText>
              <UiText preset="body">Интуиция возможностей</UiText>
            </span>
          </div>

          <UiText>
            Программа «силового приоритета» постоянно требует от Лидера умения
            быть дальновидным, предусмотрительным и расчетливым во всех своих
            действиях. Любой промах оборачивается для него поражением
            собственных планов, крушением карьеры и низложением из лидеров в
            «шестерки».
          </UiText>

          <UiText preset="large" color="role">
            Лидер, играя «по-крупному», «по-крупному» и проигрывает.
          </UiText>

          <UiText>
            Ему, как любому сенсорику, свойственно стремление высказываться
            предельно конкретно и ясно, что неизбежно заставляет его сболтнуть
            что-нибудь лишнее, которое потом может обернуться против него. Часто
            говорит: «Язык мой — враг мой».
          </UiText>

          <UiText color="role">
            Он может сколько угодно развивать в себе такие качества, как
            осмотрительность и осторожность в общении с малознакомыми людьми, но
            он никогда не разучится говорить конкретно, сосредотачивать свое
            внимание на конкретном изложении мысли, на конкретных доводах и
            фактах.
          </UiText>

          <UiText color="accent">
            Например, Лидер-посредник говорит: «Наша фирма предоставляет вам
            скидку на оплату дорогостоящих и сверхсрочных медицинских услуг. За
            это вы нам будете ежемесячно платить… » — «Позвольте, — возражает
            оппонент, — я должен платить только за скидку на оплату услуг,
            которыми я в ближайшие годы и пользоваться-то не собираюсь?! Так во
            сколько же мне обойдется такая «скидка»?…
          </UiText>

          <UiText color="role">
            Где-то в своих аргументах Лидер обязательно дает «козырь» против
            самого себя. Его логика слаба интуитивно, хотя бы потому, что
            слишком сильна своим волевым напором.
          </UiText>

          <UiText>
            Его аргументы — это всегда какая-то сиюминутная выгода. И
            убедительность его основана не на действительной, а на желаемой,
            подтасованной базе данных.
          </UiText>

          <UiText>
            Благодаря своему умению убеждать с помощью стройно подтасованных
            фактов, представители этого типа великолепно работают посредниками
            во всяких сомнительных коммерческих мероприятиях, могут очень бойко
            торговать «дырками от бубликов», в чем и бывают нередко уличены.
          </UiText>

          <UiText>
            Впрочем, если бы при такой сокрушительной волевой сенсорике, Лидер
            был бы еще и неуязвим по интуиции…
          </UiText>

          <UiText color="role">
            К счастью, в природе такое невозможно. Как бы Лидер ни старался
            развивать эту функцию, она никогда у него не будет достаточно
            сильной.
          </UiText>

          <UiText>
            Случается, он этим даже ослабляет свою программу: начинает выжидать
            и просчитывать шансы там, где надо действовать волевым напором и
            натиском. Увы, одно исключает другое.
          </UiText>

          <UiText>
            В любом случае Лидеру приходится принимать во внимание расчеты по
            аспекту интуиции возможностей, особенно на ранних стадиях общения.
          </UiText>

          <UiText preset="large" color="role">
            Лидер очень осторожно завязывает новые контакты.
          </UiText>

          <UiText color="role">
            Напряжен и насторожен в общении с новыми людьми: с одной стороны,
            контролирует свое поведение, стараясь произвести максимально
            благоприятное впечатление, с другой — постоянно наблюдает за
            собеседником, стараясь соотнести его волевой потенциал со своим
            собственным.
          </UiText>

          <UiText>
            Часто сам создает ситуацию, позволяющую ему быстро определить
            возможную расстановку сил: постарается каким-либо образом заявить
            свои права на лидерство и посмотреть, какова будет реакция.
          </UiText>

          <UiText>
            Иногда старается повернуть ситуацию так, чтобы сразу же поставить
            собеседника в зависимость от себя. Иногда это делается по привычке —
            такой уже сложился стиль общения, иногда — в целях «разведки»
            допустимых возможностей.
          </UiText>

          <UiText preset="large" color="role">
            При своей внешней прямолинейности Лидер способен проявлять чудеса
            приспосабливаемости. Очень конформен.
          </UiText>

          <UiText>
            Умеет так быстро перенимать главенствующую общественную идеологию,
            что даже у тех, кто знает его недолгое время, возникает уверенность
            в абсолютной его беспринципности.
          </UiText>

          <UiText>
            Наметив себе цель, никогда не идет сразу напролом. Наоборот, может
            разыграть роль абсолютно незаинтересованного человека, одновременно
            прикидывая возможные способы воздействия.
          </UiText>

          <UiText>
            Постарается использовать личное обаяние или будет воздействовать
            через друзей и знакомых, — одним словом, ищет «рычаги влияния»,
            опираясь на уже сложившиеся системы связей и иерархий, стараясь
            найти «нужного человека» в «нужном клане».
          </UiText>

          <UiText>
            Стратегия «сжимающегося железного обруча». Свою силу попусту не
            расходует — применяет только в случае необходимости.
          </UiText>

          <UiText preset="large" color="role">
            Любит разыгрывать роль «покровителя-благодетеля». Этакого «крестного
            отца», вообще, «отца родного» — «Ленин и дети»…
          </UiText>

          <UiText>
            Будучи профессиональным политиком, великолепно умеет лавировать и
            маневрировать, но никогда не теряет «свою линию». Не идет дальше
            кратковременных уступок. Выстраивает свою стратегию, рассчитывая на
            умение импровизировать и на удачу: «Главное — ввязаться в бой, а там
            посмотрим».
          </UiText>

          <UiText preset="large" color="role">
            Не любит работать в условиях жестких рамок. Ему нужны свобода
            действий и масштабность.
          </UiText>

          <UiText>
            Его планы динамичны, они постоянно корректируются реальными
            обстоятельствами. Опасается несвоевременных действий, по
            возможности, ведет выжидательную тактику, приберегая инициативу для
            решительного прорыва в нужный момент.
          </UiText>

          <UiText color="role">
            Выслушивает всех, от кого можно получить дельный совет. Любит
            беседовать со специалистами и у них учиться.
          </UiText>

          <UiText preset="large" color="role">
            О планах на будущее старается говорить уверенно и с оптимизмом, хотя
            далеко не всегда уверен в счастливом исходе.
          </UiText>

          <UiText>
            Не позволяет себе говорить о собственной неудачливости и невезучести
            даже в кругу самых близких друзей.
          </UiText>

          <UiText>
            В дуальной паре Лидер — Лирик неудачники не очень высоко котируются,
            поэтому Лидер сделает все возможное, чтобы это скрыть.
          </UiText>

          <UiText>
            Никого не допускает к своим связям. Ни в коем случае не раскрывает
            своих знакомств, хоть и стремится произвести впечатление человека, у
            которого «все схвачено».
          </UiText>

          <UiText>
            У него действительно «все схвачено», но только для себя и для
            «своих» — качество, которое очень привлекает к нему его дуала
            Лирика.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">4 — Болевая функция.</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_people" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чувство</UiText>
              <UiText preset="body">Этика отношений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Относительно собственных этических качеств Лидер не строит иллюзий,
            поскольку знает за собой такие неприятные черты, как изначальная
            подозрительность и привычка предполагать наихудшие мотивы в
            поступках людей
          </UiText>

          <UiText>
            Следствие того, что аспект этики отношений и интуиции возможностей
            находятся у него на очень слабых и уязвимых позициях.
          </UiText>

          <UiText>
            Исходя из собственных этических «комплексов» — страхов, недоверия и
            недопонимания, Лидер как раз и формирует свои личные взаимоотношения
            и это одна из серьезнейших его проблем.
          </UiText>

          <UiText>
            Лидер постоянно беспокоится, что его собственные этические
            «несовершенства» слишком заметны окружающим и разрушают тот
            «положительный» образ «строгого, но справедливого лидера», который
            он старательно выстраивает в соответствии с программой своего
            интеллекта.
          </UiText>

          <UiText>
            А относительно «этичности» собственной «волевой» программы Лидер
            действительно не строит иллюзий — о каких этических правах и о какой
            свободе выбора может идти речь при единовластии и единоволии Лидера?
            При его неуступчивости и диктате по отношению к партнеру…
          </UiText>

          <UiText preset="large" color="role">
            Для Лидера исключительно важно отношение к его мнению и его
            авторитету — для него это гораздо важнее, чем для представителей
            других психологических типов.
          </UiText>

          <UiText color="role">
            Поскольку ум и сила — главнейшие его ценности, для Лидера очень
            важно, чтобы это было оценено не только им, но и другими.
          </UiText>

          <UiText>
            Для Лидера также важно, чтобы его воспринимали не только таким,
            каким он кажется, но и таким, каким он может быть, если к нему
            относиться хорошо. Важно, чтобы воспринимали и оценивали не только
            его самого и не такого, каков он есть, а его позитивный этический
            потенциал.
          </UiText>

          <UiText>
            Именно то, что хорошо видит и оценивает его дуал Лирик.
          </UiText>

          <UiText>
            О том, каким он может быть хорошим, Лидер обычно говорит сразу, но
            полунамеками. Он достаточно умен и предусмотрителен для того, чтобы
            не говорить об этом открытым текстом. Кроме того, хвалить себя ему
            кажется и нескромным, и неприличным — ведь подсознательно он
            настроен на своего дуала, который это и так хорошо видит.
          </UiText>

          <UiText preset="large" color="role">
            Лидеру очень важно быть правильно понятым, особенно теми людьми,
            которых он предполагает к себе приблизить.
          </UiText>

          <UiText color="role">
            Такому человеку он охотно может рассказать о своем характере, о том,
            как он обычно реагирует на те или иные поступки, что ему нравится в
            людях, что нет.
          </UiText>

          <UiText>
            Лидеру очень важно, чтобы в его поступках люди не предполагали
            дурных намерений.
          </UiText>

          <UiText>
            Жестокость и подозрительность он приберегает для врагов, а друзьям
            он готов в любую минуту доказать свое хорошее отношение делом.
          </UiText>

          <UiText>
            Даже если его другу потребуется помощь, оказав которую, он рискует
            навлечь на себя серьезные неприятности, Лидер может со своей стороны
            предложить эквивалентную услугу, но уже без последствий для себя.
          </UiText>

          <UiText color="accent">
            Например, если для его друга потребуется подписать гарантийное
            обязательство, Лидер скорее всего откажется, но взамен может
            одолжить крупную сумму денег на продолжительный срок.
          </UiText>

          <UiText>
            Лидер готов помогать не только своим друзьям, но и друзьям своих
            друзей, разумеется, рассчитывая, что при случае люди ему отплатят
            тем же.
          </UiText>

          <UiText>
            И все-таки Лидеру мало быть уважаемым, важно еще и быть любимым.
            «Влюбиться не главное, главное — в себя влюбить». Основная проблема
            личных взаимоотношений Лидера как раз в том и заключается, что он
            далеко не всякому доказательству любви верит.
          </UiText>

          <UiText>
            Выстраивая свои отношения относительно несколько заниженной
            этической самооценки, Лидер очень боится сократить психологическую
            дистанцию, боится, что при ближайшем рассмотрении его сочтут
            малопривлекательным субъектом.
          </UiText>

          <UiText>
            Такой подход к делу заставляет его действовать в этическом плане
            очень напряженно, противоестественно и нелогично. Часто, едва
            добившись расположения, он сам первый разрушает отношения. Мужчины
            этого типа активно сокращают дистанцию физически, но не этически.
          </UiText>

          <UiText preset="large" color="role">
            Представителям этого типа довольно трудно формировать свои личные
            отношения еще и потому, что, по большому счету, они имеют весьма
            отдаленное представление о том, как это надо делать.
          </UiText>

          <UiText color="role">
            В неопределенной этической ситуации чувствуют себя совершенно
            беспомощными и дезориентированными.
          </UiText>

          <UiText>
            Следуя своему правилу контроля за любой инициативой, Лидер создает
            себе массу этических проблем хотя бы уже тем, что не допускает
            свободы выбора для своего партнера, подразумевается психологически
            несовместимый партнер.
          </UiText>

          <UiText>
            Лидер начинает слишком сильно давить на него своим мнением, своей
            властью, авторитетом: он все решает за партнера, все за него
            продумывает, ставит его в жесткие условия, не допуская ни малейших
            возражений с его стороны.
          </UiText>

          <UiText color="accent">
            Например, может сразу жестко оговорить время и продолжительность
            свиданий — «по вторникам и четвергам с часу до двух — иначе мне
            неудобно!»; может настаивать на определенных условиях встреч: «Если
            случайно где-нибудь встретимся, мы с тобой не знакомы. Никто не
            должен знать, что мы встречаемся». Причем Лидер может так поступать
            вовсе не потому, что он, например, женат. Но даже если он сейчас и
            свободен, не исключено, что в будущем он женится на ком-то другом, а
            сейчас он опасается, что его нынешняя связь возможно повлияет на его
            будущие семейные отношения.
          </UiText>

          <UiText>
            Как любой иррациональный сенсорик, Лидер развивает свою интуицию и
            старается быть предусмотрительным, даже в ущерб своим сиюминутным
            отношениям. А то, что таким поведением он глубоко обижает и
            разочаровывает своего партнера, — это уже второй вопрос, но именно
            он-то и оборачивается проблемой.
          </UiText>

          <UiText>
            Серьезную ошибку совершает Лидер, пытаясь взять на себя этическую
            инициативу. Ему мало того, что он желает быть воспринятым не таким,
            какой он есть, а таким, каким он хочет казаться.
          </UiText>

          <UiText>
            Он еще на этой, довольно неустойчивой основе пытается сам
            моделировать свои отношения. И, разумеется, хочет, чтобы они
            развивались именно так, как ему нужно.
          </UiText>

          <UiText>
            Именно поэтому Лидер, особенно женщины не прочь лишний раз
            повыяснять отношения. Ох, не надо бы ему этого делать! Ничего
            хорошего он для себя не выяснит. Ведь хорошие отношения Лидеру и так
            ясны — он их чувствует, а плохие и выяснять незачем.
          </UiText>

          <UiText>
            Зачем ему выслушивать о себе неприятные вещи? — Ведь говорить ему о
            том, какой он плохой, значит, усугублять его комплексы, занижать его
            самооценку и превращать его в того монстра, каким ему его описывают.
          </UiText>

          <UiText>
            Лидеру нельзя давать повода осознавать себя «плохим» — ни к чему
            хорошему это не приведет. Нельзя его «тыкать носом» в собственные
            этические недостатки — это его только ожесточает.
          </UiText>

          <UiText preset="large" color="role">
            Нельзя ему вколачивать добро с кулаками — в такое «добро» он не
            верит.
          </UiText>

          <UiText color="role">
            В силу своего пессимизма и своей слабой интуиции Лидер не принимает
            для себя также и идею изначального миролюбия, всеобщей
            доброжелательности и всеобщей любви.
          </UiText>

          <UiText>
            Лидер поверит только в то, чему сам был свидетель, и в то, что
            развивалось у него на глазах, а именно — в конкретные отношения с
            конкретным человеком, при которых он лично чувствовал себя хорошо.
          </UiText>

          <UiText>
            Со всеми партнëрами Лидер чувствует себя таким, каким его оценивают.
            Причем об этом ему совсем необязательно говорить открытым текстом —
            Лидер очень хорошо чувствует оценку партнера по взгляду, по
            интонации, по улыбке, по выражению лица.
          </UiText>

          <UiText>
            Поэтому своей заниженной оценкой партнер может разочаровать Лидера
            еще раньше, чем тот начнет разочаровывать его своим поведением.
            Лидер очень хорошо чувствует бесперспективность и обреченность
            отношений и ведет себя в соответствии с этим.
          </UiText>

          <UiText>
            Лидер может продолжать отношения чисто физически или чисто
            формально, в то время как в духовном и интеллектуальном плане они
            для него уже давно закончились.
          </UiText>

          <UiText>
            Демонстративно завышая свою этическую оценку, пытаясь представить
            себя лучше, чем он, как ему кажется, есть, Лидер пытается подсказать
            партнеру, как нужно с ним обращаться, как нужно формировать с ним
            отношения: только no-хорошему, только в самой доброжелательной
            форме.
          </UiText>

          <UiText>
            Нужно с утра до вечера говорить Лидеру о том, какой он добрый и
            хороший: это единственная возможность помочь ему справиться со
            своими этическими проблемами.
          </UiText>

          <UiText>
            Именно поэтому хорошие отношения у Лидера складываются только в
            партнерстве с его дуалом Лириком, который, от природы будучи наделен
            сильной интуицией и оптимизмом, позволяет себе роскошь воспринимать
            людей именно такими, какими они себя преподносят.
          </UiText>

          <UiText>
            Искренне восхищаясь талантами и достоинствами Лидера, Лирик резко
            завышает его самооценку, чем и поднимает авторитет Лидера в его
            собственных глазах.
          </UiText>

          <UiText>
            Лидер будет глубоко благодарен тому, кто убедит его в том, какой он
            в действительности хороший; тому, кто внушит ему, что он — самый
            лучший. Лидер всеми силами постарается подтвердить это мнение.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">5 — Внушаемая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_time" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чутьё</UiText>
              <UiText preset="body">Интуиция времени</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Лидер со свойственным ему напором и натиском органически не
            переносит неопределенности. Например, когда выяснение какого-либо
            актуального для него вопроса затягивается на неопределенное время.
          </UiText>

          <UiText>
            В такой период он очень нервничает, переживает. Ему кажется, что вся
            его жизнь поставлена на карту.
          </UiText>

          <UiText>
            Очень тяжело переживает вынужденное бездействие в период
            неопределенности. Очень уязвим в этот момент. Очень внушаем всякими
            прогнозами. Мрачных прогнозов всегда опасается. Именно поэтому
            многие представители этого типа склонны ко всяким суевериям,
            основывающимся на предсказаниях, гаданиях, приметах.
          </UiText>

          <UiText preset="large" color="role">
            Многие из них,особенно женщины, верят астрологическим прогнозам и
            стараются в соответствии с ними координировать свои планы и
            действия. Причем иногда им это даже помогает.
          </UiText>

          <UiText color="accent">
            Особенно, когда в прогнозе говорится: «На этой неделе не нужно
            выяснять отношений и волноваться по пустякам, а следует жить
            спокойно, побольше отдыхать и заниматься своим здоровьем».
          </UiText>

          <UiText>
            Примерно то же самое скажет Лидеру и его дуал Лирик, который всегда
            хорошо чувствует его эмоциональное состояние и всегда точно знает,
            что ему нужно; и даже самые мрачные новости Лирик преподносит с
            ободряющей улыбкой, как бы говоря о том, что все это временные
            неприятности и скоро пройдут.
          </UiText>

          <UiText>
            Лидер тяжело переносит вынужденное ожидание. Особенно ему неприятны
            этические отношения, вынуждающие на большой расход времени:
            например, когда его «динамят» или «раскручивают» на длительное и
            безрезультатное ухаживание.
          </UiText>

          <UiText>
            Этого Лидеры не любят и некоторые из них сразу предостерегают своих
            новых знакомых, чем могут для них обернуться такие «игры».
          </UiText>

          <UiText preset="large" color="role">
            Не любит непредвиденного расхода времени.
          </UiText>

          <UiText color="accent">
            Например, когда ему навязывают чужие проблемы, поскольку это
            занимает у него лишние время и силы.
          </UiText>

          <UiText>
            Лидеру вообще бывает трудно представить, каким запасом времени он
            располагает, как он это время может использовать, чем он может себя
            в это время занять.
          </UiText>

          <UiText>
            То ему кажется, что оно расходуется очень непродуктивно, и тогда
            Лидер уплотняет свой график, иногда ему кажется, что его время
            слишком перенасыщено какими-то делами, которые застряли на мертвой
            точке, и чтобы продвинуть их, опять же нужно время.
          </UiText>

          <UiText>
            У Лидера постоянно возникают проблемы с распределением времени для
            выполнения всей необходимой работы.
          </UiText>

          <UiText color="accent">
            Многие из представителей этого типа очень тщательно планируют свой
            день, стараются все намеченное выполнять, везде поспевать, никуда не
            опаздывать, и тем не менее постоянно возникают какие-то
            непредвиденные обстоятельства, сдвигающие их планы то в одну, то в
            другую сторону.
          </UiText>

          <UiText>
            Как любой сенсорик, Лидер стремится переделать максимум дел в
            единицу времени, что, разумеется, приводит к перегрузкам и
            перенапряжению.
          </UiText>

          <UiText>
            Но, к счастью для Лидера, у него есть такой великолепный
            консультант, как Есенин, превосходно разбирающийся в своевременности
            любого дела и любой работы, который всегда может напомнить Лидеру,
            что «работа не волк, в лес не убежит», и Лидер тут же замечает, что
            он действительно заработался и ему пора отдохнуть.
          </UiText>

          <UiText>
            Кроме того, Лирик всегда хорошо видит «критическое» время - время
            активных действий, время «решительного удара», время, когда
            «промедление смерти подобно».
          </UiText>

          <UiText>
            Есенин, как никто, умеет увидеть развитие этического потенциала
            человека во времени. Он всегда может точно ответить на вопрос: «Чего
            ожидать от этого человека?», «Откровенен ли он?», «Друг он или
            враг?».
          </UiText>

          <UiText>
            Во всех этих жизненно важных для себя ориентирах Лидер опирается на
            подсказку своего дуала Лирика.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">
            6 — Активационная функция
          </UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_emotions" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Желание</UiText>
              <UiText preset="body">Этика эмоций</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Подсознательно Лидер старается подчинять свои чувства рассудку, как
            и любой логик.
          </UiText>

          <UiText color="accent">
            Например старается, чтобы его настроение не сказывалось ни на
            работе, ни на его взаимоотношениях с подчиненными. Старается держать
            со всеми ровный, приветливый тон.
          </UiText>

          <UiText>
            К сожалению, Лидеру не всегда удаëтся выражать свои эмоции адекватно
            ситуации и это ему очень затрудняет общение. Слабая и уязвимая этика
            отношений создает проблемы и для его этики эмоций.
          </UiText>

          <UiText color="accent">
            Например, попадая в неловкую этическую ситуацию, Лидер иногда
            подолгу терпит психологический дискомфорт, и из-за этого его
            накопившиеся эмоции с удвоенной силой изливаются в совершенно другой
            обстановке, в самый неподходящий момент, по другому поводу и на ни в
            чем не повинного человека.
          </UiText>

          <UiText>
            Лидер очень страдает от эмоционального противоречия между тем, каким
            он себя ощущает и каким старается себя преподнести. Лидер — это
            всегда глубокая и пылкая эмоциональность под маской суровой
            сдержанности и невозмутимости.
          </UiText>

          <UiText preset="large" color="role">
            Положительные эмоции Лидера — это его глубочайшая, интимнейшая
            тайна, которую он и ближайшему партнеру не выдаст.
          </UiText>

          <UiText color="role">
            Отрицательные эмоции изливает сколько угодно, на кого угодно и при
            первом же удобном случае.
          </UiText>

          <UiText>
            Положительных эмоций часто стесняется: боится показаться смешным,
            нелепым, слабым, зависимым, уязвимым.
          </UiText>

          <UiText>
            За необузданные отрицательные эмоции тоже себя ругает, опасается
            неприятных для себя последствий, боится за свой авторитет, может
            сожалеть о том, что обидел человека несправедливо.
          </UiText>

          <UiText>
            Лидер склонен к состраданию, но и самолюбование благородными
            порывами для него тоже очень характерно. Более того, для него
            гораздо важнее именно продемонстрировать свой этический потенциал:
            ведь так ему гораздо легче обратить внимание на свои достоинства и
            задать нужный тон своим отношениям.
          </UiText>

          <UiText>
            Именно поэтому, замечание о том, что добро нужно делать
            недемонстративно, Лидер может воспринимать очень болезненно — как
            упрек в свой адрес, как критику мотивов своего поведения, как
            «камешек в свой огород».
          </UiText>

          <UiText>
            К счастью, для представителей этого типа, существует такая
            «этическая отдушина», как религия, поощряющая их на самые благие
            побуждения, активизирующая на самые положительные эмоции и
            позволяющая им творить добро в той форме, в какой для них это всего
            удобнее и естественнее.
          </UiText>

          <UiText>
            Кроме того, религия помогает им реализовать свои самые глубокие и
            потому еще нерастраченные чувства. Если рядом нет достойного их
            любви человека, то хорошо, что есть кому поверить свои самые
            сокровенные мысли и желания. Причем выражения своих чувств в этом
            случае можно и не стесняться.
          </UiText>

          <UiText>
            Еще одна возможность не стесняться выражения своих чувств — это
            творчество на актерском и музыкальном поприще: здесь Лидер проявляет
            себя в полном блеске своей силы и своего темперамента.
          </UiText>

          <UiText>
            Лидер часто ощущает себя одиноким и непонятым человеком, поэтому
            стесняется проявлять свои истинные эмоции в обществе малознакомых
            ему людей, чаще всего он пытается подключить свое настроение к
            общему эмоциональному тону, но и это у него не всегда получается —
            нередко «фальшивит», что бывает очень заметно и не всегда приятно
            окружающим.
          </UiText>

          <UiText>
            Иногда, попадая в новую компанию, Лидер часто некстати берет на себя
            роль «массовика-затейника», характерно для мужчин и не всегда удачно
            шутит, что приводит к очень неприятным последствиям. Бывает, что
            совершенно необоснованно берет на себя роль лидера и очень
            обижается, когда его «ставят на место»: может вспылить и даже
            полезть в драку.
          </UiText>

          <UiText>
            Иногда — наоборот: демонстративно не поддается общему веселью,
            держится обособленно, напускает на себя неприступно-невозмутимый
            вид, «сидит как поповна на смотринах», характерно для женщин.
          </UiText>

          <UiText preset="large" color="role">
            Лидер неприятно говорить о своих чувствах и переживаниях - это для
            него глубоко личная и интимная тема.
          </UiText>

          <UiText>
            Он не знает, как об этом сказать: боится сфальшивить, боится
            показаться смешным или слишком необузданным.
          </UiText>

          <UiText>
            Действительно, любая попытка вести себя неестественно (не в
            соответствии со своим настроением) почти всегда оборачивается для
            Лидера неприятными последствиями: стоит ему слишком увлечься своей
            ролью, как его поведение сразу же начинает выглядеть нелепым,
            неуместным, а иногда и выходить за рамки приличий.
          </UiText>

          <UiText color="role">
            Кстати, о приличиях: с этим у Лидера нередко возникают серьезные
            затруднения. И не потому, что он не знает, как себя вести или
            недостаточно хорошо воспитан — тут как раз все обстоит благополучно.
          </UiText>

          <UiText>
            Все, что ему нужно знать, — он всегда знает. Но стоит Лидеру хоть
            немного расслабиться, а в гостях это чаще всего и происходит, как он
            сразу же начинает «выпадать из своей роли» и очень этим
            обстоятельством смущаться, а следовательно, и реагировать на любые
            замечания очень обостренно.
          </UiText>

          <UiText preset="large" color="role">
            Достаточно кому-либо из присутствующих неадекватно прореагировать на
            его шутку или высказывание, и его эмоциональность тут же переходит
            границы дозволенного.
          </UiText>

          <UiText>
            И если именно в этот момент Лидеру напомнить о приличиях, он
            способен полностью потерять контроль над своими словами и
            поступками. Возможно, поэтому многие Лидеры стараются не
            расслабляться в гостях, а предпочитают принимать их у себя дома, где
            чувствуют себя гораздо спокойнее и увереннее.
          </UiText>

          <UiText>
            Лидеры сами же страдают от собственной вспыльчивости, всегда
            сожалеют о своей несдержанности: о том, что наговорили сгоряча много
            лишнего, о том, что кого-то обидели и кто-то о них теперь плохо
            подумает.
          </UiText>

          <UiText>
            Многие, особенно женщины, стараются поскорее загладить свою вину.
            Часто подолгу ругают себя за собственный «трудный» характер, не
            знают, к кому бежать советоваться по этому вопросу. Понимают, что
            это серьезнейшая проблема их коммуникабельности.
          </UiText>

          <UiText>
            Положение спасает присутствие дуала Лидера — Лирика, который всегда
            умеет задать легкий и непринужденный тон общения, умеет разрядить
            обстановку, умеет сгладить чью-то неловкость и переключить внимание
            на что-то более приятное и интересное. Лирик для каждого найдет
            тактичный комплимент и приветливое слово.
          </UiText>

          <UiText>
            Только в обществе Лирика Лидер может по-настоящему расслабиться и
            получить нужную этическую поддержку. Рядом с Лириком Лидер буквально
            отдыхает душой.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">7 — Функция защиты</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_comfort" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Комфорт</UiText>
              <UiText preset="body">Сенсорика ощущений</UiText>
            </span>
          </div>

          <UiText>
            В этом аспекте наблюдаются некоторые различия между мужчинами и
            женщинами, представляющими этот тип.
          </UiText>

          <UiText>
            Мужчина-Лидер вынослив и непривередлив. Не тратит время на создание
            особого уюта. Старается, чтобы в его комнате было более-менее чисто,
            вещи — на своих местах, пища — питательная и здоровая. И этого ему
            вполне достаточно.
          </UiText>

          <UiText>
            Одевается удобно и неброско. Придерживается определенного
            нейтрального стиля, не подверженного колебаниям моды.
          </UiText>

          <UiText>
            Иное дело женщины-Лидеры: расходуют массу сил, времени и внимания на
            создание домашнего уюта. В доме неукоснительно поддерживается
            образцовый порядок, особенно к приходу гостей.
          </UiText>

          <UiText>
            Все «намыто-наглажено», все «блестит». Добротная мебель «под
            старину», множество декоративных дополнений — фарфор-хрусталь,
            салфеточки-занавесочки, большие картины на стенах, большие «фикусы»
            в кадках - словом, все как «у людей», все как полагается.
          </UiText>

          <UiText preset="large" color="role">
            Великолепно готовят, прекрасно пекут, обожают заготавливать соленья
            и варенья впрок.
          </UiText>

          <UiText>
            У многих свои дачные участки, где они проводят все выходные.
            Рукодельницы и «на все руки умелицы». Сами себе шьют, следят за
            модой, но и придерживаются собственного стиля, отдают предпочтение
            ярким, но благородным тонам. Любят музыку, искусство. Женщина-Лидер
            — это всегда и «добрая работница и петь-плясать охотница».
          </UiText>

          <UiText>
            Эстетика Лидера ярче всего проявляется в национальном русском
            фольклоре. Это всегда добротно сработанное и нарядно-вычурное
            декоративно-прикладное искусство, ярко расцвеченное, богато
            отделанное золотом.
          </UiText>

          <UiText>
            Это и своеобразный песенный фольклор, где особое место уделяется
            «наболевшим» этическим проблемам, современный «городской романс»,
            где проходит тема «любви-злодейки» и «бедовой девчоночки», которая
            вроде бы и всем хороша, а вот в любви не везет.
          </UiText>

          <UiText preset="large" color="role">
            Лидеры не умеют говорить о любви, но они не могут о ней не петь.
          </UiText>

          <UiText>
            Женщина-Лидер — это та, что «коня на скаку остановит, в горящую избу
            войдет». Способна на исключительное самопожертвование. Проявляет
            чудеса выносливости и терпения. Способна день-деньской тянуть свою
            «лямку» безропотно и ни на что не жалуясь. Не любит ныть, не любит
            болеть, не любит раскисать.
          </UiText>

          <UiText>
            Во время болезни Лидеру особенно трудно общаться, он сам пугается
            собственного недомогания и собственной слабости — ему кажется, что
            он теперь таким навсегда и останется.
          </UiText>

          <UiText color="role">
            Всегда старается быть бодрым, энергичным, подтянутым, чего бы ему
            это ни стоило
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">8 — Фоновая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_business" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Практика</UiText>
              <UiText preset="body">Сенсорика ощущений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Лидер — самый практичный из всех типов личности. Любое свое действие
            стремится объяснить соображениями целесообразности.
          </UiText>

          <UiText>«Я никогда не делаю бесполезных вещей».</UiText>

          <UiText>
            Демонстративно практичен. Никто лучше и точнее Лидера не умеет
            оценивать товарные качества вещей, никто лучше его не увидит их
            достоинств и недостатков.
          </UiText>

          <UiText color="role">
            Лидер обладает самой лучшей памятью на «товарные» качества предмета
            — его цену, форму, цвет, запах, вкус.
          </UiText>

          <UiText preset="large" color="role">
            Невозможно заставить Лидера заплатить за вещь больше, чем она того
            стоит. Более того, Лидер никогда не позволит себя «раскрутить» на
            лишние, в его понимании, расходы. Никогда не сделает невыгодных
            приобретений.
          </UiText>

          <UiText>
            Независимо от уровня доходов Лидера всегда живет в ладу со своим
            бюджетом, из-за чего иногда производит впечатление человека
            обеспеченного, но «прижимистого».
          </UiText>

          <UiText>
            Очень экономно ведет хозяйство, старается, чтобы оно было
            «безотходным», чтобы ничего лишнего не выбрасывалось.
          </UiText>

          <UiText>
            Например, хозяйка-Лидер может собирать оставшиеся кусочки мыла,
            чтобы использовать их в стирке наряду со стиральным порошком.
            Хозяйка-Лидер может попытаться найти способ использовать одноразовую
            вещь вторично, а если это не получится, все равно найдет ей
            какое-нибудь применение в хозяйстве.
          </UiText>

          <UiText preset="large" color="role">
            О том, чтобы выбрасывать продукты, Лидер и помыслить не может! Лидер
            покупает продукты по самой дешевой цене и только такие, которые
            употребляются в пищу с минимальным количеством отходов.
          </UiText>

          <UiText color="role">
            Очень бережно относится к своим вещам, подолгу и аккуратно носит
            одежду, строго разделяя ее на домашнюю и выходную. Нарядная и
            добротная одежда «на выход»; простенькая, но практичная — «для
            дома».
          </UiText>

          <UiText>
            Лидер умеет и любит работать. Старается в любом деле достичь самой
            высокой квалификации, выполняет работу очень быстро и качественно.
          </UiText>

          <UiText color="accent">
            «Наибольшая из всех безнравственностей — это браться за дело,
            которое не умеешь делать»
          </UiText>

          <UiText>
            Любит продемонстрировать свое умение всегда действовать точно и
            сообразно обстоятельствам. Лидер — это тот, который всегда знает
            «как надо».
          </UiText>

          <UiText>
            Поручив какое-либо задание, всегда предельно четко его объясняет.
            Если сотрудник не все понимает с одного раза, будет объяснять
            столько, сколько нужно, до тех пор, пока его не поймут,
            подсознательный расчет на слабую деловую логику Лирика.
          </UiText>

          <UiText color="role">
            Не позволит поступить наперекор своим объяснениям. Очень обижается,
            если к нему лишний раз не обращаются за объяснениями. Воспринимает
            это как заниженную оценку, вынесенную его деловым качествам.
          </UiText>

          <UiText preset="large" color="role">
            Лидеру очень важно, чтобы хвалили его работу и ставили в пример
            другим. Иногда ему кажется, что он только для этого и работает.
          </UiText>

          <UiText>
            При том, что Лидер терпеть не может разгильдяйства и халатности, он
            способен снисходительно относиться к ошибкам своих служащих, при
            условии, что они проявляют в работе усердие или хотя бы видимость
            его. Этим Лидер помогает своему дуалу Лирику проявить хотя бы
            видимость деловой инициативы, хоть как-то реализовать свои деловые
            качества.
          </UiText>

          <UiText>
            Когда Лидер предполагает добиться чьего-либо расположения, он не
            дожидается, пока его попросят о помощи — он сам с готовностью
            предлагает свои услуги.
          </UiText>

          <UiText>
            Лидер обожает решать бытовые проблемы людей, чью благодарность и
            дружбу он хотел бы заслужить. Ему очень нравится выглядеть
            человеком, у которого «все схвачено».
          </UiText>

          <UiText>
            Будучи сориентированным на слабую деловую логику Лирика, Лидер
            полагает, что лучший способ завоевать доверие и любовь человека —
            это предложить ему самую действенную помощь в решении его конкретных
            бытовых проблем.
          </UiText>

          <UiText>
            Поэтому, если услужливость Лидера кому-то кажется слишком навязчивой
            или не совсем правильно воспринимается окружающими, он всегда это
            очень болезненно переживает и считает это своим очередным этическим
            промахом.
          </UiText>

          <UiText>
            Лирик — единственный из всех типов личности, кто с восторгом и
            глубокой признательностью воспримет щедрую и искреннюю заботу
            Лидера, кто никогда не перестает восхищаться его деловыми качествами
            и его самоотверженным трудом.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
