<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <div class="warning">
      <UiText preset="small" color="accent">
        Если вы не умеет воспринимать юмор, обидчивы или зависимы от мнений
        незнакомцев, пожалуйста, не читайте все что ниже.
      </UiText>

      <UiText preset="small" color="accent">
        Ненормативная лексика и сексуальные темы, оскорбление чувств всех
        причастных. Но весело и остроумно. Соблюдена авторская орфография и
        пунктуация.
      </UiText>
    </div>

    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Люркмор"
          subtitle="2 минуты"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Селютин"
          subtitle="4 минуты"
          target-content-id="tab-2"
        />

        <VariousTab
          title="Эльвира Фея"
          subtitle="2 минуты"
          target-content-id="tab-3"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText color="accent">
            <i>
              небыдло, ОБВМ, СПГС, козёл отпущения, задрот, омега, кудере,
              хикки, интеллигент, internet white knight, веган
            </i>
          </UiText>

          <UiText preset="large" color="role">
            Гуманист всю жизнь страдает за всё человечество. Это мешает ему
            устроить свою жизнь. Сестра милосердия, кондуктор, художник,
            наклейщик марок на конверты — вот те профессии, что не мешают
            Гуманисту думать о вечном.
          </UiText>

          <UiText>
            Синдром поиска глубинного смысла — довольно для него характерное
            явление, они ищут тонкий смысл везде и во всём. Несмотря на
            задумчивость и самоуглублённость, весьма наблюдателен, и имеет
            неприятное свойство между делом подмечать то, что вы предпочли бы
            скрыть.
          </UiText>

          <UiText>
            Илитист до мозга костей, считает практически всех тех, кто его
            окружает непроходимым быдлом. Учит всех жить правильно, хотя сам
            жить не умеет вообще, за что справедливо считается оторванным от
            жизненных реалий занудой.
          </UiText>

          <UiText preset="large" color="role">
            Многие Гуманисты на этих ваших нервных срывах становятся склонными к
            самокритике и негативно настроенными суицидниками. При определённых
            обстоятельствах может запросто стать героем.
          </UiText>

          <UiText>
            Победители опроса «Какой тип чаще всего попадает в рай после
            смерти?».
          </UiText>

          <UiText>
            Страшно боится совершить ошибку, поэтому замучает всех и каждого
            вопросами о том, как ему лучше сделать то или иное дело. В
            результате всё у него всё равно выйдет через жопу, несмотря на то,
            что он очень старался.
          </UiText>

          <UiText>
            Неоправданно считается самым асексуальным ТИМом. Это объясняется
            тем, что Гуманист мужского пола часто может отказаться от прямого
            предложения перепихнуться, после чего уязвлённая девица уверенно
            будет рассказывать всем, что он гей и импотент.
          </UiText>

          <UiText>
            В близких, доверительных отношениях таки любят поебаться, но по
            определённым причинам немногим из них удаётся таких отношений
            достичь. То, что большинство Гуманистов не ищет лёгких путей к
            наслаждению и влюбляется в недуалов, только усугубляет ситуацию и
            приводит к баттхерту.
          </UiText>

          <UiText>Частая жертва «зоны дружбы».</UiText>

          <UiText>Интегральный тип Дании и Белоруссии.</UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">Бочка меда</UiText>
          <UiText preset="large" color="role">
            Таки нехило разбирается в людях и хорошо видит их проблемы и
            способности.
          </UiText>
          <UiText preset="small" color="accent">Ложка дегтя</UiText>
          <UiText preset="large" color="accent">
            С практической точки зрения, самый бестолковый тип: ни денег
            заработать, ни врагу морду набить, ибо даже к врагу зачастую
            испытывает бессмысленное сострадание.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="large" color="role">
            Томный сноб. Тормоз. Всепрощение и морализм, сочетающиеся самым
            удивительным образом. Душевный мазохизм. Ищет мораль там, где надо
            просто радоваться жизни.
          </UiText>

          <UiText>
            Те ещё зануды, кого угодно своей добротой изнасилуют, да ещё и
            сделают всё так, что виноватым себя почувствуешь.
          </UiText>

          <UiText>
            Гуманистки как только посчитают мужика своим, то всё — мягко так его
            раком ставят, а чуть что так сразу обиды.
          </UiText>

          <UiText preset="large" color="role">
            И конечно, болеть и ещё раз болеть — своими болячками они любого
            здоровяка в гроб загонят.
          </UiText>

          <UiText>
            А вот на мочение мужиков Гуманистов (хотя мужик и Гуманист редко
            когда совпадает) никаких сортиров не жалко: все, как один, кого-то
            из себя корчат, все в «масках», все чего-то тужатся, и этим только
            всем жить мешают.
          </UiText>

          <UiText>
            Так остро чувствует и остро переживает из-за всякой ерунды, что
            теряет чувство реальности. Поэтому дерется очень больно, часто —
            ногами.
          </UiText>

          <UiText preset="large" color="role">Сомнения до последнего.</UiText>

          <UiText>
            Руки растут не оттуда, откуда надо, испортят при любой работе в
            хозяйстве все, что можно испортить, и не помогает критика любимого
            Администратора — Гуманист посылает его лесом и уходит на диван.
          </UiText>

          <UiText>
            Лентяи, бесятся при любой работе и всячески её избегают, особенно
            ту, которая не делается в течении 5 секунд (не шутка, а чистая
            правда).
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Страшная самоуверенность в сочетании с потребностью в уважении
            (комплекс шестёрки).
          </UiText>

          <UiText>
            Отвратительный педагог. Классический вариант Мужа на диване. Жесток
            к своей семье, при этом внутренняя жестокость потрясающе
            маскируемая, наличие сентиментальности.
          </UiText>

          <UiText preset="large" color="role">
            Вот только «скользкие», убегают при попытке к ним приблизиться...
            Нацисты-националисты, наверное, в первую очередь из них получаются.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-3" class="tab">
        <section>
          <UiText preset="large" color="role">
            А Гуманисты — они, сука, жалостливые и сердобольные сволочи, которым
            непременно надо быть в каждой бочке дегтя медовой затычкой.
          </UiText>

          <UiText>
            И мед этот, знаете, тягучий такой и липкий, а уж сладкий настолько,
            что у вас быстро развивается диабет третьей степени.
          </UiText>

          <UiText>
            У Гуманистов есть три состояния — они или учат жизни, или умиляются,
            или плачут.
          </UiText>

          <UiText>
            Последнее состояние случается регулярно, ибо огорчает их все подряд,
            от несовершенства этого мира до неправильного цвета пуговиц на вашем
            халате, обидеть их куда легче, чем отнять конфету у ребенка, а вот
            успокоить проблематично, и ныть Гуманист будет до того момента, пока
            вы не сделаете всего, что он хотел изначально, а потом еще немножко.
          </UiText>

          <UiText>
            Доброта из Гуманиста так и прет, и изливается словесным поносом на
            всех окружающих.
          </UiText>

          <UiText>
            Что самое паскудное — в 100 из 100 случаев толку от Гуманистов ноль,
            но зато они будут так долго капать вам на мозг и сожалеть, что не
            могут помочь, что вы сами в итоге оторвете жопу от дивана и
            попретесь по указанному им адресу поздравлять ненавистных
            родственников, кормить бездомных или покупать себе же полезную
            зелень для диетического супа (который Гуманист заставит вас
            приготовить под своим чутким руководством).
          </UiText>

          <UiText preset="large" color="role">
            С виду они походят на святых, посланных в этот жестокий мир, чтоб
            его спасти, и обожают порассуждать о судьбах мироздания и пороках,
            захлестнувших современную молодежь.
          </UiText>

          <UiText>
            При более внимательном взгляде Гуманист — классические гнилые
            интеллигенты в очках на сломанной дужке, пользы никакой, но поныть и
            попризывать к насаждению доброго и вечного огненным мечом — это
            завсегда, особенно если бороться со злом будет кто-то другой,
            нередко Хранитель или Администратор, коего по болевой легко развести
            на жалость, чем Гуманист беззастенчиво пользуется.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
