<template>
  <div class="text g-page">
    <section>
      <UiText preset="subtitle" color="accent">Сильные стороны</UiText>

      <UiText preset="large" color="role">
        Общителен и эмоционален. Способен найти подход к любому человеку в
        случае необходимости.
      </UiText>

      <UiText>
        В этом ему помогает природная обаятельность и дипломатичность. Говорит
        комплименты, стремится делать людям приятное.
      </UiText>

      <UiText>
        Разбирается в способностях людей. Хорошо чувствует их скрытые побуждения
        и недостатки. Способен даже предсказывать поведение окружающих.
      </UiText>

      <UiText preset="large" color="role">
        Тянется к незаурядным людям, интересуется всем необычным и загадочным.
        Увлекшись какой-либо идеей, охотно её рекламирует, становясь её активным
        сторонником.
      </UiText>

      <UiText>
        Впечатлителен и отзывчив, сочувствует людям, любит давать им советы в
        сложных жизненных ситуациях. Эмоционален, нуждается в постоянном притоке
        новых впечатлений.
      </UiText>

      <UiText>
        Стрессоустойчив, в экстремальных условиях мобилизуется, может дать
        решительный отпор. В случае неудачи переживает её бурно, но недолго.
      </UiText>

      <UiText>Любит красивые вещи, стремится оригинально одеваться.</UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">Проблемы</UiText>

      <UiText>
        Из-за желания поддерживать со всеми хорошие отношения перегружает себя
        лишними контактами. Доверчив по натуре, в разговоре может порой
        рассказать лишнее.
      </UiText>

      <UiText>
        Быстро разочаровывается в объектах своих симпатий. Может быть
        экзальтированным, сильно зависит от настроения.
      </UiText>

      <UiText>
        Не любит регламентации и строгих правил, стесняющих его независимость.
      </UiText>

      <UiText>
        Противник иерархии и чинопочитания. Не приемлет условностей и
        предрассудков.
      </UiText>

      <UiText preset="large" color="role">
        Довольно неорганизован и непрактичен. Часто не успевает сделать
        намеченное к сроку, так как склонен отвлекаться на второстепенные дела.
      </UiText>

      <UiText>
        Порой ему не хватает терпения и тщательности, не всегда доводит начатое
        до конца.
      </UiText>

      <UiText>
        Осуждает грубых и невоспитанных людей, однако сам бывает вспыльчив,
        несдержан, порой даже агрессивен.
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Нельзя требовать и ожидать
      </UiText>

      <UiList iconName="chevron-right" iconColor="accent" iconSize="16">
        <UiListItem>Качественного выполнения кропотливой работы.</UiListItem>

        <UiListItem>Систематического ведения документации.</UiListItem>

        <UiListItem>Высокой самоорганизованности.</UiListItem>

        <UiListItem>
          Умения эффективно руководить другими людьми и распределять
          обязанности.
        </UiListItem>

        <UiListItem>
          Безэмоционального поведения в конфликтных ситуациях.
        </UiListItem>
      </UiList>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Подходящие виды деятельности
      </UiText>

      <UiText>
        Желательная сфера применения способностей — гуманитарная, в том числе
        педагогика, искусство, журналистика, семейное психологическое
        консультирование, служба знакомств, а также имиджмейкерство и реклама.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
