<template>
  <div class="text g-page">
    <section>
      <UiText preset="subtitle" color="accent">Сильные стороны</UiText>

      <UiText preset="large" color="role">
        Имеет хорошее аналитическое мышление, сильно развитую логику. Умеет
        выделить главное и отсечь второстепенное в анализируемом материале.
      </UiText>

      <UiText>
        Любит обобщать факты, хорошо разбирается в схемах, классификациях и
        структурах.
      </UiText>

      <UiText>
        Реально оценивает практические возможности предпринимаемого дела, не
        упускает из виду альтернативы. Сторонник дисциплины и порядка,
        основанных не на административном нажиме, а на совести, долге, личной
        ответственности.
      </UiText>

      <UiText preset="large" color="role">
        По натуре добр, но дело ставит выше личных интересов и отношений.
      </UiText>

      <UiText>
        Человек слова, ценит справедливость, разумный порядок во всем. Хороший
        докладчик, умеющий кратко и доходчиво донести материал до слушателя.
      </UiText>

      <UiText>
        Стремится к независимости, но дает собой руководить людям, умеющим
        уговаривать мягко, но настойчиво.
      </UiText>

      <UiText>
        Хорошо чувствует время, на мероприятия и встречи обычно приходит
        пунктуально.
      </UiText>

      <UiText>
        Осторожен, чувствует опасность. Редко выходит из себя. Демократичен,
        терпим к иным точкам зрения.
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">Проблемы</UiText>

      <UiText>
        Недостаточно гибок в отношениях. Предпочитает говорить о том, что его
        интересует, посторонние подробности в речи собеседника пропускает мимо
        ушей.
      </UiText>

      <UiText>
        Если тема ему неинтересна, старается уйти от разговора, так как не
        желает тратить время попусту. Не любит делать несколько дел сразу,
        особенно в спешке.
      </UiText>

      <UiText>
        Неэкономен, не всегда оценивает выгодность и полезность того, что
        делает. Долго колеблется перед принятием важного решения по сложному
        вопросу.
      </UiText>

      <UiText>
        Может проявлять упрямство и бескомпромиссность. Не терпит, чтобы им
        командовали, хладнокровно отвергает волевое давление. Скрытен, не любит
        обсуждать свою личную жизнь.
      </UiText>

      <UiText preset="large" color="role">
        Не терпит, когда ограничивают его свободу, выражают необоснованные
        требования.
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Нельзя требовать и ожидать
      </UiText>

      <UiList iconName="chevron-right" iconColor="accent" iconSize="16">
        <UiListItem>Большой практичности и мобильности.</UiListItem>

        <UiListItem>
          Чувствительности, тонкой пристройки к собеседнику.
        </UiListItem>

        <UiListItem>
          Качественного выполнения рутинной работы, неинтересной для него
          самого.
        </UiListItem>

        <UiListItem>Коммуникабельности.</UiListItem>

        <UiListItem>«Пробивных» качеств.</UiListItem>
      </UiList>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Подходящие виды деятельности
      </UiText>

      <UiText>
        Научно-исследовательская и аналитическая работа (анализ сложных явлений
        и объектов).
      </UiText>

      <UiText>
        Разработка новых идей для практического применения. Может работать
        хорошо везде, где требуется системный анализ, построение схем и
        классификаций, выдвижение концепций.
      </UiText>

      <UiText>В системе MBTI этот тип называют «реорганизатор бизнеса».</UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
