<template>
  <div class="text g-page">
    <section>
      <UiText preset="large" color="role">
        Ваша сильная сторона — это предприимчивость в новых делах и начинаниях.
        Новое, нужное дело вы начинаете с большим азартом, не жалея сил для
        достижения результата.
      </UiText>

      <UiText>
        Вы — человек практического ума, умеете сориентировать любую теорию или
        идею на практическую пользу.
      </UiText>

      <UiText>
        Вы принимаете деятельное участие при внедрении в жизнь новых технологий.
        Вы не склонны размениваться по мелочам, вас особенно привлекают крупные
        цели и проекты.
      </UiText>

      <UiText>
        Вас можно назвать человеком действия, так как вы не откладываете
        выполнение своих решений в долгий ящик. Вы быстро, без раскачки
        включаетесь в новое дело и стараетесь довести его до конца.
      </UiText>

      <UiText>
        Вы — оптимист, верящий в успех начатого дела. Своими планами вы охотно
        делитесь с окружающими; любите испытывать себя в различных сферах
        деятельности, смело идете на риск, готовы к преодолению любых
        трудностей.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        В жизни вы постоянно сталкиваетесь с проблемами в организации
        повседневного быта. Для отдыха у вас часто не хватает времени. Несмотря
        на приверженность к здоровому образу жизни, вы нерегулярно заботитесь о
        своем здоровье.
      </UiText>

      <UiText>
        Совмещайте полезное с приятным, не сосредоточивайтесь чрезмерно на
        каком-то одном занятии.
      </UiText>

      <UiText>
        Соблюдайте рациональный режим жизни, совмещая работу с отдыхом.
        Займитесь оздоровительным бегом.
      </UiText>

      <UiText>
        Будьте более внимательны к своему внешнему виду, не пренебрегайте
        мнением окружающих о вас.
      </UiText>

      <UiText>
        Уделяйте больше внимания своим домашним делам. Проявляйте чаще заботу о
        близких, посвящайте им больше своего личного времени, делайте им
        приятные сюрпризы, вникайте в их проблемы.
      </UiText>

      <UiText>
        Старайтесь воспитывать в себе эстетический вкус. Не приносите в жертву
        свой внешний вид даже во имя целей, которые кажутся вам более важными.
      </UiText>

      <UiText preset="large" color="role">
        Не злоупотребляйте экстравагантными выходками, особенно осторожно
        касайтесь интимных тем, не стремитесь обратить на себя внимание таким
        образом: окружающие могут неправильно вас понять.
      </UiText>

      <UiText>
        Сами того не желая, вы можете нарушить непринужденную атмосферу общения,
        поставив себя и друзей в неловкое положение.
      </UiText>
    </section>

    <section>
      <UiText>
        Другая ваша проблема связана с двусмысленным юмором и шутками, которые
        не всегда могут быть правильно восприняты и поняты.
      </UiText>

      <UiText preset="large" color="role">
        Будьте тактичны и скромны в своих высказываниях. Не стремитесь поднять
        людям настроение любой ценой. Помните, что не все любят шутливый тон, а
        тем более иронию или насмешки.
      </UiText>

      <UiText>
        Избегайте излишней эмоциональной фамильярности в общении, воспитывайте в
        себе вежливость и хорошие манеры. Это повысит вашу самооценку и вызовет
        уважение окружающих.
      </UiText>

      <UiText preset="large" color="role">
        Не идите на конфронтацию по несуществующим вопросам — этим вы можете
        противопоставить себя большинству и потерять уважение.
      </UiText>

      <UiText>
        Не давайте поспешного выхода своим эмоциям, не допускайте, чтобы ваши
        действия опережали мысли.
      </UiText>

      <UiText>
        Лучше удалитесь от объекта вашего раздражения на время и, успокоившись,
        все обдумав, выскажите ему своё мнение при очередной встрече.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
