<template>
  <div class="text g-page">
    <section>
      <UiText preset="subtitle" color="accent">Сильные стороны</UiText>

      <UiText preset="large" color="role">
        Стремится к полезным, рациональным действиям. Экономен, тщателен в
        работе, добросовестен и исполнителен.
      </UiText>

      <UiText>
        Эрудирован, много читает и размышляет. Помнит прочитанное в подробностях
        и образно пересказывает окружающим.
      </UiText>

      <UiText>
        Имеет сильную интуицию, благодаря которой может предвидеть итог
        затеваемого дела. Хорошо оценивает степень риска, часто дает советы
        проявлять осторожность и осмотрительность, чтобы избежать неожиданностей
        и неприятностей.
      </UiText>

      <UiText preset="large" color="role">
        Хорошо чувствует логические просчеты в любой системе. Пунктуален, если
        этого от него требуют.
      </UiText>

      <UiText>
        Скромен в быту и одежде, однако ценит комфорт и уют. Вежлив в общении.
        Обладает чувством юмора, умеет утешить отчаявшихся.
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">Проблемы</UiText>

      <UiText>
        Скептик по природе, замечает все противоречия и несовершенства
        окружающего мира.
      </UiText>

      <UiText>
        Подвержен частым сомнениям и колебаниям. Ему плохо дается внутреннее
        равновесие. Не умея управлять своим настроением, бывает то излишне
        придирчивым и ворчливым, то добрым и уступчивым.
      </UiText>

      <UiText>
        Его эмоции отражаются на окружающих. Из-за своей скрупулезности не
        всегда успевает доводить начатое до конца.
      </UiText>

      <UiText>
        Осторожен и нерешителен в новых начинаниях. Не любит спешить, суетиться;
        недоверчиво относится к людям, забегающим вперед.
      </UiText>

      <UiText preset="large" color="role">
        Бывает упрям и несговорчив, если уверен в своей правоте, которую он
        доказывает фактами.
      </UiText>

      <UiText>
        Прямому волевому воздействию не подчиняется. Не любит делать
        комплименты, считает более честным говорить о недостатках.
      </UiText>

      <UiText>
        Ему трудно проявлять волевое давление или уговаривать что-либо сделать.
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Нельзя требовать и ожидать
      </UiText>

      <UiList iconName="chevron-right" iconColor="accent" iconSize="16">
        <UiListItem>Оперативности в делах.</UiListItem>

        <UiListItem>
          Смелости и решительности в экстремальных ситуациях.
        </UiListItem>

        <UiListItem>Заботливости и гостеприимства.</UiListItem>

        <UiListItem>Эмоционального сопереживания.</UiListItem>
      </UiList>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Подходящие виды деятельности
      </UiText>

      <UiText>
        Научно-исследовательская деятельность прикладного характера:
        программирование, математика и физика, макроэкономика, концептуальный
        анализ сложных проблем, оценка степени риска, экспертиза и прогноз, а
        также философия, история и археология, архивная и библиотечная работа.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
