<template>
  <div class="text g-page">
    <section>
      <UiText preset="large" color="role">
        Наиболее развитой стороной вашей личности является способность
        испытывать сильные чувства и эмоции.
      </UiText>

      <UiText>
        Вы — человек со сложным духовным миром, полным контрастов и
        противоречий. Ради истинных, глубоких чувств вы можете пожертвовать
        многим.
      </UiText>

      <UiText>
        Свойственная вам поэтичность натуры позволяет выразить испытываемые вами
        чувства в образной форме, часто драматической, иногда трагической.
      </UiText>

      <UiText>
        Вы можете обладать талантом оратора, умеющего зажечь речью большое
        количество людей, даже если вы об этом не подозреваете.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Вас можно назвать человеком дальновидным и предусмотрительным. Вы хорошо
        чувствуете назревание кризиса в развитии событий и умеете принять меры
        заранее, чтобы избежать его.
      </UiText>

      <UiText>
        Окружающих вы также стремитесь предупредить о возможных неприятностях,
        грозящих им. В этом находит выражение общая гуманитарная направленность
        вашей личности.
      </UiText>

      <UiText preset="large" color="role">
        Вы — человек довольно принципиальный, не прощаете несправедливых обид и
        унижений. Ради этого, все обдумав и взвесив, вы способны предпринять
        самые решительные меры.
      </UiText>

      <UiText>
        Однако в некоторых случаях ваша принципиальность может быть негибкой, а
        решительность чрезмерной.
      </UiText>

      <UiText>
        Стремитесь проявлять сдержанность в экстремальных ситуациях, принимать
        решения в спокойном состоянии.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Ваша основная проблема — неумение избегать ситуаций, доставляющих
        страдания и неприятные ощущения.
      </UiText>

      <UiText>
        Вам не всегда легко вписаться в новое общество, уйти от неприятного
        общения с неинтересными людьми
      </UiText>

      <UiText preset="large" color="role">
        Вы не всегда можете положиться на свой вкус, не умеете правильно, а
        главное, вовремя проследить за своим здоровьем.
      </UiText>

      <UiText>
        Для вас характерно неумение найти внутреннее равновесие с самим собой.
        Избегайте излишней драматизации событий.
      </UiText>

      <UiText>
        Разряжайте накопившиеся эмоции в художественном творчестве, в
        самодеятельности: пении, игре на музыкальных инструментах, театральном
        искусстве.
      </UiText>

      <UiText>
        Не стремитесь произвести впечатление во что бы то ни стало. От этого
        могут пострадать ваши интересы или здоровье.
      </UiText>

      <UiText>
        Одевайтесь в соответствии с погодой, соблюдайте последовательность в
        приеме блюд, отдавайте преимущество здоровой пище.
      </UiText>

      <UiText>
        Старайтесь, чтобы ваш облик и стиль одежды соответствовали конкретной
        обстановке.
      </UiText>

      <UiText>
        Не будьте так недоверчивы к комплиментам и оценке вашей внешности. Не
        ищите в этом подвоха. Чтобы не воспринимать болезненно повышенный
        интерес к себе, старайтесь как можно чаще работать открыто, на людях.
      </UiText>

      <UiText preset="large" color="role">
        Больше доверяйте людям, не думайте, что они хотят вам плохого.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Еще одна ваша проблема — это не всегда успешное проявление своих деловых
        качеств, желание показать себя предприимчивым, активным человеком. Не
        преувеличивайте значимость своей деловой инициативы.
      </UiText>

      <UiText>
        Всегда задавайте себе вопрос, насколько реальны ваши призывы к действию,
        могут ли они привести к конкретным положительным результатам.
      </UiText>

      <UiText>
        Преодолевайте в себе нежелание считаться с повседневными конкретными
        делами, в том числе домашними. Конкретнее формулируйте свои проблемы, не
        будьте навязчивыми по отношению к другим людям.
      </UiText>

      <UiText>
        Ваше общение с людьми может быть затруднено также из-за проявления
        излишней официальности.
      </UiText>

      <UiText preset="large" color="role">
        Избегайте высокомерия, будьте более демократичны и просты с людьми, не
        злоупотребляйте иронией и насмешками.
      </UiText>

      <UiText>
        Ваша склонность к сарказму может обидеть людей и отвернуть их от вас.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
