<template>
  <div class="text g-page">
    <section>
      <UiText preset="large" color="role">
        Вашей сильной стороной является конкретная логика, то есть скрупулезное
        изучение любого вопроса и тщательная подготовка любого мероприятия.
      </UiText>

      <UiText>Вы — человек ответственный, не бросающий слов на ветер.</UiText>

      <UiText>
        Для вас характерно стремление к порядку, дисциплине, соблюдению четких
        норм и правил. Вы нетерпимы ко всякого рода расхлябанности,
        безответственности.
      </UiText>

      <UiText>
        Вы — человек рассудка, руководствуетесь в своих решениях логикой, а не
        эмоциями. Вы склонны к глубокой проработке конкретных областей
        деятельности.
      </UiText>

      <UiText preset="large" color="role">
        Вам свойственна настойчивость и целеустремленность. Нет сомнения, что вы
        — хороший администратор, всегда контролирующий правильность выполнения
        принятых решений. Вы также сторонник применения мер дисциплинарного
        воздействия к людям, не выполняющим своих обязанностей.
      </UiText>

      <UiText>
        Вы уважаете авторитеты, пользуетесь только надежными источниками
        информации. Вы бескомпромиссны в выполнении своего долга,
        дисциплинированны, исполнительны, собранны, следите за порядком в быту и
        на производстве.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Одна из ваших основных проблем — неуверенность в ситуациях, требующих
        ломки устоявшихся взглядов без ясных перспектив, недоверчивость к
        неожиданным идеям и предложениям, требующим отказа от ценностей
        прошлого, альтернативности.
      </UiText>

      <UiText>
        В таких случаях может возникнуть чувство приближения хаоса,
        нестабильности, потери ориентиров.
      </UiText>

      <UiText preset="large" color="role">
        Постарайтесь, взвесив все за и против, отказаться от прежних
        стереотипов.
      </UiText>

      <UiText>
        Изучайте все новое, нетрадиционное, чтобы новые идеи не застали вас
        врасплох. Больше доверяйте людям, не ищите причин своих неудач в чьих-то
        преднамеренных кознях.
      </UiText>

      <UiText preset="large" color="role">
        Не предъявляйте ко всем одинаковых требований, помните: у всех разные
        способности от природы. Старайтесь выработать индивидуальный подход к
        каждому.
      </UiText>

      <UiText>
        Если вы являетесь начальником, не сковывайте проявление творческой
        инициативы подчиненных. Не контролируйте каждый их шаг.
      </UiText>

      <UiText preset="large" color="role">
        Не стремитесь зарекомендовать себя перед начальством за счет соблюдения
        всех, даже морально устаревших постановлений и инструкций.
      </UiText>

      <UiText>
        Расширяйте круг своих интересов и увлечений, не сосредоточивайтесь на
        чем-то одном. Умерьте свой реализм в критике нового, отклоняющегося от
        норм и правил.
      </UiText>

      <UiText>
        Помните, что самые передовые идеи в своё время не были зафиксированы ни
        в одном справочнике.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Другая ваша проблема — перепады, неровности в общении с людьми. У вас
        бывают неестественные, резкие переходы от демонстрации любезности и
        чуткости к проявлениям властности и требовательности.
      </UiText>

      <UiText>
        Помните о том, что вам свойственно при очень близких отношениях
        проявлять несдержанность и даже грубость.
      </UiText>

      <UiText>
        Старайтесь поддерживать с людьми ровные, в меру сдержанные отношения,
        чтобы не доводить возможные недоразумения и конфликты до драматической
        развязки.
      </UiText>

      <UiText preset="large" color="role">
        Не теряйте чувства меры в отношениях с людьми: не будьте ни чрезмерно предупредительны, не слишком навязчивы со своими проблемами.
      </UiText>

      <UiText>
        Не считайте других обязанными вам помогать.
      </UiText>

      <UiText>
        Не утомляйте людей излишними поучениями и морализаторством. Даже если вы правы, своим назидательным тоном вы рискуете нажить себе недоброжелателей.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
