<script setup lang="ts">
import PageHeaderWidget from "@widgets/PageHeaderWidget.vue";
</script>

<template>
  <div class="page">
    <PageHeaderWidget iconName="document" title="Совместимость психогрупп" />

    <UiText>
      От психосексуальности зависит их поведение как в отношениях, так и
      непосредственно в постели.
    </UiText>

    <UiText>
      Дуальные пары всегда состоят из агрессора и виктима или заботливого и
      инфантила, что логично — именно эти сочетания являются оптимальными, в них
      партнёры соответствуют запросам друг друга и могут дать друг другу то, что
      им надо.
    </UiText>

    <hr />

    <UiText preset="subtitle" color="accent">Гармоничные отношения</UiText>

    <div>
      <UiSvg name="aggressor" size="48" color="pink" />
      <UiSvg name="victim" size="48" color="yellow" />
      <UiText preset="subtitle">Агрессор и виктим</UiText>
      <UiText color="accent">Идеальные «кошки-мышки»</UiText>
    </div>

    <UiText preset="large" color="accent">
      Отношения напоминают игру в «кошки-мышки».
    </UiText>

    <UiText>
      Причём, что немаловажно, «мышка» заинтересована в том, чтобы её поймали,
      не меньше, чем «кошка», и поймать её должен данный конкретный хищник.
    </UiText>

    <UiText>
      Вопреки распространённому заблуждению, виктим вовсе не горит желанием
      подчиняться кому ни попадя.
    </UiText>

    <UiText preset="large" color="accent">
      Это жертва, которая всегда сама выбирает себе охотника. Это гармоничные
      взаимоотношения.
    </UiText>

    <UiText>
      Здесь нет места манипуляциям, так как каждый в паре даёт другому именно
      то, что ему нужно.
    </UiText>

    <UiText>
      Виктим постоянно проверяет на прочность себя и партнёра, а агрессору
      нравится завоёвывать, ведь удовольствие охотника не в том, чтобы жертва
      сама приползла к нему, а в том, чтобы преодолеть её сопротивление.
    </UiText>

    <UiText>
      Агрессор говорит: «Я хочу», подразумевая «И возьму». Виктим отвечает:
      «Попробуй» и это означает согласие.
    </UiText>

    <UiText preset="large" color="accent">
      Секс в данной паре, построенный на доминантности и противоборстве,
      страстный, даже жесткий.
    </UiText>

    <UiText>
      Агрессор говорит: «Я хочу», подразумевая «И возьму». Виктим отвечает:
      «Попробуй» и это означает согласие.
    </UiText>

    <UiText>
      Виктим завлекает агрессора, провоцирует охоту на себя и не дается.
      Заставляет агрессора проявлять силу и упорство, добиваться, несмотря на
      отказ или игнорирование, и наслаждается доказательством того, что его
      хотят.
    </UiText>

    <UiText>
      Агрессор, в свою очередь, ищет сложную цель, ему нравится, когда его
      дразнят и распаляют. Для этих отношений характерно взаимное сексуальное
      напряжение, нагнетание его для последующего чувственного взрыва и
      разрядки.
    </UiText>

    <UiText preset="small" color="accent">
      Агрессорско-виктимские отношения часто путают что в корне неверно. Суть
      отношений в БДСМ — в добровольности, в заранее оговорённых ролях. Здесь же
      никто не обязан по умолчанию подчиняться, как, впрочем, и подчинять.
    </UiText>

    <UiText preset="small" color="accent">
      Что касается БДСМ, предрасположенность к нему не зависит от типа
      информационного метаболизма, так что не стоит проводить никаких
      параллелей.
    </UiText>

    <UiText preset="small" color="accent">
      Виктим может быть садистом, инфантил — доминантом, а суровый агрессор —
      сабмиссивом-мазохистом.
    </UiText>

    <UiText preset="large" color="accent">
      Это ни в коем случае не отношения раба и хозяина — партнёры всегда
      равноправны.
    </UiText>

    <hr />

    <div class="block-title">
      <UiSvg name="caring" size="48" color="green" />
      <UiSvg name="childlike" size="48" color="turquoise" />
      <UiText preset="subtitle">Заботливый и инфантил</UiText>
      <UiText color="accent">Гармоничные «дочки-матери»</UiText>
    </div>

    <UiText preset="large" color="accent">
      Гармоничные взаимоотношения, построенные на взаимном согласии.
    </UiText>

    <UiText>
      Это не обязательно нежность и уси-пуси вообще, но борьба как таковая
      отсутствует.
    </UiText>

    <UiText>
      Заботливый не стремится завоевать партнёра агрессивными методами. Он
      спрашивает: «Ты хочешь?» и инфантил отвечает: «Хочу». Если же он говорит
      «не хочу», то это не провокация, а вполне серьезное объяснение.
    </UiText>

    <UiText>
      И, напротив, инфантилам особенно может быть тяжело озвучить своё желание:
      они его смущаются, предоставляя инициативу заботливому.
    </UiText>

    <UiText>
      Инфантил стремится получать всевозможные удовольствия и
      экспериментировать, заботливый же проявляет чувства в том, чтобы
      удовлетворять все его капризы, и они могут далеко в этом зайти.
    </UiText>

    <UiText preset="large" color="accent">
      Ценностью является комфорт, как физический так и психологический и
      отсутствие ограничений.
    </UiText>

    <UiText>
      Возможна универсальность, отсутствие четкой привязки к тому, кто будет
      сверху.
    </UiText>

    <UiText preset="large" color="accent">
      Секс в этой паре оценивается не как всплеск, вспышка, страсть, а как
      поддержка, тепло, еще один способ выражения привязанности и любви.
    </UiText>

    <UiText>
      Совсем не обязательно он будет исключительно нежным, но и устраивать в
      постели сафари они вряд ли будут.
    </UiText>

    <UiText preset="large" color="accent">
      Разве что для разнообразия — они ценят эксперименты.
    </UiText>

    <hr />

    <UiText preset="subtitle" color="accent">Негармоничные отношения</UiText>

    <div>
      <UiSvg name="aggressor" size="48" color="pink" />
      <UiSvg name="caring" size="48" color="green" />
      <UiText preset="subtitle">Агрессор и заботливый</UiText>
      <UiText color="accent">Рубить траву неинтересно</UiText>
    </div>

    <UiText preset="large" color="accent">
      Отношения агрессора и заботливого далеко не так гармоничны. Оба имеют
      разные цели.
    </UiText>

    <UiText>
      Агрессор, настроенный на виктима, будет стремиться подчинить партнёра, в
      то время как заботливый этого не приемлет.
    </UiText>

    <UiText>
      Вероятней всего, он в силу своего стремления договориться миром и отдавать
      начнет исполнять для агрессора роль виктима, но будет при этом разочарован
      попытками насадить тиранию, нежеланием и неумением воспринимать
      равноправный диалог, как это будет выглядеть с его точки зрения.
    </UiText>

    <UiText>
      В сексе заботливый будет прислушиваться к желаниям агрессора, но тот хочет
      захватывать и завоевывать, а не получать просто так, и будет испытывать
      скуку.
    </UiText>

    <UiText>
      В то же время заботливый не приемлет сильных, но грубых ласк.
    </UiText>

    <UiText preset="large" color="accent">
      Лишенная прелюдии силовая эротическая игра угнетает его сексуальность. Оба
      останутся недовольны друг другом.
    </UiText>

    <hr />

    <div>
      <UiSvg name="aggressor" size="48" color="pink" />
      <UiSvg name="childlike" size="48" color="turquoise" />
      <UiText preset="subtitle">Агрессор и инфантил</UiText>
      <UiText color="accent">Насилие над детьми</UiText>
    </div>

    <UiText preset="large" color="accent">
      В этих отношениях тоже нет понимания.
    </UiText>

    <UiText>
      Инфантил, настроенный на то, что его желаниями интересуются, будет
      чувствовать себя ущемленным агрессором.
    </UiText>

    <UiText>
      Провокации инфантила, уверенного, что его капризы и проказы будут
      удовлетворены и прощены будут восприняты агрессором как виктимная
      провокация и призыв к активным действиям по их преодолению и подавлению.
    </UiText>

    <UiText>
      Но когда он начнёт действовать, инфантил вместо приятия, начнет
      сопротивляться по-настоящему.
    </UiText>

    <UiText>
      Ведь его «не хочу» означает именно «не хочу», а не «попробуй, возьми».
    </UiText>

    <UiText preset="large" color="accent">
      Это недопонимание приведет к тому, что оба будут испытывать эмоциональный
      дискомфорт из-за ощущения принуждения.
    </UiText>

    <hr />

    <div>
      <UiSvg name="victim" size="48" color="yellow" />
      <UiSvg name="caring" size="48" color="green" />
      <UiText preset="subtitle">Виктим и заботливый</UiText>
      <UiText color="accent">Обслуживание тюремной камеры</UiText>
    </div>

    <UiText preset="large" color="accent">
      В этих отношениях виктим будет провоцировать заботливого.
    </UiText>

    <UiText>
      Тот, чтобы угодить партнёру, начнет проявлять агрессию, ему
      несвойственную, давить на виктима, как тот того хочет, но виктим не будет
      ему подчиняться в силу неуверенности заботливого в своем праве на то.
    </UiText>

    <UiText>
      Заботливый будет недоволен тем, что не может удовлетворить партнера, никак
      не может ему угодить, и виктим не желает идти на примирение, а виктим
      будет видеть слабость в стремлении к комфорту.
    </UiText>

    <UiText preset="large" color="accent">
      Таким образом, оба останутся недовольны.
    </UiText>

    <hr />

    <div>
      <UiSvg name="victim" size="48" color="yellow" />
      <UiSvg name="childlike" size="48" color="turquoise" />
      <UiText preset="subtitle">Виктим и инфантил</UiText>
      <UiText color="accent">Ребенок с пистолетом</UiText>
    </div>

    <UiText preset="large" color="accent">
      Виктим вполне может соблазнить инфантила поиграть в агрессора.
    </UiText>

    <UiText>
      В силу их любви к экспериментам, но вскоре понадобится исполнение и других
      его желаний, а виктим будет продолжать требовать завоевывать его и
      подчинять.
    </UiText>

    <UiText preset="large" color="accent">
      Инфантил устанет нести агрессорские обязанности, начнет капризничать, что
      вызовет непонимание и разочарование у виктима.
    </UiText>

    <hr />

    <div>
      <UiSvg name="aggressor" size="48" color="pink" />
      <UiSvg name="aggressor" size="48" color="pink" />
      <UiText preset="subtitle">Два агрессора</UiText>
      <UiText color="accent">Железные дровосеки</UiText>
    </div>

    <UiText preset="large" color="accent">
      Эта пара может создать впечатление сумасшедшей страсти в постели, однако
      это заблуждение.
    </UiText>

    <UiText>
      Оба настроены действовать одинаково, оба хотят наслаждаться подчинением,
      но для каждого из них подчинение его самого неприятно или даже невозможно.
    </UiText>

    <UiText preset="large" color="accent">
      Каждый из них настроен брать. Поэтому и тот, кто сверху, и тот кто снизу
      будут вести себя равно, и не равно не получать того, чего оба хотят.
    </UiText>

    <UiText>
      Агрессор, в отличие от виктима, не умеет создавать эмоциональное
      напряжение, сексуальную обстановку, он может только отвечать и
      действовать.
    </UiText>

    <UiText preset="large" color="accent">
      Таким образом, этот секс будет агрессивным, но механическим, без ярких
      чувств.
    </UiText>

    <hr />

    <div>
      <UiSvg name="victim" size="48" color="yellow" />
      <UiSvg name="victim" size="48" color="yellow" />
      <UiText preset="subtitle">Два виктима</UiText>
      <UiText color="accent">Прикованы к кровати и некому спеть</UiText>
    </div>

    <UiText preset="large" color="accent">
      Отношений в этой паре — тоже игра, но отнюдь неприятная обоим.
    </UiText>

    <UiText>
      Это игра в то, кто кого перевиктимит, что будет раздражать каждого из них.
    </UiText>

    <UiText>
      Одному из них придется взять на себя роль агрессора, начать проявлять
      сексуальную инициативу, чего виктим делать не умеет и не хочет, и каждый
      будет пытаться перекинуть это на партнера.
    </UiText>

    <UiText>
      Им обоим не удастся испытать себя на прочность, ощутить опасность, через
      которую проявляется доверие.
    </UiText>

    <UiText preset="large" color="accent">
      Чувство незащищенности, недостатка сильной руки выразится во взаимных
      скандалах, неудовлетворении друг другом.
    </UiText>

    <hr />

    <div>
      <UiSvg name="caring" size="48" color="green" />
      <UiSvg name="caring" size="48" color="green" />
      <UiText preset="subtitle">Два заботливых</UiText>
      <UiText color="accent">
        Забота в обе стороны, которая никому не нужна
      </UiText>
    </div>

    <UiText preset="large" color="accent">
      В отсутствие провокатора к сексуальным отношениям они будут искать
      предложения друг в друге.
    </UiText>

    <UiText>
      Но ни один из них не нуждается в том, что они могут отдавать, что в итоге
      приведет к ощущению недооцененности.
    </UiText>

    <UiText preset="large" color="accent">
      У одного или обоих партнеров собственные сексуальные стремления останутся
      нереализованными.
    </UiText>

    <hr />

    <div>
      <UiSvg name="childlike" size="48" color="turquoise" />
      <UiSvg name="childlike" size="48" color="turquoise" />
      <UiText preset="subtitle">Два инфантила</UiText>
      <UiText color="accent">Показывать письки на балконе</UiText>
    </div>

    <UiText preset="large" color="accent">
      Вполне вероятно, что до секса дело так и не дойдет.
    </UiText>

    <UiText>
      Если же они окажутся в одной постели, то каждый будет уверен в том, что
      именно его фантазии им следует исполнять, что именно его должны ублажать.
    </UiText>

    <UiText preset="large" color="accent">
      Оба будут считать своего партнера нечутким.
    </UiText>
  </div>
</template>

<style scoped lang="scss">
@use "@shared/styles/variables/colors";

.page {
  display: flex;
  flex-direction: column;
  gap: 16px;
  padding-left: 12px;
  padding-right: 12px;

  hr {
    margin-top: 16px;
    margin-bottom: 16px;
    opacity: 0.2;
    background-color: colors.$accent;
  }
}

a {
  text-decoration: underline;
}
</style>
