<script setup lang="ts">
import PageHeaderWidget from "@widgets/PageHeaderWidget.vue";
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="page g-page">
    <PageHeaderWidget iconName="time" title="История" />

    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab title="Карл" target-content-id="tab-1" />

        <VariousTab title="Кэтрин" target-content-id="tab-2" />

        <VariousTab title="Антон" target-content-id="tab-3" />

        <VariousTab title="Аушра" target-content-id="tab-4" />

        <VariousTab title="Григорий" target-content-id="tab-5" />
      </template>

      <VariousTabContent id="tab-1" class="page g-page">
        <UiText preset="subtitle" color="accent">
          Психические функции, Карл
        </UiText>

        <div class="person">
          <NuxtImg
            src="/images/history/carl-gustav.webp"
            loading="lazy"
            class="portrait"
          />
          <div class="person-text">
            <UiText preset="subtitle">Карл Густав Юнг</UiText>

            <UiText preset="small" color="accent">1875 — 1961, Цюрих</UiText>
          </div>
        </div>

        <UiText>
          Ввёл в психологию понятия «психических функций», характеристики
          индивидуальных психических процессов которые в комбинации с его же
          «психическими установками» позволяют описать различные «типы
          личности».
        </UiText>

        <UiText preset="large" color="accent">
          Описал четыре психические функции — мышление, чувство, ощущение,
          интуиция и две психические установки — интроверсия и экстраверсия.
        </UiText>

        <UiText>
          Полагая, что «чистых» экстравертов и интровертов не бывает, считал,
          что у каждого человека одна из этих установок преобладает.
        </UiText>

        <hr />

        <UiText preset="large" color="accent">
          Четыре психологических типа и две психологические установки дают
          восемь наглядных психологических типов.
        </UiText>

        <UiList iconName="chevron-right" iconColor="accent" iconSize="16">
          <UiListItem>
            Интуиция передаёт субъекту восприятие бессознательным путём.
            Предметом такого восприятия может быть всё — и внешние, и внутренние
            объекты или их сочетания.
          </UiListItem>

          <UiListItem>
            Мышление следует своим собственным законам, приводит данные
            содержания представлений в понятийную связь.
          </UiListItem>

          <UiListItem>
            Ощущение — восприятие, совершающееся посредством органов чувств.
          </UiListItem>

          <UiListItem>
            Чувства придает содержанию известную ценность в смысле принятия или
            отвержения его. Чувство основано на оценочных суждениях: хорошо —
            плохо, красиво — некрасиво.
          </UiListItem>
        </UiList>

        <hr />

        <UiText preset="large">Цитата из книги «Психологические типы»:</UiText>

        <UiText color="accent">
          Сознательное психическое есть средство для адаптации и ориентации и
          состоит из ряда различных психических функций. Среди них можно
          выделить четыре основных: ощущение, мышление, чувство, интуиция.
        </UiText>

        <UiText color="accent">
          В ощущение я включаю всё восприятие с помощью чувственных органов; под
          мышлением я имею в виду функцию интеллектуального познания и
          формирования логических заключений; чувство — функция субъективной
          оценки; интуицию я понимаю как восприятие с помощью бессознательного
          или восприятие бессознательных содержаний.
        </UiText>

        <UiText preset="large" color="accent">
          Настолько, насколько позволяет мой опыт, эти четыре базовые функции
          кажутся мне достаточными, чтобы выразить и представить все
          многочисленные виды сознательной ориентации.
        </UiText>

        <UiText color="accent">
          Мышление должно тщательно исключать чувство, если только оно желает
          быть настоящим, верным своему принципу мышлением.
        </UiText>

        <UiText color="accent">
          Но в таком случае речь идёт не о дифференцированном типе, а о
          сравнительно неразвитом мышлении и чувстве.
        </UiText>

        <UiText color="accent">
          Равномерная сознательность и бессознательность функций есть,
          следовательно, признак примитивного состояния духа.
        </UiText>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="page g-page">
        <UiText preset="subtitle" color="accent">Дочки-матери типологии</UiText>

        <div class="person">
          <NuxtImg
            src="/images/history/briggs.webp"
            loading="lazy"
            class="portrait"
          />
          <div class="person-text">
            <UiText preset="subtitle">Кэтрин и Изабель Бриггс</UiText>

            <UiText preset="small" color="accent">1875 — 1968, США</UiText>
          </div>
        </div>

        <UiText>
          Бриггс училась дома у своего отца. Утверждала, что она не помнит, кто
          научил её писать, но он или она сделали это плохо.
        </UiText>

        <UiText>
          Она никогда не посещала формальную школу, пока не уехала в колледж в
          возрасте четырнадцати лет.
        </UiText>

        <UiText>
          Бриггс получила степень в сельском хозяйстве и стала известным ученым
          в то время, когда считалось, что слишком много образования для женщин
          вредит их репродуктивным способностям.
        </UiText>

        <UiText>
          Бриггс изучила данные исследований современных детских теорий
          образования и социального развития.
        </UiText>

        <UiText>
          Она создала для детей тест по призванию. Она видела в этом ключ к
          будущему счастью и благополучию ребенка.
        </UiText>

        <hr />

        <UiText preset="large" color="accent">
          Ее ранние исследования привели к тому, что в 1917 году она
          идентифицировала 4 основных типа личности: медитативные типы,
          спонтанные типы, исполнительные типы и коммуникативные типы, которые
          позже превратились в термины MBTI.
        </UiText>

        <UiText>
          Однако, исследуя работы различных философов, ученых и психологов, она
          не смогла выделить одну окончательную теорию типа, охватывающую все
          аспекты.
        </UiText>

        <UiText preset="large" color="accent">
          Из-за недостатка открытий она решила выделить свою собственную теорию
          типа.
        </UiText>

        <UiText>
          В 1923 году Бриггс прочла работу Карла Юнга и представил его своей
          дочери. Его теория сосредоточена на врожденных различиях между людьми
          в том, что касается принятия ими решений и получения информации.
        </UiText>

        <UiText>
          Она была вдохновлена на написание эротической фантастики о Юнге.
          Прочитав «Психологические типы» Юнга, Бриггс отказалась от
          собственного создания теории личности и начала более глубоко
          фокусироваться на идеях Юнга.
        </UiText>

        <UiText>
          Изабель, изначально не интересовавшаяся типологическими
          исследованиями, изменила своё мнение, когда она столкнулась с работой,
          в которой пытались определить тип работы людей, соответствующий их
          характеру.
        </UiText>

        <UiText>
          Она решила объединить усилия с мамой. Кэтрин и Изабель находились под
          сильным влиянием Юнга и решили, что его идеи могут помочь людям
          сделать лучший жизненный выбор и представить индивидуальные различия в
          позитивном свете.
        </UiText>

        <UiText>
          С этого момента они начали двадцатилетний период наблюдений. В 1945
          году Кэтрин и Изабель с помощью Лаймана Бриггса провели первое
          обследование студентов медицинской школы Джорджа Вашингтона. Помня о
          ранней работе своей матери во время Второй мировой войны, Изабель
          создала тест, который поможет определить подходящую для человека
          работу, связанную с войной.
        </UiText>

        <hr />

        <UiText>
          Бриггс и её ранние исследования типов личности сыграли важную роль в
          создание одного из самых известных и широко используемых инструментов
          личности, индикатора типа Майерс-Бриггс — MBTI.
        </UiText>

        <UiText>
          Сегодня он используется в таких широких областях, как развитие
          руководителей и семейное консультирование.
        </UiText>

        <UiText preset="large" color="accent">
          Поскольку в 1962 году он был официально добавлен к коллекции тестов
          Службы образовательного тестирования, по оценкам, 50 миллионов человек
          прошли MBTI.
        </UiText>

        <UiText>
          MBTI классифицирует типы личности по четырем парам категорий. Кэтрин и
          Изабель утверждали, что каждый вписывается в одну из 16 возможных
          комбинаций типов личности с преобладающим предпочтением в каждой из
          четырех пар.
        </UiText>

        <UiText>
          Структура теста практически не изменилась с тех пор, как Бриггс
          впервые её разработала.
        </UiText>

        <UiText>
          MBTI подвергается критике со стороны некоторых, кто утверждает, что
          Бриггс разработала оценку у себя дома до проведения каких-либо
          обширных научных исследований, а не наоборот.
        </UiText>
      </VariousTabContent>

      <VariousTabContent id="tab-3" class="page g-page">
        <UiText preset="subtitle" color="accent">Польский метаболизм</UiText>

        <div class="person">
          <NuxtImg
            src="/images/history/anton.webp"
            loading="lazy"
            class="portrait"
          />
          <div class="person-text">
            <UiText preset="subtitle">Антон Кемпинский</UiText>

            <UiText preset="small" color="accent">1918 — 1972, Краков</UiText>
          </div>
        </div>

        <UiText>
          Польский психиатр, психолог, философ. Первым начал внедрять в Польше
          новый гуманистический подход в психиатрии и психотерапии. Был одним из
          первых исследователей, которого заинтересовали психологические
          проблемы бывших узников нацистских лагерей смерти.
        </UiText>

        <UiText preset="large" color="accent">
          Получил известность своими работами по теории
          энергетическо-информационного метаболизма.
        </UiText>

        <UiText>
          Ряд положений концепции информационного метаболизма были использованы
          в психиатрической аксиологии.
        </UiText>

        <UiText>
          Аутизм Кемпинский рассматривал как фактор, приводящий к прекращению
          обмена информации с внешним миром у страдающего шизофренией, и,
          соответственно, прекращению информационного метаболизма.
        </UiText>

        <UiText>
          При аутизме происходит прекращение информационного обмена с миром, что
          в итоге приводит к заточению в мире личных переживаний,
          «психологической бесплодности» и «шизофренической пустоте».
        </UiText>

        <hr />

        <UiText preset="large">
          Цитата из книги «Экзистенциальная психиатрия»:
        </UiText>

        <UiText color="accent">
          В сигнальном метаболизме, то есть в получении информации из окружения
          и реагировании на неё (реакция организма, в свою очередь, является
          сигналом для окружения), существуют законы, аналогичные законам
          энергетического метаболизма, а именно, закон специфичности структуры и
          закон равновесия между анаболическими и катаболическими процессами.
        </UiText>

        <UiText preset="large" color="accent">
          Подобно тому, как субстанции, ассимилируемые организмом, разбиваются
          на основные элементы из которых организм строит собственную структуру,
          потоки информации, поступающие извне, преобразуются в специфические
          структуры —отсюда правильность утверждения, что каждый живёт в своем
          собственном мире.
        </UiText>

        <UiText color="accent">
          Способность интеграции является одной из самых существенных черт
          нервной системы.
        </UiText>

        <UiText color="accent">
          Количество энергии, поступающей в организм благодаря его анаболическим
          процессам (построение), в общем, уравнивается с количеством энергии,
          выходящей благодаря процессам катаболическим (распада).
        </UiText>

        <UiText color="accent">
          Аналогично существует определённое равновесие между информацией,
          принимаемой из окружения, и высылаемой в него.
        </UiText>

        <UiText color="accent">
          Аналогии между энергетическим метаболизмом и информационным
          подтверждает верность известного выражения «психическое несварение»…
        </UiText>
      </VariousTabContent>

      <VariousTabContent id="tab-4" class="page g-page">
        <UiText preset="subtitle" color="accent">На задворках империи…</UiText>

        <div class="person">
          <NuxtImg
            src="/images/history/aushra.webp"
            loading="lazy"
            class="portrait"
          />
          <div class="person-text">
            <UiText preset="subtitle">Аушра Аугустинавичюте</UiText>

            <UiText preset="small" color="accent">1928 — 2005, Вильнюс</UiText>
          </div>
        </div>

        <UiText>
          Основоположница соционики — концепции типов личности и взаимоотношений
          между ними, основанной на типологии известного швейцарского психолога
          К. Г. Юнга и теории информационного метаболизма А. Кемпинского.
        </UiText>

        <UiText>
          В конце 60-х — начале 70-х годов познакомилась с типологией Юнга,
          теорией психоанализа Зигмунда Фрейда и теорией информационного
          метаболизма Антона Кемпинского на основе которых вместе с
          единомышленниками разработала теорию соционики.
        </UiText>

        <UiText>
          Сама Аугустинавичюте датой рождения соционики называла 1968 год, в
          котором она поняла, как можно расширить концепцию Юнга и построить
          8-компонентную модель психики (модель А).
        </UiText>

        <UiText>
          Позднее, в середине 1980-х годов, прочитав переведённую на русский
          язык книгу Б. Шнейдермана «Психология программирования: Человеческие
          факторы в вычислительных и информационных системах», узнала о
          существовании типологии Майерс-Бриггс и написала комментарий к тесту
          Майерс-Бриггс, обратив внимание на необходимость создания
          соционических тестов для диагностики типа информационного метаболизма.
        </UiText>

        <hr />

        <UiText preset="large">
          Цитата из книги «О дуальной природе человека»:
        </UiText>

        <UiText color="accent">
          Рождается новая наука соционика, наука о шестнадцатитипной природе
          людей и о закономерностях отношений между ними.
        </UiText>

        <UiText color="accent">
          Люди всегда мечтали жить в хороших отношениях с другими людьми,
          мечтали быть понятыми и хотели понимать других.
        </UiText>

        <UiText color="accent">
          Хотели видеть кругом доброжелательность и сами быть доброжелательными.
          Мечтали все, удавалось немногим.
        </UiText>

        <UiText color="accent">
          Сегодня мы знаем, что нельзя мечтать о по-настоящему гармоничной,
          мирной и творческой жизни общества и скрытых за своими типами
          закономерностей общения.
        </UiText>

        <UiText color="accent">
          Совершенно новым этапом в жизни общества будет такая его
          реорганизация, которая каждом человеку предоставит возможность для
          достаточного количества контактов с нужными для его психосоматического
          здоровья людьми.
        </UiText>

        <hr />

        <UiText preset="large">Цитата из книги «Социон»:</UiText>

        <UiText color="accent">
          Человеческий мозг, отражая внешний и внутренний мир индивидуума,
          обслуживает не только его самого, но и общество.
        </UiText>

        <UiText color="accent">
          Для удовлетворения своих нужд человеку необходимо представление о всей
          окружающей его действительности.
        </UiText>

        <UiText color="accent">
          В обслуживании социума люди кооперируются: обществу передаются
          представления индивида лишь о некоторых аспектах его действительности.
        </UiText>

        <UiText color="accent">
          Механизм этого явления,по нашим сегодняшним представлениям, достаточно
          прост: отдельные аспекты действительности отражаются в мозгу человека
          с разной степенью дифференциации и осознанности.
        </UiText>
      </VariousTabContent>

      <VariousTabContent id="tab-5" class="page g-page">
        <UiText preset="subtitle" color="accent">Математика психики…</UiText>

        <div class="person">
          <NuxtImg
            src="/images/history/grigoriy.webp"
            loading="lazy"
            class="portrait"
          />
          <div class="person-text">
            <UiText preset="subtitle">Григорий Рейнин</UiText>

            <UiText preset="small" color="accent">1951, Санкт-Петербург</UiText>
          </div>
        </div>

        <UiText>
          Рейнин доказал теорему, что 16 объектов можно поделить на две группы
          пополам пятнадцатью различными способами, и это будут те группы,
          которые описывают свойства личности.
        </UiText>

        <UiText>
          Эти математически выведенные признаки были изучены теоретически, как
          непосредственно вытекающие из моделей А ТИМов одного полюса признака,
          и путем наблюдений и экспериментов, которые проводила Аушра
          Аугустинавичюте у себя на даче в Литве.
        </UiText>

        <UiText preset="large" color="accent">
          В результате чего была выпущена работа Аушры «Теория признаков
          Рейнина».
        </UiText>

        <UiText>
          Заслуга Рейнина состоит в том, что он математически доказал
          существование признаков, а Аушра осуществила их первоначальное
          наполнение.
        </UiText>

        <hr />

        <UiText preset="large">Что пишет сам Григорий:</UiText>

        <UiText color="accent">
          Под влиянием работ Аушры Аугустинавичуте «Социон» и «Дуальная природа
          человека» появилась моя чисто математическая работа под названием:
          «Признаки дихотомии Социона».
        </UiText>

        <UiText color="accent">
          На самом деле основным инициирующим моментом для меня стал признак
          аристократы-демократы. Он был ортогонален каждому из признаков Юнга, И
          мне стало интересно сколько ещё чисто формально таких признаков
          существует.
        </UiText>

        <UiText color="accent">
          В результате получилась 16-и элементная математическая группа,
          состоящая из 15-и попарно ортогональных и единичного признаков. Я
          предположил, что все эти признаки, как и признаки Юнга, входящие в эту
          группу, могут иметь психологическую семантику и разработал план
          эксперимента. Аушра с энтузиазмом восприняла эту идею и организовала
          такой эксперимент в своем имении в Запишкисе.
        </UiText>

        <UiText color="accent">
          Эксперимент состоялся 1-3 августа 1987-го года. На эксперименте были
          проведены наблюдения за всеми 15-ю дихотомиями. В ситуации участвовала
          группа испытуемых около 25-и человек с определёнными типами. Все типы
          определяла сама Аушра. Многие из этих людей были её давнишними
          знакомыми.
        </UiText>

        <UiText color="accent">
          Тогда в Запишкисе был собран полный социон. Группа экспертов состояла
          из четырёх человек: Аушра Аугустинавичуте, Николай Медведев, Лариса
          Кобринская и Григорий Рейнин. Время от времени к группе экспертов
          подключался кто-то из испытуемых, не занятых в эксперименте (иногда Г.
          А. Шульман). Социон разбивали на две группы по 8 типов и давали им
          какое-то задание. Эксперты наблюдали за этими группами и описывали
          свои наблюдения, а участники писали самоотчеты. Такой метод называется
          «методом обратной задачи».
        </UiText>

        <UiText preset="large">
          Вклад Рейнина в соционику и объяснение сложных перепитий человеческой
          психики трудно недооценить.
        </UiText>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style scoped lang="scss">
@use "@shared/styles/variables/colors";

.page {
  hr {
    margin-top: 16px;
    margin-bottom: 16px;
    opacity: 0.2;
    background-color: colors.$accent;
  }

  .person {
    display: flex;
    gap: 16px;
    padding-bottom: 24px;
    border-bottom: solid 1px colors.$grey;
  }
}

.portrait {
  width: 128px;
  border-radius: 4px;
}

a {
  text-decoration: underline;
}
</style>
