<script setup lang="ts">
import { UiText } from "@shared/ui";
import PageHeaderWidget from "@widgets/PageHeaderWidget.vue";
</script>

<template>
  <div class="page">

    <PageHeaderWidget iconName="square-3" title="Информационный метаболизм" />

    <UiText preset="subtitle" color="accent">
      Суть
    </UiText>

    <UiText preset="large" color="accent">
      Информационный метаболизм — это процесс усвоения, обработки и передачи информации психикой человека. 
    </UiText>

    <UiText>
      Польский психиатр Антон Кемпинский впервые сравнил этот процесс с обменом веществ в организме.
    </UiText>

    <UiText>
      Так же, как пища расщепляется, усваивается и перерабатывается, поступая в клетки, внешние информационные сигналы проходят через психику, преобразуются, частично остаются внутри и формируют внутренний мир человека, а частично передаются вовне для взаимодействия с окружающей средой.
    </UiText>

    <UiText preset="large" color="accent">
      Кемпинский считал, что психика человека зависит от постоянного поступления информации, так же как организм зависит от питания. 
    </UiText>

    <UiText preset="large" color="accent">
      Если поток информации прекращается, начинается дезинтеграция психики — разрушение целостности восприятия.
    </UiText>

    <UiText>
      Информация поступает в мозг в виде сигналов, которые вызывают энергетические импульсы. Каждая система принимает только те сигналы, которые способна воспроизводить.
    </UiText>

    <UiText>
      Это значит, что человек воспринимает лишь ту информацию, которую в состоянии осознать и передать дальше. 
    </UiText>

    <UiText color="dark-grey">
      Например, если он не замечает, каким тоном говорит, то не обращает внимания и на интонации окружающих.
    </UiText>

    <hr class="separator" />
    
    <UiText preset="subtitle" color="accent">
      Процесс
    </UiText>

    <UiText>
      Весь процесс информационного метаболизма можно разделить на несколько категорий. 
    </UiText>

    <UiText>
      Одна группа сигналов связана с динамическими процессами — движением, изменениями в пространстве, действиями, которые не только сообщают о настоящем, но и позволяют предсказать будущее поведение.
    </UiText>

    <UiText>
      Другая группа — это сигналы о внутренних состояниях людей, эмоциях, настроении, реакции на происходящее.
    </UiText>

    <UiText>
      Статическая информация также делится на два типа: восприятие внешних характеристик объектов, позволяющее определить их форму, размеры и опасность, и понимание внутренних структур, закономерностей и потенциальных возможностей.
   </UiText>

   <hr class="half" />

    <UiText >
      Аушра Аугустинавичюте, развивая идеи Кемпинского, выделила четыре основные психические функции, через которые человек воспринимает и обрабатывает информацию. 
    </UiText>

    <UiText>
      Логика отвечает за анализ внешних процессов и закономерностей. 
    </UiText>

    <UiText>
      Этика воспринимает внутренние состояния, эмоции и отношения между людьми. 
    </UiText>

    <UiText>
      Сенсорика фиксирует физическую реальность, форму и конкретные характеристики окружающего мира.
    </UiText>

    <UiText>
      Интуиция занимается пониманием структуры, возможностей и вероятных сценариев будущего.
    </UiText>
    
  </div>
</template>

<style scoped lang="scss">
@use "@shared/styles/variables/colors";

  .page {
  display: flex;
  flex-direction: column;
  gap: 16px;
  padding-left: 12px;
  padding-right: 12px;

  hr {
    margin-top: 16px;
    margin-bottom: 16px;
    opacity: 0.2;
    background-color: colors.$accent;
    }

 .half {
    width:50%;
  }
  }
  
</style>
