import type { RoleDetailCardType } from "@types";

const DETAIL_ROLES: RoleDetailCardType[] = [
  {
    type: "role",
    role: "queen",
    tags: ["Статус", "Сенсорики", "Экстраверты", "Предусмотрительные"],
    title: "Короли и королевы",
    subtitle:
      "Лидеры своей масти, их жизнь проходит на виду и имеет социальную значимость, репутация заслужена",
    content: [
      "Понятия авторитета, руководства, покровительства, уверенности, мудрости, ответственности.",
      "Умеют добиться задуманного, решать трудные задачи, распорядиться властью, позаботиться об окружающих.",
    ],
  },
  {
    type: "role",
    role: "king",
    tags: ["Статус", "Сенсорики", "Экстраверты", "Предусмотрительные"],
    title: "Короли и королевы",
    subtitle:
      "Лидеры своей масти, их жизнь проходит на виду и имеет социальную значимость, репутация заслужена",
    content: [
      "Понятия авторитета, руководства, покровительства, уверенности, мудрости, ответственности.",
      "Умеют добиться задуманного, решать трудные задачи, распорядиться властью, позаботиться об окружающих.",
    ],
  },
  {
    type: "role",
    role: "page",
    tags: ["Самодостаточность", "Интуиты", "Интроверты", "Предусмотрительные"],
    title: "Пажи",
    subtitle: "Не обладающие силой и властью, но подвижные, гибкие и быстрые",
    content: [
      "Понятия новостей, вестей, хорошей ориентации в жизненных ситуациях, восприимчивости, податливости.",
      "Они олицетворяют то, что связано с молодостью: энтузиазм, неопытность, ранимость, привлекательность.",
      "Реализуют свои интересы в нетрадиционных, либо обновляющихся областях деятельности с постоянным кругом контактов.",
      "Нравится заниматься тем, что значимо лично для них, их внутренний мир идей, возможность работать в присущем им ритме.",
    ],
  },
  {
    type: "role",
    role: "knight",
    tags: ["Уникальность", "Интуиты", "Экстраверты", "Беспечные"],
    title: "Рыцари",
    subtitle: "Ищущие, увлеченные своей идеей",
    content: [
      "Мотив движения, перемен, собственных целей, личной свободы.",
      "Каждый день должны доказывать себе и миру, что они рыцари, поэтому устраивают турниры и дуэли, стараются выделиться, ищут новых и новых испытаний своих достоинств.",
      "Увлекают сложные перспективные задачи с масштабными последствиями.",
    ],
  },
  {
    type: "role",
    role: "lady",
    tags: ["Благосостояние", "Сенсорики", "Интроверты", "Беспечные"],
    title: "Дамы",
    subtitle: "Сосредоточенные на своих отношениях с миром",
    content: [
      "Понятия авторитета, практичности, понимания собственных целей и умения их добиваться, уравновешенности, способности оказать поддержку, силы.",
      "Отмечаются качества, обеспечивающие комфортное взаимодействие с другими: доброжелательность, понимание, спокойствие, надежность, щедрость, зрелый жизненный опыт.",
      "Свойственна деятельность практического характера с постоянным кругом контактов.",
      "Интересует хорошее материальное обеспечение, комфортные условия жизни и работы, запасы, обеспечивающие богатство ощущений и информации.",
    ],
  },
];

export default DETAIL_ROLES;
