import type { QuadraDetailCardType } from "@types";

const DETAIL_QUADRAS: QuadraDetailCardType[] = [
  {
    type: "quadra",
    quadra: "air",
    tags: ["Дети", "Альфа", "Демократы", "Рассудительные"],
    title: "Воздух",
    subtitle: "Генерировать новые идеи для будущего человечества.",
    content: [
      "Интуитивно-аналитическое и эмоционально-сенсорное мышление.",
      "Генерирование идей и системных проектов, склонность к теоретизированию и абстрактному осмыслению окружающей действительности, психологическому комфорту и позитивным эмоциям.",
    ],
  },
  {
    type: "quadra",
    quadra: "fire",
    tags: ["Подростки", "Бета", "Аристократы", "Решительные"],
    title: "Огонь",
    subtitle: "Запустить импульс изменений и проконтролировать внедрение.",
    content: [
      "Конкретно-системное мышление волевыми (силовыми) категориями (порядок и сила) и событийно-эмоциональная идеология.",
      "Склонность к системному, волевому, эмоциональному, событийному осмыслению действительности, к системно-силовой и эмоционально-событийной реализации идеологических решений.",
    ],
  },
  {
    type: "quadra",
    quadra: "water",
    tags: ["Взрослые", "Гамма", "Демократы", "Решительные"],
    title: "Вода",
    subtitle: "Суммировать наработанный опыт и корректировать направление.",
    content: [
      "Событийно-деловое мышление, идеология защиты и контроля отношений.",
      "Склонность к технологическому, прогностическому, волевому, коммуникативному осмыслению и критическому отношению к действительности, событийно-методическому и прагматично-консервативному взаимодействию с окружающей средой.",
    ],
  },
  {
    type: "quadra",
    quadra: "earth",
    tags: ["Старики", "Дельта", "Аристократы", "Рассудительные"],
    title: "Земля",
    subtitle:
      "Гуманно управлять процессом и давать возможность развития каждому.",
    content: [
      "Конкретно-деловое, позитивно-отношенческое мышление, идеология глобальных возможностей и деловых удобств.",
      "Склонность к технологическому, возможностному осмыслению действительности с позиций комфортных условий работы и отношений.",
    ],
  },
];

export default DETAIL_QUADRAS;
