<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <div class="warning">
      <UiText preset="small" color="accent">
        Если вы не умеет воспринимать юмор, обидчивы или зависимы от мнений
        незнакомцев, пожалуйста, не читайте все что ниже.
      </UiText>

      <UiText preset="small" color="accent">
        Ненормативная лексика и сексуальные темы, оскорбление чувств всех
        причастных. Но весело и остроумно. Соблюдена авторская орфография и
        пунктуация.
      </UiText>
    </div>

    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Люркмор"
          subtitle="2 минуты"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Селютин"
          subtitle="4 минуты"
          target-content-id="tab-2"
        />

        <VariousTab
          title="Эльвира Фея"
          subtitle="2 минуты"
          target-content-id="tab-3"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText preset="small" color="accent">
            <i>
              небыдло, админ, распиздяй, анархист, битард, панк, нищеброд,
              хакер, говнарь, пиздабол, мизантроп, тролль
            </i>
          </UiText>

          <UiText preset="large" color="role">
            Вечный двигатель, создатель всего нового. Борется с чем угодно и за
            что угодно, главное чтобы это оправдывалось Идеей™.
          </UiText>

          <UiText>
            Собственно, идей у него всегда много, но реализация пиздец как
            хромает, свои идеи предпочитает реализовывать чужими руками.
            Поскольку его гениальные начинания у большинства людей понимания не
            находят, обычно в ответ на критику начинает люто, бешено
            фонтанировать говном в адрес супостата. Люто, но кратковременно, так
            как быстро заёбывается держать себя в мобилизованном состоянии, и
            снова начинает распиздяйничать.
          </UiText>

          <UiText>
            Зарабатывание денег для них есть творчество, доставляет сам процесс,
            пока он не заебал. Все заработанные деньги сразу проёбываются на
            покупку велосипеда/вертолёта/межгалактического хуйбимболёта и бурное
            обмывание этого события с проёбыванием всех полимеров.
          </UiText>

          <UiText>
            Зачастую мужчинам-Новаторам бабы особо не дают из-за их жлобства и
            маниакально-шизоидного поведения, ибо они очень тонко подмечают
            уровень тупости интеллектуальных способностей других. Собственно,
            мужчины женщин-Новаторов тоже не особо любят из-за их неприкрытого
            декольте мозга.
          </UiText>

          <UiText>
            Поэтому они зачастую остаются девственниками ебать как долго.
            Некоторые особо упоротые создают идиотские учения, другие — следуют
            им, а третьи верят в фильм Секрет.
          </UiText>

          <UiText>
            Загнобить его невозможно, чем больше вы кидаете лулзов в его адрес,
            тем больше получаете апперкотов в ответ. Впрочем это можно несколько
            смягчить, накормив плюшками.
          </UiText>

          <UiText>
            В общем-то бывают очень верными и преданными друзьями.
          </UiText>

          <UiText>
            Интегральный социотип современных британских учёных. А если
            серьёзно, то их страны — Голландия, Австралия и Испания.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">Бочка меда</UiText>
          <UiText preset="large" color="role">
            Не знает равных в вопросах поиска и хранения информации и
            закономерностей.
          </UiText>
          <UiText preset="small" color="accent">Ложка дегтя</UiText>
          <UiText preset="large" color="accent">
            Никто не умеет ломать и портить вещи, как Новатор! Так что
            готовьтесь к разобранным часам и вечным непонятным банкам-склянкам
            на полках, если с ним живете.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="large" color="role">Безапелляционный хам.</UiText>

          <UiText>
            Очень импульсивен. Такое ощущение, что каждую минуту возникает
            какая-то новая и обязательно безумная идея.
          </UiText>

          <UiText>
            Завидует тем, у кого идеи работают и приносят реальные плоды.
            Собственные идеи обычно воплощает чужими руками, но свой копирайт
            никогда не забудет поставить.
          </UiText>

          <UiText preset="large" color="role">
            Не любит, когда ему читают мораль.
          </UiText>

          <UiText>
            Всё бы ничего, если бы не врождённое чувство, что все им чего-то
            должны. Вроде соглашается, но потом выясняется, что он все понял
            совсем не так.
          </UiText>

          <UiText>
            Новатор — фокусник, который вот-вот покажет сногсшибательный фокус.
          </UiText>

          <UiText preset="large" color="role">
            Руками не умеет делать ничего.
          </UiText>
        </section>

        <section>
          <UiText>
            Может нахамить мимоходом, потом долго униженно извиняется, отчего
            выглядит еще глупее.
          </UiText>

          <UiText preset="large" color="role">Фактически неуправляем.</UiText>

          <UiText>
            Слова «дисциплина» и «субординация» он слышит впервые, и значение их
            представляет себе смутно. Как правило, придя в новый коллектив,
            портит отношения с окружающими и только потом приноравливается.
          </UiText>

          <UiText>
            Как правило, придя в новый коллектив, портит отношения с окружающими
            и только потом приноравливается.
          </UiText>

          <UiText preset="large" color="role">
            Подавляющее количество обещаний не исполняет.
          </UiText>

          <UiText>
            Если увлекается чем-то интересным, забывает обо всем на свете, в том
            числе про свои прямые обязанности.
          </UiText>
        </section>

        <section>
          <UiText>
            Логический подтип — нервное существо, склонное к шизофрении,
            обладающее недюжинными способностями выдавать нескончаемый поток
            бредовых идей.
          </UiText>

          <UiText>
            Интуитивный подтип — капризный интеллигент в «маминой кофте».
          </UiText>

          <UiText>
            Один вариант — обломист-буддист, другой — хакер-атеист.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Лентяи, каких свет не видывал.
          </UiText>

          <UiText>
            Лежа на диване ногами кверху, будут изрекать любые абстрактные идеи,
            но дело будет стоять.
          </UiText>

          <UiText>
            Если же идея стоит того, чтобы положить на нее жизнь — положат.
            Будут копать землянку голыми руками, выискивать по книгам
            символические мелочи для пополнения банка данных и изведут всех
            кругом своей непрактичностью и разбросанными где попало вещами.
          </UiText>

          <UiText>
            Так что уж лучше пусть ничего не делают, чем смотреть на их
            нерациональное поведение.
          </UiText>

          <UiText>
            Воспитанные и развитые Новаторы нередко вызывают недоумение и
            насмешку завышенной оценкой чужих действий.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Разгильдяй, недисциплинирован.
          </UiText>

          <UiText>Вот только им предложить что-то взамен сложно.</UiText>

          <UiText>
            Очень импульсивный и нервный тип, фактически неуправляем, и если
            хорошо не вглядываться, то и вовсе шизофреник.
          </UiText>

          <UiText>
            Безумные идеи так и прут из него, которые похожи на сногсшибательные
            фокусы, и которые он старается воплотить в жизнь всегда чужими
            руками, поскольку своими не умеет делать ничего, но копирайт свой
            застолбит всенепременно при этом.
          </UiText>

          <UiText>
            О, как он завистлив к тем, чьи идеи работают и приносят реальные
            плоды!
          </UiText>

          <UiText>И как он любит обещать и ничего не делать.</UiText>

          <UiText>
            А когда начинаешь читать ему мораль за безумство, хамит
            безапелляционно, потому что он понял всё совсем не так; потом долго
            и униженно извиняется.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-3" class="tab">
        <section>
          <UiText preset="large" color="role">
            Сами Новаторы — они, сука, обаятельные уроды.
          </UiText>

          <UiText>
            Запиздят так, что их считаешь умнее Энтштейна, идей дурацких у них —
            что у дурака фантиков.
          </UiText>

          <UiText>Однако не ведитесь, товарищи!</UiText>

          <UiText>
            Когда вы окажетесь по шею в грязи в таежном болоте или в балетной
            пачке на босу ногу посреди Тверской и с Новатором по правую руку,
            радостно лыбящимся, как идиот, вы вспомните наш совет.
          </UiText>

          <UiText>
            Что для нормального индивида, Администратора какого, или, не побоюсь
            этого слова, Инспектора, служит поводом для немедленного
            самоуничтожения, то для Новатора — утренняя разминочка перед Большой
            Аферой.
          </UiText>

          <UiText>
            У него наблюдается явный дефект строения черепа — волосы растут и
            наружу, и внутрь, вследствие чего мозг, очевидно, перманентно
            чешется, а огребают на свою жопу, естественно, окружающие.
          </UiText>

          <UiText>
            Мнят себя гениальными бизнесменами, идеи льются из них, как говно из
            прорванной канализации.
          </UiText>

          <UiText>
            И все как одна оказываются провальными, потому как тактики из
            Новаторов как из свиньи балерина, в итоге они перманентно ходят с
            голой задницей.
          </UiText>

          <UiText>
            Общительные, любят компанию, однако как скажут — так отрежут,
            тонкостью восприятия отличаются разве что в собственных мечтах, а в
            реальности вечно ляпают не то не в том месте и не в то время.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Кроме того, любит заботу и внимание. И попробуйте ему их не
            предоставить!
          </UiText>

          <UiText>
            Мстительные они, сволочи, так что лучше сразу привыкайте носить
            тапочки в зубах, потому как живыми вы все одно от них не уползете.
          </UiText>

          <UiText>
            А ежели вы тапочки таки принесете, то не избежать вам обвинения в
            отсутствии инициативы и полета мысли.
          </UiText>

          <UiText>
            Видимо, именно ради Новаторов мироздание и создало Дипломата –
            единственного человека, у которого от капризов Новатора не возникает
            желания заехать ему этими тапочками в ебальник.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
