<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Самая неуверенная область — это ощущения своего тела.
  </UiText>

  <UiText class="description">
    Часто боятся врачей, оттягивают походы к ним на месяцы и года. Способны целый день ничего не есть и удивляться, почему это болит голова и живот.
  </UiText>

  <UiText class="description">
    В вопросах сексуальности может впадать в крайности — либо страдать нимфоманией, либо отрицать физическую любовь в принципе.
  </UiText>

  <UiText class="description">
    Представители этого типа имеют очень странный вкус, часто брезгливы.
  </UiText>

  <UiText class="description">
    Одеваться любят вызывающе, совмещая элементы разных исторических эпох, отдавая предпочтения строгим фасонам и необычным сочетаниям.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Больше всего боится не соответствовать общественным негласным стандартам эстетики, здоровья и сексуальности.
  </UiText>

  <UiText class="description">
    Его цель — обеспечить себя необходимым минимумом приятных физиологических ощущений, которые не выходили бы за рамки приличий и не ухудшали самочувствие.
  </UiText>

  <UiText class="description">
    Болезнь или отсутствие сексуальных контактов — крайне тяжелая проблема в восприятии.
  </UiText>

</template>

<style lang="scss" scoped></style>
