<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Не умеет работать с четко структурированными таблицами и документами.
  </UiText>

  <UiText class="description">
    Одна мысль о заполнении анкет и других муторных бумажек вводит в плохое настроение.
  </UiText>

  <UiText class="description">
    Часто может допускать ошибки в логических выводах, в счетах и в задачах, где требуется кропотливый труд.
  </UiText>

  <UiText class="description">
    Очень боится показаться глупым и неусидчивым, поэтому часто идет в технические вузы, чтобы «доказать всем, что он что-то умеет».
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Сознательной социальной целью является борьба за единственно правильный регламент поведения, за то, чтобы иерархия объектов окружающего мира была, во-первых, единственной, во-вторых, никогда и никем не нарушалась.   
  </UiText>

  <UiText class="description">
    Ему трудно быть точным, аккуратным и предсказуемым, но он стремится развить эти качества.
  </UiText>

  <UiText class="description">
    Опасается упреков в неаккуратности, халатности, боится допустить ошибки в расчетах и нарушить формальные алгоритмы.
  </UiText>

</template>

<style lang="scss" scoped></style>
