<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Может очень долго работать на износ и при этом мало спать, есть, отдыхать.
  </UiText>

  <UiText class="description">
    Обладают отличным здоровьем, они могут долго функционировать в условиях полного дискомфорта.
  </UiText>

  <UiText class="description">
    Обычная ситуация, когда он долго-долго работает, а затем сваливается с тяжелой болезнью, связанной с переутомлением.
  </UiText>

  <UiText class="description">
    Причем, пока он не заболеет, он будет считать, что все хорошо.
  </UiText>

  <UiText class="description">
    С трудом ощущает потребности своего тела, неприхотлив в быту.
  </UiText>

  <UiText class="description">
    Очень раздражают люди, которые много внимания уделяют сенсорной составляющей жизни, жалуются на болезни.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Боится упреков в неопрятности, каких-либо внешних изъянах, плохой физической форме, сексуальной непривлекательности. 
  </UiText>

  <UiText class="description">
    Усиленно следит за собой, занимается спортом и старается получить как можно больше приятных ощущений; собственно, это и есть его сознательная цель. 
  </UiText>

  <UiText class="description">
    Она, кстати, предусматривает и сексуальную востребованность, что делает многих классическими «героями-любовниками» — изобретательными, жизнерадостными и полными энергии.
  </UiText>

</template>

<style lang="scss" scoped></style>
