<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Самую большую неуверенность испытывает при общении и взаимодействии с другими людьми.
  </UiText>

  <UiText class="description">
    Он часто не понимает, как к нему относятся его близкие люди, он не воспринимает полунамеков на отношения, чтобы достучаться до него, нужно говорить предельно ясно: «Ты мне нравишься, и я хочу быть с тобой».
  </UiText>

  <UiText class="description">
    С близкими людьми может «колбасить» в области отношений: то он фамильярен и хлопает вас по плечу, то он становится суровым и смотрит на вас, как на незнакомого человека в метро.
  </UiText>

  <UiText class="description">
    Это нормально, поскольку человек не имеет определенного паттерна поведения в отношениях и ему тяжело выстраивать корректные отношения как с родственниками и друзьями, так и с коллегами и приятелями.
  </UiText>

  <UiText class="description">
    Может быть нетактичным, может сказать глупость или грубость, сам того не осознавая. В этой ситуации не стоит обижаться на него, ведь он не хотел вас обидеть, он просто не знает, как сказать фразу более вежливо.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Больше всего боится упрёков в неэтичности, грубости, невоспитанности.
  </UiText>

  <UiText class="description">
    Ему очень хотелось бы научиться строить отношения с людьми.
  </UiText>

  <UiText class="description">
    Этой проблеме уделяет повышенное внимание, для него очень важно со всеми быть одинаково предупредительным и обязательно демократичным.
  </UiText>

</template>

<style lang="scss" scoped></style>
