<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Очень сложно воспринимать структурированную информацию, заниматься оформлением документов и таблиц.
  </UiText>

  <UiText class="description">
    Затруднительно выделить в тексте главное и отсечь второстепенное.
  </UiText>

  <UiText class="description">
    Работа с документацией вводит в уныние.
  </UiText>

  <UiText class="description">
    Очень сложно слушать нудные, по их мнению, речи о классификациях, о сортировке, о разделах целого.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Боится упреков в непонимании законов материального мира, в тупости, ограниченности, неспособности логично и аргументированно мыслить и говорить.  
  </UiText>

  <UiText class="description">
    Чтобы обезопасить себя, часто занимается самообразованием, особенно в области точных наук. Не выносит логических неоднозначностей и манипуляций.
  </UiText>

  <UiText class="description">
    Фактам и их анализу он уделяет повышенное внимание, готов тратить массу времени и сил на перепроверку информации о материальных объектах.
  </UiText>

</template>

<style lang="scss" scoped></style>
