<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Очень боится опаздывать, всегда нервничает, если что-то идет не по плану и происходит не вовремя.
  </UiText>

  <UiText class="description">
    Не любит непунктуальных людей, сам всегда приходит заранее, чтобы успеть к началу.
  </UiText>

  <UiText class="description">
    Всегда переживает, когда планы срываются, может впасть в ступор от неожиданности.
  </UiText>

  <UiText class="description">
    Любит стабильность, как в работе, так и в личной жизни. Не умеет предсказывать опасные ситуации.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Видит свою основную задачу в том, чтобы успевать делать все вовремя; своевременность и соблюдение временных рамок — главный стимул его работы.
  </UiText>

  <UiText class="description">
    Нередко он считает время своим основным врагом в борьбе за высокое качество продукции; работу надо сдавать, а она еще не закончена, точнее, она может быть еще лучше.
  </UiText>

  <UiText class="description">
    Играет со временем в прятки, пытается сделать вид, что сроки для него не существуют, но за это приходится расплачиваться укорами совести.
  </UiText>

</template>

<style lang="scss" scoped></style>
