<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Абсолютно неконфликтный человек. Ситуация противостояния его изматывает за считанные минуты.
  </UiText>

  <UiText class="description">
    Он не переносит силовое давление и моральное насилие. Нельзя добиться от него абсолютно ничего, если на него давить.
  </UiText>

  <UiText class="description">
    В такой ситуации он может психануть и повести себя неадекватно, после чего будет долго стесняться своих эмоций.
  </UiText>

  <UiText class="description">
    Мягкий и добрый человек, который не может пробиваться, «идти по головам» и давить на других.
  </UiText>

  <UiText class="description">
    Если представитель этого типа не знает соционики, то он может считать себя «мямлей» и «слабым человеком», хотя это совсем не так.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Боится упреков в физической немощи, безволии, апатичности и неумении завоевывать земные блага. 
  </UiText>

  <UiText class="description">
    Часто отличается нарочитым упрямством, но только в крайнем случае применяет физическую силу.
  </UiText>

  <UiText class="description">
    Интересуется гимнастиками, боевыми искусствами, старается поддерживать форму.
  </UiText>

</template>

<style lang="scss" scoped></style>
