<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Не любит ситуации неопределенности. 
  </UiText>

  <UiText class="description">
    Если ему начать рассказывать о своих идеях, то он запутается в вариантах и почувствует раздражение.
  </UiText>

  <UiText class="description">
    Нагромождение любых идей способно вызвать ступор.
  </UiText>

  <UiText class="description">
    Люди этого типа не любят хвастунов и выскочек, людей, которые выпячивают свои способности и свою уникальность.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Страдает от обвинений в бесталанности, непонятливости, медлительности ума, неумении ухватить шанс. 
  </UiText>

  <UiText class="description">
    Тяжело переживает обсуждение чужих и своих способностей. Чтобы не стать мишенью насмешек, усиленно размышляет над сложными философскими вопросами.
  </UiText>

  <UiText class="description">
    Выискивает в себе таланты и тратит массу сил на их детальную проработку и развитие, а каждую свою оригинальную идею до мелочей «обсасывает», чтобы представить ее на суд публики в гармоничном и законченном виде.
  </UiText>

</template>

<style lang="scss" scoped></style>
