<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Теряется, когда вокруг него проявляются сильные эмоции, как положительные, так и отрицательные.
  </UiText>

  <UiText class="description">
    Обычно выглядит человеком спокойным, хладнокровным, даже заторможенным.
  </UiText>

  <UiText class="description">
    В ситуации конфликта предпочитает уйти, не ввязываясь в дискуссию.
  </UiText>

  <UiText class="description">
    Сильные и нестабильные эмоции — это признак плохих отношений, от которых необходимо избавиться.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Боится упреков в недостаточной эмоциональной чуткости, холодности, неартистичности, отсутствии интереса к идеологии. 
  </UiText>

  <UiText class="description">
    Борется за то, чтобы все проявляли свои чувства и настроения в строго определенных ситуациях и руководствовались при этом здравым смыслом и чувством меры.
  </UiText>

  <UiText class="description">
    Неконтролируемые эмоции считает общественным злом и всякий раз возмущается, когда наблюдает непредсказуемые эмоциональные вспышки окружающих.
  </UiText>

</template>

<style lang="scss" scoped></style>
