<template>
  <div class="text g-page">
    <section>
      <UiText preset="body" color="accent">
        Описания не должны обязательно совпадать со всеми чертами характера
        личности.
      </UiText>

      <UiText preset="small" color="accent">
        Идея как раз описать наблюдаемые у среднего представителя типа
        особенности поведения и обработки информации психикой.
      </UiText>

      <UiText preset="small" color="accent">
        Автор описания — Велта Микелсоне
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="role">
        Умеет создать дружескую атмосферу и позаботиться о комфорте для себя и
        других.
      </UiText>

      <br />

      <UiText>
        Дружелюбный, миролюбивый, жизнерадостный человек. Избегает неприятных и
        конфликтных ситуаций. Во всем ищет прекрасное.
      </UiText>

      <UiText preset="large" color="role">
        Поддерживает дружеские отношения, со всеми уживается, так как деликатен
        и идет на компромиссы.
      </UiText>

      <UiText>
        Считает, что человек рожден, чтобы радоваться жизни, наслаждаться ею
        здесь и сейчас..
      </UiText>

      <UiText>
        Оригинально и со вкусом подбирает себе гардероб, не терпит вычурности в
        одежде.
      </UiText>

      <UiText preset="large" color="role">
        И на работе создает приятную и уютную атмосферу.
      </UiText>

      <UiText>
        Разными, другому незаметными, мелочами украшает пространство вокруг
        себя, придавая ей своеобразную привлекательность. Каждую вещь
        воспринимает как произведение искусства. Даже ежедневный обед превращает
        в праздник.
      </UiText>
    </section>

    <section>
      <UiText>
        Он не желает расставаться с бытовыми удобствами, поэтому путешествует с
        неохотой. Если же отправляется в путь, заранее тщательно ко всему
        готовится, берет с собой все необходимое.
      </UiText>

      <UiText preset="large" color="role">
        Чутко ощущает и понимает свои и чужие телесные потребности.
      </UiText>

      <UiText>Охотно отдыхает на природе в кругу хороших друзей.</UiText>

      <UiText>
        Ради близких способен сделать многое, однако не переусердствует.
        Считается с привычками других людей и думает о их удобстве. Для него
        важны здоровье и самочувствие как свое, так и близких.
      </UiText>

      <UiText>
        Свои потребности старается удовлетворить сам, не загружая других
        просьбами личного характера.
      </UiText>

      <UiText>
        Не стремится захватить власть, у него нет настойчивости. Он не умеет
        защищать своё мнение, поэтому уступает сильным.
      </UiText>
    </section>

    <section>
      <UiText>
        Из тех людей, которые охотно берут предметы в руки, ощупывают и
        определяют их качество. Быстро находит нужные ему вещи. При выборе
        покупок в основном отдает предпочтение привычным товарам.
      </UiText>

      <UiText>
        Любитель острых ощущений — быстрая езда на автомобиле, катание на
        каруселях. Чувствует и наслаждается природой, отмечая всю её красоту.
      </UiText>

      <UiText preset="large" color="role">
        Мир воспринимает эмоционально, ориентирован только на положительные
        эмоции, создавая праздничное настроение.
      </UiText>

      <UiText>
        Имеет привычку при разговоре касаться партнера рукой, чтобы образовалась
        более тесная связь. Обыкновенные повседневные события рассказывает
        радостно, иногда с юмором и улыбкой. Часто свои рассказы он дополняет
        увлекательными мелочами, создавая яркое повествование, чтобы доставить
        людям приятные минуты.
      </UiText>

      <UiText preset="large" color="role">
        Услышанное от других, может тут же пересказать более красочно и
        увлекательно.
      </UiText>

      <UiText>
        Годами помнит пережитые ощущения и может описать их также живо, как
        будто они случились только что. Может распознать и описать давно
        испытанный запах и вкус. В такие моменты воссоздает в памяти картину
        пережитого, связанное с конкретной вещью или событием, ощущая при этом
        радость, грусть, неловкость и прочее.
      </UiText>

      <UiText>
        Иногда эти представления и воспоминания настолько сильны, что он
        мысленно продолжает разговор с людьми из прошлого. Иногда он приписывает
        себе сверхъестественные способности, которыми в обычной жизни не
        обладает.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Полностью открывается только в кругу близких, и в такие моменты со своей
        веселостью и легкостью увлекает слушателей.
      </UiText>

      <UiText>
        В такой компании имеют место его разукрашенные рассказы, шутки, смех,
        песни и раскрепощенное поведение. В этом он неповторим.
      </UiText>

      <UiText>
        В романтических играх ведет себя естественно, он мастерски создает
        особую атмосферу. Ради любимого человека способен жертвовать, уступать,
        угождать. Однако, если его избранник недостаточно отзывчив, может легко
        отдалиться.
      </UiText>

      <UiText>
        В супружеской жизни он не позволяет остыть семейному очагу. Если
        отношения изменились, убеждает партнера и сам себе внушает, что ничего
        плохого не произошло.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        О своих переживаниях старается не рассказывать, если только самому
        близкому.
      </UiText>

      <UiText>
        Он чутко чувствует изменения в поведении и настроении близких.
      </UiText>

      <UiText>
        Общительный и тактичный. Легко приспосабливается к собеседнику,
        поддерживая разговор на любую тему. Отзывчивый и приятный в общении.
        Всегда помнит дни рождения близких и знакомых и не забывает их
        поздравить.
      </UiText>

      <UiText>
        Всегда интересуется интригами, сенсациями и захватывающими новостями из
        жизни близких и также знаменитостей.
      </UiText>

      <UiText preset="large" color="role">
        Одна из любимых тем — обсуждать сенсации в кругу друзей. Он из тех, кто
        всегда знает, что происходит с его близкими и знакомыми. Для беседы у
        него всегда находится время.
      </UiText>

      <UiText>
        В споры и выяснения отношений не вступает и даже удаляется, поскольку
        желает быть в дружеских отношений со всеми. С ним трудно поссориться,
        ведь он обычно не возражает. Если почувствует, что обидел кого-то своими
        словами или действием, то стремится все обратить в шутку.
      </UiText>
    </section>

    <section>
      <UiText>
        Семейные ссоры для него трагедия. Их он обсуждает с каждым членом семьи
        отдельно, успокаивает расстроенных и убеждает, как важно жить в мире и
        согласии. Не способен объективно оценивать ситуацию.
      </UiText>

      <UiText>
        Может запланировать и наметить ряд действий, как лучше сохранить
        независимость, соблюдая нужную дистанцию, чтобы не испортить отношения.
      </UiText>

      <UiText preset="large" color="role">
        Не свойственна деловитость. Беспокоится о том, как добиться успешной
        деятельности.
      </UiText>

      <UiText>
        С удовольствием принимает советы. Не хвастается своими успехами.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        В быту способен «из мухи делать слона», сам себе создавая проблемы.
      </UiText>

      <UiText>
        Поведение Дипломата иногда напоминает поведение кота, чье милое
        мурлыканье внезапно может перейти в нападение.
      </UiText>

      <UiText>
        Он умеет быть мягким и сердечным, однако это не бесконечно. Не прощает
        предательства и измены. После серьезной ссоры может идти на примирение,
        возобновить испорченные отношения. Правда, отношение уже не будет таким,
        как прежде.
      </UiText>

      <UiText>
        Перед началом работы ему необходимо, чтобы окружающая обстановка
        соответствовала его порядку. Если вещи не разложены по своим местам, ему
        трудно сосредоточиться и начинать работу.
      </UiText>

      <UiText>
        Его окружение должно быть приятным, красивым и чистым. Недовольство
        могут вызывать любые неудобства — ручка, которая пачкает и плохо пишет,
        неуютное кресло, плохое освещение и прочее. Если рабочая обстановка не
        соответствует его требованиям, наводит порядок сам.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        На его работоспособность влияет неблагоприятное отношение окружающих и
        излишнее напряжение в коллективе.
      </UiText>

      <UiText>
        Подобные ощущения испытывает и тогда, если не улажена его личная жизнь.
        Он прекрасно знает, к кому нужен особый подход. Личные дела у него тесно
        переплетены с рабочими обязанностями.
      </UiText>

      <UiText preset="large" color="role">
        Обычно складывается определенный распорядок дня.
      </UiText>

      <UiText>
        Он плохо переносит ограничения во времени, это отнимает его свободу и
        независимость. При этом он избегает брать на себя ответственность. Плохо
        улавливает момент, когда нужно начать действовать, хотя старается всё
        сделать вовремя.
      </UiText>

      <UiText>
        Работу совершает медленно и лениво, легко находит отговорки. Расширить
        свои знания или освоить другую профессию — это для него катастрофа. Ему
        не хочется нарушать имеющийся порядок и уклад жизни.
      </UiText>
    </section>

    <section>
      <UiText>
        Не хватает решительности, он часто сомневается, откладывает принятия
        решений. Это объясняется тем, что он внутренне медленно созревает, как
        будто ожидая толчка со стороны.
      </UiText>

      <UiText preset="large" color="role">
        Именно по этой причине его необходимо принуждать или стимулировать при
        выполнении ответственных шагов.
      </UiText>

      <UiText>
        Это часто мешает ему осуществлять свои желания. Хотя со стороны
        создается впечатление, будто он всегда чем-то занят. Торопливые и
        беспокойные люди его настораживают.
      </UiText>

      <UiText preset="large" color="role">
        Продуктивно работает, когда ясно видит цель.
      </UiText>

      <UiText>
        Ему приятно, если работа его оценена. Он не рожден для монотонной
        работы, в которой требуется продолжительное сосредоточенность, терпение
        и забота. Не любит переделывать чужую работу.
      </UiText>

      <UiText>
        Безошибочно и точно может выбрать лучшие продукты, только первой
        свежести. Также охотно выбирает одежду и другое. Его интересует не цена,
        а качество.
      </UiText>

      <UiText>
        Однако ему не хватает здравого смысла в денежных расходах. Даже когда он
        старается экономить, деньги быстро улетучиваются.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Любопытный человек. С удовольствием слушает рассказы о чем-то
        загадочном.
      </UiText>

      <UiText>
        Скучные, непривлекательные и неинтересные люди его напрягают. Они
        раздражают и выводят его из терпения, он старается всячески избегать
        контактов с ними. Но при общении в своем кругу осмотрительный,
        заботливый и даже услужливый.
      </UiText>

      <UiText preset="large" color="role">
        Вдохновляют толковые беседы, которые внушают ему уверенность в будущем.
      </UiText>

      <UiText>
        Ему необходимо определить связь между соответствующими закономерностями.
        Тогда он сам будет знать, что нужно делать.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
