<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Велта Микелсоне"
          subtitle="10 минут"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Вера Стратиевская"
          subtitle="25 минут"
          target-content-id="tab-2"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText preset="subtitle" color="role">
            Умеет создать дружескую атмосферу и позаботиться о комфорте для себя
            и других.
          </UiText>

          <br />

          <UiText>
            Дружелюбный, миролюбивый, жизнерадостный человек. Избегает
            неприятных и конфликтных ситуаций. Во всем ищет прекрасное.
          </UiText>

          <UiText preset="large" color="role">
            Поддерживает дружеские отношения, со всеми уживается, так как
            деликатен и идет на компромиссы.
          </UiText>

          <UiText>
            Считает, что человек рожден, чтобы радоваться жизни, наслаждаться ею
            здесь и сейчас..
          </UiText>

          <UiText>
            Оригинально и со вкусом подбирает себе гардероб, не терпит
            вычурности в одежде.
          </UiText>

          <UiText preset="large" color="role">
            И на работе создает приятную и уютную атмосферу.
          </UiText>

          <UiText>
            Разными, другому незаметными, мелочами украшает пространство вокруг
            себя, придавая ей своеобразную привлекательность. Каждую вещь
            воспринимает как произведение искусства. Даже ежедневный обед
            превращает в праздник.
          </UiText>
        </section>

        <section>
          <UiText>
            Он не желает расставаться с бытовыми удобствами, поэтому
            путешествует с неохотой. Если же отправляется в путь, заранее
            тщательно ко всему готовится, берет с собой все необходимое.
          </UiText>

          <UiText preset="large" color="role">
            Чутко ощущает и понимает свои и чужие телесные потребности.
          </UiText>

          <UiText>Охотно отдыхает на природе в кругу хороших друзей.</UiText>

          <UiText>
            Ради близких способен сделать многое, однако не переусердствует.
            Считается с привычками других людей и думает о их удобстве. Для него
            важны здоровье и самочувствие как свое, так и близких.
          </UiText>

          <UiText>
            Свои потребности старается удовлетворить сам, не загружая других
            просьбами личного характера.
          </UiText>

          <UiText>
            Не стремится захватить власть, у него нет настойчивости. Он не умеет
            защищать своё мнение, поэтому уступает сильным.
          </UiText>
        </section>

        <section>
          <UiText>
            Из тех людей, которые охотно берут предметы в руки, ощупывают и
            определяют их качество. Быстро находит нужные ему вещи. При выборе
            покупок в основном отдает предпочтение привычным товарам.
          </UiText>

          <UiText>
            Любитель острых ощущений — быстрая езда на автомобиле, катание на
            каруселях. Чувствует и наслаждается природой, отмечая всю её
            красоту.
          </UiText>

          <UiText preset="large" color="role">
            Мир воспринимает эмоционально, ориентирован только на положительные
            эмоции, создавая праздничное настроение.
          </UiText>

          <UiText>
            Имеет привычку при разговоре касаться партнера рукой, чтобы
            образовалась более тесная связь. Обыкновенные повседневные события
            рассказывает радостно, иногда с юмором и улыбкой. Часто свои
            рассказы он дополняет увлекательными мелочами, создавая яркое
            повествование, чтобы доставить людям приятные минуты.
          </UiText>

          <UiText preset="large" color="role">
            Услышанное от других, может тут же пересказать более красочно и
            увлекательно.
          </UiText>

          <UiText>
            Годами помнит пережитые ощущения и может описать их также живо, как
            будто они случились только что. Может распознать и описать давно
            испытанный запах и вкус. В такие моменты воссоздает в памяти картину
            пережитого, связанное с конкретной вещью или событием, ощущая при
            этом радость, грусть, неловкость и прочее.
          </UiText>

          <UiText>
            Иногда эти представления и воспоминания настолько сильны, что он
            мысленно продолжает разговор с людьми из прошлого. Иногда он
            приписывает себе сверхъестественные способности, которыми в обычной
            жизни не обладает.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Полностью открывается только в кругу близких, и в такие моменты со
            своей веселостью и легкостью увлекает слушателей.
          </UiText>

          <UiText>
            В такой компании имеют место его разукрашенные рассказы, шутки,
            смех, песни и раскрепощенное поведение. В этом он неповторим.
          </UiText>

          <UiText>
            В романтических играх ведет себя естественно, он мастерски создает
            особую атмосферу. Ради любимого человека способен жертвовать,
            уступать, угождать. Однако, если его избранник недостаточно
            отзывчив, может легко отдалиться.
          </UiText>

          <UiText>
            В супружеской жизни он не позволяет остыть семейному очагу. Если
            отношения изменились, убеждает партнера и сам себе внушает, что
            ничего плохого не произошло.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            О своих переживаниях старается не рассказывать, если только самому
            близкому.
          </UiText>

          <UiText>
            Он чутко чувствует изменения в поведении и настроении близких.
          </UiText>

          <UiText>
            Общительный и тактичный. Легко приспосабливается к собеседнику,
            поддерживая разговор на любую тему. Отзывчивый и приятный в общении.
            Всегда помнит дни рождения близких и знакомых и не забывает их
            поздравить.
          </UiText>

          <UiText>
            Всегда интересуется интригами, сенсациями и захватывающими новостями
            из жизни близких и также знаменитостей.
          </UiText>

          <UiText preset="large" color="role">
            Одна из любимых тем — обсуждать сенсации в кругу друзей. Он из тех,
            кто всегда знает, что происходит с его близкими и знакомыми. Для
            беседы у него всегда находится время.
          </UiText>

          <UiText>
            В споры и выяснения отношений не вступает и даже удаляется,
            поскольку желает быть в дружеских отношений со всеми. С ним трудно
            поссориться, ведь он обычно не возражает. Если почувствует, что
            обидел кого-то своими словами или действием, то стремится все
            обратить в шутку.
          </UiText>
        </section>

        <section>
          <UiText>
            Семейные ссоры для него трагедия. Их он обсуждает с каждым членом
            семьи отдельно, успокаивает расстроенных и убеждает, как важно жить
            в мире и согласии. Не способен объективно оценивать ситуацию.
          </UiText>

          <UiText>
            Может запланировать и наметить ряд действий, как лучше сохранить
            независимость, соблюдая нужную дистанцию, чтобы не испортить
            отношения.
          </UiText>

          <UiText preset="large" color="role">
            Не свойственна деловитость. Беспокоится о том, как добиться успешной
            деятельности.
          </UiText>

          <UiText>
            С удовольствием принимает советы. Не хвастается своими успехами.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            В быту способен «из мухи делать слона», сам себе создавая проблемы.
          </UiText>

          <UiText>
            Поведение Дипломата иногда напоминает поведение кота, чье милое
            мурлыканье внезапно может перейти в нападение.
          </UiText>

          <UiText>
            Он умеет быть мягким и сердечным, однако это не бесконечно. Не
            прощает предательства и измены. После серьезной ссоры может идти на
            примирение, возобновить испорченные отношения. Правда, отношение уже
            не будет таким, как прежде.
          </UiText>

          <UiText>
            Перед началом работы ему необходимо, чтобы окружающая обстановка
            соответствовала его порядку. Если вещи не разложены по своим местам,
            ему трудно сосредоточиться и начинать работу.
          </UiText>

          <UiText>
            Его окружение должно быть приятным, красивым и чистым. Недовольство
            могут вызывать любые неудобства — ручка, которая пачкает и плохо
            пишет, неуютное кресло, плохое освещение и прочее. Если рабочая
            обстановка не соответствует его требованиям, наводит порядок сам.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            На его работоспособность влияет неблагоприятное отношение окружающих
            и излишнее напряжение в коллективе.
          </UiText>

          <UiText>
            Подобные ощущения испытывает и тогда, если не улажена его личная
            жизнь. Он прекрасно знает, к кому нужен особый подход. Личные дела у
            него тесно переплетены с рабочими обязанностями.
          </UiText>

          <UiText preset="large" color="role">
            Обычно складывается определенный распорядок дня.
          </UiText>

          <UiText>
            Он плохо переносит ограничения во времени, это отнимает его свободу
            и независимость. При этом он избегает брать на себя ответственность.
            Плохо улавливает момент, когда нужно начать действовать, хотя
            старается всё сделать вовремя.
          </UiText>

          <UiText>
            Работу совершает медленно и лениво, легко находит отговорки.
            Расширить свои знания или освоить другую профессию — это для него
            катастрофа. Ему не хочется нарушать имеющийся порядок и уклад жизни.
          </UiText>
        </section>

        <section>
          <UiText>
            Не хватает решительности, он часто сомневается, откладывает принятия
            решений. Это объясняется тем, что он внутренне медленно созревает,
            как будто ожидая толчка со стороны.
          </UiText>

          <UiText preset="large" color="role">
            Именно по этой причине его необходимо принуждать или стимулировать
            при выполнении ответственных шагов.
          </UiText>

          <UiText>
            Это часто мешает ему осуществлять свои желания. Хотя со стороны
            создается впечатление, будто он всегда чем-то занят. Торопливые и
            беспокойные люди его настораживают.
          </UiText>

          <UiText preset="large" color="role">
            Продуктивно работает, когда ясно видит цель.
          </UiText>

          <UiText>
            Ему приятно, если работа его оценена. Он не рожден для монотонной
            работы, в которой требуется продолжительное сосредоточенность,
            терпение и забота. Не любит переделывать чужую работу.
          </UiText>

          <UiText>
            Безошибочно и точно может выбрать лучшие продукты, только первой
            свежести. Также охотно выбирает одежду и другое. Его интересует не
            цена, а качество.
          </UiText>

          <UiText>
            Однако ему не хватает здравого смысла в денежных расходах. Даже
            когда он старается экономить, деньги быстро улетучиваются.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Любопытный человек. С удовольствием слушает рассказы о чем-то
            загадочном.
          </UiText>

          <UiText>
            Скучные, непривлекательные и неинтересные люди его напрягают. Они
            раздражают и выводят его из терпения, он старается всячески избегать
            контактов с ними. Но при общении в своем кругу осмотрительный,
            заботливый и даже услужливый.
          </UiText>

          <UiText preset="large" color="role">
            Вдохновляют толковые беседы, которые внушают ему уверенность в
            будущем.
          </UiText>

          <UiText>
            Ему необходимо определить связь между соответствующими
            закономерностями. Тогда он сам будет знать, что нужно делать.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="small" color="accent">1 — Базовая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_comfort" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Комфорт</UiText>
              <UiText preset="body">Сенсорика ощущений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Красота и гармония во всех их проявлениях, яркая, изобилующая
            приятными впечатлениями жизнь, стремление к удовольствию в самых
            эстетичных и изысканных его формах — вот основные, присущие
            представителям этого типа ценности.
          </UiText>

          <UiText>
            Для Дипломата характерно не только созидание прекрасного во всех его
            формах и проявлениях, но и бережное отношение к уже существующей
            гармонии.
          </UiText>

          <UiText>
            Никогда не позволит себе испортить кому-нибудь настроение или
            привнести в атмосферу праздника будничность. Он — созидатель всего
            того, что приносит радость и доставляет удовольствие.
          </UiText>

          <UiText>
            Любит и ценит жизнь во всех ее проявлениях. Для него очень важно
            чувствовать вкус к жизни. Важно сделать жизнь красивой, приятной,
            легкой; важно ощущение «праздника жизни». Дарить удовольствие для
            Дипломата так же приятно, как и получать его.
          </UiText>

          <UiText>
            Дипломат — реалист. А иначе, как бы он дополнял такого мечтателя и
            фантазера, как Новатор. Дипломат сориентирован на самые простые и
            естественные ценности: благополучие семьи, уютный дом, добрые
            отношения.
          </UiText>

          <UiText preset="large" color="role">
            Никому никаких неприятностей старается не доставлять. Сам радуется
            жизни и не намерен усложнять ее другим.
          </UiText>

          <UiText>
            Для Дипломата очень важно ощущение комфорта, душевного покоя,
            хорошего самочувствия и хорошего настроения. Отсутствие какого-либо
            из этих ощущений его серьезно обеспокоит.
          </UiText>

          <UiText presset="small" color="accent">
            Например, если обстоятельства складываются так, что он не имеет
            возможности в обеденный перерыв пойти куда-то пообедать и вынужден
            регулярно питаться всухомятку, это его будет очень беспокоить: «Так
            ведь недолго и гастрит нажить…»
          </UiText>

          <UiText preset="large" color="role">
            Комфорт и дискомфорт, здоровье и болезнь, счастье и несчастье, жизнь
            и смерть — основные темы его рассуждений.
          </UiText>

          <UiText>
            Часто размышляет о том, в каких условиях он хотел бы существовать.
            Любит критиковать плохо продуманные или неудобно организованные
            условия работы, учебы и отдыха.
          </UiText>

          <UiText>
            Обладает свойством запоминать и заново воссоздавать однажды
            пережитые ощущения. Звуки, цвета, запахи запоминаются им как
            целостное впечатление и могут восстановить в памяти ассоциации,
            связанные с пережитым чувством, напомнить о каком-то событии, о
            каком-то человеке, о каких-то отношениях.
          </UiText>

          <UiText preset="large" color="role">
            Умеет замечать неприятные ощущения, испытываемые другими людьми.
          </UiText>

          <UiText presset="small" color="accent">
            Например, сразу же заметит, что кому-то жарко, холодно, тесно,
            душно, кому-то жмет обувь.
          </UiText>

          <UiText>
            Замечает, когда кто-то испытывает болевые ощущения. Всегда знает,
            чем они вызваны, и стремится устранить их причину. Причем старается
            сделать это в тактичной форме, поскольку считает, что ощущения — это
            нечто сугубо личное и интимное, поэтому и влиять на них следует
            деликатно и ненавязчиво.
          </UiText>

          <UiText>
            Представители этого типа великолепно работают в медицине.
          </UiText>

          <UiText>
            Дипломат умеет сострадать чужому недомоганию, поскольку и свое
            собственное плохое самочувствие воспринимает как серьезную
            неприятность. В этот момент он полностью поглощен своим состоянием и
            своими ощущениями. Общение с окружающими в этот период его только
            раздражает, особенно, если они безучастно относятся к его состоянию
            и не проявляют никакого сочувствия и никакой заботы.
          </UiText>

          <UiText>
            Недостаточно выраженное сострадание Дипломат воспринимает как
            проявление душевной черствости и плохого отношения к себе. Если,
            например, видит, что его жалобы только раздражают окружающих,
            старается ограничить с ними всякие контакты до лучших времен.
          </UiText>

          <UiText>
            Формально выраженное сочувствие, равно как и общеободряющие,
            «дежурные» фразы, ничуть не улучшают его состояния. Во время болезни
            Дипломат нуждается не в ободрении, а в утешении.
          </UiText>

          <UiText color="role">
            Не считает себя способным к физическим перегрузкам, поэтому не любит
            оказываться в условиях, требующих от него физической выносливости,
            особенно, когда это касается его отдыха.
          </UiText>

          <UiText preset="large" color="role">
            Любит отдыхать в условиях скромного и непритязательного комфорта, в
            обществе приятных и интересных ему людей.
          </UiText>

          <UiText>
            Туризм, требующий физического напряжения, сопряженный с риском,
            опасностью и полнейшим отсутствием удобств, его привлекает
            сравнительно мало.
          </UiText>

          <UiText color="role">
            Любит отдых на природе. Тонко чувствует ее красоту. Любое проявление
            прекрасного старается запомнить, как вообще старается запоминать все
            хорошее, «чтобы было что вспомнить». «Жизнь - не то, что прожито, а
            то, что запомнилось».
          </UiText>

          <UiText>
            Умеет и любит принимать гостей. Рад возможности проявить свой вкус и
            кулинарные таланты. Сама подготовка к приему доставляет ему
            удовольствие.
          </UiText>

          <UiText>
            Дипломат обычно устраивает для своих гостей настоящий «сенсорный
            праздник»: уютная обстановка, приятная музыка, мягкое освещение,
            красивейшая сервировка, вкуснейшая еда - все делается для того,
            чтобы удовольствие от праздника было всесторонним и наиболее полным.
          </UiText>

          <UiText preset="large" color="role">
            Дипломат тщательно продумывает все детали будущего застолья: подбор
            гостей, сервировку, сочетание блюд, выбор вин.
          </UiText>

          <UiText presset="small" color="accent">
            Если это, например, новогодний праздник, продумывается оформление
            комнаты, карнавальные костюмы, подарки, сюрпризы...
          </UiText>

          <UiText preset="large" color="role">
            Очень сердится, когда кто-нибудь мешает осуществлению его
            праздничной затеи
          </UiText>

          <UiText preset="large" color="role">
            Дипломата отличает великолепный вкус во всем, что касается гармонии
            ощущений.
          </UiText>

          <UiText>
            Это всегда непревзойденные кулинары, способные по запаху определить
            и вкусовые качества пищи и степень ее готовности. Дипломат не просто
            готовит пищу: он творит, он вкладывает душу, он представляет, какое
            удовольствие должна доставлять его еда.
          </UiText>

          <UiText>
            Очень серьезно относится к вопросам питания. Исключительно
            привередлив и разборчив в пище. Еда, не вызывающая у него доверия,
            им съедена не будет, даже если его очень об этом попросить. Очень
            консервативен в вопросах вкуса.
          </UiText>

          <UiText color="role">
            В любых условиях Дипломат умеет создать ощущение комфорта, ощущение
            тепла и уюта. Какими бы скромными средствами он не располагал,
            всегда придумает, как украсить свой дом.
          </UiText>

          <UiText>
            Может использовать для этого свое рукоделие, свои рисунки или
            рисунки своих детей. Любое, даже временное его жилье выглядит уютным
            и обжитым.
          </UiText>

          <UiText>
            В оформлении интерьера Дипломат предпочитает затейливо-изящный
            стиль, часто с декоративными дополнениями. Очень рационально
            использует пространство, умеет даже тесноту сделать уютной.
          </UiText>

          <UiText presset="small" color="accent">
            Порядок в доме Дипломата, особенно если он дуализирован, обычно
            соблюдается, причем в очень ненавязчивой и необременительной для
            домочадцев форме: домочадцы разбрасывают вещи, Дипломат, их
            терпеливо собирает и раскладывает по местам и так до тех пор, пока
            домочадцы не начинают автоматически класть вещи на место.
          </UiText>

          <UiText preset="large" color="role">
            Если у него не хватает сил регулярно наводить порядок во всем доме,
            всегда есть какой-то участок, где порядок неукоснительно соблюдается
            и где все со вкусом организовано.
          </UiText>

          <UiText>
            Предметы быта в доме Дипломата всегда красивые и удобные, всегда
            очень красивая посуда. Не только та, что для праздников, но и та,
            что на каждый день.
          </UiText>

          <UiText>
            Красивая посуда и красивое постельное белье — «маленькая слабость»
            представителей этого типа. Мягкая, удобная мебель, ковры, подушки,
            салфеточки — все, что радует глаз и располагает к отдыху, непременно
            присутствует в его доме.
          </UiText>

          <UiText preset="large" color="role">
            Эстетика Дипломата рассчитана на восприятие малыми формами. Красота
            каждой вещи должна восприниматься в отдельности — отсюда некоторая
            декоративная перенасыщенность, свойственная его эстетике.
          </UiText>

          <UiText presset="small" color="accent">
            Свойственная также эстетике всех иррациональных «сенсориков-этиков»
            - и Дипломата, и Политика.
          </UiText>

          <UiText preset="large" color="role">
            Обладает многими художественными талантами и с удовольствием их
            реализует.
          </UiText>

          <UiText>
            Так, не обучаясь специально профессии парикмахера или портного,
            часто выполняет работу не хуже, а иногда и лучше иного
            профессионала.
          </UiText>

          <UiText>
            Дипломат, профессионально занимающийся дизайном (одежды, причесок,
            обуви, мебели), вне конкуренции.
          </UiText>

          <UiText preset="large" color="role">
            Великолепно чувствует гармонию цвета, линий, форм, звуков, запахов.
            Лучшие парфюмеры и лучшие дегустаторы получаются именно из
            представителей этого типа.
          </UiText>

          <UiText>
            Умеет подбирать ассоциативные сочетания запаха и цвета, цвета и
            звука. Может изобрести духи, соответствующие определенной музыке,
            настроению, определенному цветовому сочетанию, определенному
            художественному направлению и стилю одежды.
          </UiText>

          <UiText>
            Дипломат создавать свою моду, умеет и сам приспосабливаться к любому
            ее направлению. Никогда не наденет то, что неудобно носить, или то,
            что невыгодно подчеркивает недостатки его внешности.
          </UiText>

          <UiText color="role">
            Этим объясняется способность Дипломата в любой одежде выглядеть
            исключительно привлекательно. По природе склонные к полноте, они
            великолепно справляются с этой проблемой, благодаря умению со вкусом
            одеваться, легко двигаться и удобно себя чувствовать в любой
            обстановке.
          </UiText>

          <UiText>
            Кроме того, Дипломат не может допустить, чтобы его полнота
            доставляла ему какие-то неудобства. Поэтому начинает соблюдать диету
            каждый раз, когда чувствует, что это необходимо.
          </UiText>

          <UiText preset="large" color="role">
            Всегда уверен в своей привлекательности, и окружающие, особенно
            представители противоположного пола, это всегда хорошо чувствуют.
          </UiText>

          <UiText color="role">
            Обычно пользуется успехом, причем заслуженным, и это его очень
            радует. Никогда не спекулирует на своей красоте, поскольку считает
            ее нормальным и естественным явлением. Ему приятно доставлять
            удовольствие своим внешним видом.
          </UiText>

          <UiText>
            Более того, Дипломат охотно помогает и советом и делом всем, кто
            хочет сделать свою внешность более привлекательной, чем оказывает
            неоценимую услугу своему дуалу Новатору, обычно уделяющему
            недостаточно внимания своему внешнему виду.
          </UiText>

          <UiText preset="small" color="accent">
            Как любила говорить одна студентка-Дипломат про своего
            преподавателя-Новатора: «Каждый раз, когда я его вижу, мне так
            хочется его отмыть!».
          </UiText>

          <UiText preset="large" color="role">
            Нет ничего более естественного для Дипломата, чем забота о своих
            близких, о своих домочадцах — это один из его жизненных ориентиров.
            Его домочадцы всегда бывают ухожены и накормлены.
          </UiText>

          <UiText color="role">
            Дипломат может свои потребности сократить до минимума, но
            постарается, чтобы его семья не испытывала ни малейших неудобств.
          </UiText>

          <UiText>
            Эстетическое воспитание детей считает делом первостепенным и
            наиважнейшим.
          </UiText>

          <UiText preset="small" color="accent">
            Например, живя на пособие по безработице, может купить своим детям
            пианино и оплачивать им уроки музыки.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">2 — Творческая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_emotions" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Желание</UiText>
              <UiText preset="body">Этика эмоций</UiText>
            </span>
          </div>

          <UiText>
            В эмоциональном плане Дипломат часто производит двойственное
            впечатление: внешне — это беззаботный весельчак и оптимист,
            внутренне — человек сдержанный и напряженный.
          </UiText>

          <UiText>
            В малознакомом обществе Дипломат старается не привлекать к себе
            особого внимания, больше наблюдает, чем действует. Внешне всегда
            кажется спокойным, уравновешенным, уверенным в себе.
          </UiText>

          <UiText preset="large" color="role">
            При кажущейся открытости внутренне скрытен и недоверчив. Часто
            производит впечатление человека «себе на уме». И действительно,
            Дипломат боится сболтнуть о себе что-нибудь лишнее.
          </UiText>

          <UiText>
            На близкой дистанции в своей компании общается легко, свободно;
            умеет создать непринужденную обстановку. Любит развлекать друзей
            забавными историями.
          </UiText>

          <UiText preset="large" color="role">
            Умеет и любит быть душой компании. Прекрасно поднимает настроение
            шутками.
          </UiText>

          <UiText>
            Если какие-то шутки оказываются неуместными, может быстро и тактично
            поменять тему. Но следует заметить, Дипломат поддерживает в компании
            хорошее настроение только в том случае, если это не противоречит его
            собственному внутреннему состоянию.
          </UiText>

          <UiText preset="large" color="role">
            Миролюбив. Дружелюбен. Умеет создать ощущение тепла и радушия. Очень
            к себе располагает и может найти контакт с любым окружением.
          </UiText>

          <UiText>
            Прекрасно чувствует собеседника, умеет к нему эмоционально
            подстроиться, причем делает это вполне искренне. Очень легко
            завоевывает доверие людей, но никогда этим не злоупотребляет, если
            только этого не требуют интересы его работы.
          </UiText>

          <UiText color="role">
            Легко вызывает на откровенность. Качество, позволяющее
            представителям этого типа быть хорошими разведчиками, агентами,
            психотерапевтами и воспитателями.
          </UiText>

          <UiText preset="large" color="role">
            Умеет запоминать и воспроизводить однажды пережитые эмоции, умеет
            представить себе переживания другого человека, его чувства и его
            характер.
          </UiText>

          <UiText>
            Умеет эмоционально воссоздать и пережить в себе эмоциональное
            состояние другого человека, умеет как бы пропустить его через себя.
            Благодаря этому качеству Дипломат может быть очень хорошим актером,
            дипломатом или посредником.
          </UiText>

          <UiText preset="large" color="role">
            Выигрывает спор не только благодаря эрудиции, но и благодаря умению
            выставлять самые неожиданные контраргументы — и здесь ему нет
            равных.
          </UiText>

          <UiText>
            Если при нем затевается ссора или спор, всегда старается разрядить
            обстановку, старается отвлечь спорщиков или успокоить их.
          </UiText>

          <UiText>
            Качество, рассчитанное на проблематичную этику его дуала Новатора,
            постоянно затевающего спор, переходящий в ссору.
          </UiText>

          <UiText>
            Разумеется, Дипломат и сам может втянуться в ссору со своим
            конфликтером и тем не менее состояние вражды ему очень неприятно.
            Именно поэтому предпочитает выступать связующим звеном между
            враждующими сторонами. «Мастер челночной дипломатии».
          </UiText>

          <UiText role="role">
            Всегда радуется возможности кого-то помирить, уговорить, убедить.
            Хорошо устраивает свои дела неофициальным образом.
          </UiText>

          <UiText>
            Работая на руководящей должности, старается поддерживать хорошие
            отношения со всеми подчиненными. Считает для себя важным уделять
            внимание психологическому климату в коллективе.
          </UiText>

          <UiText preset="large" color="role">
            Старается поменьше критиковать других — не любит конфликтовать и
            наживать себе врагов. Поэтому, если и приходится кого-то
            покритиковать, старается сделать это в мягкой форме.
          </UiText>

          <UiText>
            Но если видит, что это кого-то травмирует, старается не обострять
            отношений и переводит все в шутку. Качество, совершенно необходимое
            при общении с таким дуалом, как Новатор, который, как уже
            говорилось, очень обостренно воспринимает критику в свой адрес.
          </UiText>

          <UiText color="role">
            Дипломат умеет быть режиссером настроения: если считает нужным
            кого-то успокоить или утешить, сделает это великолепно.
          </UiText>

          <UiText>
            Если считает нужным привлечь внимание к своим проблемам, сделает это
            «творчески»: создаст обстановку совершенно невыносимого напряжения и
            не «отпустит» до тех пор, пока его проблемы не начнут хотя бы
            частично решать, или до тех пор, пока сам не успокоится.
          </UiText>

          <UiText preset="large" color="role">
            Дипломат не стесняется открыто говорить о своих проблемах, причем в
            этом не всегда ограничивает себя близким кругом, из-за чего может
            производить впечатление нытика.
          </UiText>

          <UiText>
            Такая этическая тактика рассчитана на этику эмоций его дуала
            Новатора, которого иногда бывает необходимо отвлечь от его
            фантастических проектов и поставить перед фактом конкретной, реально
            существующей проблемы.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">3 — Ролевая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_time" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чутьё</UiText>
              <UiText preset="body">Интуиция времени</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Обычно ценит и свое и чужое время, но расходует его столько, сколько
            требуется для достижения нужного ему результата.
          </UiText>

          <UiText preset="small" color="accent">
            Например, если он чего-то не выяснил, чего-то недопонял, он будет
            продолжать разговор до тех пор, пока не получит полную ясность,
            независимо от того, располагает ли его собеседник временем для
            объяснений или нет. Он может зайти «на минутку» и застрять на
            несколько часов, но зато получит полную информацию по всем
            интересующим его вопросам.
          </UiText>

          <UiText color="role">
            Такое качество, как пунктуальность, для него более значимо именно в
            этическом плане. Поэтому, если ему приходится опаздывать, всегда
            чувствует себя очень неловко. Если обстоятельства не обязывают его к
            пунктуальности, Дипломат этому только рад.
          </UiText>

          <UiText>
            В силу многих причин четкий распорядок дня ему неудобен.
            Необходимость жить по жесткому графику, поспевать куда-то к
            определенному часу для него всегда обременительна.
          </UiText>

          <UiText>
            Не всегда может планировать время отдыха или время работы. Время
            отдыха для Дипломата определяется его самочувствием.
          </UiText>

          <UiText preset="small" color="accent">
            Например, не дожидаясь перерыва, Дипломат может выйти передохнуть и
            перекусить (если условия того позволяют). Время окончание работы
            определяется ее результатом.
          </UiText>

          <UiText preset="large" color="role">
            Время обычно расходуется на сиюминутные дела и сиюминутные
            потребности, что особенно затрудняет его планирование.
          </UiText>

          <UiText>
            Поэтому Дипломат очень не любит давать обещания: опасается, что
            выполнить их будет трудно из-за каких-то непредвиденных
            обстоятельств.
          </UiText>

          <UiText color="role">
            Часто разыгрывает роль оптимиста, уверенного в завтрашнем дне. Любит
            прогнозировать будущее, хотя его прогнозы иногда носят наивный
            характер.
          </UiText>

          <UiText preset="small" color="accent">
            Например, может какое-нибудь случайное везение рассматривать как
            предвестник будущих блестящих перспектив.
          </UiText>

          <UiText>
            По аспекту «интуиция времени» для Дипломата особенно характерны
            перепады от оптимизма к пессимизму. Иногда отдельную, случайную
            удачу он может возвести в перспективу: например, если его похвалили
            на работе, он уже предполагает для себя блестящую карьеру, поругали
            — предвидит увольнение.
          </UiText>

          <UiText color="role">
            Его собственное будущее, будущее его семьи, его страны, его общества
            - тема, которая его постоянно волнует.
          </UiText>

          <UiText>
            Причем конкретной программы по этому аспекту Дипломат предложить не
            может. Вопрос «Что же с нами будет?» всегда остается для него
            неразрешимым, всегда остается областью его размышлений. Его
            мучительных размышлений.
          </UiText>

          <UiText preset="large" color="role">
            Бывает затруднительно предвидеть развитие ситуации во времени. Он
            может потерять много времени на неоправданное ожидание.
          </UiText>

          <UiText>
            Он может «зацикливаться» на ожидании, отказываясь от других
            возможностей и перспектив. Это объясняется тем, что для Дипломата
            расход времени оправдывается результатом дела. Если достигнуты
            положительные результаты, то не жалко и потраченного времени.
          </UiText>

          <UiText>
            Ценнейшую услугу в прогнозировании перспектив оказывает для
            Дипломата его дуал Новатор. Лучшего «предсказателя» глобальных
            перемен в развитии общества трудно себе представить.
          </UiText>

          <UiText>
            Новатор лучше, чем кто-либо другой, может ответить на вопрос, как и
            в каких условиях будут жить отдельный человек, семья, общество в
            целом через определенный отрезок времени. Какие возможны перемены в
            будущем, какие обстоятельства повлияют на эти перемены.
          </UiText>

          <UiText>
            Дипломат может не обращаться к гадалке, имея такого дуала, как
            Новатор, который видит не только перемены к лучшему или к худшему,
            но видит и сроки этих перемен. При Новаторе для Дипломата не бывает
            бесполезного ожидания — Новатор этого просто не допустит и
            переориентирует Дипломата на другие, действительно перспективные
            планы.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">4 — Болевая функция.</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_business" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Практика</UiText>
              <UiText preset="body">Деловая логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            На любую предстоящую ему работу, даже любимую, даже привычную и
            постоянную, смотрит как на обременительную необходимость — и это
            одна из его серьезнейших проблем.
          </UiText>

          <UiText>
            Даже если часть работы он уже выполнил легко, в творческом порыве,
            под влиянием вдохновения, все равно ему еще предстоит ее завершать,
            прорабатывать детали, проверять конечный результат, а все это — уже
            необходимость.
          </UiText>

          <UiText color="role">
            Необходимость выполнять какую-то работу выводит Дипломата из
            естественного для него расслабленного состояния.
          </UiText>

          <UiText preset="small" color="accent">
            Необходимость выходить из этого состояния и переключаться на работу
            — уже сама по себе его напрягает, создает ему неприятные ощущения:
            «Вот сейчас допью кофе... докурю... и надо идти доделывать проект...
            Кто бы знал, как мне не хо-о-очется... кто бы за меня его
            сделал...».
          </UiText>

          <UiText>
            Часто говорит о необходимости делать какие-то дела и о том, как ему
            «не хо-о-очется» их делать. Часто жалуется на перегрузки, на
            недостаток времени.
          </UiText>

          <UiText color="role">
            Из каких-то обычных, бытовых дел создает целую проблему. Часто
            складывается впечатление, что он больше всех работает, больше всех
            перегружен и жизнь у него тяжелее, чем у всех других.
          </UiText>

          <UiText>
            Очень тяжело входит в работу, очень долго раскачивается. То ему
            кажется, что она ему не по силам, что он не знает, как ее сделать,
            что у него не собрано достаточно материала, что у него не готово
            рабочее место.
          </UiText>

          <UiText color="role">
            В творческом порыве Дипломат может сделать работу вообще незаметно
            для себя. Пришла идея, как сделать эту работу — пошел и сделал. Но
            «на одном дыхании» можно сделать работу только небольшого объема,
            как же представители этого типа пишут многотомные романы и ставят
            многосерийные фильмы?
          </UiText>

          <UiText preset="large" color="role">
            Великолепно работает творчески. Начинает работу по вдохновению, а
            там уже заставляет себя ее продолжить и закончить.
          </UiText>

          <UiText preset="small" color="accent">
            Во многих художественных произведениях для представителей этого
            типа, начало работы — книги, фильма, оперы — выглядит гораздо более
            талантливым, многообещающим и интересным, чем ее продолжение и
            завершение.
          </UiText>

          <UiText>
            Между первой частью работы и последующими иногда могут быть большие
            промежутки времени. Дипломат должен «созреть» для продолжения и
            завершения. Для него это очень важно - зато и результат себя
            оправдывает.
          </UiText>

          <UiText preset="large" color="role">
            Не любит показывать незаконченную работу, не любит, когда его
            контролируют в процессе работы.
          </UiText>

          <UiText>
            Не любит, когда в процессе работы начинают конструктивно критиковать
            его работу — критиковать его методы, его замысел, его стиль.
          </UiText>

          <UiText>
            В его понимании это значит чинить ему препятствия. В таких случаях
            всегда требует, чтобы ему дали возможность доделать работу
            самостоятельно и представить конечный результат.
          </UiText>

          <UiText preset="small" color="accent">
            Старается выбирать такую профессию, которая бы полностью реализовала
            его творческий потенциал, но если этого не получилось, старается
            найти себе работу по силам и по возможностям.
          </UiText>

          <UiText>
            В таких случаях на блестящую профессиональную карьеру он не
            претендует, на работе старается ничем не выделяться, чтобы не
            слишком ругали и не слишком хвалили. Лишний раз на глаза начальству
            предпочитает не попадаться, никаких лишних нагрузок, инициатив,
            ответственности и обязанностей на себя не берет.
          </UiText>

          <UiText preset="large" color="role">
            Иногда создается впечатление, что Дипломат вообще боится работы и
            ищет способ как бы ее избежать.
          </UiText>

          <UiText>
            Если кто-либо привносит в его работу какие-то новые проблемы и этим
            ее усложняет, Дипломат страшно раздражается.
          </UiText>

          <UiText color="accent">
            Например, если в учебных или методических целях его заставляют
            решать простую задачу сложными методами, как это иногда бывает в
            методиках Администратора, это буквально выводит его из себя.
          </UiText>

          <UiText color="role">
            Дипломат как раз нуждается в том, чтобы ему показали самую простую и
            самую рациональную методику, с самым минимальным расходом времени, а
            уж усложнить он ее и сам сможет.
          </UiText>

          <UiText>
            Всегда очень внимательно прочитывает инструкции, очень внимателен ко
            всем методическим рекомендациям. Его учебные конспекты, как правило,
            бывают самые полные и самые аккуратные.
          </UiText>

          <UiText color="role">
            Дипломат — это тот самый студент, который всегда у всех выпрашивает
            «переписать конспектик». Причем стоит ему в этом отказать, он сразу
            выглядит таким несчастным — для него это действительно очень важно.
          </UiText>

          <UiText>
            Самостоятельно разобраться в какой-либо методике, рационально и
            эффективно ее применить для Дипломата самая настоящая победа. Он
            совершенно счастлив, когда к нему обращаются за советом или
            консультацией по поводу знакомой ему методики. Иногда ему даже
            кажется, что методические консультации — это его призвание.
          </UiText>

          <UiText color="role">
            Довольно часто рассуждает о том, как можно было бы неплохо
            заработать. Хотя именно зарабатывать деньги ему чрезвычайно трудно.
          </UiText>

          <UiText>
            Даже будучи высококвалифицированным и широкообразованным
            специалистом, Дипломат может по нескольку месяцев напряженно искать
            работу, а потом согласиться на самые невыгодные условия: «Да можно
            было бы и бесплатно работать, но потом хотя бы рекомендацию
            получить, хотя бы стаж заработать.»
          </UiText>

          <UiText preset="large" color="role">
            Очень важно найти работу в перспективной или в постоянно требуемой
            области, чтобы в будущем не нужно было менять профессию, чтобы не
            было осложнений с поисками работы.
          </UiText>

          <UiText>
            Поэтому в вопросах деловой логики Дипломат удобнее всего
            ориентироваться на советы и прогнозы своего дуала Новатора, у
            которого этот аспект находится на сильных демонстративных позициях,
            поэтому он может себе позволить быть снисходительным к недостаточной
            практичности своего партнера.
          </UiText>

          <UiText>
            Дуализированный Дипломат обычно высоко оценивает деловые качества
            своего партнера и соглашается со всеми его предложениями:
          </UiText>

          <UiText preset="small" color="accent">
            «В первый год после приезда мой муж ввел режим жесточайшей экономии,
            мы абсолютно во всем себе отказывали. Зато сразу же купили машину,
            муж утвердился на новой работе и теперь его собираются сделать
            компаньоном фирмы, а там можно будет и квартиру купить...»
          </UiText>

          <UiText color="role">
            Дипломат умеет жить в режиме жесточайшей экономии, особенно если это
            временное, непродолжительное явление, если уже виден выход из
            тупика, и, наконец, самое главное, если это требуется в интересах
            семьи и в интересах близкого ему человека.
          </UiText>

          <UiText>
            Подсознательно Дипломат всегда уверен в интуиции своего партнера,
            поскольку подсознательно сориентирован на сильную интуицию своего
            дуала, знает и всегда рассчитывает на то, что выход из
            затруднительного положения будет найден, причем в кратчайшее время.
          </UiText>

          <UiText>
            Это обстоятельство его обычно успокаивает и он с удовольствием
            занимается своим прямым делом - экономно ведет хозяйство. И тут ему
            нет равных, поскольку, как известно, только Дипломат может из
            одной-единственной курицы сделать пять сытных блюд («бульончик,
            жаркое, студень, салат и еще фаршированное горлышко») и кормить ими
            свое многочисленное семейство.
          </UiText>

          <UiText>
            Как бы, казалось, не боялся Дипломат работы, он все-таки очень
            трудолюбив. Работая по призванию в удобных для себя условиях, он
            всегда показывает блестящие результаты. Занимаясь своим любимым
            делом, часто оказывается вне конкуренции.
          </UiText>

          <UiText>
            Работа для Дипломата — это всегда очень большая и серьезная
            ответственность, и хотя он иногда и производит впечатление
            «талантливого лентяя», на самом деле — это чаще всего талантливый
            труженик.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">5 — Внушаемая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_ideas" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Мысль</UiText>
              <UiText preset="body">Интуиция возможностей</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Во всем, что касается поиска возможностей, Дипломат действует
            неуверенно, как бы наощупь. Все время ищет поддержку со стороны,
            постоянно нуждается в наставнике, который подскажет, правильно ли он
            поступает.
          </UiText>

          <UiText>
            Склонен занижать собственные возможности, они часто кажутся ему
            недостаточными для решения всех его насущных проблем.
          </UiText>

          <UiText color="accent">
            Например, часто сожалеет о том, что у него нет влиятельных связей,
            что ему мало кто помогает, что ему не с кем посоветоваться, не к
            кому обратиться, не на кого опереться.
          </UiText>

          <UiText>
            Дипломат старается быть дальновидным и предусмотрительным, но
            поскольку самостоятельно просчитать возможности ситуации ему бывает
            очень трудно, он часто совершает ошибки, которые иногда
            оборачиваются для него серьезными неприятностями.
          </UiText>

          <UiText color="accent">
            Например, не всегда может разобраться в характере ситуации, поэтому
            его доверием, радушием и доброжелательностью часто злоупотребляют.
          </UiText>

          <UiText>
            Зная это, Дипломат старается быть осторожнее, предусмотрительнее, но
            тем не менее нередко позволяет вызывать себя на откровенность, о чем
            впоследствии очень сожалеет.
          </UiText>

          <UiText preset="large" color="role">
            Поэтому Дипломат всегда с интересом выслушает рекомендацию о том,
            какую пользу он может для себя извлечь из той или иной ситуации, как
            ему лучше поступить в том или ином случае и какие могут быть
            последствия его поступков.
          </UiText>

          <UiText>
            Сам Дипломат не способен с уверенностью ответить на эти вопросы. В
            правильности своих прогнозов он обычно сомневается, даже если
            высказывает их уверенным тоном.
          </UiText>

          <UiText>
            Ситуация коренным образом меняется, когда партнером Дипломата
            становится его дуал. При всей, казалось бы, отрешенности Новатор
            умеет трезво оценить и возможности ситуации, и возможности своего
            партнера. Анализ ситуации Новатором направлен как раз на то, чтобы
            придать действиям партнера нужное направление.
          </UiText>

          <UiText>
            Самую полную информацию по аспекту интуиции возможностей Новатор
            предоставляет именно своему дуалу Дипломату. С партнëрами других
            психологических типов приятного и продуктивного общения на эту тему,
            как правило, не получается.
          </UiText>

          <UiText>
            С Новатором Дипломат чувствует себя надежно защищенным, способным
            выжить и выстоять в самых трудных условиях:
          </UiText>

          <UiText color="accent">
            «Когда мы с мужем приехали сюда, мы были совершенно одни, нам никто
            не помогал. У нас здесь не было ни родственников, ни друзей. Мы
            всего добились сами...»
          </UiText>

          <UiText>
            Как уже говорилось, Дипломат предпочитает смотреть на жизнь реально,
            поэтому ему очень важно быть уверенным в реализации своих
            возможностей. Считает, чем раньше человек найдет себя, тем легче ему
            будет себя реализовать.
          </UiText>

          <UiText>
            Дуализированный Дипломат всегда интереснее работает творчески.
            Именно в партнерстве с Новатором он получает возможность безгранично
            развивать свою фантазию и выступать ярким новатором на выбранном
            поприще. Уверенно определять новые направления в искусстве, являться
            законодателем новых стилей и жанров.
          </UiText>

          <UiText>
            На развитие талантов своих детей Дипломат не пожалеет ни сил, ни
            денег. Всегда склонен видеть в своем ребенке выигрышный лотерейный
            билет, который когда-нибудь да выиграет. Часто через способности
            ребенка пытается реализовать свои нереализованные возможности.
          </UiText>

          <UiText>
            Развитие собственных талантов для Дипломата также имеет большое
            значение. Именно поэтому он очень интересуется мнением о своем
            профессиональном потенциале, о своих возможностях и способностях. Не
            любит, когда критикуют его способности.
          </UiText>

          <UiText preset="large" color="role">
            Большой интерес у него вызывают люди, способные найти и раскрыть его
            таланты.
          </UiText>

          <UiText color="role">
            Любит слушать о блестящих перспективах и интересных событиях,
            которые его еще могут ожидать в жизни.
          </UiText>

          <UiText>
            Может и в преклонном возрасте осуществить свою давнюю мечту и
            освоить профессию, которую раньше по каким-то причинам считал для
            себя недоступной.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">
            6 — Активационная функция
          </UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_logic" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Теория</UiText>
              <UiText preset="body">Структурная логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            С удовольствием включается в работу, которая ему кажется логически
            определенной и для которой имеет достаточную теоретическую
            подготовку.
          </UiText>

          <UiText>
            Достоверность источника информации для Дипломата очень важна.
          </UiText>

          <UiText color="accent">
            Например, если в справочнике, которым он располагает, обнаружится
            какая-то логическая неувязка, он не успокоится, пока не найдет этому
            какое-то объяснение или пока не выяснит, насколько эта нелогичность
            принципиальна, насколько она влияет на общую суть его работы.
          </UiText>

          <UiText preset="large" color="role">
            В случае, если у Дипломата возникают сомнения в достоверности
            располагаемой им информации, он подготавливает себе теоретический
            материал самостоятельно, причем ни денег, ни времени ему на это не
            жаль.
          </UiText>

          <UiText color="accent">
            Пример: одна студентка-Дипломат купила себе электронный переводчик и
            с его помощью переводила для себя всю необходимую информацию,
            изданную на иностранных языках.
          </UiText>

          <UiText>
            Скрупулезно собирает весь тот материал, который считает для себя
            важным, тщательно анализирует и продумывает его. Дипломат
            исключительно наблюдателен в мелочах:
          </UiText>

          <UiText color="accent">
            «Я сразу заподозрила неладное, как только муж сел читать газету и
            сразу же ее отбросил! А такого с ним прежде никогда не случалось.
            Чтобы он когда-нибудь отложил газету, не прочитав ее всю от корки до
            корки?! - никогда такого не было!.»
          </UiText>

          <UiText preset="large" color="role">
            Исключительная наблюдательность и умение глубоко анализировать
            полученную информацию позволяют ему прекрасно проявить себя во
            многих профессиональных областях.
          </UiText>

          <UiText color="accent">
            Например, великолепно работать в таких профессиях, как разведчик,
            следователь, врач, актер, режиссер.
          </UiText>

          <UiText color="role">
            Дипломат очень интересуется самыми перспективными научными методами.
            Старается быть в курсе самых последних разработок. Свой компьютер
            загружает новейшими программами.
          </UiText>

          <UiText>
            Убеждается достоверными фактами и логически последовательными
            аргументами. Ему интересно наблюдать логические закономерности в
            каких-то труднообъяснимых явлениях.
          </UiText>

          <UiText>
            По счастью, у Дипломата есть такой дуал, как Новатор, способный
            просчитать то, чего еще нет в природе, самую смелую фантазию, самый
            смелый замысел. Благодаря расчетам и логическим выкладкам Новатора
            самая смелая мечта кажется близкой и легко осуществимой реальностью,
            и Дипломат, при всем своем трезвом реализме, с удовольствием
            принимает участие в самых фантастических проектах Новатора, с
            готовностью предоставляет свою помощь и поддержку в реализации самых
            смелых его начинаний.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">7 — Функция защиты</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_will" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Воля</UiText>
              <UiText preset="body">Волевая сенсорика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            О своих волевых качествах Дипломат говорит примерно так: «Я только
            недавно понял, что у меня, оказывается, большая сила воли».
          </UiText>

          <UiText>
            Сила воли у Дипломата действительно есть и действительно большая, но
            он не позволяет себе пользоваться ею без особой надобности.
          </UiText>

          <UiText preset="large" color="role">
            Поэтому часто производит впечатление мягкого, расслабленного
            человека, старающегося быть очень аккуратным и деликатным в методах
            своего волевого воздействия.
          </UiText>

          <UiText>
            Это объясняется тем, что волевая сенсорика Дипломата подсознательно
            настроена на очень уязвимую волевую сенсорику Новатора. Поэтому
            открытого волевого давления Дипломат старается ни на кого не
            оказывать. Подсознательно он это держит как крайнюю меру для самой
            экстремальной ситуации.
          </UiText>

          <UiText>
            Если ситуация того требует, Дипломат может быть и жестким и строгим,
            но он никогда не злоупотребляет своими волевыми качествами. Не любит
            работать на должности, обязывающей требовать жесткого и
            беспрекословного подчинения.
          </UiText>

          <UiText>
            Дипломат — всегда «мягкий» и душевный руководитель, даже на самой
            высокой ступени власти.
          </UiText>

          <UiText color="accent">
            Актеры-Дипломаты, играя роли жестоких властелинов, как правило, не
            мобилизуют свою волевую сенсорику — они всегда играют их внешне
            мягкими и душевными, но внутренне строгими и непреклонными, то есть
            играют самих себя.
          </UiText>

          <UiText>
            Жесткость Дипломата проявляется только в том случае, если его
            «мягкое» воздействие не приносит никаких позитивных результатов.
            Если, например, на его просьбу ответили отказом, Дипломат создает
            обстановку совершенно невыносимого напряжения, а это, как правило,
            стоит ему большого расхода сил. А доводить себя до чрезмерного
            напряжения Дипломат не любит и силы свои предпочитает расходовать
            экономно.
          </UiText>

          <UiText color="role">
            Применять методы волевого воздействия Дипломат очень не любит. Ему
            неприятно даже попадать в ситуацию, которая его к этому принуждает:
            ему неприятно упрекать, неприятно мстить.
          </UiText>

          <UiText>
            Подсознательно настроенный на уязвимую сенсорику и этику Новатора,
            Дипломат понимает, что такое воздействие допустимо только в самом
            крайнем случае, когда его просьбы постоянно игнорируются, когда его
            интересы абсолютно не принимаются во внимание, когда его жертвы
            совершенно никем не замечаются — тогда ему уже становится обидно за
            свои впустую растраченные силы и он демонстративно игнорирует
            интересы своего партнера, мстит, но это самая крайняя мера.
          </UiText>

          <UiText color="role">
            В обычных условиях Дипломат не склонен ни наказывать, ни заставлять.
            Старается всего добиться «по-хорошему», методом убеждения.
          </UiText>

          <UiText preset="large" color="role">
            Не любит скандалов, предпочитает в спорных вопросах разбираться
            спокойно, без отрицательных эмоций и только на основе фактов.
          </UiText>

          <UiText>
            В общении старается не применять жестких этических мер: ему
            неприятно ссориться, неприятно отказывать. Бывает даже неловко
            прервать нежелательное знакомство. Поэтому опасается бесцеремонных и
            навязчивых людей. Необходимость поддерживать общение, в котором он
            не заинтересован, иногда воспринимается им как серьезная проблема.
          </UiText>

          <UiText color="role">
            Не способен делать карьеру методом волевого давления. Всего
            добивается только благодаря своему таланту, терпению и умению
            наладить личные контакты.
          </UiText>

          <UiText>
            Ни лбом, ни локтями работать не способен. Условий жестокой
            конкуренции старается избегать.
          </UiText>

          <UiText>
            Ни за власть, ни за влияние бороться не намерен — это не его
            ценности. Но поставить себя в безвыходное положение Дипломат никому
            не позволит. Не позволит лишить себя права выбора, никому не
            позволит посягать на свою личную свободу.
          </UiText>

          <UiText>
            Он этого не позволит даже своему дуалу Новатору, которого иногда
            «заносит» по волевой сенсорике настолько, что он начинает
            разыгрывать из себя роль тирана и деспота. В таком случае Дипломат
            сразу пытается логически и этически разобраться в причинах такого
            поведения. Старается устранить эти причины, старается успокоить и
            логически переубедить своего дуала.
          </UiText>

          <UiText>
            Ему приходится использовать всю свою волю и всю свою выдержку для
            того, чтобы при любых условиях, в самой критической и самой
            экстремальной ситуации сохранять подчеркнуто хорошие отношения со
            своим партнером. Но это уже тема описания следующей функции
            Дипломата.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">8 — Фоновая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_people" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чувство</UiText>
              <UiText preset="body">Этика отношений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Стремится к этической гармонии во всех формах своих отношений. Для
            него свойственно включаться в уже сложившуюся систему отношений и
            выбирать там удобную позицию, соответствующую его собственным
            этическим установкам и сложившимся обстоятельствам.
          </UiText>

          <UiText>
            Удобнее всего Дипломат чувствует себя в условиях изначально
            доброжелательных отношений на достаточно быстро сложившейся близкой
            дистанции.
          </UiText>

          <UiText>
            Единственные позитивные качества, свойственные проблематичной этике
            его дуала Новатора, — изначальная доброжелательность и быстрое
            сокращение дистанции. Попав в обстановку приятных и доброжелательных
            отношений, Дипломат старается ничем не нарушать сложившуюся
            этическую гармонию, а наоборот — внести в общий эмоциональный строй
            свою посильную лепту.
          </UiText>

          <UiText color="role">
            Хорошее отношение к себе Дипломат воспринимает с искренней
            благодарностью: «Я была так растрогана его подарком, я шла домой и
            плакала… просто от благодарности к этому человеку!»
          </UiText>

          <UiText preset="large" color="role">
            Очень ценит хорошие отношения и старается сделать все от него
            зависящее, чтобы их укрепить. Поэтому его доброе расположение иногда
            принимают преувеличенные, демонстративно выраженные формы
          </UiText>

          <UiText>
            Отношение Дипломата - это всегда яркая и демонстративная реакция на
            отношение к нему окружающих. Если возникает какое-то недопонимание,
            он начинает демонстративно обижаться.
          </UiText>

          <UiText>
            Однако в интересах благоприятного развития отношений со своим
            партнером Дипломата заставляет себя не «застревать» на своих обидах,
            поскольку это приводит к очень серьезным этическим осложнениям,
            которые ему же самому и приходится выправлять, что для него
            представляет определенные трудности.
          </UiText>

          <UiText color="role">
            Аспект этики отношений у Дипломата находится не на самых выгодных
            позициях, поэтому он делает все от него зависящее, чтобы поддержать
            с партнером ровные, доброжелательные отношения и ни коим образом не
            доводить дело до конфликта.
          </UiText>

          <UiText>
            Дипломата старается поддержать любой положительный импульс со
            стороны партнера и использует любую возможность для того, чтобы
            задать своим отношениям с партнером ярко выраженное позитивное
            направление.
          </UiText>

          <UiText>
            Это объясняется тем, что Дипломат подсознательно настроен на очень
            слабую и уязвимую этику своего дуала Новатора, которому очень важно,
            чтобы его хорошее отношение сразу же находило отклик у партнера.
          </UiText>

          <UiText>
            Если Новатор не получает ярко выраженной реакции на свои этические
            действия, он начинает нервничать и выводить своего партнера на
            «этические разборки», пока не убедится, что его партнер относится к
            нему действительно хорошо.
          </UiText>

          <UiText>
            Если отношения выражаются недостаточно демонстративно, Новатор им
            просто не верит.
          </UiText>

          <UiText>
            Демонстративно выраженная этика Дипломата избавляет Новатора от
            необходимости устраивать проверку чувств своего партнера.
          </UiText>

          <UiText color="accent">
            Пример: Новатор, которому чувства его жены казались недостаточно
            ярко выраженными, однажды похитил и спрятал своего собственного сына
            для того, чтобы посмотреть, способна ли его супруга быть «настоящей
            матерью».
          </UiText>

          <UiText>
            Если Дипломат в силу полученного воспитания стесняется откровенно
            демонстрировать свои чувства, если ему кажется, что это неприлично,
            что его отношения еще недостаточно определились, что он пока еще
            фальшивит или переигрывает, у него возникают серьезнейшие проблемы
            со своим дуалом.
          </UiText>

          <UiText>
            Поскольку Новатору, в силу его уязвимой этики, необходимо как можно
            скорее убедиться в том, что рядом с ним любящий и преданный друг.
          </UiText>

          <UiText>
            Защищая интересы близкого и любимого человека, Дипломат с
            удовольствием берет на себя функции дипломата. Великолепно
            использует свое умение налаживать контакты с людьми, он способен
            довольно быстро примирить своего дуала с окружающими.
          </UiText>

          <UiText preset="large" color="role">
            Новатор, в свою очередь, это замечает и воспринимает с
            благодарностью. В присутствии Дипломата он всегда чувствует себя
            намного уверенней, хотя бы потому, что чувствует себя защищенным.
          </UiText>

          <UiText>
            Дипломат без особых для себя усилий успокаивает Новатора, сглаживает
            его этические неловкости и неувязки, переключает его на какие-то
            нейтральные и отвлеченные темы.
          </UiText>

          <UiText>
            В случае неловкости отвлекает от него внимание публики. Причем
            делает все это легко и естественно, чем и создает своему дуалу
            удобную обстановку для общения и помогает ему чувствовать себя
            хорошо, приятно, комфортно.
          </UiText>

          <UiText color="role">
            Демонстративная доброжелательность Дипломата — непременное условие
            его сенсорной гармонии, основная предпосылка его сенсорной
            программы.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
