<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Переживает по поводу того, что у него не осталось времени. 
  </UiText>

  <UiText class="description">
    Эти переживания касаются как глобального вопроса — «жизнь проходит, а ничего не происходит», так и локального — «не успеваю сделать работу, как быть».
  </UiText>

  <UiText class="description">
    Может долго собираться, и лишь в последний момент понять, что не успевает.
  </UiText>

  <UiText class="description">
    Ценит своё время, считает, что время — это невосполнимый ресурс.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Ему постоянно кажется, что время уходит слишком быстро и он не успеет закончить требуемые дела к сроку.
  </UiText>

  <UiText class="description">
    Свой ритм жизни он боится кому-либо навязать, о времени не рассуждает, но тонко чувствует, как оно проносится мимо.
  </UiText>

  <UiText class="description">
    Дать точный прогноз развития процесса  не в состоянии, он видит лишь общие тенденции. Если окружающим нужно, готов помочь им распланировать время и наладить оптимальный ритм жизнедеятельности.
  </UiText>

  <UiText class="description">
    Собственные проблемы и неудачи он объясняет недостатком времени, тем, что его «сбили с ритма , или тем, что сроки изначально были невыполнимы, а чей-то прогноз оказался неверен.
  </UiText>

</template>

<style lang="scss" scoped></style>
