<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Имеет внутренний будильник, который часто звонит слишком поздно.
  </UiText>

  <UiText class="description">
    Если куда-то собирается, то мысль «Я опаздываю!» приходит к нему тогда, когда он действительно уже опаздывает, а не заранее.
  </UiText>

  <UiText class="description">
    Именно поэтому представители этого типа часто делают важные дела в последний момент, в институте готовятся к экзаменам в последние сутки, забывая еду и сон, на работе в отчетные дни сидят с утра. до ночи, просто не распределив время правильно.
  </UiText>

  <UiText class="description">
    Иногда бывают слишком суетливыми и торопящими других, а иногда слишком медленными.
  </UiText>

  <UiText class="description">
    Часто начинают обсуждение важных для них вопросов в неподходящее для других время.
  </UiText>

  <br />
  
  <hr />

  <UiText class="description">
    Пытается точно оценить время, которое потребуется на реализацию его проектов.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Часто сомневается в своевременности предпринимаемых действий.
  </UiText>

  <UiText class="description">
    Способен, как правило, в критической ситуации, точно прогнозировать события.
  </UiText>

</template>

<style lang="scss" scoped></style>
