<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Всегда следит за своими родными, чтобы они не заболели.
  </UiText>

  <UiText class="description">
    Если же все-таки они слегли, будет заботиться, лечить и кормить с ложечки.
  </UiText>

  <UiText class="description">
    При этом, представители этого типа сами себя не жалеют и способны довести себя до нервного истощения.
  </UiText>

  <UiText class="description">
    Осознают, что они заболели, лишь тогда, когда уже не могут встать с кровати.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Всегда видит, как окружающие себя чувствуют, насколько им удобно комфортно, как они выглядят.
  </UiText>

  <UiText class="description">
    Боится навязать кому-либо свое понимание сенсорных ощущений. В то же время, если кому-то необходимо  способен обеспечить комфорт, уют или помочь в удовлетворении физиологических потребностей.
  </UiText>

  <UiText class="description">
    Неудачи также склонен «валить» на физиологию, умеет одним своим видом изобразить усталость, плохое самочувствие, сексуальную неудовлетворенность.
  </UiText>

</template>

<style lang="scss" scoped></style>
