<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Ненавидит хаос и беспорядок. Всегда показывают пример дисциплинированности и ответственности.
  </UiText>

  <UiText class="description">
    Перед началом работы они собирают полное «досье», досконально изучают предмет, лишь после этого начинают действовать.
  </UiText>

  <UiText class="description">
    Сложно рассказать теорию дела, ему проще показать, как нужно делать.
  </UiText>

  <UiText class="description">
    В целом, он гораздо больше практик, чем теоретик.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Постоянно сомневается в том, насколько правильно он понимает регламент повседневных действий в материальном мире и насколько точно вписывается в социальную иерархию.
  </UiText>

  <UiText class="description">
    Он отслеживает все изменения в интересующих его системных объектах и иерархических структурах.
  </UiText>

  <UiText class="description">
    Если кому-то из окружающих нужно, готов помочь в работе с регламентной информацией, например, с заполнением документов, хождением по инстанциям, точными расчетами.
  </UiText>

  <UiText class="description">
    Свои неудачи часто объясняет маленькой должностью, небольшим объемом полномочий, а также тем, что «все нарушают законы», «играют не по правилам», «презирают регламент».
  </UiText>

</template>

<style lang="scss" scoped></style>
