<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Очень непривередливые люди. 
  </UiText>

  <UiText class="description">
    Они могут довольствоваться простой пищей, обычной одеждой, жить в стандартной квартире и не мечтать о большем.
  </UiText>

  <UiText class="description">
    При этом, если у него есть возможность заработать на обеспеченную жизнь, он заработает.
  </UiText>

  <UiText class="description">
    К сожалению, часто вспоминают о потребностях тела слишком поздно: они легко могут обгореть на солнце, перетрудиться и лечь в больницу, проходить с переломанным пальцем неделю и только потом пойти ко врачу.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Постоянно интересуется ощущениями других людей, их самочувствием, внешностью, одеждой, сексуальной жизнью.
  </UiText>

  <UiText class="description">
    Боится навязать кому-то излишнюю заботу, неприятные ощущения, нарушить чей-то покой.
  </UiText>

  <UiText class="description">
    Свои неудачи склонен объяснять нарушениями здоровья, пространственным дискомфортом, а иногда и сексуальными проблемами.
  </UiText>

</template>

<style lang="scss" scoped></style>
