<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Всегда отслеживает эмоциональную атмосферу в обществе.
  </UiText>

  <UiText class="description">
    Может предчувствовать разгорающийся конфликт, при этом постарается его уладить.
  </UiText>

  <UiText class="description">
    Очень близко к сердцу воспринимает несчастье других людей, из-за таких переживаний может даже заболеть.
  </UiText>

  <UiText class="description">
    На людях старается не показывать сильные эмоции.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Исключительно внимательно относится к эмоциональным проявлениям окружающих, он чувствует эти проявления во всех деталях, хотя и не любит говорить об этом.
  </UiText>

  <UiText class="description">
    Собственные эмоции склонен сдерживать, поскольку боится навязать свое состояние кому-либо другому.
  </UiText>

  <UiText class="description">
    Однако, если окружающим нужно, может гармонизировать обстановку своей энергетикой и создать людям то настроение, в котором они нуждаются (причем вовсе не обязательно хорошее — но соответствующее ситуации).
  </UiText>

  <UiText class="description">
    Свои неудачи склонен аргументировать тонкостями настроении и чувств людей, тем, что он «боялся испортить настроение» , «не смог омрачить праздник».
  </UiText>

</template>

<style lang="scss" scoped></style>
