<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Всегда отслеживает эмоциональное состояние людей вокруг.
  </UiText>

  <UiText class="description">
    Боится показаться слишком холодным и закрытым. В различных кругах общения ведет себя по-разному.
  </UiText>

  <UiText class="description">
    Нуждается в оптимистичных людях, которые покажут ему, что жизнь — это веселая штука, что не стоит переживать по пустякам, и что в итоге все будет хорошо.
  </UiText>

  <UiText class="description">
    Не способен выдерживать отрицательные эмоции долгое время, такое общение его истощает.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Внимательно следит за переменами настроения окружающих.
  </UiText>

  <UiText class="description">
    Опасается навязать кому-либо свое эмоциональное состояние, свою энергетику.
  </UiText>

  <UiText class="description">
    Настроение других определяет как «в принципе хорошее» или «в принципе плохое», нюансами не очень интересуется.
  </UiText>

  <UiText class="description">
    Всегда готов помочь кому-то в оценке эмоций и чувств. Он обычно аргументирует свои трудности или неудачи тем, что «…окружающие были против», «…все так боялись», «не хотел портить людям настроение», «…мог нарваться на скандал»…
  </UiText>

</template>

<style lang="scss" scoped></style>
