<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Очень прижимистый тип, который старается сэкономить на всем.
  </UiText>

  <UiText class="description">
    Не любит выкидывать старые вещи, тратить деньги попусту, всегда оставляет большой запас на черный день.
  </UiText>

  <UiText class="description">
    Если видит, что люди действует нецелесообразно и нелогично, то его это раздражает, он начинает разбираться в ситуации.
  </UiText>

  <UiText class="description">
    Считает, что большинство процессов в работе уже давно можно было бы автоматизировать.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Подсознательно отслеживает благосостояние окружающих, особенности их занятий, в том числе и технологические.
  </UiText>

  <UiText class="description">
    Интересуется подробностями «делания денег», оценивает, насколько эффективно работают люди и коллективы.
  </UiText>

  <UiText class="description">
    При необходимости даст четкий и конкретный «практический» совет, поможет разрешить сомнения в деловых вопросах.
  </UiText>

  <UiText class="description">
    Часто объясняет свои неудачи несовершенством технологического процесса, финансовыми затруднениями.
  </UiText>

</template>

<style lang="scss" scoped></style>
