<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Считает, что нельзя принуждать людей к работе.
  </UiText>

  <UiText class="description">
    Не давят на других людей, при этом резко дают отпор, когда давят на них.
  </UiText>

  <UiText class="description">
    В случае угрозы могут постоять за себя и за близких, но самостоятельно ни на кого нападать не будут.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Постоянно следит за расстановкой сил в окружающем пространстве. Он не хочет никому навязывать свою волю, но если его попросят, готов применить силу или отстоять что-либо в конкурентном поединке. 
  </UiText>

  <UiText class="description">
    Он всегда чувствует, кто сильнее, кто слабее, хотя и затрудняется оценить мелкие различия в объемах кинетических энергий. Нередко опасается что его собственные волевые качества недостаточны.
  </UiText>

  <UiText class="description">
    Свои промахи и неудачи склонен объяснять тем, что его заставили, вынудили, что он н смог воспротивиться более сильному человеку, что вынужден был подчиниться обстоятельствам.
  </UiText>

</template>

<style lang="scss" scoped></style>
