<template>
  <div class="text">
    <section>
      <UiText preset="body" color="accent">
        Описания не должны обязательно совпадать со всеми чертами характера
        личности.
      </UiText>

      <UiText preset="small" color="accent">
        Идея как раз описать наблюдаемые у среднего представителя типа
        особенности поведения и обработки информации психикой.
      </UiText>

      <UiText preset="small" color="accent">
        Автор описания — Велта Микелсоне
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="role">
        Прекрасно разбирается во взаимоотношениях между людьми.
      </UiText>

      <br />

      <UiText>
        Знакомства заводит осторожно и не сразу идет на сближение. В
        повседневном общении соблюдает дистанцию. Этим создается впечатление о
        нем как о замкнутом и некоммуникабельном человеке.
      </UiText>

      <UiText>
        У него обычно мало друзей. Среди знакомых он якобы выбирает своих. Но не
        всегда члены своей семьи включены в категорию своих!
      </UiText>

      <UiText preset="large" color="role">
        Знает, какие эмоции нужно избегать, что мешает воплотить его замыслы в
        жизнь, что отнимает силы и нарушает равновесие.
      </UiText>

      <UiText>
        Особенно хорошо различает фальшь и наигранность в чувствах и отношениях.
        Доверяет только своему опыту, в чем лично убедился.
      </UiText>

      <UiText>
        Хранитель общепринятых норм морали, принципов отношений между людьми и
        других неписанных законов человечества, но с трудом подчиняется
        управлению других, особенно тех кто слабее его.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Его недовольство вызывает все, что осложняет установленные им отношения.
      </UiText>

      <UiText>
        В таких ситуациях может стать беспощадным. Переживает, если отношения
        портятся по независящим от него обстоятельствам.
      </UiText>

      <UiText>
        Сочувствует больным, бедным, опустившимся и отверженным жизнью. Считает,
        что нужно уделять особое внимание безработным и слабым, при возможности
        подбадривать.
      </UiText>

      <UiText>
        Также считает, что дети, пенсионеры и многодетные семьи, инвалиды
        нуждаются в помощи в первую очередь.
      </UiText>

      <UiText>
        Если Хранитель находится на посту в самоуправлении или в социальной
        службе, он естественно от всей души выслушает социально обездоленных и
        поможет им всеми силами.
      </UiText>

      <UiText preset="small" color="accent">
        Показывает себя с наилучшей стороны как сотрудник органов
        правоохранения, в том числе в полиции. Это объясняется тем, что в
        отличии от других социотипов в нем строгость уравновешивается с
        корректностью поведения.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Он обладает высокой самооценкой, жизнерадостный, деятельный, энергичный,
        непреклонный.
      </UiText>

      <UiText>
        Как традиционалист не приемлет отклонения от общепринятых норм в
        поведении и во взаимных отношениях. Он отстаивает свои убеждения перед
        всем обществом, заботится о своей личной чести.
      </UiText>

      <UiText preset="large" color="role">
        Важно соблюдать и даже сохранить, и передать следующим поколениям все
        нравственные и этические нормы, которые в ходу эволюции человечества
        были одобрены.
      </UiText>

      <UiText>
        Также важно уважать своих родителей и прародителей, заботиться о
        близких.
      </UiText>

      <UiText>
        Не ищет новизны в том, что уже принято и ужилось в обществе. Например,
        придерживаются традиционных рецептов, ритуальных обычаев своей нации,
        отмечают праздники, важные торжественные событий, даты.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Взаимоотношения окружающих внимательно анализирует,однако своё мнение
        редко высказывает и редко меняет.
      </UiText>

      <UiText>
        Если он чувствует сопротивление или угрозу, может резко отстаивать свою
        правоту. Быстро оценивает, как действовать в сложившейся ситуации. Умело
        использует психологическое давление. Может требовать и действовать
        бесстрашно, не теряя терпения в сложных ситуациях.
      </UiText>

      <UiText preset="large" color="role">
        Его трудно запугать или вывести из себя.
      </UiText>

      <UiText>
        Целеустремленный, напористый, требовательный, самоуверенный, сдержанный
        и стрессоустойчивый. В обычном состоянии миролюбивый, но при
        необходимости готов защитить себя и близких.
      </UiText>

      <UiText>
        В коллективе он прекрасно чувствует расположение сил и влияния. Способен
        навязывать партнеру свои требования. Ему тяжело приспосабливаться. Если
        происходят осложнения, пересказывает ситуацию другим и выслушивает
        советы.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Практичен, умело использует все, что находится под рукой.
      </UiText>

      <UiText>
        Талантливо оценивает качества вещей. Тщательно и основательно подходит к
        работе. Его работу не требуется переделывать.
      </UiText>

      <UiText>
        Ему больше всего необходимо личное благосостояние. Этим объясняется то,
        что для него гнездо счастья — семья и дом.
      </UiText>

      <UiText preset="large" color="role">
        Он не утомляется от домашних забот, потому что нуждается в активной
        деятельности.
      </UiText>

      <UiText>
        Малоподвижный образ жизни заставляет искать активность вне дома, зато
        часто посещает разные кружки, хоры, общественные мероприятия.
      </UiText>

      <UiText preset="large" color="role">
        Ему важно произвести впечатление рассудительного и серьезного человека.
      </UiText>

      <UiText>
        Старается все просчитывать, продумать, но чаще всего живет
        расточительно.
      </UiText>
    </section>

    <section>
      <UiText>
        Однако в условиях кризиса способен жить бережливо. Уважает тех, кто
        умеет выразиться конкретно, коротко и понятно.
      </UiText>

      <UiText>
        Самый осторожный и внимательный социотип. Замечает и избегает ситуации,
        которые нельзя изменить. О своих неудачах не говорит, считая, что другие
        ничем не смогут помочь.
      </UiText>

      <UiText preset="large" color="role">
        Свои достижения не рекламирует. Плохо оценивает способности людей.
      </UiText>

      <UiText>
        С недоверием воспринимает громких хвастунов. Нуждается в том, чтобы его
        работа была оценена.
      </UiText>

      <UiText>
        Боится принимать новые вызовы, так как не чувствует себя достаточно
        образованным, хотя на самом деле знает очень много.
      </UiText>

      <UiText preset="large" color="role">
        Он приложит много усилий, чтобы выполнить работу качественно.
      </UiText>

      <UiText>
        Непроверенные идеи и догадки выслушивает с подозрением, стараясь
        сохранить все старое без изменений. Боится ввести изменения в
        установленный ритм. Тяжело переносит критику в свой адрес и редко хвалит
        других.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Живет здесь и сейчас, не терпит ожиданий, неопределенности и
        неизвестности. В непредвиденных ситуациях теряет равновесие, путается в
        мыслях.
      </UiText>

      <UiText>
        Свои решения обычно принимает быстро. При недостатке времени лучше
        мобилизуется к работе. Непрерывно ищет себе занятия, не умеет отдыхать,
        поскольку пассивный отдых считает проявлением бездельничества.
      </UiText>

      <UiText>
        Долго готовится перед началом работы. Не может выполнять одновременно
        несколько дел. За следующее берется только тогда, когда закончил
        предыдущее. Часто большие нагрузки отрицательно влияют на его здоровье.
        По-настоящему может расслабиться только, если видит результат работы.
      </UiText>

      <UiText>
        Не уверен в будущем, боится неизвестности. Долго помнит ошибки прошлого.
        Ему нужен партнер, который способен открыть развитие и ход событий и
        дать чувство уверенности. Плохо себя чувствует, если события развиваются
        медленно.
      </UiText>

      <UiText preset="large" color="role">
        Не относится враждебно к человеку с другим мышлением.
      </UiText>

      <UiText>
        С ним ведет вежливую беседу. Другое дело, что он испытает внутри себя. В
        случае антипатии Хранитель чаще всего ограждает себя от подобного
        общения.
      </UiText>

      <UiText>
        Он не любит случайные прикосновения, прикосновения неприятных ему людей.
        Остро чувствует свои физические потребности. В доме ему необходим уют и
        порядок, только тогда его самочувствие стабилизируется.
      </UiText>

      <UiText>
        Как правило у него пристальный, внимательный взгляд и напряженное
        выражение лица. Обычно губы плотно сжаты. Во время разговора окидывает
        партнера пронзительным взглядом, но при ответе, отводит глаза в сторону.
      </UiText>

      <UiText>Может длительное время сохранять одно положение тела.</UiText>

      <UiText>
        Ему неприятно долговременное нахождение чужих людей в собственном доме.
        В такой ситуации он чувствует себя чужим в своем доме.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Подчеркнуто аккуратен, педантичен. У него складывается своё понимание о красоте и о том, что доставляет удовольствие.
      </UiText>

      <UiText>
        Прекрасно знает, как одеваться согласно ситуации и соблюдает этикет. Даже его домашняя одежда продуманная и стильная.
      </UiText>

      <UiText>
        Он покупает только качественные и комфортные вещи. Старается быть перфекционистом – чтобы у него был самый красивый дом, самая ухоженная семья.
      </UiText>

      <UiText>
        Отличный семьянин. Забота о семье для него — это не просто обязанность, а смысл его жизни.
      </UiText>

      <UiText preset="large" color="role">
        Где хозяйничает он, там имеются достаток в деньгах и запасы на будущее.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
