<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Велта Микелсоне"
          subtitle="9 минут"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Вера Стратиевская"
          subtitle="27 минута"
          target-content-id="tab-2"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText preset="subtitle" color="role">
            Прекрасно разбирается во взаимоотношениях между людьми.
          </UiText>

          <br />

          <UiText>
            Знакомства заводит осторожно и не сразу идет на сближение. В
            повседневном общении соблюдает дистанцию. Этим создается впечатление
            о нем как о замкнутом и некоммуникабельном человеке.
          </UiText>

          <UiText>
            У него обычно мало друзей. Среди знакомых он якобы выбирает своих.
            Но не всегда члены своей семьи включены в категорию своих!
          </UiText>

          <UiText preset="large" color="role">
            Знает, какие эмоции нужно избегать, что мешает воплотить его замыслы
            в жизнь, что отнимает силы и нарушает равновесие.
          </UiText>

          <UiText>
            Особенно хорошо различает фальшь и наигранность в чувствах и
            отношениях. Доверяет только своему опыту, в чем лично убедился.
          </UiText>

          <UiText>
            Хранитель общепринятых норм морали, принципов отношений между людьми
            и других неписанных законов человечества, но с трудом подчиняется
            управлению других, особенно тех кто слабее его.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Его недовольство вызывает все, что осложняет установленные им
            отношения.
          </UiText>

          <UiText>
            В таких ситуациях может стать беспощадным. Переживает, если
            отношения портятся по независящим от него обстоятельствам.
          </UiText>

          <UiText>
            Сочувствует больным, бедным, опустившимся и отверженным жизнью.
            Считает, что нужно уделять особое внимание безработным и слабым, при
            возможности подбадривать.
          </UiText>

          <UiText>
            Также считает, что дети, пенсионеры и многодетные семьи, инвалиды
            нуждаются в помощи в первую очередь.
          </UiText>

          <UiText>
            Если Хранитель находится на посту в самоуправлении или в социальной
            службе, он естественно от всей души выслушает социально обездоленных
            и поможет им всеми силами.
          </UiText>

          <UiText preset="small" color="accent">
            Показывает себя с наилучшей стороны как сотрудник органов
            правоохранения, в том числе в полиции. Это объясняется тем, что в
            отличии от других социотипов в нем строгость уравновешивается с
            корректностью поведения.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Он обладает высокой самооценкой, жизнерадостный, деятельный,
            энергичный, непреклонный.
          </UiText>

          <UiText>
            Как традиционалист не приемлет отклонения от общепринятых норм в
            поведении и во взаимных отношениях. Он отстаивает свои убеждения
            перед всем обществом, заботится о своей личной чести.
          </UiText>

          <UiText preset="large" color="role">
            Важно соблюдать и даже сохранить, и передать следующим поколениям
            все нравственные и этические нормы, которые в ходу эволюции
            человечества были одобрены.
          </UiText>

          <UiText>
            Также важно уважать своих родителей и прародителей, заботиться о
            близких.
          </UiText>

          <UiText>
            Не ищет новизны в том, что уже принято и ужилось в обществе.
            Например, придерживаются традиционных рецептов, ритуальных обычаев
            своей нации, отмечают праздники, важные торжественные событий, даты.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Взаимоотношения окружающих внимательно анализирует,однако своё
            мнение редко высказывает и редко меняет.
          </UiText>

          <UiText>
            Если он чувствует сопротивление или угрозу, может резко отстаивать
            свою правоту. Быстро оценивает, как действовать в сложившейся
            ситуации. Умело использует психологическое давление. Может требовать
            и действовать бесстрашно, не теряя терпения в сложных ситуациях.
          </UiText>

          <UiText preset="large" color="role">
            Его трудно запугать или вывести из себя.
          </UiText>

          <UiText>
            Целеустремленный, напористый, требовательный, самоуверенный,
            сдержанный и стрессоустойчивый. В обычном состоянии миролюбивый, но
            при необходимости готов защитить себя и близких.
          </UiText>

          <UiText>
            В коллективе он прекрасно чувствует расположение сил и влияния.
            Способен навязывать партнеру свои требования. Ему тяжело
            приспосабливаться. Если происходят осложнения, пересказывает
            ситуацию другим и выслушивает советы.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Практичен, умело использует все, что находится под рукой.
          </UiText>

          <UiText>
            Талантливо оценивает качества вещей. Тщательно и основательно
            подходит к работе. Его работу не требуется переделывать.
          </UiText>

          <UiText>
            Ему больше всего необходимо личное благосостояние. Этим объясняется
            то, что для него гнездо счастья — семья и дом.
          </UiText>

          <UiText preset="large" color="role">
            Он не утомляется от домашних забот, потому что нуждается в активной
            деятельности.
          </UiText>

          <UiText>
            Малоподвижный образ жизни заставляет искать активность вне дома,
            зато часто посещает разные кружки, хоры, общественные мероприятия.
          </UiText>

          <UiText preset="large" color="role">
            Ему важно произвести впечатление рассудительного и серьезного
            человека.
          </UiText>

          <UiText>
            Старается все просчитывать, продумать, но чаще всего живет
            расточительно.
          </UiText>
        </section>

        <section>
          <UiText>
            Однако в условиях кризиса способен жить бережливо. Уважает тех, кто
            умеет выразиться конкретно, коротко и понятно.
          </UiText>

          <UiText>
            Самый осторожный и внимательный социотип. Замечает и избегает
            ситуации, которые нельзя изменить. О своих неудачах не говорит,
            считая, что другие ничем не смогут помочь.
          </UiText>

          <UiText preset="large" color="role">
            Свои достижения не рекламирует. Плохо оценивает способности людей.
          </UiText>

          <UiText>
            С недоверием воспринимает громких хвастунов. Нуждается в том, чтобы
            его работа была оценена.
          </UiText>

          <UiText>
            Боится принимать новые вызовы, так как не чувствует себя достаточно
            образованным, хотя на самом деле знает очень много.
          </UiText>

          <UiText preset="large" color="role">
            Он приложит много усилий, чтобы выполнить работу качественно.
          </UiText>

          <UiText>
            Непроверенные идеи и догадки выслушивает с подозрением, стараясь
            сохранить все старое без изменений. Боится ввести изменения в
            установленный ритм. Тяжело переносит критику в свой адрес и редко
            хвалит других.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Живет здесь и сейчас, не терпит ожиданий, неопределенности и
            неизвестности. В непредвиденных ситуациях теряет равновесие,
            путается в мыслях.
          </UiText>

          <UiText>
            Свои решения обычно принимает быстро. При недостатке времени лучше
            мобилизуется к работе. Непрерывно ищет себе занятия, не умеет
            отдыхать, поскольку пассивный отдых считает проявлением
            бездельничества.
          </UiText>

          <UiText>
            Долго готовится перед началом работы. Не может выполнять
            одновременно несколько дел. За следующее берется только тогда, когда
            закончил предыдущее. Часто большие нагрузки отрицательно влияют на
            его здоровье. По-настоящему может расслабиться только, если видит
            результат работы.
          </UiText>

          <UiText>
            Не уверен в будущем, боится неизвестности. Долго помнит ошибки
            прошлого. Ему нужен партнер, который способен открыть развитие и ход
            событий и дать чувство уверенности. Плохо себя чувствует, если
            события развиваются медленно.
          </UiText>

          <UiText preset="large" color="role">
            Не относится враждебно к человеку с другим мышлением.
          </UiText>

          <UiText>
            С ним ведет вежливую беседу. Другое дело, что он испытает внутри
            себя. В случае антипатии Хранитель чаще всего ограждает себя от
            подобного общения.
          </UiText>

          <UiText>
            Он не любит случайные прикосновения, прикосновения неприятных ему
            людей. Остро чувствует свои физические потребности. В доме ему
            необходим уют и порядок, только тогда его самочувствие
            стабилизируется.
          </UiText>

          <UiText>
            Как правило у него пристальный, внимательный взгляд и напряженное
            выражение лица. Обычно губы плотно сжаты. Во время разговора
            окидывает партнера пронзительным взглядом, но при ответе, отводит
            глаза в сторону.
          </UiText>

          <UiText>Может длительное время сохранять одно положение тела.</UiText>

          <UiText>
            Ему неприятно долговременное нахождение чужих людей в собственном
            доме. В такой ситуации он чувствует себя чужим в своем доме.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Подчеркнуто аккуратен, педантичен. У него складывается своё
            понимание о красоте и о том, что доставляет удовольствие.
          </UiText>

          <UiText>
            Прекрасно знает, как одеваться согласно ситуации и соблюдает этикет.
            Даже его домашняя одежда продуманная и стильная.
          </UiText>

          <UiText>
            Он покупает только качественные и комфортные вещи. Старается быть
            перфекционистом – чтобы у него был самый красивый дом, самая
            ухоженная семья.
          </UiText>

          <UiText>
            Отличный семьянин. Забота о семье для него — это не просто
            обязанность, а смысл его жизни.
          </UiText>

          <UiText preset="large" color="role">
            Где хозяйничает он, там имеются достаток в деньгах и запасы на
            будущее.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="small" color="accent">1 — Базовая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_people" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чувство</UiText>
              <UiText preset="body">Этика отношений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Программа Хранителя ставит своей задачей в первую очередь выявить
            существующие негативные этические тенденции и бороться с ними до
            полного их искоренения.
          </UiText>

          <UiText>
            В силу этих причин для Хранителя приемлемы только те отношения, в
            которых он видит для себя и для общества наименьшую вероятность
            неприятностей.
          </UiText>

          <UiText color="role">
            Возможно поэтому все его заповеди так категоричны и включают в
            первую очередь именно то, чего человеку делать нельзя.
          </UiText>

          <UiText preset="large" color="role">
            Чаще всего взаимоотношения с людьми у Хранителя строятся на двух
            заповедях: «Не делай другим того, чего не желаешь себе» и «Око за
            око, зуб за зуб».
          </UiText>

          <UiText>
            То есть, если человек не сделал тебе ничего плохого, ты не имеешь
            права к нему плохо относиться, но если ты в нем предполагаешь
            способность совершить дурной поступок, твое право ему не доверять,
            и, более того, твоя обязанность — предостеречь других.
          </UiText>

          <UiText>
            Если не понимать этой мотивации, может сложиться мнение о Хранителе,
            как о сплетнике, «обожающем перемывать косточки другим».
          </UiText>

          <UiText>
            Хотя именно представители этого типа при их врожденном понимании,
            что такое «хорошо», а что — «плохо», а также при их комплексе
            «ожидания неприятных последствий» терпеть не могут сплетничать ни о
            других, ни о себе, считая злословие делом недостойным и опасным, но
            предостережение — это их святое право и обязанность, и они всегда
            готовы и умеют его отстоять.
          </UiText>

          <UiText preset="large" color="role">
            Иногда, по причине слабой интуиции и логики Хранитель сам страдает
            от ограниченности собственной этической программы.
          </UiText>

          <UiText color="accent">
            Например, если ему сказать: «Я ведь тебе ничего плохого не сделал,
            почему ты мне не доверяешь?», тогда он начинает осознавать, что его
            поведение противоречит его собственным принципам. То есть он
            «наказывает» человека еще до проступка и, осознав это, Хранитель
            поступает очень не предусмотрительно — позволяет себе быть
            откровенным с человеком, который у него доверия не вызывает, что,
            как правило, оборачивается для него крупными неприятностями.
          </UiText>

          <UiText color="role">
            К счастью для себя, представители этого типа довольно рано начинают
            понимать свое природное преимущество, и никому не позволяют его
            оспаривать — умение видеть в человеке предрасположенность к дурным
            поступкам, умение видеть этический потенциал окружающих людей.
          </UiText>

          <UiText preset="large" color="role">
            Хранитель — великолепный физиономист, исключительно наблюдателен,
            способный по едва уловимым, только ему одному заметным признакам
            составить очень точное представление о характере человека и о
            мотивах его поведения.
          </UiText>

          <UiText color="role">
            Каждого человека, впервые оказавшегося в поле его зрения, Хранитель
            как бы «препарирует» своим пронизывающим, «рентгеновским» взглядом,
            под которым мало кто себя чувствует уютно. Самое точное
            представление об «этичности» человека, о мотивах его поведения
            складывается у Хранителя именно по первому впечатлению.
          </UiText>

          <UiText>
            В сложившемся негативном мнении он, как правило, не ошибается, а
            если и соглашается отказаться от первоначального впечатления, то
            только для того, чтобы лишний раз себя перепроверить.
          </UiText>

          <UiText>
            Наделив его этим ценным качеством, природа как бы извинилась за то,
            что слегка обделила его интуицией и логикой.
          </UiText>

          <UiText preset="large" color="role">
            Пользуясь этим своим природным щитом, Хранитель строит отношения с
            людьми очень осторожно, даже настороженно.
          </UiText>

          <UiText>
            Его раздражает, когда этому его свойству противопоставляют
            альтернативу «изначального дружелюбия ко всем без исключения». Такая
            установка его сбивает с толку, поскольку не противоречит его
            этическим принципам, но вместе с тем является для него опасной, так
            как заставляет забыть о своих сильных качествах и подставить под
            удар слабые.
          </UiText>

          <UiText preset="large" color="role">
            Хранитель часто производит впечатление человека замкнутого и
            некоммуникабельного. Действительно, он лучше себя чувствует в
            привычном и проверенном окружении. И только подчиняясь
            обстоятельствам, буквально заставляет себя расширить круг своих
            знакомств.
          </UiText>

          <UiText color="role">
            Хранитель всегда знает, как к нему относятся, всегда чувствует
            отношение к себе. Всегда чувствует ложь, фальшь и лицемерие и по
            отношению к себе и по отношению к другим.
          </UiText>

          <UiText>
            Со свойственным ему максимализмом, в котором находят отражение все
            его непоколебимые этические принципы, Хранитель предпочитает
            поддерживать отношения только с теми людьми, которые полностью
            соответствует его нравственным критериям.
          </UiText>

          <UiText>
            И даже если создается впечатление, что он предъявляет своему
            окружению слишком завышенные требования, Хранитель не способен
            снизить их, как бы его об этом ни просили.
          </UiText>

          <UiText color="role">
            Не видит и не представляет себя вне системы собственных моральных
            ценностей. Совет «Будь ты проще!» — не для него.
          </UiText>

          <UiText>
            Ситуация «любовного треугольника» для него абсолютно неприемлема.
            Сама мысль о неверности своему супругу кажется ему кощунственной —
            он и сам не допустит неверности по отношению к себе и не позволит
            себе отбить партнера у другого.
          </UiText>

          <UiText>
            Понятие «сексуальных свобод» допускает только как область
            эротических фантазий. И то не для себя. Но в реальной жизни ни для
            себя, ни для своего партнера этого не позволит: слишком горд, чтобы
            делить его еще с кем-то.
          </UiText>

          <UiText preset="large" color="role">
            В отношениях очень последователен, принципиален.
          </UiText>

          <UiText>
            Максималист. Любви, дружбе отдается полностью. Отдает все, что
            имеет, и даже то, чего не имеет.
          </UiText>

          <UiText color="role">
            Может взять ссуду, чтобы оплатить долги своего друга.
          </UiText>

          <UiText>
            На добрый и искренний интерес к себе трогательно отзывчив. И это
            понятно: ведь на его «рентгеновский» взгляд окружающие реагируют, в
            основном, негативным отношением, которое он всегда очень остро
            чувствует и к которому привыкает как к чему-то постоянному в своей
            жизни.
          </UiText>

          <UiText>
            Поэтому на искреннее расположение к себе считает своим долгом
            ответить взаимностью. Но если замечает, что кто-либо злоупотребляет
            его расположением, без сожаления расстается с таким человеком.
            Хранитель долго помнит зло и старается порвать все отношения с тем,
            кто хоть когда-то причинил ему неприятности. Иногда он может
            поддерживать видимость общения, хотя на самом деле для него этого
            человека уже не существует.
          </UiText>

          <UiText>
            В постоянном стремлении «искоренить всё зло на земле», которое в
            условиях психологического дискомфорта концентрируется именно на
            ближайшем окружении, Хранитель бывает слишком скор на «этическую
            расправу».
          </UiText>

          <UiText preset="large" color="role">
            Он, как никто, умеет при первом же подозрении «припереть к стенке»
            своего «обвиняемого», не оставляя ему ни малейшего шанса
            оправдаться.
          </UiText>

          <UiText>
            А заодно, и себя лишая возможности развивать отношения позитивно.
          </UiText>

          <UiText>
            Хранитель обожает «выяснять отношения», опять же, вследствие слабой
            интуиции, в случае психологического дискомфорта или затяжного
            кризиса отношений он может специально спровоцировать ссору, чтобы
            получить дополнительные данные для подкрепления собственных
            наблюдений и для полной уверенности, что к нему относятся именно
            так, как он это чувствует.
          </UiText>

          <UiText color="role">
            Недоверчивый по своей природе, он трудно «очаровывается»: как бы он
            ни любил, как бы ни был привязан, никогда не закрывает глаза на
            недостатки человека — ведь это возможный источник будущих
            неприятностей.
          </UiText>

          <UiText>
            Хранитель вообще мало кому симпатизирует, слишком многое видит в
            людях. Бывает довольно трудно добиться его доверия, вызвать на
            откровенность. Хотя он и выбалтывает много лишнего незаметно для
            себя, поскольку, как все сенсорики, незаметно для себя высказывается
            предельно конкретно.
          </UiText>

          <UiText>
            Но даже намеренно позволяя себе довериться кому-либо, Хранитель
            никогда не исключает возможности, что его откровением злоупотребят:
            во-первых, он понимает, что взаимная откровенность — непременное
            условие, или обязанность, дружеских отношений, во-вторых, боится
            обидеть человека недоверием, а в-третьих, иногда чувствует себя
            достаточно сильным и способным выстоять в любой, этически сложной
            ситуации, на тот случай, если его «секреты» станут известны
            окружающим.
          </UiText>

          <UiText>
            Негативным мнением о себе Хранитель принципиально не желает
            интересоваться, поскольку всегда безошибочно знает, кто и как к нему
            относится. Кроме того, не предполагает за собой плохих поступков,
            поскольку во всем следует своей первой «программной» этической
            заповеди.
          </UiText>

          <UiText>
            По этой же причине старается игнорировать сплетни — этот «этический
            мусор», который не заслуживает его внимания. Крайне раздражается,
            когда вынужден выслушивать негативное мнение о себе: «Нет, ты
            послушай, что о тебе говорят!» — считает это жестокостью, глупостью
            и прямым насилием над собой.
          </UiText>

          <UiText preset="large" color="role">
            Еще ужаснее для него ситуация, в которой ему инкриминируются
            какие-то мифические проступки и в которой он вынужден оправдываться,
            не дай Бог, еще публично, непонятно в каких грехах; такое для
            Хранителя совершенно невыносимо и приводит в крайнее раздражение.
          </UiText>

          <UiText>
            В бытовом общении Хранитель старается держать далекую
            психологическую дистанцию почти со всем своим окружением. Стараясь
            избегать неприятного общества, он может изолировать себя от
            «враждебного» окружающего мира, время от времени, добровольно
            запирая себя «в монастырь».
          </UiText>

          <UiText>
            Хранитель предпочитает общаться только с узким кругом своих близких,
            проверенных друзей. Но это касается только его личного общения, его
            личных симпатий и предпочтений. «Чужие» — это те, кто не вызывает у
            него доверия и в чьем обществе он испытывает психологический
            дискомфорт.
          </UiText>

          <UiText>
            В силу слабой интуиции возможностей и определенной ограниченности
            жизненного опыта Хранителю иногда свойственно делить людей на
            «своих» и «чужих» по этническому или ментальному признаку, но тем
            страшнее и больнее для него разочарование, когда он в «своих» кругах
            встречает «чужих» людей, которые относятся к нему враждебно и
            злоупотребляют его доверием.
          </UiText>

          <UiText>
            В конечном счете деление на «своих» и «чужих» у Хранителя очень
            условно и на протяжении всей его жизни претерпевает много изменений.
          </UiText>

          <UiText preset="large" color="role">
            Хранитель очень не любит, когда его дружбы домогаются насильно.
            Опасается людей, которые «лезут в душу с отмычкой», хотя чаще всего
            именно «на отмычку» и открывается.
          </UiText>

          <UiText>
            Не любит, когда пытаются им манипулировать. Не любит, когда у него
            перехватывают «этическую инициативу».
          </UiText>

          <UiText color="role">
            Взаимоотношения между людьми — основная область его интересов и
            наблюдений, предмет постоянных размышлений и анализа. Именно поэтому
            он так избирателен в выборе друзей и партнеров.
          </UiText>

          <UiText>
            Только его дуал Предприниматель, подсознательно сориентированный на
            аналогичные этические ценности, соответствует представлению
            Хранителя о дружбе. Да и то не всегда!
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">2 — Творческая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_will" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Воля</UiText>
              <UiText preset="body">Волевая сенсорика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Хранитель умеет и может подчинять людей системе своих этических и
            нравственных ценностей, которая составляет весь смысл его
            существования. Он менее всего склонен оставаться сторонним
            наблюдателем этических проблем общества.
          </UiText>

          <UiText color="role">
            Поэтому активно борется с любыми отклонениями от нравственных и
            моральных норм, чем и снискал себе славу «воинствующего моралиста».
          </UiText>

          <UiText>
            Представители этого типа считают своим долгом выявлять все то зло,
            которое обнаруживается в окружающем их пространстве.
          </UiText>

          <UiText>
            Разоблачать общественные пороки, бороться с преступностью,
            нарушением общественной морали; бороться за всеобщее благоденствие,
            за чистоту нравственных норм, за восстановление справедливости, за
            экологию окружающей среды — первейшее его занятие.
          </UiText>

          <UiText preset="large" color="role">
            Хранитель ненавидит организованное зло и всегда стремится
            противопоставить ему сплоченное добро — воинственную добродетель.
          </UiText>

          <UiText>
            Хранитель ненавидит мафию в любом ее проявлении. Никогда ни один из
            представителей этого типа не будет заниматься мафиозным бизнесом.
            Сам тип человека-мафиози, который стремится всеми
            правдами-неправдами пробиться к власти и пользоваться ее благами для
            того, чтобы подчинять своей воле других, вызывает у Хранителя
            глубочайшую антипатию и раздражение, которое он даже в рамках
            приличия не в силах сдержать.
          </UiText>

          <UiText color="role">Хранитель и мафия несовместимы.</UiText>

          <UiText preset="large" color="role">
            Хранителю свойственна высокая требовательность и к себе, и к
            окружающим во всех аспектах его жизни: в дружбе, в любви, в деловых
            отношениях, в работе - во всем равные, часто завышенные, требования
            и к себе, и к другим.
          </UiText>

          <UiText>
            Ответственность за свои слова, поступки, за проявленные чувства, за
            данные обещания, за «тех, кого ты приручил», за качество выполняемой
            работы. Ответственность перед коллективом, коллегами, родственниками
            и семьей… Но самая большая ответственность — перед самим собой.
          </UiText>

          <UiText color="role">
            Для Хранителя характерна исключительная работоспособность и
            педантичная исполнительность.
          </UiText>

          <UiText>
            Хранитель отдает работе максимум усилий, и если от него потребовать
            еще большей отдачи, это быстро приводит к перенапряжению и нервному
            срыву, что резко ухудшит и качество работы, и отношения с
            начальством.
          </UiText>

          <UiText color="role">
            Побудительные мотивы всех его усилий диктуются именно этическим
            аспектом и выражаются лозунгом: «Делай для других так, как ты
            хочешь, чтобы сделали для тебя».
          </UiText>

          <UiText preset="large" color="role">
            Хранитель не любит привлекать посторонних к решению своих проблем,
            предпочитает справляться собственными силами — чего бы это ему ни
            стоило.
          </UiText>

          <UiText>
            А также не симпатизирует тем, кто обычно решает свои проблемы за
            чужой счет. Навязывание другим своих проблем считает неэтичным и
            бестактным. В его понимании это неуважение к чужому свободному
            времени, к праву человека на досуг.
          </UiText>

          <UiText>
            По той же причине старается никому не навязывать своего общества,
            даже самым близким друзьям, даже если ему очень одиноко.
          </UiText>

          <UiText color="role">
            Обязательный. Если в силу объективных причин не может выполнить
            взятое на себя обязательство, очень страдает. По этой же причине не
            любит брать в долг или покупать в кредит — волнуется, что не сможет
            вовремя вернуть.
          </UiText>

          <UiText preset="large" color="role">
            В условиях нейтральных отношений вежлив, дисциплинирован, подтянут и
            того же требует от других: ведь нельзя же раздражать окружающих
            грубыми манерами, вызывающим поведением и неэстетичным видом.
          </UiText>

          <UiText>
            В доме старается поддерживать чистоту и порядок. Считает
            недопустимым запускать домашние дела — рассматривает это как
            необязательность по отношению к другим членам семьи.
          </UiText>

          <UiText preset="large" color="role">
            Даже если берет какую-то работу на дом, старается сначала сделать
            все домашние дела, чтобы потом спокойно сесть за работу.
          </UiText>

          <UiText>
            Уходя из дома, обязательно за собой все приберет — ему неприятно
            возвращаться в неприбранную квартиру.
          </UiText>

          <UiText>
            После ухода гостей, в тот же вечер перемоет всю посуду, вытрет и
            расставит по местам. Тщательно уберет всю квартиру и только после
            этого позволит себе отдохнуть.
          </UiText>

          <UiText>
            Его очень раздражают, например, такие мелочи, как крошки на столе
            или пятна на полу, разбросанная одежда, «завалы» на письменном
            столе.
          </UiText>

          <UiText>
            Он отложит свои самые неотложные дела для устранения этих
            «раздражителей», и при случае может строго выговорить домашним за
            безответственное отношение к порядку в доме.
          </UiText>

          <UiText preset="large" color="role">
            Необходимость терпеть беспорядок в своем доме угнетает его до такой
            степени, что может даже быть поводом для развода.
          </UiText>

          <UiText>
            Хранителя раздражают любые отклонения от установленного им в своем
            доме порядка.
          </UiText>

          <UiText color="accent">
            Даже такая, например, мелочь: если еда, которую он подаëт, съедается
            не в том порядке, в котором он это задумал, его это уже раздражает.
          </UiText>

          <UiText>
            Свое раздражение Хранитель подавляет только в обществе дуала
            Предпринимателя — только ему еще как-то позволяется нарушать порядок
            в доме, но и то в разумных пределах.
          </UiText>

          <UiText>
            В противном случае, это будет стоить Хранителю слишком большого
            расхода времени и сил, что он тут же расценит как неуважение к
            своему труду, и за что с Предпринимателя сразу же «строжайше
            взыщется».
          </UiText>

          <UiText>
            Творческая волевая сенсорика Хранителя особенно ярко проявляется в
            экстремальной ситуации — при защите его интересов и главное — при
            защите интересов его взаимоотношений.
          </UiText>

          <UiText>
            На свои взаимоотношения Хранитель никому не позволяет посягать.
            Очень не любит, если кто-то оговаривает его друзей — предпочитает
            сам во всем разобраться.
          </UiText>

          <UiText>
            По этой же причине старается не давать повода говорить плохо о себе.
            Никому не позволяет поссорить себя с другом. За друга, за любимого
            человека пойдет в огонь и воду, не рассуждая и не считаясь с
            опасностями.
          </UiText>

          <UiText preset="large" color="role">
            Охраняет свои взаимоотношения от нападок со стороны. Не позволяет
            оказывать на себя волевое давление.
          </UiText>

          <UiText>
            Когда на Хранителя пытаются оказать нежелательное воздействие или
            проявляют нежелательную этическую инициативу, он способен дать отпор
            невероятной силы.
          </UiText>

          <UiText>
            Иногда после такого инцидента у него остается неприятный осадок — он
            чувствует, что завысил меру обороны, «стрелял из пушки по воробью».
            Но в любом случае, последнее слово непременно должно остаться за
            ним: а иначе, какой бы он был сенсорик?
          </UiText>

          <UiText preset="large" color="role">
            Очень упрям, неохотно меняет свое мнение.
          </UiText>

          <UiText>
            Иногда, чувствуя враждебное настроение окружающих, Хранитель может
            начать «защищаться» еще до того, как на него «напали», но тогда
            почти сразу же замечает свою неправоту и испытывает жесточайшие
            угрызения совести. Хранитель не может первым нападать — это
            противоречит его этической программе.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">3 — Ролевая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_logic" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Теория</UiText>
              <UiText preset="body">Структурная логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Хранителю всегда хочется произвести впечатление человека
            рассудительного и здравомыслящего. Более того, ему очень хочется
            быть таковым и он всю жизнь этому учится.
          </UiText>

          <UiText color="role">
            Хранитель старается контролировать свои чувства рассудком и
            логически анализировать все происходящее с ним, но это у него плохо
            получается.
          </UiText>

          <UiText>
            Очень уважает в людях умение четко и лаконично излагать свою мысль.
            Сам этому долго и малоуспешно учится.
          </UiText>

          <UiText>
            Любое изучаемое явление, теорию или предмет старается понять по
            сути, разложить «по полочкам», найти в нем какую-то закономерность.
            Успешно учится только по четко разработанным и доступно изложенным
            методикам.
          </UiText>

          <UiText>
            Если же предмет преподаëтся хаотично, сумбурно, непоследовательно, с
            какой-то импровизированной тематикой, с постоянной сменой методик
            или с полным отсутствием таковой — для него это катастрофа: такое
            обучение он не воспринимает, попадает в число отстающих, очень из-за
            этого переживает, впадает в панику и уныние.
          </UiText>

          <UiText color="role">
            С возрастом Хранители становятся особенно разборчивы в выборе
            учителей и методов образования, уровень которого они на протяжении
            всей своей жизни постоянно повышают: овладевают несколькими
            профессиями (необязательно смежными), в которых считают необходимым
            добиваться высокого профессионализма.
          </UiText>

          <UiText>
            А поскольку совершенствование мастерства требует постоянного
            углубления в теорию, учеба ими воспринимается как самый постоянный и
            естественный в жизни процесс.
          </UiText>

          <UiText preset="large" color="role">
            Хранители стараются быть логичными и последовательными в изложении
            своих аргументов.
          </UiText>

          <UiText>
            Поэтому продумывают их заранее и излагают по пунктам: «Во-первых,
            во-вторых, в-третьих… ». Но уже на «в-четвертых» и «в-пятых»
            отклоняются от заданной темы, на «в-шестых» и «в-седьмых» повторяют
            и варьируют предыдущие аргументы, а при столкновении с «программным»
            или «творческим» логиком, особенно из противоположной квадры, вся их
            такая «стройная» и «продуманная» концепция разваливается еще на
            первом пункте.
          </UiText>

          <UiText>
            Логика Хранителя не выдерживает столкновений и с теми, у кого этот
            аспект находится на еще более слабых позициях -например, с
            иррациональными этическими экстравертами — Политиком и Советчиком,
            когда логическая последовательность спора вообще не соблюдается, а
            разговор постоянно перескакивает на личностные «разборки».
          </UiText>

          <UiText>
            Обычный выход для Хранителя в этой ситуации — вовремя увидеть
            нецелесообразность дальнейшей дискуссии, что ему дается ценой
            огромного напряжения, и, целиком опираясь на свою волевую сенсорику,
            выйти из спора, стараясь при этом никого, по возможности, не
            обидеть.
          </UiText>

          <UiText>
            Вследствие таких «споров» у Хранителей корректируется представление
            о собственном «логическом потенциале» и они с еще большим усердием и
            вниманием начинают относиться к его развитию.
          </UiText>

          <UiText>
            Поскольку не считают себя в этом вопросе абсолютно безнадежными,
            хотя и понимают, что профессии философа и теоретика — не для них.
          </UiText>

          <UiText>
            Логические соотношения для Хранителя не так важны, как этические.
            Поэтому в интересах этики отношений он может исказить факты, может
            манипулировать ими, что вызывает некоторые осложнения на начальном
            этапе дуализации его с Предпринимателем.
          </UiText>

          <UiText>
            Но впоследствии Предприниматель понимает, что не следует придираться
            к некоторым логическим погрешностям Хранителя, и относит его
            «логическую» информацию на аспект этики, понимает, что за логической
            информацией Хранителя стоят только его этические побуждения.
          </UiText>

          <UiText>И Хранитель ему за это понимание очень благодарен.</UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">4 — Болевая функция.</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_ideas" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Мысль</UiText>
              <UiText preset="body">Интуиция возможностей</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Проявляется в постоянном предчувствии неприятностей, которые
            Хранитель ожидает повсеместно и ото всех.
          </UiText>

          <UiText>
            Ему трудно быть дальновидным, увидеть ситуацию в развитии. Свои
            собственные возможности ни в какой, даже в самой, казалось бы,
            выигрышной для себя ситуации просчитать не может. Часто, если не
            постоянно, испытывает ощущение безысходности.
          </UiText>

          <UiText>
            Об успехах, удачах и неудачах не рассуждает — для него это слишком
            больная тема. Не переносит, когда приводят в пример чужие успехи:
            воспринимает это как упрек в свой адрес.
          </UiText>

          <UiText>
            Хранитель никогда не бывает доволен результатами своей работы.
            Сколько бы ни сделал, считает, что все это ничтожно мало. Чего бы ни
            добился — все ему кажется, что недостаточно реализовал свой
            творческий потенциал.
          </UiText>

          <UiText>
            Хранителю неимоверно трудно находить применение своим способностям.
            Постоянное ощущение собственной невостребованности — для него
            мучительнейшая пытка.
          </UiText>

          <UiText color="role">
            Хранитель не способен за себя просить — слишком горд, и, кроме того,
            считает это чем-то подлым и несправедливым по отношению к другим.
          </UiText>

          <UiText preset="large" color="role">
            Испытывает страшную неловкость всякий раз, когда вынужден отвечать
            на вопросы: «Что вы можете?», «Что вы умеете?»
          </UiText>

          <UiText>
            И тем не менее Хранитель умеет так много и на таком высоком
            профессиональном уровне, что в это просто трудно поверить, потому-то
            ему и самому неудобно об этом говорить.
          </UiText>

          <UiText preset="large" color="role">
            Желание Хранителя реализовать свои способности бывает настолько
            сильным, что он постоянно повышает свой профессиональный уровень,
            работая во всех доступных ему и интересующих его областях.
          </UiText>

          <UiText>
            И тем не менее Хранитель умеет так много и на таком высоком
            профессиональном уровне, что в это просто трудно поверить, потому-то
            ему и самому неудобно об этом говорить.
          </UiText>

          <UiText>
            Хранитель не согласен с тем, что «нельзя служить двум богам
            одновременно». Для него свойственно «обрастать специальностями»:
            если не представляется возможности реализовать себя в одной
            профессии, осваивает другую, но навыки предыдущей специальности
            старается поддерживать на профессиональном уровне — мало ли
            пригодится.
          </UiText>

          <UiText color="role">
            Не способен пробивать себе дорогу к успеху нечестными методами.
            Сшибать преграды лбом, работать локтями, драться за работу «как за
            кость», получать ее «через диванчик» — все это не для него, все это
            ниже его достоинства.
          </UiText>

          <UiText>
            Хранитель считает, что способности и таланты — это божий дар,
            следовательно, и реализовывать их надо честными методами, а не по
            закону джунглей. В конкурсе, где победитель заранее известен,
            Хранитель, как правило, не участвует.
          </UiText>

          <UiText>
            Хранитель вообще плохо себя чувствует в условиях нездоровой
            конкуренции:
          </UiText>

          <UiText color="accent">
            «В ожидании прослушивания я чувствовала себя как в очереди за
            бесплатной похлебкой. Вокруг безработные, неустроенные музыканты,
            глаза у всех злые, голодные. Выступать пришлось перед своими же
            конкурентами, а это предельно трудно — физически ощущаешь их зависть
            и недоброжелательность, ведь каждый рассматривает этот конкурс как
            свой последний шанс…»
          </UiText>

          <UiText preset="large" color="role">
            В обстановке нездоровой конкуренции Хранитель работать не может. Не
            любит, когда ему завидуют.
          </UiText>

          <UiText>
            Сам старается не возбуждать в людях зависть, возбуждать в людях
            низменные чувства считает неэтичным, поэтому обычно довольно скромно
            рассказывает о своих достижениях.
          </UiText>

          <UiText>
            По этой же причине он часто испытывает затруднения в поисках работы,
            в поисках заказа, ангажемента. Выгодно продать свою работу — для
            него просто невыполнимая задача. Иногда он искренне рад, если его
            услугами пользуются даром — все же хоть какая-то востребованность.
          </UiText>

          <UiText>
            Хранителю трудно просчитать свои возможности. Он может спасовать
            перед легкой задачей, но при этом замахнутся на сверхсложную,
            сделает работу высочайшего класса, но не решится донести ее до
            зрителя.
          </UiText>

          <UiText>
            Несмотря на свою этическую проницательность Хранитель нередко
            ошибается в выборе друзей, советчиков или партнеров. Часто
            «Дон-кихотствует не по делу» — дает шанс и оказывает помощь тому,
            кто менее всего этого заслуживает, — отвечает злом на добро,
            злоупотребляет его доверием, дружбой, чувствами, отношением.
          </UiText>

          <UiText>
            Хранителя легко облапошить: «подписать» на изначально обреченный
            проект, на авантюрный эксперимент, подрядить на сопряженную с
            риском, невыгодную работу.
          </UiText>

          <UiText preset="large" color="role">
            Его с легкостью можно «подставить», он чаще других становится
            жертвой афер и спекуляций. Вследствие этого Хранитель старается быть
            особенно осторожным в своих поступках, словах, решениях и
            взаимоотношениях.
          </UiText>

          <UiText>
            С другой стороны, чем больше он осторожничает, тем больше напряжения
            и враждебности он создает в собственном окружении, и тем меньше
            оставляет шансов для себя.
          </UiText>

          <UiText color="role">
            Много проблем доставляет ему неспособность вовремя предвидеть и
            правильно оценить возможную опасность, а также неумение правильно
            рассчитать свои силы, что неизбежно приводит к перегрузкам, нервным
            срывам, провалам на экзаменах и выступлениях, вследствие чего, он
            чувствует себя законченным неудачником.
          </UiText>

          <UiText>
            Поскольку собственный успех дается ему ценой неимоверного,
            каторжного труда, его, как и Инспектора всегда раздражает и
            возмущает легкий успех у других, сам он, разумеется, в легкий успех
            не верит, и его всегда неприятно задевает самоуверенность некоторых
            удачливых выскочек.
          </UiText>

          <UiText>
            Хранителя, так же как и Инспектора держат в постоянном напряжении
            неизвестность и неопределенность его положения в системе любых
            отношений — и в деловых и в этических. Поэтому выяснение отношений
            для него самое первоочередное занятие, причем неопределенному «да»
            Хранитель предпочитает определенное «нет».
          </UiText>

          <UiText preset="large" color="accent">
            Нет ничего страшнее для Хранителя, чем вынужденное ожидание и
            бездействие в условиях полнейшей неопределенности и неизвестности.
          </UiText>

          <UiText>
            Паника Хранителя легко пресекается окриком его дуала
            Предпринимателя: «Ну, сколько можно паниковать?» — Хранитель
            моментально берет «себя в руки», мобилизует свою силу воли, и вот он
            уже готов к новым испытаниям.
          </UiText>

          <UiText>
            Хранитель очень болезненно переживает непредвиденные разочарования —
            если отменяется долгожданный праздник, срывается назначенное
            свидание или разрушается созданная им романтическая обстановка.
            Такое он долго помнит, стараясь впредь не строить иллюзий.
          </UiText>

          <UiText color="role">
            Хранители предпочитают не связываться с экстравагантными и
            непредсказуемыми в своем поведении людьми.
          </UiText>

          <UiText>
            Попадая в одну с ними компанию, быстро начинают ощущать опасность и
            ненужность своего здесь пребывания, стараются поскорее уйти.
          </UiText>

          <UiText>
            Детям-Хранителям в аналогичной ситуации становится нестерпимо
            грустно, и они без видимой причины начинают плакать. Часто
            предпочитают держаться обособленно от других детей, не любят игр с
            неприятными сюрпризами, не любят глупых, жестоких розыгрышей.
          </UiText>

          <UiText>
            Замечено, что Хранитель не особенно любит ходить по врачам: если и
            есть какая-то опасность для здоровья, предпочитают о ней не знать.
          </UiText>

          <UiText>
            Проявление заботы о себе Предприниматель воспринимает, как выражение
            хорошего отношения. Только с таким партнером он по-настоящему
            расслабляется, только ему он по-настоящему доверяет.
          </UiText>

          <UiText>
            Не любит медосмотров и обследований: ему неприятно, когда в нем
            видят какие-то физические изъяны.
          </UiText>

          <UiText>
            Подсознательная связь со слабой сенсорикой его дуала
            Предпринимателя.
          </UiText>

          <UiText color="role">
            Вынужденная необходимость ограждать себя от неприятностей, вечный
            самоконтроль, постоянная сдержанность и самоограничения — все это в
            конечном счете выливается в ощущение неполноты жизни, сожаление, что
            самое интересное проходит мимо.
          </UiText>

          <UiText>
            Из этого состояния Хранитель может выйти только с помощью своего
            дуала-Предпринимателя. Только Предприниматель может реализовать его
            несостоявшиеся мечты. Только он со своей фантазией, жизнелюбием,
            оптимизмом, здоровым авантюризмом и неисчерпаемой энергией способен
            вырвать Хранителя из плена его вечных химерических страхов.
          </UiText>

          <UiText>
            С помощью Предпринимателя Хранитель перестает ощущать свою
            никчемность и ненужность в этом мире. Для Хранителя Предприниматель
            — это выход из тупика на свежий воздух, на яркие краски жизни.
          </UiText>

          <UiText>
            В лице Предпринимателя он наконец находит желанный идеал любви и
            дружбы. Предприниматель — единственный, к которому Хранитель
            чувствует безграничное доверие, в чьей преданности не сомневается
            сам и не позволяет сомневаться другим.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">5 — Внушаемая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_business" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Практика</UiText>
              <UiText preset="body">Деловая логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Хранитель очень уважает людей с ярко выраженными деловыми, в его
            понимании, качествами: честных тружеников, мастеров «на все руки»,
            способных усовершенствовать и рационализировать процесс труда.
          </UiText>

          <UiText>
            Подсознательно Хранитель сориентирован на деловую логику
            Предпринимателя, поэтому он всегда замечает и осуждает какие-то
            бесполезные и неэффективные методы работы.
          </UiText>

          <UiText>
            Так же как и Предприниматель, Хранитель считает, что деловые
            проблемы надо решать «в корне», а не какими-то частными полумерами,
            но ввиду того, что у него этот аспект попадает на самую пассивную
            психическую функцию, ему трудно предпринимать в этой области
            самостоятельные действия — здесь ему необходима помощь дуала.
          </UiText>

          <UiText>
            С помощью Предпринимателя Хранитель может реализовать себя
            практически, найти себе достойное применение, найти занятие по
            способностям. В лице Предпринимателя он получает защитника своих
            деловых интересов.
          </UiText>

          <UiText preset="large" color="role">
            Хранитель очень работоспособен. Умеет работать эффективно и
            сосредоточенно. Быстро осваивает новые специальности. Умеет и любит
            работать с полной отдачей.
          </UiText>

          <UiText>
            Для Хранителя очень важно, чтобы работа соответствовала его
            творческому и интеллектуальному потенциалу. Важно, чтобы в работе
            была возможность профессионального роста, повышения квалификации.
          </UiText>

          <UiText>
            Работа должна быть и для ума и для души одновременно. Если
            выполняемая работа не реализует его потенциал, он меняет профессию.
          </UiText>

          <UiText>
            Пытаясь самостоятельно решить свои деловые проблемы, Хранитель часто
            совершает ошибку, подменяя аспект «деловой логики» аспектом «деловых
            отношений», которые, как он считает, обязаны быть глубоко этичными.
          </UiText>

          <UiText>
            Так, осваиваясь на производстве, он старается как можно меньше
            обращаться за помощью к своему мастеру.
          </UiText>

          <UiText>
            Это объясняется тем, что Хранитель подсознательно настроен на
            деловую логику Предпринимателя, который не любит, когда к нему
            каждую минуту обращаются за разъяснениями и просьбами о помощи, и
            очень ценит в сотруднике стремление во всем разобраться
            самостоятельно.
          </UiText>

          <UiText preset="large" color="role">
            Хранитель, в свою очередь, подсознательно чувствует, что ему как
            будто «неудобно» каждый раз отрывать других от работы, поэтому он и
            старается обойтись собственными силами, чем иногда создает
            впечатление «слишком гордого» человека.
          </UiText>

          <UiText>
            В силу чрезмерной деликатности и слабой интуиции Хранителю бывает
            трудно самостоятельно заниматься бизнесом — трудно назначать и
            «держать» свою цену. Трудны отношения, когда выгода одной стороны
            оборачивается убытком для другой. Таких отношений он старается
            избегать.
          </UiText>

          <UiText>
            По этой же причине он предпочитает и не торговаться о цене — считает
            это унизительным и для себя, и для продавца: ведь, наверное,
            продавец просто не может продать дешевле, поэтому и назначает такую
            цену и столько надо платить.
          </UiText>

          <UiText color="role">
            Может не захотеть покупать и по резко сниженной цене — значит,
            прежняя цена была явно завышена, значит, продавец вообще дурной
            человек и не заслуживает того, чтобы с ним имели дело!
          </UiText>

          <UiText>
            Хранителю трудно просить прибавку к жалованью: он считает, что
            работодатель должен сам оценить его труд и достойно вознаградить
            его, а если этого не происходит, значит, либо босс — безнадежно
            скупой человек, либо — фирма прогорает. В любом случае надо искать
            другое место, что он и делает.
          </UiText>

          <UiText>
            В деловых вопросах Хранитель не силен, и всю жизнь пользуется самым
            примитивным набором стереотипных решений: не получается заработать —
            надо экономить, не получается сделать самому — надо нанять
            специалиста, нет денег оплатить его услуги — надо терпеть неудобства
            и копить деньги.
          </UiText>

          <UiText>
            Деловой хватки у Хранителя нет. Прагматизм рассматривается ими, как
            нечто неэтичное и противоположное их программе.
          </UiText>

          <UiText>
            По этой же причине им довольно трудно симпатизировать своим дуалам
            Предпринимателям на начальном этапе отношений или в сфере
            противоположных деловых интересов — тут они чувствуют себя маленькой
            рыбешкой перед пастью акулы.
          </UiText>

          <UiText>
            Хранителю необходимо постоянно получать информацию по аспекту
            деловой логики. Он обязательно должен знать четкие и не
            противоречащие его этической программе ответы на вопросы «Что
            делать?» и «Как сделать?»
          </UiText>

          <UiText>
            И только его дуал Предприниматель может дать ему все указания и все
            объяснения в той форме, которая полностью его удовлетворит. Потому
            что подсознательно, как уже было сказано, Хранитель настроен на
            деловую логику Предпринимателя, на его «альтернативный прагматизм».
          </UiText>

          <UiText>
            Деловые проблемы Хранителя решаются только «в одной команде» с
            Предпринимателем. И не дай Бог ему оказаться со своим дуалом «по
            разную сторону баррикад», конкурировать с ним или делить
            противоположные интересы — полнейший провал обеспечен.
          </UiText>

          <UiText>
            С помощью «деловых логиков» другого психологического типа проблемы
            Хранителя не решаются, а только усугубляются.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">
            6 — Активационная функция
          </UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_time" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чутьё</UiText>
              <UiText preset="body">Интуиция времени</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Время — это тот аспект, который Хранитель хотел бы игнорировать.
            Время — враг сенсорики. Недостаток времени ему мешает сделать работу
            безупречно красивой. Время крадет его силы, красоту, молодость,
            возможности.
          </UiText>

          <UiText>
            Время приносит какие-то, не всегда приятные перемены, к которым
            нужно еще, неизвестно как, приспосабливаться, а на это опять
            требуется время.
          </UiText>

          <UiText>
            Хранитель предпочитает работать медленно, тщательно прорабатывая
            детали, но (если это кому-нибудь нужно) может работать и очень
            интенсивно, делая по нескольку дел одновременно, не отдыхая, а
            только переключаясь с одной работы на другую.
          </UiText>

          <UiText preset="large" color="role">
            Лучший способ активизировать Хранителя — назначить ему четкие
            «временные рамки».
          </UiText>

          <UiText color="role">
            В зависимости от заданного срока Хранитель планирует и объем работы,
            и степень проработанности деталей. Поэтому ему всегда важно знать,
            на какое количество времени он может рассчитывать, стараясь при этом
            учитывать и непредвиденный расход времени.
          </UiText>

          <UiText>
            В достаточно насыщенном временном режиме Хранитель чувствует свою
            востребованность. Но лучше всего, когда ему «задает темпы» его дуал
            — только он может это сделать с учетом проблемной интуиции
            Хранителя, недооценивающего или переоценивающего темпы своей работы.
          </UiText>

          <UiText>
            По подсказке Предпринимателя Хранитель оценивает актуальность
            заданной работы, подстраивается под насыщенный рабочий ритм
            Предпринимателя и под «временные пустоты» его вынужденной
            безработицы, заполняя их какими-то своими, давно откладываемыми
            делами.
          </UiText>

          <UiText preset="large" color="role">
            Хранитель терпеть не может непродуктивного расхода времени - он не
            любит ждать и ему неприятно заставлять ждать других: поэтому
            старается быть пунктуальным.
          </UiText>

          <UiText color="role">
            Ему же самому собственная пунктуальность дается ценой перерасхода
            времени, следствие слабой интуиции возможностей — ему трудно
            рассчитать количество времени, требуемое на дорогу, с учетом разных
            транспортных неожиданностей.
          </UiText>

          <UiText>
            Хранитель не любит тратить время на незапланированное общение, «на
            неожиданный приезд и продолжительный присест» — еще одна причина, по
            которой Хранитель ограничивает круг своих знакомств.
          </UiText>

          <UiText color="role">
            Хранитель ценит свое время, поскольку это не только одна из
            ценностей его диады, это и квадровая ценность — стремление сделать
            как можно больше, стремление реализовать свой потенциал. Все это
            делает фактор времени для Хранителя особенно значимым.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">7 — Функция защиты</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_emotions" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Желание</UiText>
              <UiText preset="body">Этика эмоций</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            В стремлении избежать неприятных этических отношений Хранитель в
            первую очередь сосредоточен на наблюдении отрицательных эмоций.
            Положительные эмоции ему наблюдать менее интересно — он им либо не
            верит, либо не относит на свой счет.
          </UiText>

          <UiText>
            Хранитель распознает эмоциональное состояние каждого, кто попадает в
            поле его наблюдений, но, и в этом его отличие от Гуманиста, он
            интересуется только теми эмоциями, которые касаются его личных
            взаимоотношений.
          </UiText>

          <UiText>
            Быть, например, сторонним наблюдателем скандалов в общественном
            месте ему и неприятно и неинтересно. Другое дело, когда он
            становится их невольным участником… Возможно поэтому Хранители,
            иногда неожиданно для себя, и втягиваются в такие скандалы.
          </UiText>

          <UiText>
            Сами по себе интриги, сплетни, разборки в коллективе Хранителя не
            интересуют — только в том случае, если это имеет к нему
            непосредственное отношение. Ему все равно, кто с кем перемигивается,
            а это ему всегда видно. Главное — как это относится непосредственно
            к нему или к его партнеру.
          </UiText>

          <UiText preset="large" color="role">
            Очень отзывчив на чужую боль и страдание, но утешать не любит —
            боится, что сочувствие может лишний раз напомнить человеку о его
            боли, и тем самым заставит его лишний раз ее пережить.
          </UiText>

          <UiText>
            Страдания, по мнению Хранителя — это неприятные ощущения, которые
            нужно как можно скорее оставить в прошлом, а муссировать их нечего.
          </UiText>

          <UiText>
            Еще больше не любит выражать формальное соболезнование, но
            заставляет себя, если того требуют приличия. Всегда старается помочь
            делом. Считает, что сочувствие, не подкрепленное конкретным делом,
            неубедительно и может быть воспринято как фальшь.
          </UiText>

          <UiText>
            То же самое и с выражением благодарности: если не за что
            благодарить, но приличия того требуют, делает над собой усилие. А
            его искреннее «спасибо» очень дорого стоит.
          </UiText>

          <UiText preset="large" color="role">
            Считает добрые поступки этической нормой, а дурные — отклонением от
            нормы. Поэтому зло помнит долго, а добро считает в порядке вещей —
            из-за чего некоторым кажется неблагодарным.
          </UiText>

          <UiText color="role">
            Не способен намеренно причинить боль. Очень переживает, если кого-то
            нечаянно заставил страдать.
          </UiText>

          <UiText preset="large" color="role">
            Под влиянием чувств склонен жертвовать своими интересами.
          </UiText>

          <UiText>
            В любви и дружбе способен на исключительную эмоциональную
            самоотдачу, в противном случае, ему бы не удалось убедить такого
            глубоко ранимого и стеснительного в проявлении своих чувств
            партнера, как Предприниматель.
          </UiText>

          <UiText>
            Впрочем, иногда даже Предприниматель вынужден приглушать избыток
            страстей Хранителя, особенно, если это мешает его работе.
          </UiText>

          <UiText>
            Партнеров других психологических типов пылкая чувственность
            Хранителя совсем не вдохновляет, иногда даже отпугивает — она как-то
            не вяжется с его внешней холодностью и неприступностью.
          </UiText>

          <UiText>
            Хранитель никому не позволяет регулировать силу своих эмоций:
            сколько ни есть — все его, а кому не нравится — пусть ищет себе
            другого партнера.
          </UiText>

          <UiText>
            Хранитель не переносит «эмоционального приспособленчества», он не
            понимает, как можно подстраивать свои чувства под настроение
            партнера. Это в его понимании — лицемерие.
          </UiText>

          <UiText>
            Настроение Хранителя может только автоматически меняться в
            зависимости от настроения окружающих, ему можно поднять настроение,
            а можно и испортить. Но сам он, как правило, настроение не задает.
          </UiText>

          <UiText color="role">
            Не «покупается» на дешевые комплименты и откровенную лесть. Сам
            никогда не льстит, комплименты говорит очень редко, и только
            искренне восхищаясь чем-либо.
          </UiText>

          <UiText>
            В его понимании, говорить комплименты — то же, что и льстить.
            Поэтому он всегда опасается, что его искреннее восхищение будет
            воспринято как фальшь. Мысленно он всегда отмечает чьи-то
            достоинства, но не всегда решается высказаться на этот счет вслух.
          </UiText>

          <UiText color="role">
            Очень сдержан в выражении своих симпатий, опасается демонстративно
            выражать свои эмоции. Поэтому никогда не выражает больше, чем
            чувствует, хотя в своих антипатиях откровенен до бестактности, но в
            этом случае собственную бестактность считает вполне допустимой.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">8 — Фоновая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_comfort" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Комфорт</UiText>
              <UiText preset="body">Сенсорика ощущений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Цель и смысл сенсорики Хранителя именно в том, чтобы создавать
            условия максимального комфорта, уюта и удовольствия для своего
            партнера, а также оградить его от неприятных ощущений.
          </UiText>

          <UiText color="accent">
            В паре Предприниматель — Хранитель сенсорная гармония не является
            самоцелью, но выступает как часть и непременное условие гармонии
            этической, как бы являясь залогом гармоничных взаимоотношений.
          </UiText>

          <UiText>
            Создавая свое произведение, Хранитель всегда думает о том, как будет
            восприниматься его работа.
          </UiText>

          <UiText color="accent">
            Например, он скрупулезно прорабатывает детали, поскольку
            предполагает, что его работу захотят рассматривать вблизи: ведь не
            должен же зритель шарахаться от его произведения только потому, что
            подошел к нему слишком близко.
          </UiText>

          <UiText preset="large" color="role">
            Изделие рук Хранителя отличается изяществом и завершенностью
            деталей. Именно поэтому он более склонен к миниатюре, чем к
            монументальности.
          </UiText>

          <UiText>
            В живописи Хранитель не любит слишком ярких, раздражающих цветовых
            сочетаний, поэтому успешнее работает в дизайне или в
            декоративно-прикладном искусстве. Так же как и Инспектору, ему легче
            работать по заказанной теме: если это кому-нибудь нужно, его это
            активизирует к работе.
          </UiText>

          <UiText>
            Кулинария Хранителя — изысканный вкус при простоте компонентов и
            минимальных затратах времени и средств.
          </UiText>

          <UiText>
            Хранители умеют устраивать приемы по высшему разряду, стараясь при
            этом окружить гостей максимальным комфортом. Хранитель обычно не
            задумывается, почему он старается подать кушанье в таком виде, чтобы
            сам процесс еды уже не представлял никаких затруднений — без
            косточек, без кожуры, без горошинок перца.
          </UiText>

          <UiText>
            Но на самом деле это объясняется подсознательным расчетом на его
            дуала Предпринимателя, который во время еды может заниматься своей
            работой, смотреть телевизор или читать газету и потому не всегда
            замечает, что он ест.
          </UiText>

          <UiText preset="large" color="role">
            В одежде Хранитель ценит сочетание красоты, удобства и
            функциональности.
          </UiText>

          <UiText color="role">
            Одевается с элегантной простотой и изяществом.
          </UiText>

          <UiText>
            В силу слабой интуиции, не позволяет себе никакой экстравагантности,
            не злоупотребляет декоративными дополнениями; вообще, старается не
            привлекать к своей одежде взгляды посторонних — предпочитает, чтобы
            смотрели на его лицо.
          </UiText>

          <UiText>Одежда — только рамка его собственной красоты.</UiText>

          <UiText preset="large" color="role">
            Умеет создать уют и комфорт самыми простыми средствами. Порядок и
            чистота помещения — непременное условие его быта.
          </UiText>

          <UiText>
            Перед выходом на работу Хранитель последние минуты потратит на
            наведение порядка с тем, чтобы обязательно вернуться в чистую
            квартиру. Для него это очень важно.
          </UiText>

          <UiText>
            Любит неперегруженный интерьер. В декоративных дополнениях не любит
            слащавости, следствие эстетического воспитания Мастером.
          </UiText>

          <UiText>
            Часто развивает в себе массу художественных и музыкальных талантов,
            благодаря чему ему не скучно наедине с собой, а его дуалу не скучно
            с ним. В искусстве Хранитель видит для себя возможность добиться
            заслуженного успеха упорным трудом — и здесь он наконец-то к нему
            приходит.
          </UiText>

          <UiText>
            Для Хранителя очень важна высокая оценка его искусству. Поэтому он
            предпочитает демонстрировать его только в узком кругу самых близких
            друзей. Но в первую очередь ему приятно радовать своим мастерством
            именно своего партнера.
          </UiText>

          <UiText>
            Хранители наделены природной, подсознательной, способностью очень
            точно координировать свои сенсорные ощущения относительно ощущений
            партнера — качество, которое так ценится их дуалом и которое
            доставляет им обоим много радости.
          </UiText>

          <UiText preset="large" color="role">
            Смысл эстетики Хранителя напрямую связан с его этической программой
            — уютное гнездышко для двоих.
          </UiText>

          <UiText>
            Типичный ее образец — «хрустальная мечта» — куколка Барби в своем
            уютном домике, вместе со своим «принцем».
          </UiText>

          <UiText color="role">
            Любое произведение искусства, созданное им, как бы воссоздает эту
            мечту.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
