<template>
  <div class="text g-page">
    <section>
      <UiText preset="large" color="role">
        В повседневной жизни вы — человек открытый, общительный, дружелюбно
        настроенный. За это вас любят окружающие.
      </UiText>

      <UiText>
        Вы умеете доставлять удовольствие людям. Вы гостеприимны, хлебосольны,
        заботливы. Умеете интересно и наполнено проводить свободное время:
        ходите в кино, театры, концерты, часто бываете в гостях.
      </UiText>

      <UiText>
        Любите приятные поездки и путешествия. Вы не прочь провести время в
        веселых, шумных компаниях, любите праздники и застолья.
      </UiText>

      <UiText>Вам нравится дарить подарки, доставлять людям радость.</UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Ваша основная проблема — неумение распорядиться своим временем в
        повседневных делах.
      </UiText>

      <UiText>
        Вы слишком торопливы, часто суетливы, у вас ни на что не хватает
        времени. Вы утопаете в бесконечных делах и заботах, иной раз забывая о
        главном.
      </UiText>

      <UiText preset="large" color="role">
        Старайтесь правильно спланировать свой день.
      </UiText>

      <UiText>
        Откажитесь от мелких, второстепенных дел и вопросов, отложите их на
        потом. Не хватайтесь за все сразу, иначе вам не удастся все сделать в
        сроки.
      </UiText>

      <UiText>
        Вы можете оказаться незастрахованным от неожиданностей. Старайтесь
        вычленять главное в сети явлений, прогнозировать развитие наиболее
        важных дел.
      </UiText>

      <UiText>
        Вы бываете слишком требовательны и бескомпромиссны по отношению к
        близким и знакомым, что служит причиной многих разочарований в людях.
      </UiText>

      <UiText>
        Раз обманувшись в человеке, вы становитесь подозрительны и недоверчивы
        ко всем другим. В порыве эмоций вы можете преувеличить недостатки
        других, представить этих людей в «черном цвете».
      </UiText>

      <UiText>
        Научитесь соизмерять свои требования с реальной жизнью. Будьте терпимы к
        людям,снисходительно относитесь к их недостаткам.
      </UiText>

      <UiText preset="large" color="role">
        Чрезмерным эмоциональным давлением вы можете разрушить установившуюся
        гармонию отношений. Помните, что идеальных людей нет.
      </UiText>
    </section>

    <section>
      <UiText>
        Другая ваша проблема — чрезмерная расточительность сил и материальных
        ресурсов. Неумение контролировать повседневные расходы не позволяет вам
        создать необходимый материальный резерв.
      </UiText>
      
      <UiText preset="large" color="role">
        Экономьте свои силы, не беритесь за дела, которые не гарантируют
        надежной отдачи.
      </UiText>

      <UiText>
        Откажитесь от бесчисленных встреч с родственниками и знакомыми, лучше займитесь домашними делами, чтобы выкроить себе время для спокойного отдыха.
      </UiText>

      <UiText>
        Старайтесь поддерживать дома более строгий порядок. Избавляйтесь от бесполезных вещей, не накапливайте их. Чем меньше у вас мелких, бесполезных предметов, тем легче вы найдете необходимую вещь в нужный момент.
      </UiText>

      <UiText preset="large" color="role">
        Умерьте своё гостеприимство, не будьте навязчивы в угощениях, старайтесь во всем соблюдать чувство меры.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
