<template>
  <div class="text g-page">
    <section>
      <UiText preset="subtitle" color="accent">Сильные стороны</UiText>

      <UiText preset="large" color="role">
        Деятельный и напористый человек. Умеет трезво оценить ситуацию и принять
        практическое решение.
      </UiText>

      <UiText>
        Хороший администратор: отлаживает качественный рабочий процесс.
        Старается создать все условия для слаженной работы. Способен
        координировать деятельность разных людей и подразделений.
      </UiText>

      <UiText>
        Очень прагматичен: поступки людей оценивает с точки зрения их пользы.
      </UiText>

      <UiText preset="large" color="role">
        Любит во всем надежность и основательность. Отличается высокой
        работоспособностью.
      </UiText>

      <UiText>
        Умеет бережно и рационально обращаться с деньгами. Практичность и
        добротность вещей предпочитает моде. Любит во всем порядок. Обладает
        развитым чувством долга.
      </UiText>

      <UiText>
        Ценит время и не любит тратить его попусту. Очень пунктуален, старается
        все планировать наперед.
      </UiText>

      <UiText>
        Предпочитает зря не рисковать. Хороший хозяин в доме. Расторопен и
        изобретателен в бытовых вопросах.
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">Проблемы</UiText>

      <UiText>
        Консервативен в своих вкусах и привычках. Не любит признавать свои
        ошибки и идти на компромиссы. Плохо воспринимает критику, даже в
        шутливой форме.
      </UiText>

      <UiText>
        Ему не хватает дипломатичности в отношениях. Бывает излишне резок в
        своих критических оценках. Осуждает всех, кто, по его мнению,
        недостаточно качественно и честно работает.
      </UiText>

      <UiText>
        Избегает делать комплименты, хвалить за хорошую работу — считает её
        нормой. Не любит говорить о развлечениях, сторонник строгого воспитания.
        Если его работу критикуют некомпетентные люди, может вспылить.
      </UiText>

      <UiText>
        С близкими нередко проявляет властность и требовательность.
        Стрессонеустойчив, особенно его выбивают из колеи ситуации
        неопределенности. Тяготится долгим ожиданием какого-либо события.
      </UiText>

      <UiText preset="large" color="role">
        Утопая в деталях и отвлекаясь на другие дела, может не успевать
        закончить работу к сроку. Очень болезненно это переживает. Не имея
        достаточного количества фактов, откладывает принятие решения.
      </UiText>

      <UiText>
        Не выносит, когда его подгоняют или отвлекают от работы. Придерживаясь
        установленных правил поведения, требует того же от окружающих.
      </UiText>

      <UiText>
        Вместе с тем может неожиданно разнервничаться, сорваться, проявить
        резкость и нетерпимость.
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Нельзя требовать и ожидать
      </UiText>

      <UiList iconName="chevron-right" iconColor="accent" iconSize="16">
        <UiListItem>
          Гибкого изменения своего поведения соответственно ситуации.
        </UiListItem>

        <UiListItem>
          Мягкости и дипломатичности в отношениях с людьми.
        </UiListItem>

        <UiListItem>
          Выдержки и хладнокровия в экстремальных ситуациях.
        </UiListItem>

        <UiListItem>Генерации нестандартных идей.</UiListItem>
      </UiList>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Подходящие виды деятельности
      </UiText>

      <UiText>
        Успешно работают в управленческой сфере, там, где необходимо руководить
        другими людьми и координировать их деятельность, при условии
        стабильности ситуации и законов.
      </UiText>

      <UiText>
        Хорошо проявляют себя как экономисты, работники кредитных отделов
        банков,технические секретари с распорядительскими функциями в фирмах,
        работниками в области сопровождения технического процесса — ремонт и
        эксплуатация техники, строительства, сельского хозяйства, фермерства.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
