<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">Особенности</UiText>

  <UiText>
    Серьезный, сосредоточенный, дисциплинированный, не склонен к беспорядочному
    веселью.
  </UiText>

  <UiText>Может долго играть в одиночестве, не скучая.</UiText>

  <UiText>
    К вещам относится бережно, раздражается, если кто-то их портит.
  </UiText>

  <UiText>
    Опрятен и аккуратен, старается поддерживать чистоту одежды и обуви.
  </UiText>

  <UiText>
    Не любит быть центром внимания, предпочитает роль рядового участника, а не
    организатора.
  </UiText>

  <UiText>
    Избегает рискованных приключений, но если нужно, умеет отстаивать себя –
    твердостью и даже жесткостью.
  </UiText>

  <UiText>
    Пунктуален, старается не опаздывать и выходить из дома заранее.
  </UiText>

  <UiText>
    Медлителен в решениях, учится осмысленно и вдумчиво, тогда как другие
    схватывают на лету.
  </UiText>

  <UiText>
    Любит работу, требующую усидчивости, стремится оформлять ее красиво и
    безупречно.
  </UiText>

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Сказочный персонаж
  </UiText>

  <UiText class="description" color="black">
    🎀 Мальвина — «Золотой ключик»
    <i>(Алексей Толстой)</i>
    . Серьезная, правильная, требовательная к себе и другим.
  </UiText>

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Рекомендации по воспитанию
  </UiText>

  <UiText class="description" color="black">
    Объясняйте важность ответственности. Он должен понимать, что за его
    старательность люди будут ему доверять.
  </UiText>

  <UiText class="description" color="black">
    Не торопите, если он раздражен. Позвольте делать все в его темпе.
  </UiText>

  <UiText class="description" color="black">
    Хвалите за аккуратность, послушание и добросовестность.
  </UiText>

  <UiText class="description" color="black">
    Учите видеть важность отношений. Чем лучше он относится к людям, тем больше
    получает в ответ.
  </UiText>

  <UiText class="description" color="black">
    Мягко указывайте на недочеты. Он не терпит беспорядка, но лучше подойти к
    этому осторожно.
  </UiText>

  <UiText class="description" color="black">
    Стимулируйте его через более глобальные цели. Объясняйте, что внимание к
    деталям ведет к успеху в жизни.
  </UiText>

  <UiText class="description" color="black">
    Помогайте не зацикливаться на мелочах, обращая его внимание на более крупные
    задачи.
  </UiText>

  <hr />

  <UiText class="description" color="black">
    Этот ребенок ответственный, основательный, практичный, но ему важно
    научиться гибкости и принятию чужих ошибок.
  </UiText>
</template>
