<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <div class="warning">
      <UiText preset="small" color="accent">
        Описания не должны обязательно совпадать со всеми чертами характера
        личности.
      </UiText>

      <UiText preset="small" color="accent">
        Идея как раз описать наблюдаемые у среднего представителя типа
        особенности поведения и обработки информации психикой.
      </UiText>
    </div>

    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Велта Микелсоне"
          subtitle="12 минут"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Вера Стратиевская"
          subtitle="27 минут"
          target-content-id="tab-2"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText preset="subtitle" color="role">
            Очень энергичный человек, способный много работать ради результата.
          </UiText>

          <br />

          <UiText>
            Талант и успех объясняются его врожденной неутомимой
            жизнедеятельностью. Он знает что делать в любой ситуации и без
            работы жить не может.
          </UiText>

          <UiText preset="large" color="role">
            Отличный администратор, способный руководить большим коллективом,
            четко распределять задания для каждого, высоко требовательный в
            вопросах качества и дисциплины. Успешнее работает уже в построенном
            учреждение, меньше создает сам.
          </UiText>

          <UiText preset="large" color="role">
            Он обеспечивает устойчивость, стабильность, устраняя все, что мешает
            успешной работе.
          </UiText>

          <UiText>
            Внедряет и использует самые эффективные методы работы, следит, чтобы
            она выполнялась качественно, в срок и согласно установленным
            правилам. Вырабатывает, упрощает и приспосабливает разные методики,
            нетрадиционные решения, инструкции, повышая эффективность.
          </UiText>

          <UiText preset="large" color="role">
            Планирует последовательность действий.
          </UiText>

          <UiText>
            Считает, что бездельникам и безалаберным людям, которые работают
            поверхностно, нет места в его коллективе. Лучше сотрудничает с теми,
            которые действуют подобно ему. Характерно то, что выполнить работу
            так, чтобы Администратор был доволен, редко удаëтся. Он всегда
            находит какую нибудь мелочь или недочет, которая раздражает и
            требует переделывания. Работу, выполненную им или под его
            руководством, редко приходиться выполнять заново.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Характерно, что он бережливый, покупки делает продуманно, в доме нет
            почти ничего лишнего.
          </UiText>

          <UiText>
            Все предметы и вещи использует максимально долго, умеет ухаживать за
            ними, чтобы они не теряли внешний вид и функциональность. Все, что
            необходимо для ежедневной жизни, у него должно быть под рукой.
          </UiText>

          <UiText>
            Человек, тонко ощущающий физический мир и все происходящее вокруг.
            Хорошо разбирается в механизмах. Он придает большое значение
            аккуратности во внешности, но не копирует моду.
          </UiText>

          <UiText>
            Стиль одежды — консервативный, классический, но всегда чистый,
            элегантный, неброский, приспособленный к конкретной ситуации. Все
            детали согласованы, не выделяются яркие тона.
          </UiText>

          <UiText preset="small" color="accent">
            Женщины свой гардероб не перенасыщают, в нем находиться все только
            необходимое. Неотъемлемая часть гардероба — аксессуары, они дорогие
            и соответствуют наряду, а также обязательно дорогая косметика.
          </UiText>

          <UiText>
            В своем окружении хочет видеть прилично и аккуратно одетых людей.
            Считает, что внешность подчеркивает внутреннее содержание человека.
            Это для него как бы эстетическая нужда, равноценная наслаждению
            искусством.
          </UiText>

          <UiText>
            Каждая вещь для него — ценность, за которой он с удовольствием
            следит, ухаживает и бережет. Часто наводит порядок, только тогда
            ощущает комфорт.
          </UiText>

          <UiText>
            На работе считает — если созданы комфортные условия, только тогда
            можно требовать от людей качественное выполнение работы.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Немаловажна ему застольная эстетика.
          </UiText>

          <UiText>
            Ему необходим красиво сервированный стол, дорогая посуда,
            качественные блюда. Продукты питания он покупает продуманно, чтобы
            ничего не приходилось выбрасывать. Среди Администраторов много
            отличных кулинаров.
          </UiText>

          <UiText>
            Обладает изысканным чувством цвета, формы и красоты. В доме всегда
            царит комфорт, уют и всё устроено со вкусом. Но поскольку сам
            придумать не может, он скорее кого то копирует.
          </UiText>

          <UiText>
            Как традиционалист, высоко ценит традиции и обряды. Часто его ставят
            в пример окружающим. Назойливо заботливый к близким, относится к ним
            с высокой ответственностью.
          </UiText>

          <UiText>
            Типично, что он заранее продумывает подарки, покупает их с мыслю,
            подарить в подходящий момент.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Физически вынослив, не жалуется о своем здоровье и самочувствие, но
            бывает, запускает болезни, так как ходьба по поликлиникам отрывает
            от работы.
          </UiText>

          <UiText>
            Даже отдыхая от работы ему нужно заниматься чем то физически — быть
            активным, быть в движении. Если работает, то усердно, а если
            отдыхает, то от всей души.
          </UiText>

          <UiText preset="large" color="role">
            Он всю жизнь учится выражаться и вести себя этично согласно
            ситуации. Чтобы скрыть свою неловкость, он часто шутит, но его шутки
            не всем понятны. В общении с незнакомыми людьми сдержан, соблюдает
            дистанцию, в отношениях с друзьями — внимательный и понимающий.
          </UiText>

          <UiText>
            Умеет заинтересовать партнера разговором. Если партнер терпеливый,
            умеющий слушать его, тогда ведет себя особенно внимательно. Убежден
            в своей правоте, не терпит, когда ему возражают или говорят правду в
            глаза, бывает, что может вспылить.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Ему трудно управлять своим холерическим темпераментом. Случается,
            что в течении жизни из-за этого теряет много друзей и коллег.
          </UiText>

          <UiText>Едва ли способен уступить, иногда долго держит злобу.</UiText>

          <UiText preset="large" color="role">
            С близкими ведет себя сердечно и сентиментально.
          </UiText>

          <UiText>
            Ему важно получить любовь, ждет достоверных подтверждений чувств. На
            работе старается избежать случайностей. Чувствует себя ответственным
            за партнера, защищает его интересы больше, чем свои.
          </UiText>

          <UiText>
            Хочет быть спокойным, однако в отношениях с противоположным полом
            чувствует себя напряженным. Из-за этого часто становится чрезмерно
            эмоциональным, прямолинейным, насмешливым и резким.
          </UiText>
        </section>

        <section>
          <UiText>
            В жизни его самым большим дефицитом считается нехватка времени, все
            им запланированное не всегда удаëтся сделать. Это объясняется тем,
            что его педантичность и высокая требовательность к себе замедляет
            процесс.
          </UiText>

          <UiText preset="large" color="role">
            Нехватка времени портит его жизнь.
          </UiText>

          <UiText>
            Сам старается не опаздывать, но случается, так же не позволяет
            другим злоупотреблять его временем.
          </UiText>

          <UiText preset="large" color="role">
            Видит проблемы в отношениях, но не понимает, как их решить.
          </UiText>

          <UiText>
            Ему хочется поступить этично. Колеблется в принятии решений. По этой
            причине он долго находится в дисгармонии с собой.
          </UiText>

          <UiText preset="small" color="accent">
            Женщины долго не способны освободиться от напряжения, но его можно
            снять кокетством.
          </UiText>

          <UiText>
            Поскольку не способен предвидеть изменения эмоциональной атмосферы
            коллектива, беззащитен перед созреванием конфликта.
          </UiText>

          <UiText preset="large" color="role">
            Выход из конфликта не видит и даже не пытается его решить. Либо он
            ускользает от конфликта, либо у него получается решать его довольно
            резко.
          </UiText>

          <UiText>
            Ожидает от других корректного к себе отношения, но жизнь преподносит
            разные, непредсказуемые ситуации,к которым он не готов. Нельзя
            сказать, что его не тревожит дискомфорт в отношениях, он об этом
            достаточно много думает, и всю жизнь учится налаживать их.
          </UiText>

          <UiText>
            Хотя он разговорчивый человек, но на протяжении многих лет может
            оставаться для коллег загадкой.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Способен жертвовать собой в некомфортной супружеской жизни только
            потому, что дал слово, и нельзя разрушать семью.
          </UiText>

          <UiText>Не терпит, когда злоупотребляют его доверием.</UiText>

          <UiText>
            Ему не свойственна оторванность от реального мира, он не предается
            фантазиям.
          </UiText>

          <UiText>
            Ему важно все видеть, ощущать и убеждаться в реальном существовании.
            Полагается на свои раннее проверенные методы. Прежде, чем советовать
            что то другим, проверяет на своем опыте. Непроверенные и
            сомнительные приемы работы и некачественный товар другим не
            предлагает.
          </UiText>

          <UiText preset="large" color="role">
            Обычно людей переоценивает или недооценивает, среднего не бывает.
          </UiText>

          <UiText>
            Также осторожно относится к разному риску. Он нуждается в партнере,
            который поможет ему понять других, заметить творческий потенциал,
            предоставит прогнозы на будущее и способен мыслить стратегически,
            лишь тогда он готов начинать бизнес.
          </UiText>
        </section>

        <section>
          <UiText>
            Принимаясь за новую сложную работу, собирает полезную и достоверную
            информацию со всех возможных источников.
          </UiText>

          <UiText preset="large" color="role">
            Свою мысль излагает лаконично. Предпочитает помогать не словом, а
            делом.
          </UiText>

          <UiText>
            Всегда готов пополнить знания, поскольку желает усовершенствоваться.
            Не способен понять тех, которые не понимают элементарных вещей, даже
            не разбираются по грамматике языка. В следствии этого автоматически
            группирует окружающих – «умные» и «тупые» или «авторитетные» и «не
            авторитетные». Обычно прислушивается к мнению своего авторитета, а
            не к президенту.
          </UiText>

          <UiText preset="large" color="role">
            Создает вокруг себя стабильный и прогнозируемый мир, в котором царит
            честность и справедливость.
          </UiText>

          <UiText>
            Ему важно заботиться о социальной защите людей, особенно нуждающихся
            в помощи – пенсионеров, инвалидов, многодетных семей, школьников и
            студентов. Его заботит благосостояние всего общества – внедрение
            всего, облегчающего человеческую жизнь, и устранение всего, что
            создает препятствие в достижении комфорта.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Своим внешним видом создает впечатление о себе как о сильной,
            целеустремленной, прямолинейной личности.
          </UiText>

          <UiText>
            Не отступает перед трудностями, преодолевает их. В этом помогает его
            выдержка и способность к выживанию. Не обременяет других своими
            личными нуждами.
          </UiText>

          <UiText>
            Обладает чувством собственника — не позволяет, чтобы другие посягали
            на принадлежащие ему вещи или на его территорию, действовали без его
            ведома, диктовали свои условия.
          </UiText>

          <UiText preset="large" color="role">
            Он не занимает власть силой.
          </UiText>

          <UiText>
            Но умеет защищать и отстаивать занятую позицию, потому что для него
            важен статус.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="small" color="accent">1 — Базовая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_business" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Практика</UiText>
              <UiText preset="body">Деловая логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Деловой расчет Администратора в первую очередь базируется на его
            личных волевых качествах, на его умении руководить, требовать,
            вкладывать свой личный труд, на его умении распределять ресурсы и
            использовать резервы, независимо от объективных экономических
            условий, независимо от того, благоприятны они или нет. Главное,
            чтобы они были стабильны.
          </UiText>

          <UiText>
            В отличие от Предпринимателя, чей деловой расчет основывается на
            сильной интуиции, на умении приспособиться к постоянным переменам и
            использовать их с выгодой для себя; на максимальном использовании
            объективных условий и возможностей.
          </UiText>

          <UiText color="accent">
            «Мастерство никогда не бывает случайным. Это всегда результат
            высокого намерения, искреннего усилия и разумного исполнения; оно
            представляет собой мудрый выбор из многих альтернатив.» ©
            Аристотель
          </UiText>

          <UiText color="role">
            Представителей этого типа отличают исключительная работоспособность
            и деловая активность. Основную цель жизни видят в беспредельном
            совершенствовании своего профессионального мастерства — для них это
            бесконечно увлекательно и интересно — расширяет сферу новых
            творческих поисков, позволяет разрабатывать новые технологии,
            возводящие их профессиональное мастерство на ещё большую высоту.
          </UiText>

          <UiText>
            Любую работу выполняют по максимуму своего профессионализма,
            вкладывая максимальное количество сил и возможностей. Выполнять
            работу кое-как не могут в принципе, считая это предательством их
            творческих целей и профессиональных интересов.
          </UiText>

          <UiText>
            Объем их работы не ограничивается ни временем, ни количеством
            вложенных сил. Создается впечатление, что они хотят переделать всю
            работу, которая только попадает в их поле зрения.
          </UiText>

          <UiText>
            Творческое отношение к делу питает их силы, пробуждает фантазию,
            расширяет сферу их интересов, позволяя ставить перед собой всё более
            сложные и интересные задачи.
          </UiText>

          <UiText color="role">
            Деловая активность их безгранична и неисчерпаема. Начав что-то
            делать, они постоянно открывают для себя новые горизонты
            возможностей — углубляются в процесс работы так, будто раскапывают
            «золотую жилу».
          </UiText>

          <UiText preset="large" color="role">
            Труд как стремление к совершенству.
          </UiText>

          <UiText color="role">
            Любую работу представители этого психотипа доводят до высочайшего
            профессионализма. Объем их познаний потрясает!
          </UiText>

          <UiText>
            В любом деле они проявляют исключительную требовательность к себе и
            другим и высокую самоотдачу: «Все, что я делаю, я делаю хорошо».
          </UiText>

          <UiText color="accent">
            «Победа ожидает того, у кого все в порядке, и это называется удачей»
            © Амундсен
          </UiText>

          <UiText>
            Весь смысл их жизни — в работе, в труде, в занятии выбранным делом.
            Люди этого типа обычно не понимают, как можно работать в пол силы.
            Безответственного отношения к труду в принципе не признают.
          </UiText>

          <UiText>
            Тот, кто работает «спустя рукава», в их понимании вообще не человек.
            Стоит ли говорить об их отношении ко всяким «халявщикам» и лентяям —
            эти люди для них существуют на совершенно противоположном полюсе.
          </UiText>

          <UiText>
            В зрелом возрасте Администраторы обычно уже не тратят свои силы на
            борьбу с ними - все равно все зло на свете не искоренишь, а есть
            дела и поважнее.
          </UiText>

          <UiText color="role">
            Самоотверженный труд Администратор считает нормой. Поэтому, как
            правило, скуп на похвалу и поощрение.
          </UiText>

          <UiText>
            Преподаватели этого типа обычно задают работу в двойном объеме.
          </UiText>

          <UiText preset="large" color="role">
            Единственное, что поощряет Администратор, это встречную инициативу.
          </UiText>

          <UiText color="role">
            Если он поручил сделать задание в двух вариантах, а ты сделал в
            четырех — молодец, но в следующий раз — эти четыре варианта будут
            уже твоей нормой.
          </UiText>

          <UiText>
            Разумеется, можно сориентировать Администратора и на то, чтобы он
            давал меньший объем работы, что великолепно умеет делать его
            конфликтер Лирик, но такая ориентация его обычно настораживает и
            очень беспокоит — время уходит, а работа накапливается.
          </UiText>

          <UiText color="role">
            Огромный объем работы Администратора считает в порядке вещей — как
            для себя, так и для других. Только самым близким людям, и в самые
            редкие минуты, он может пожаловаться на усталость.
          </UiText>

          <UiText preset="large" color="role">
            Перегрузки и перенапряжение сопутствуют этим людям всю жизнь.
          </UiText>

          <UiText>
            Обычно, когда Администратор видит, что у кого-то работа не
            получается, он отбирает её и выполняет сам, при этом подробно
            показывая и поясняя, как надо это делать.
          </UiText>

          <UiText>
            Администратор в отличие от Лидера никогда не поучает, «как надо
            жить» — он учит, «как надо делать» то или иное дело.
          </UiText>

          <UiText color="role">
            По части изобретения методик представители этого типа вне
            конкуренции. Положительное свойство его методов работы — умение
            максимально использовать имеющиеся в наличии резервы и возможности.
          </UiText>

          <UiText>
            Эффективность его методик зачастую просто поражает своими
            результатами! Разрабатывая свои методики, Администратор
            подсознательно ориентируется на людей, умеющих рассчитывать свои
            силы, возможности и время выполнения работы, как это делает его дуал
            Гуманист.
          </UiText>

          <UiText preset="large" color="role">
            И это обстоятельство необходимо принимать во внимание — в противном
            случае, следование его методикам приводит к перегрузкам и
            перенапряжению.
          </UiText>

          <UiText color="role">
            Ни в коем случае не следует списывать неудачи в работе на
            «сомнительность» его методик! Не говоря уже о том, что такое
            обвинение исключительно болезненно его ранит, — оно будет в корне
            несправедливо: никогда и ни при каких обстоятельствах Администратор
            не порекомендует того, в чем лично не убежден на основании
            многократно проверенного опыта.
          </UiText>

          <UiText>
            Поэтому никогда нельзя его ругать за «безответственные» деловые
            советы — такие советы он в принципе давать не способен.
          </UiText>

          <UiText color="accent">
            Другое дело —- если кто-то что-то неправильно понял, но это уже не
            его вина.
          </UiText>

          <UiText color="role">
            Представители этого типа отличаются исключительно высокой степенью
            личной ответственности. То, что ими обещано, выполняется всегда и
            при любых обстоятельствах.
          </UiText>

          <UiText preset="large" color="role">
            Пообещать и не выполнить они не могут. Администраторы педантичны и
            требовательны во всем, что касается взаимных обязательств.
          </UiText>

          <UiText>
            Очень исполнительны и дисциплинированны. Администраторы не любят,
            когда к ним обращаются с пустяковой просьбой, поскольку к любому
            поручению относятся слишком серьезно. Сами никогда не обращаются к
            чужой помощи без достаточных на то оснований. Предпочитают решать
            свои проблемы собственными силами и того же требуют от других.
          </UiText>

          <UiText>
            Не верят в легкий успех. Ценность любой работы, любого произведения
            для них определяется количеством вложенного труда.
          </UiText>

          <UiText color="accent">
            «Если все кажется легким, это безошибочно доказывает, что работник
            весьма мало искусен и работа выше его разумения» © Леонардо да
            Винчи
          </UiText>

          <UiText color="role">
            Если работа выполняется слишком быстро, Администратор начинает
            искать в ней недостатки и, как правило, находит.
          </UiText>

          <UiText>
            Прекрасно оценивают профессионализм и деловые качества сотрудников.
            Но иногда «покупаются» на показное рвение. Высоко ценят
            компетентность в различных областях знаний. Сами нередко поражают
            всесторонней эрудицией.
          </UiText>

          <UiText preset="large" color="role">
            Любой аспект работы оценивают с точки зрения ее целесообразности. За
            бесполезные дела не берутся.
          </UiText>

          <UiText>
            Свои поступки соизмеряют в первую очередь целесообразностью и
            деловыми интересами. Великолепно организуют технические условия для
            максимально продуктивной работы.
          </UiText>

          <UiText>
            Администратор не способен сидеть без дела — постоянно готов к
            активности. Обладает исключительной энергией.
          </UiText>

          <UiText color="accent">
            Если, например, организует сотрудников на общую уборку, сам активно
            в ней участвует.
          </UiText>

          <UiText>
            Не неженка и не белоручка. Всегда требователен и к себе и к другим.
            Постоянно обращает внимание окружающих на недостатки и нерешенные
            проблемы, критикует сотрудников за недостаточную активность, за
            отсутствие инициативы и делового энтузиазма.
          </UiText>

          <UiText>
            В работе отличается безукоризненной точностью. Проверку качества
            работы никому не доверяет — проверяет как себя, так и партнеров. Его
            собственную работу можно не проверять.
          </UiText>

          <UiText>
            Качество своей работы не считает пределом совершенства. Если кто-то
            из его окружения выполняет работу качественнее, чем он сам, этому
            только искренне радуется, но не любит, когда этим хвастают.
          </UiText>

          <UiText color="role">
            Отчитываясь за проделанную работу, не забывает перечислить всего
            сделанного, обратить внимание на успехи и достижения.
          </UiText>

          <UiText preset="large" color="role">
            Не позволяет своему настроению влиять на собственную
            работоспособность.
          </UiText>

          <UiText>
            Но на работоспособность сослуживцев его плохое настроение обычно
            очень сильно влияет.
          </UiText>

          <UiText color="role">
            Выполняя ответственную работу, никогда не рассчитывает на
            импровизацию, удачу или вдохновение, а только на своевременное
            начало и упорный труд.
          </UiText>

          <UiText>
            С понятием «своевременное начало» у Администратора не все обстоит
            благополучно — иногда начинает работу слишком рано, когда еще не
            закончен процесс подготовки к ней и многие данные предстоящего дела
            ему недостаточно ясны.
          </UiText>

          <UiText preset="large" color="role">
            Любое дело стремится довести до конца, не позволит себе бросить
            работу на середине.
          </UiText>

          <UiText>
            Хотя будучи перегружен другими заданиями, может поручить
            подчиненному закончить его работу, но делает это крайне редко и
            неохотно. Не любит, когда при одной незавершенной работе ему
            поручают другую.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">2 — Творческая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_comfort" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Комфорт</UiText>
              <UiText preset="body">Сенсорика ощущений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Эстетика для представителей этого типа имеет огромное значение. Все,
            что ни делает Администратор, должно быть безупречно красиво.
            Техника, мастерство шлифуются им до бесконечности.
          </UiText>

          <UiText color="role">
            Создается впечатление, что он собирается побить все рекорды красоты
            и очень расстраивается, если качество его работы не соответствует
            собственным творческим замыслам:
          </UiText>

          <UiText color="accent">
            «Ни одна человеческая рука не в состоянии довести работу до полного
            совершенства» © Леонардо да Винчи
          </UiText>

          <UiText>
            И тем не менее стремление к эстетическому совершенству характерно
            для представителей этого типа.
          </UiText>

          <UiText preset="large" color="role">
            Огромное значение для него имеет эстетика собственного быта.
            Независимо от того, кем он работает — чернорабочим или министром,
            Администратор всегда подтянут и опрятен в одежде.
          </UiText>

          <UiText color="role">
            Представители этого типа умеют носить одежду исключительно аккуратно
            — так, что одна и та же вещь служит им многие годы и выглядит на
            удивление новой.
          </UiText>

          <UiText>
            Одевается добротно и элегантно, без вычурностей и излишеств. Гнаться
            за модой не в его правилах.
          </UiText>

          <UiText>
            В своих вкусах Администратор очень консервативен, придерживается
            собственных эстетических эталонов.
          </UiText>

          <UiText>
            Основной стиль одежды — классический, но она отличается добротностью
            и высоким качеством пошива «дорогая скромность». Многие женщины
            любят деловой стиль, неброские, но дорогие украшения. С большим
            вкусом подбирают косметику и духи. Отличительная черта
            женщин-Администраторов — способность сохранять свою красоту до
            самого преклонного возраста.
          </UiText>

          <UiText color="role">
            Вкусы, как и привычки, меняет неохотно. К новым вкусовым ощущениям
            относится подозрительно и иногда с предубеждением.
          </UiText>

          <UiText>
            Каждый раз, отведывая незнакомое блюдо, он предварительно
            интересуется, что это такое и из чего приготовлено. Если, в его
            понимании, это не съедобно, старается отказаться в деликатной форме.
          </UiText>

          <UiText color="role">
            Любимая и привычная еда Администратору никогда не надоедает, и ее
            однообразие его не смущает.
          </UiText>

          <UiText>
            Всех представителей этого типа отличают прямая осанка и широко
            расправленные плечи. Ходят с гордо поднятой головой, если
            оборачиваются, то обычно всем корпусом. Мужчины этого типа
            отличаются выправкой, даже если никогда не служили в армии.
          </UiText>

          <UiText>
            К внешнему виду окружающих Администратор требователен не меньше, чем
            к своему собственному облику: он может отказать в предоставлении
            работы человеку, пришедшему на собеседование неопрятно одетым, даже
            если это специалист высокого класса и с отличными рекомендациями.
          </UiText>

          <UiText preset="large" color="role">
            Красота, изящество, эстетика, великолепный вкус постоянно
            сопутствуют представителям этого типа. Это — то, что их окружает,
            то, что создается их руками.
          </UiText>

          <UiText>
            Семейный обед — парадно-праздничная обстановка. На стол выставляется
            лучшая посуда, готовятся фирменные блюда — все должно быть на самом
            высоком уровне, у некоторых даже будничный ужин сервируется как
            парадный.
          </UiText>

          <UiText>
            Излишне говорить о том, какие великолепные кулинарки, мастерицы и
            умелицы представительницы этого типа. Причем Администратору обычно
            недостаточно того вкуса, которым он наделен от природы: многие из
            них дополнительно учатся всяким художественным ремеслам, что иногда
            резко меняет их профессиональную ориентацию.
          </UiText>

          <UiText color="accent">
            Учительница математики начала брать уроки рисования, потом научилась
            составлять букеты, потом пошла на курсы керамики и гончарного дела,
            потом разработала и запатентовала свою собственную керамическую
            технологию, затем открыла керамическую фабрику по производству
            посуды, после чего переквалифицировалась на производство
            керамической скульптуры и сувениров.
          </UiText>

          <UiText preset="large" color="role">
            Чистота, порядок, дорогой и добротный комфорт — качества, которые
            Администратор считает обязательными для своего дома. В его доме
            должно быть все, что может потребоваться на все случаи жизни.
          </UiText>

          <UiText color="accent">«Мой дом — моя крепость»</UiText>

          <UiText>
            Ни пустых полок, ни пустого холодильника в его доме не бывает.
            Администратор всегда помнит, какие запасы требуется пополнить.
            Излишки, которые у него залеживаются, выбрасывает только в случае
            уверенности, что в хозяйстве это использовать невозможно. Продукты
            покупает только лучшего качества, не считаясь с ценой, но в
            небольших количествах. Чтобы не пришлось потом выбрасывать.
          </UiText>

          <UiText preset="large" color="role">
            Хозяйство ведет очень экономно и расчетливо.
          </UiText>

          <UiText color="role">
            Свое здоровье старается не запускать. Придает большое значение
            профилактике и спорту.
          </UiText>

          <UiText>
            Болеть не любить — обычно выходит на работу, едва начав
            выздоравливать. Если его подчиненные больше трех-четырех дней
            засиживаются на больничном, воспринимает это как дезертирство с
            рабочего фронта.
          </UiText>

          <UiText preset="large" color="role">
            Представители этого типа отличаются исключительной выносливостью и
            сохраняют великолепную физическую форму и в самом преклонном
            возрасте.
          </UiText>

          <UiText>
            Администратор, жалующийся на свое здоровье, — весьма редкое явление
            и только в случае действительно серьезных проблем.
          </UiText>

          <UiText preset="large" color="role">
            Любит путешествия, активный и комфортабельный отдых.
          </UiText>

          <UiText color="role">
            Регулярно посещает выставки и театральные премьеры. Всегда в курсе
            культурной и общественной жизни.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">3 — Ролевая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_emotions" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Желание</UiText>
              <UiText preset="body">Этика эмоций</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            В малознакомой компании старается разыгрывать роль этакого бодрячка,
            неунывающего весельчака, шутит, улыбается. Старается быть предельно
            вежливым и любезным со всеми.
          </UiText>

          <UiText color="role">
            Нового знакомого терпеливо выслушивает, независимо от того,
            интересен он ему или нет, — поддакивает, соглашается, выражает
            сочувствие.
          </UiText>

          <UiText>
            Если ему рассказывают какую-нибудь душещипательную историю,
            реагирует так, как следует, по его мнению, реагировать в данной
            ситуации — может и расплакаться, причем довольно демонстративно.
          </UiText>

          <UiText>
            И хотя в глубине души Администратор действительно сентиментален, он
            не считает нужным этого скрывать, по крайней мере, в своем ближайшем
            окружении.
          </UiText>

          <UiText color="role">
            Особенно ярко его сентиментальность проявляется в обстановке
            семейных торжеств или собраний в дружеском кругу: когда его
            поздравляют, упоминают о его заслугах, выказывают ему свое уважение
            и почести.
          </UiText>

          <UiText preset="large" color="role">
            Лицо Администратора принимает по-детски счастливое выражение и его
            положительные эмоции начинают приобретать какие-то совершенно
            непредсказуемые формы.
          </UiText>

          <UiText>
            Это состояние его так сильно волнует, что невольно возникает желание
            его как-то слегка успокоить, что великолепно чувствует и делает его
            дуал Лирик.
          </UiText>

          <UiText>
            В момент такого эмоционального подъема Администратор очень уязвим и
            беззащитен. Обычно воспоминание о пережитой идиллии он сохраняет
            довольно долго и еще какое-то время делится своими впечатлениями с
            окружающими.
          </UiText>

          <UiText color="accent">
            Со стороны может даже показаться, что его растроганность несколько
            преувеличена, но не дай Бог выразить недоверие его восторженному
            состоянию и этим испортить ему праздник — он будет более, чем
            уязвлен: его восторженность моментально, перейдет в крайнее
            раздражение, поскольку он сразу почувствует себя очень неловко и
            обязательно найдет какой-нибудь способ отомстить за испорченное
            настроение.
          </UiText>

          <UiText color="role">
            В сфере своих постоянных контактов Администратор обычно держат резко
            напряженный, иногда слегка взвинченный тон общения. Очень
            вспыльчивы.
          </UiText>

          <UiText>
            Причем вспылить могут по любому поводу: очень не любят, когда им
            возражают, не говоря уже о том, чтобы с ними спорить.
          </UiText>

          <UiText>
            Спорить со Администратором вообще опасно для жизни. Как уже
            говорилось, их замечания и рекомендации многократно перепроверяются
            собственным опытом, поэтому свою точку зрения они считают
            единственно правильной и готовы отстаивать ее даже с кулаками, что
            происходит довольно часто, причем уровень их образования и культуры
            в данном случае значения не имеет.
          </UiText>

          <UiText>
            В ответ на мое возражение моя начальница-Администратор, милая,
            интеллигентная женщина с научной степенью и двумя университетскими
            дипломами, вдруг сжала кулак и замахнулась: «Вот так бы тебя и
            поколотила!».
          </UiText>

          <UiText>
            Ситуацию, когда ему говорят «правду в глаза», переживает
            исключительно болезненно.
          </UiText>

          <UiText>
            Такое «правдолюбие» воспринимается им как недопустимая дерзость,
            грубость, нахальство, как своего рода «объявление войны».
          </UiText>

          <UiText>
            Выслушивая «правду» о себе, обычно стараются быть предельно
            сдержанными и ничем не обнаружить своего гнева, но такая
            «сдержанность» Администратора намного опаснее его несдержанной
            ярости.
          </UiText>

          <UiText preset="large" color="role">
            Администратору неимоверно трудно сдерживать свои отрицательные
            эмоции. Они этому всю жизнь учатся, причем не особенно успешно.
          </UiText>

          <UiText>
            Сколько близких друзей, надежных партнеров и исполнительных
            работников они теряют, прежде чем им удаëтся воспитать в себе
            сдержанность.
          </UiText>

          <UiText color="accent">
            Например, если к нему обращаются с трудновыполнимой просьбой,
            старается не отказывать.
          </UiText>

          <UiText>
            Им легче скрыть свое глубокое горе, чем свое внезапное раздражение.
            Администраторы не нытики.
          </UiText>

          <UiText color="accent">
            Могут двадцать лет жить в конфликтных отношениях и при этом
            сохранять видимость благополучной семьи.
          </UiText>

          <UiText preset="large" color="role">
            На плохое самочувствие Администраторы обычно не жалуются.
          </UiText>

          <UiText>
            Хотя иногда они могут поведать с дрожью в голосе о своей плохой
            кардиограмме или плохих анализах. Впрочем, это скорее присуще
            пожилым женщинам, а молодой представитель этого типа, придя на
            занятия с загипсованной рукой, с улыбкой сообщает, что вот, мол,
            разбил мотоцикл, а так ничего особенного не произошло.
          </UiText>

          <UiText color="role">
            Администратор обидчив, но отходчив. Зла старается долго не держать,
            впрочем это зависит от глубины нанесенной ему обиды.
          </UiText>

          <UiText>
            Утешать и выражать соболезнование не любит, поскольку не уверен, что
            умеет это хорошо делать.
          </UiText>

          <UiText color="accent">
            Но если приходится, делает это весьма своеобразно — указывает на
            производственные или профессиональные показатели: «Посмотри, какие
            успехи ты делаешь, посмотри, как все твоей работой довольны, — чего
            ты расстраиваешься! Вот увидишь, все будет хорошо!»
          </UiText>

          <UiText preset="large" color="role">
            Гнев и ярость обычно проявляет только в экстремальной ситуации —
            например, для того, чтобы мобилизовать партнера, если возникают
            какие-то конкретные трудности.
          </UiText>

          <UiText preset="large" color="role">
            Старается подчинять эмоции рассудку. От эмоционального подъема очень
            устает. На плохое настроение не жалуется. О его причинах
            предпочитает не распространяться. Выправляет себе настроение отдыхом
            и любимой музыкой.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">4 — Болевая функция.</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_time" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чутьё</UiText>
              <UiText preset="body">Интуиция времени</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Представители этого типа часто говорят, что даже если бы в сутках
            было сорок восемь часов, им бы все равно не хватило.
          </UiText>

          <UiText>
            Тот объем работы, который они обычно намереваются выполнить, не
            укладывается в назначенные ими сроки.
          </UiText>

          <UiText>
            Проблема Администраторов в том, что они не желают принимать в расчет
            фактор времени. Время — их злейший враг: они хотят довести работу до
            безупречного качества, а сроки этого не позволяют. Они составляют
            себе максимально напряженный график работы, поэтому, как бы точно
            они ни планировали свое время, постоянно происходят накладки в его
            распределении.
          </UiText>

          <UiText>
            Устанавливая дневную норму выпускаемой продукции, Администратор, как
            правило, не учитывает ни время на подготовку к работе, ни снижения
            рабочих темпов в связи с усталостью и перенапряжением, игнорирует
            время перерыва на обед, не говоря уже о других непредвиденных
            расходах времени.
          </UiText>

          <UiText>
            Иногда бывают совершенно неприятные инциденты, когда он задает своим
            подчиненным вопросы типа: «Сколько можно болтать по телефону?» или
            «Сколько времени продолжается ваш перекур?» Когда дело касается
            расхода рабочего времени, Администратор способен на исключительную
            бесцеремонность — вплоть до намека на то, что подчиненный слишком
            долго засиживается в туалете.
          </UiText>

          <UiText preset="large" color="role">
            Создается впечатление, что Администратор испытывает разочарование
            всякий раз, когда у его служащих заканчивается рабочий день или они
            отпрашиваются в отгул или в законный очередной отпуск.
          </UiText>

          <UiText color="role">
            В отпуск Администраторы отпускают своих работников крайне неохотно.
          </UiText>

          <UiText>
            Самый страшный проступок в понимании Администратора — халатное
            отношение к рабочему времени.
          </UiText>

          <UiText>
            Если недостаток профессионализма и какие-то технические погрешности
            в работе Администратор еще как-то будет терпеть, то разбазаривание
            рабочего времени или (что еще хуже) приписка рабочих часов — самое
            страшное в его глазах преступление.
          </UiText>

          <UiText preset="large" color="role">
            Низкая продуктивность — достаточный повод для увольнения.
          </UiText>

          <UiText color="role">
            Многие свои неудачи Администратор списывает на фактор времени.
            Упущенное время переживает очень болезненно. Постоянно подводит
            итоги и постоянно недоволен результатами.
          </UiText>

          <UiText>
            Время — это самое дорогое и самое дефицитное из всего, что у него
            есть. Администратор никогда не позволит себе злоупотреблять
            чьим-либо временем. Человек, не считающийся с чужим временем, в его
            представлении — величайшее социальное зло.
          </UiText>

          <UiText>
            Администратора всегда возмущает, как можно назначить две деловые
            встречи одновременно в разных местах. Если это произошло по
            чьей-либо забывчивости или рассеянности — это все равно
            непростительно.
          </UiText>

          <UiText color="role">
            Опоздание он воспринимает так же, как и обвес продуктов или обсчет
            денег. Опоздание — это украденное время, ни больше, ни меньше. Сам
            старается быть предельно пунктуальным, по крайней мере на начальном
            этапе отношений.
          </UiText>

          <UiText>
            Любой непредвиденный расход времени Администратор переживает
            исключительно болезненно. Необходимость работать в сжатые сроки
            вгоняет его в панику. Старается начать работу заблаговременно.
          </UiText>

          <UiText color="accent">
            «…Работу над дипломным проектом она начала раньше всех на курсе. Еще
            до того, как сообщили технические условия проекта, у нее уже было
            почти все готово, правда, потом, ей многое пришлось переделывать
            заново… »
          </UiText>

          <UiText>
            Расход времени у Администратора в первую очередь определяется его
            целесообразностью. Время, потраченное на работу, учебу или на личные
            дела, в его понимании, израсходовано целесообразно.
          </UiText>

          <UiText preset="large" color="role">
            Терпеть не может тратить время впустую. С людьми, злоупотребляющими
            чужим временем, старается не общаться и вообще не иметь никаких дел.
          </UiText>

          <UiText>
            При всем интересе к общественной жизни и политическим событиям,
            Администратору трудно идти «в ногу со временем». В глубине души он
            консерватор и не всегда готов признавать происходящие вокруг
            перемены.
          </UiText>

          <UiText>
            Администратору удобен партнер, который способен не только увидеть
            глобальные изменения во времени, но и убедить его считаться с ними,
            как это великолепно делает Гуманист.
          </UiText>

          <UiText>
            Пунктуальный, обязательный, деликатный и ненавязчивый в общении, он
            постоянно напоминает Администратору о самых неотложных его делах,
            следит за самым оптимальным расходом его времени. Следит за его
            распорядком дня, стараясь, чтобы он не был перегружен работой.
          </UiText>

          <UiText>
            Сам Администратор, как бы основательно он ни планировал распорядок
            своего дня, всегда перегружает его делами, даже, если это день его
            отдыха. Еще хуже получается, когда Администратор расписывает
            программу мероприятий для кого-нибудь другого.
          </UiText>

          <UiText color="accent">
            Одна из представителей этого типа, принимая у себя в гостях
            родственницу-Аналитика, организовала ей отдых, настолько
            перенасыщенный всякими мероприятиями, экскурсиями и визитами, что с
            ее гостьей через два дня произошел нервный срыв, закончившийся
            семейной ссорой и фактическим разрывом отношений.
          </UiText>

          <UiText>
            Гуманист корректирует распорядок дня Администратора, заставляет его
            считаться со своими физическими возможностями, требует уделять
            больше внимания своему здоровью и отдыху.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">5 — Внушаемая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_people" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чувство</UiText>
              <UiText preset="body">Этика отношений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Строить свои личные взаимоотношения представителям этого типа очень
            трудно.
          </UiText>

          <UiText color="accent">
            Подсознательно они сориентированы на систему этических ценностей
            Гуманиста.
          </UiText>

          <UiText>
            Поэтому их личная система взаимоотношений носит несколько
            идеалистический характер. С кем бы ни строили они свои
            взаимоотношения, они предполагают наличие в своем партнере таких
            качеств, как уступчивость, деликатность, щепетильность,
            порядочность, искренность, все те качества, которые свойственны
            этической программе Гуманиста.
          </UiText>

          <UiText preset="large" color="role">
            Естественно, что реальная действительность постоянно разочаровывает
            Администраторов.
          </UiText>

          <UiText color="role">
            Поэтому, анализируя предыдущий печальный опыт, они очень осторожны в
            формировании новых отношений. Очень нелегко сходятся с людьми,
            своего общества стараются не навязывать, о себе, о своей личной
            жизни рассказывают очень мало и очень неохотно.
          </UiText>

          <UiText>
            Очень скрытные — можно проработать с этим человеком бок о бок
            несколько лет и почти ничего о нем не знать. В общении держат
            далекую дистанцию.
          </UiText>

          <UiText>
            Внешне очень недоверчивы, склонны к подозрительности, но тем не
            менее никаких проверок на «честность» они себе не позволяют —
            считают это бесчестным для себя и оскорбительным для партнера.
            Считают, если человек злоупотребил их доверием, пусть это будет на
            его совести.
          </UiText>

          <UiText>
            Если, например, Администратор подозревает кого-то из подчиненных в
            злоумышленных действиях, он делает общее предупреждение всему
            коллективу, зная, что там уже сами во всем разберутся и общими
            силами выявят злоумышленника. Гораздо хуже обстоит дело, если в
            коллективе назревает заговор против него лично.
          </UiText>

          <UiText>
            Администратор некоторое время выжидает, надеясь, что «ядро
            заговорщиков» совершит какую-нибудь явную оплошность и тогда можно
            будет с ним «разобраться», либо кто-то из членов коллектива
            воспрепятствует заговору и погасит его. Если ни того, ни другого не
            происходит, он увольняет всех.
          </UiText>

          <UiText>
            Любое проявление непорядочности, нечестности, подлости,
            предательства, жульничества переживает очень обостренно.
            Администратор в этическом плане вообще глубоко раним. Внешней
            суровостью и неприступностью он прикрывает свою внутреннюю
            уязвимость.
          </UiText>

          <UiText preset="large" color="role">
            К злоупотреблению его доверием Администратор относится очень
            болезненно. Причем дело здесь не в самолюбии и не в амбициях, а в
            том, что затронут его этический кодекс. Он подсознательно
            сориентирован на доверие к человеку.
          </UiText>

          <UiText>
            Доверие и порядочность считает нормой отношений. Человек, не
            наделенный этими качествами, в его понимании, безнравственный злодей
            и отношение к нему должно быть соответствующим.
          </UiText>

          <UiText>
            Администратор умеет признавать свои ошибки и свою вину, хоть ему это
            стоит огромного напряжения, поскольку такое признание, как правило,
            им глубоко выстрадано, никогда не уходит от ответственности.
          </UiText>

          <UiText>
            Прямота и честность — самые активные качества его этики. Но горе
            тому, кто заставит Администратора отвечать за чужую вину — по
            собственной воле и по своему желанию, он и сам может «прикрыть» кого
            угодно, кого считает нужным, но не дай Бог его «подставить» под
            неприятности, даже по недоразумению.
          </UiText>

          <UiText>
            Что, хоть и будет считаться смягчающим обстоятельством, но тем не
            менее Администратор проведет самое тщательное расследование, пока не
            разберется в истинных мотивах поступка.
          </UiText>

          <UiText>
            Отношения с разочаровавшими его людьми Администратор рвет без
            всякого сожаления и старается впредь о них не думать. Всякое
            упоминание об этих людях ему крайне неприятно. Когда ему о них
            напоминают, он обычно морщится и отворачивается.
          </UiText>

          <UiText preset="large" color="role">
            Любое обострение отношений Администратор воспринимает как объявление
            войны: мобилизует всю свою волю и энергию и начинает обдумывать план
            действий в сложившейся ситуации.
          </UiText>

          <UiText>
            Причем эта война обычно продолжается «до победного конца» и стоит
            ему огромного напряжения сил и нервов, что впоследствии сказывается
            на его самочувствии.
          </UiText>

          <UiText>
            Администратор великолепно умеет обострять отношения и довольно
            быстро наживает себе массу врагов. Поэтому этическая программа его
            дуала Гуманиста является для его «проблематичной» этики настоящим
            спасением, поскольку ориентирует на взаимопонимание, миролюбие,
            милосердие и уступчивость.
          </UiText>

          <UiText>
            Гуманист учит Администратора быть великодушным, уметь прощать, он
            «смягчает» Администратора, сглаживает острые углы его отношений.
            Администратор успокаивается, видя перед собой этический пример
            Гуманиста, умеющего стойко переносить любые разочарования и умеющего
            не держать зла. Идеалистические принципы Достоевского обретают
            реальность, когда им следует Администратор.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">
            6 — Активационная функция
          </UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_ideas" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Мысль</UiText>
              <UiText preset="body">Интуиция возможностей</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Если представители этого типа не всегда поспевают в ногу со
            временем, и «ход часов, откусывающих минуты» их постоянно держит в
            напряжении, то творческая мысль многих из них значительно опережает
            текущие события.
          </UiText>

          <UiText color="role">
            В какие бы фантастические дали ни уносилось его воображение,
            Администратор никогда не отрывается от реальности.
          </UiText>

          <UiText>
            Даже если не каждый из представителей этого типа работает в области
            научных исследований, каждый с интересом выслушает рассказ о новых
            неизведанных явлениях.
          </UiText>

          <UiText>
            Разумеется, если источник информации достаточно авторитетен.
          </UiText>

          <UiText color="role">
            Администратор уважает людей, умеющих генерировать интересные и
            оригинальные идеи, равно как и способных нетривиально мыслить. С
            уважением относится к проектам и предложениям других и того же
            требует для себя.
          </UiText>

          <UiText preset="large" color="role">
            Воодушевляется всякой реальной возможностью воплотить свои
            творческие замыслы и научные идеи. И наоборот, отсутствие видимых
            перспектив тормозит его деловую активность, если вообще не
            парализует.
          </UiText>

          <UiText>
            Администратор нуждается в людях, способных максимально раскрыть его
            творческий потенциал, оценить его способности и таланты, помочь
            реализовать их. Именно такую помощь ему оказывает его дуал Гуманист,
            восторженно воспринимающий все его идеи и начинания, способный
            ободрить и поддержать в трудную минуту.
          </UiText>

          <UiText>
            Гуманист, который обычно не любит бегать по инстанциям и просить за
            себя, проекты Администратора пробивает с исключительной энергией.
          </UiText>

          <UiText color="role">
            К прогнозам и прогнозированию Администраторы относятся со вниманием
            и интересом - прислушиваются к мнению людей, умеющих предвидеть
            развитие событий в будущее,особенно, если эта способность базируется
            на научном опыте. Любая наука, на базе которой возможно
            прогнозирование, вызывает его интерес и уважение.
          </UiText>

          <UiText>
            Считается с мнением людей, способных разглядеть этический потенциал
            каждого человека — его нравственные качества и наклонности.
            Логический и сенсорный потенциал, интеллектуальные способности и
            художественный вкус, прекрасно видит и сам.
          </UiText>

          <UiText>
            Умеет испытывать свои способности и возможности. В обстановке
            конкурсов и соревнований не сникает — наоборот, появляется
            «спортивный азарт», который мобилизует его силы, и, что бы ни
            случилось, он великолепно владеет собой.
          </UiText>

          <UiText>
            Хотя амбициозных выскочек, рассчитывающих на легкий успех, не любит,
            равно как и тех, кто добивается популярности любой ценой.
          </UiText>

          <UiText preset="large" color="role">
            Никого никогда не осуждает за неудачи. Наоборот, всегда старается
            подбодрить и поддержать человека, чей труд по каким-либо причинам не
            оценен по заслугам.
          </UiText>

          <UiText color="role">
            Не любит, когда ему «колят глаза» чужими успехами: успех для него не
            самоцель — надо хорошо делать свою работу, и он придет сам собой.
          </UiText>

          <UiText>
            Критику своих способностей Администратор также не любит, поскольку
            делает все возможное и невозможное для того, чтобы их развить.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">7 — Функция защиты</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_logic" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Теория</UiText>
              <UiText preset="body">Структурная логика</UiText>
            </span>
          </div>
          <UiText preset="large" color="role">
            Представители этого типа учатся всю жизнь и всю жизнь им не хватает
            полученных знаний, в чем они никогда не стесняются признаться, но
            что не всегда находит понимание у их коллег.
          </UiText>

          <UiText color="accent">
            У самой пятнадцать лет преподавательского стажа, а она приходит ко
            мне на уроки с тетрадочкой и все подробно записывает!
          </UiText>

          <UiText>
            Никакой опыт работы, никакие профессиональные достижения не дают
            Администраторам уверенности в том, что они знают достаточно много.
            Представители этого типа напрочь лишены каких-либо профессиональных
            амбиций и никогда не страдают отсутствием самокритики.
          </UiText>

          <UiText>
            Какого бы уровня профессионализма они ни достигали, никогда не
            позволяют себе переоценивать собственные возможности и к любой новой
            работе подходят исключительно серьезно.
          </UiText>

          <UiText preset="large" color="role">
            Приступая к творческой или научно-исследовательской работе, они
            долго и скрупулезно собирают материал. Иногда сбор материала
            продолжается на протяжении всей их профессиональной деятельности.
          </UiText>

          <UiText color="role">
            Глубина проработки подготовительного материала у Администраторов
            бывает совершенно потрясающей.
          </UiText>

          <UiText>
            Эрудиция Администраторов достойна всякого восхищения! Независимо от
            рода деятельности, их библиотеки изобилуют всевозможными
            справочниками, словарями, каталогами, атласами и энциклопедиями.
          </UiText>

          <UiText color="accent">
            В библиотеке одного из представителей этого типа, разрабатывающего
            дизайн игрушек, хранились атласы с изображением зверей и животных
            всех существующих на земле видов, причем многие виды животных были
            представлены отдельными атласами.
          </UiText>

          <UiText>
            Администратор обычно не стесняется признать свою некомпетентность,
            хотя это и бывает чрезвычайно редко.
          </UiText>

          <UiText>
            Некомпетентность в профессиональном вопросе — вообще исключительное
            явление, но если такое происходит, то только в случае, если эта
            информация была для него по каким-то причинам недоступна.
          </UiText>

          <UiText>
            Хотя именно для настоящего Администратора никакая информация не
            бывает недоступной. Люди этого типа идеально подходят для сбора
            секретной и «труднодоступной» информации, идеально соответствуют
            профессии разведчика: исключительная наблюдательность в сочетании с
            умением анализировать полученную информацию.
          </UiText>

          <UiText>
            Причем, полученную по всем возможным и невозможным каналам,
            незаурядная физическая выносливость, решительность, самообладание,
            предельная исполнительность и безупречная точность работы — вот
            комплекс данных, которыми наделен практически каждый из
            представителей этого типа и благодаря которым некоторые из них
            являются незаменимыми «бойцами невидимого фронта».
          </UiText>

          <UiText preset="large" color="role">
            Любое полученное сведение, любое знание дает представителям этого
            типа «информацию к размышлению».
          </UiText>

          <UiText>
            Источники информации у Администратора подразделяются на
            «авторитетные» и «неавторитетные».
          </UiText>

          <UiText>
            Первые принимаются почти безоговорочно, хотя тоже не без проверки,
            вторые — проверяются и перепроверяются до тех пор, пока не переходят
            в разряд «авторитетных».
          </UiText>

          <UiText>
            Доверяет Администратор только той информации, которая подтверждена
            фактами и в достоверности которой он лично многократно убежден.
          </UiText>

          <UiText>
            Всякую новую информацию воспринимает очень обстоятельно и
            основательно, стараясь увязать ее с уже имеющейся системой знаний.
          </UiText>

          <UiText color="role">
            Если чего-то недопонял, не стесняется переспросить или уточнить.
            Полученную информацию старается сразу же разложить «по полочкам».
            Ему всегда важно понять ее не только в общих чертах, но и уточнить
            частности.
          </UiText>

          <UiText>
            Простыми и доходчивыми средствами может изложить самые сложные
            труднодоступные пониманию понятия — качество, помогающее ему достичь
            превосходных результатов в преподавательской работе.
          </UiText>

          <UiText color="role">
            Со своей стороны, Администратор очень ценит в людях умение четко и
            последовательно излагать свою мысль. Его самого «сбить с мысли»
            очень трудно — излагая что-либо, он никогда не отходит от заданной
            темы и ни на какие уводящие в сторону вопросы обычно не отвлекается.
          </UiText>

          <UiText>
            Неспособность четко и последовательно изложить свою мысль обычно не
            вызывает у него сочувствия, не любит сумбурных и путанных
            объяснений.
          </UiText>

          <UiText>
            Искажения фактов и манипулирования ими так же не терпит, более того,
            это обстоятельство его всегда очень раздражает, особенно, когда
            затрагиваются его личные интересы или интересы его дела.
          </UiText>

          <UiText>
            «Спекулятивную» логику Администратор не принимает — он не из тех,
            кого можно убедить в чем угодно простейшей подтасовкой аргументов. С
            чужим мнением соглашается, если только оно не противоречит его
            собственным установкам и убеждениям, и если оно доказано фактами, в
            которых он лично убежден.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">8 — Фоновая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_will" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Воля</UiText>
              <UiText preset="body">Волевая сенсорика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Постоянно и повсеместно, по поводу и без видимых причин
            Администратор выражает готовность дать волевой отпор всякому, кто
            хоть чем-либо его заденет. Постоянно демонстрирует умение,
            способность и готовность постоять за себя.
          </UiText>

          <UiText>
            Эта способность реализуется у Администратора подсознательно и на
            каждом шагу проявляется в его поведении.
          </UiText>

          <UiText>
            Независимо от настроения и состояния любой из представителей этого
            типа говорит с постоянным, утрированным нажимом в голосе, с
            расстановкой и акцентированием чуть ли не каждого своего слова,
            словно хочет подчеркнуть его особенную значимость.
          </UiText>

          <UiText preset="large" color="role">
            Всегда резкие и напряженно-угловатые в движениях. Расслабленными их
            могут увидеть только самые близкие люди.
          </UiText>

          <UiText>
            Ввиду постоянного напряжения, которое очень быстро передается
            окружающим, общение со Администраторам многим покажется неприятным и
            утомительным. Но это никак не относится к его дуалу Гуманисту.
          </UiText>

          <UiText>
            Напряженность Администратора его только приятно тонизирует — выводит
            из обычного расслабленного и как-будто развинченного состояния,
            заставляет собраться с силами, мобилизует его волю и энергию.
          </UiText>

          <UiText preset="large" color="role">
            Воля и целеустремленность Администратора также носят демонстративный
            характер. В назидательных целях Администратор умеет показать пример
            того, как нужно постоять за себя. Но первым нападать никогда не
            будет — разве что по недоразумению.
          </UiText>

          <UiText color="accent">
            Решительность проявляет только в интересах дела, в плане защиты
            личных интересов и интересов «своей команды».
          </UiText>

          <UiText>
            Целеустремленность — только в рамках целесообразности, как форма
            реализации собственного творческого потенциала. Администраторы не
            способны «работать локтями» и «подниматься по трупам» для достижения
            своей цели.
          </UiText>

          <UiText>
            Поэтому вопрос самоутверждения собственных амбиций их также мало
            волнует — они никогда не захватывают власть, а приходят к ней волею
            избирателей, и свое право на управление и руководство великолепно
            доказывают честным и самоотверженным трудом.
          </UiText>

          <UiText>
            Исключительно выносливые и жизнестойкие люди. Создается впечатление,
            что преодоление трудностей для них естественная и оптимальная форма
            существования: работают по девятнадцать часов в сутки, всегда
            энергичны, активны, до глубокой старости сохраняют высокий жизненный
            тонус и внешнюю привлекательность.
          </UiText>

          <UiText preset="large" color="role">
            Подчеркнуто опрятны, аккуратны, организованны, дисциплинированны.
            Считаются с удобствами окружающих.
          </UiText>

          <UiText color="role">
            Стараются никому не причинять неприятностей и не доставлять
            неудобств. Свои проблемы решают только собственными силами — чего бы
            им это ни стоило.
          </UiText>

          <UiText>
            Администратор — прирожденный лидер и, как правило, великолепный
            руководитель. Не боится взять на себя большую ответственность и не
            стремится переложить свои обязанности на других. Бремя житейских
            забот тянет безропотно, как бы тяжело оно ни было.
          </UiText>

          <UiText>
            Своего партнера окружает самой тщательной заботой и опекой, совмещая
            свои семейные обязанности с профессиональной и общественной
            деятельностью. И если партнером Администратора является его дуал
            Гуманист, затраченные усилия достойно и в полной мере
            вознаграждаются.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
