<template>
  <div class="text">
    <section>
      <UiText preset="body" color="accent">
        Описания не должны обязательно совпадать со всеми чертами характера
        личности.
      </UiText>

      <UiText preset="small" color="accent">
        Идея как раз описать наблюдаемые у среднего представителя типа
        особенности поведения и обработки информации психикой.
      </UiText>

      <UiText preset="small" color="accent">
        Автор описания — Велта Микелсоне
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="role">
        Очень энергичный человек, способный много работать ради результата.
      </UiText>

      <br />

      <UiText>
        Талант и успех объясняются его врожденной неутомимой жизнедеятельностью.
        Он знает что делать в любой ситуации и без работы жить не может.
      </UiText>

      <UiText preset="large" color="role">
        Отличный администратор, способный руководить большим коллективом, четко
        распределять задания для каждого, высоко требовательный в вопросах
        качества и дисциплины. Успешнее работает уже в построенном учреждение,
        меньше создает сам.
      </UiText>

      <UiText preset="large" color="role">
        Он обеспечивает устойчивость, стабильность, устраняя все, что мешает
        успешной работе.
      </UiText>

      <UiText>
        Внедряет и использует самые эффективные методы работы, следит, чтобы она
        выполнялась качественно, в срок и согласно установленным правилам.
        Вырабатывает, упрощает и приспосабливает разные методики, нетрадиционные
        решения, инструкции, повышая эффективность.
      </UiText>

      <UiText preset="large" color="role">
        Планирует последовательность действий.
      </UiText>

      <UiText>
        Считает, что бездельникам и безалаберным людям, которые работают
        поверхностно, нет места в его коллективе. Лучше сотрудничает с теми,
        которые действуют подобно ему. Характерно то, что выполнить работу так,
        чтобы Администратор был доволен, редко удаëтся. Он всегда находит какую
        нибудь мелочь или недочет, которая раздражает и требует переделывания.
        Работу, выполненную им или под его руководством, редко приходиться
        выполнять заново.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Характерно, что он бережливый, покупки делает продуманно, в доме нет
        почти ничего лишнего.
      </UiText>

      <UiText>
        Все предметы и вещи использует максимально долго, умеет ухаживать за
        ними, чтобы они не теряли внешний вид и функциональность. Все, что
        необходимо для ежедневной жизни, у него должно быть под рукой.
      </UiText>

      <UiText>
        Человек, тонко ощущающий физический мир и все происходящее вокруг.
        Хорошо разбирается в механизмах. Он придает большое значение
        аккуратности во внешности, но не копирует моду.
      </UiText>

      <UiText>
        Стиль одежды — консервативный, классический, но всегда чистый,
        элегантный, неброский, приспособленный к конкретной ситуации. Все детали
        согласованы, не выделяются яркие тона.
      </UiText>

      <UiText preset="small" color="accent">
        Женщины свой гардероб не перенасыщают, в нем находиться все только
        необходимое. Неотъемлемая часть гардероба — аксессуары, они дорогие и
        соответствуют наряду, а также обязательно дорогая косметика.
      </UiText>

      <UiText>
        В своем окружении хочет видеть прилично и аккуратно одетых людей.
        Считает, что внешность подчеркивает внутреннее содержание человека. Это
        для него как бы эстетическая нужда, равноценная наслаждению искусством.
      </UiText>

      <UiText>
        Каждая вещь для него — ценность, за которой он с удовольствием следит,
        ухаживает и бережет. Часто наводит порядок, только тогда ощущает
        комфорт.
      </UiText>

      <UiText>
        На работе считает — если созданы комфортные условия, только тогда можно
        требовать от людей качественное выполнение работы.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Немаловажна ему застольная эстетика.
      </UiText>

      <UiText>
        Ему необходим красиво сервированный стол, дорогая посуда, качественные
        блюда. Продукты питания он покупает продуманно, чтобы ничего не
        приходилось выбрасывать. Среди Администраторов много отличных кулинаров.
      </UiText>

      <UiText>
        Обладает изысканным чувством цвета, формы и красоты. В доме всегда царит
        комфорт, уют и всё устроено со вкусом. Но поскольку сам придумать не
        может, он скорее кого то копирует.
      </UiText>

      <UiText>
        Как традиционалист, высоко ценит традиции и обряды. Часто его ставят в
        пример окружающим. Назойливо заботливый к близким, относится к ним с
        высокой ответственностью.
      </UiText>

      <UiText>
        Типично, что он заранее продумывает подарки, покупает их с мыслю,
        подарить в подходящий момент.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Физически вынослив, не жалуется о своем здоровье и самочувствие, но
        бывает, запускает болезни, так как ходьба по поликлиникам отрывает от
        работы.
      </UiText>

      <UiText>
        Даже отдыхая от работы ему нужно заниматься чем то физически — быть
        активным, быть в движении. Если работает, то усердно, а если отдыхает,
        то от всей души.
      </UiText>

      <UiText preset="large" color="role">
        Он всю жизнь учится выражаться и вести себя этично согласно ситуации.
        Чтобы скрыть свою неловкость, он часто шутит, но его шутки не всем
        понятны. В общении с незнакомыми людьми сдержан, соблюдает дистанцию, в
        отношениях с друзьями — внимательный и понимающий.
      </UiText>

      <UiText>
        Умеет заинтересовать партнера разговором. Если партнер терпеливый,
        умеющий слушать его, тогда ведет себя особенно внимательно. Убежден в
        своей правоте, не терпит, когда ему возражают или говорят правду в
        глаза, бывает, что может вспылить.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Ему трудно управлять своим холерическим темпераментом. Случается, что в
        течении жизни из-за этого теряет много друзей и коллег.
      </UiText>

      <UiText>Едва ли способен уступить, иногда долго держит злобу.</UiText>

      <UiText preset="large" color="role">
        С близкими ведет себя сердечно и сентиментально.
      </UiText>

      <UiText>
        Ему важно получить любовь, ждет достоверных подтверждений чувств. На
        работе старается избежать случайностей. Чувствует себя ответственным за
        партнера, защищает его интересы больше, чем свои.
      </UiText>

      <UiText>
        Хочет быть спокойным, однако в отношениях с противоположным полом
        чувствует себя напряженным. Из-за этого часто становится чрезмерно
        эмоциональным, прямолинейным, насмешливым и резким.
      </UiText>
    </section>

    <section>
      <UiText>
        В жизни его самым большим дефицитом считается нехватка времени, все им
        запланированное не всегда удаëтся сделать. Это объясняется тем, что его
        педантичность и высокая требовательность к себе замедляет процесс.
      </UiText>

      <UiText preset="large" color="role">
        Нехватка времени портит его жизнь.
      </UiText>

      <UiText>
        Сам старается не опаздывать, но случается, так же не позволяет другим
        злоупотреблять его временем.
      </UiText>

      <UiText preset="large" color="role">
        Видит проблемы в отношениях, но не понимает, как их решить.
      </UiText>

      <UiText>
        Ему хочется поступить этично. Колеблется в принятии решений. По этой
        причине он долго находится в дисгармонии с собой.
      </UiText>

      <UiText preset="small" color="accent">
        Женщины долго не способны освободиться от напряжения, но его можно снять
        кокетством.
      </UiText>

      <UiText>
        Поскольку не способен предвидеть изменения эмоциональной атмосферы
        коллектива, беззащитен перед созреванием конфликта.
      </UiText>

      <UiText preset="large" color="role">
        Выход из конфликта не видит и даже не пытается его решить. Либо он
        ускользает от конфликта, либо у него получается решать его довольно
        резко.
      </UiText>

      <UiText>
        Ожидает от других корректного к себе отношения, но жизнь преподносит
        разные, непредсказуемые ситуации,к которым он не готов. Нельзя сказать,
        что его не тревожит дискомфорт в отношениях, он об этом достаточно много
        думает, и всю жизнь учится налаживать их.
      </UiText>

      <UiText>
        Хотя он разговорчивый человек, но на протяжении многих лет может
        оставаться для коллег загадкой.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Способен жертвовать собой в некомфортной супружеской жизни только
        потому, что дал слово, и нельзя разрушать семью.
      </UiText>

      <UiText>Не терпит, когда злоупотребляют его доверием.</UiText>

      <UiText>
        Ему не свойственна оторванность от реального мира, он не предается
        фантазиям.
      </UiText>

      <UiText>
        Ему важно все видеть, ощущать и убеждаться в реальном существовании.
        Полагается на свои раннее проверенные методы. Прежде, чем советовать что
        то другим, проверяет на своем опыте. Непроверенные и сомнительные приемы
        работы и некачественный товар другим не предлагает.
      </UiText>

      <UiText preset="large" color="role">
        Обычно людей переоценивает или недооценивает, среднего не бывает.
      </UiText>

      <UiText>
        Также осторожно относится к разному риску. Он нуждается в партнере,
        который поможет ему понять других, заметить творческий потенциал,
        предоставит прогнозы на будущее и способен мыслить стратегически, лишь
        тогда он готов начинать бизнес.
      </UiText>
    </section>

    <section>
      <UiText>
        Принимаясь за новую сложную работу, собирает полезную и достоверную
        информацию со всех возможных источников.
      </UiText>

      <UiText preset="large" color="role">
        Свою мысль излагает лаконично. Предпочитает помогать не словом, а делом.
      </UiText>

      <UiText>
        Всегда готов пополнить знания, поскольку желает усовершенствоваться. Не
        способен понять тех, которые не понимают элементарных вещей, даже не
        разбираются по грамматике языка. В следствии этого автоматически
        группирует окружающих – «умные» и «тупые» или «авторитетные» и «не
        авторитетные». Обычно прислушивается к мнению своего авторитета, а не к
        президенту.
      </UiText>

      <UiText preset="large" color="role">
        Создает вокруг себя стабильный и прогнозируемый мир, в котором царит
        честность и справедливость.
      </UiText>

      <UiText>
        Ему важно заботиться о социальной защите людей, особенно нуждающихся в
        помощи – пенсионеров, инвалидов, многодетных семей, школьников и
        студентов. Его заботит благосостояние всего общества – внедрение всего,
        облегчающего человеческую жизнь, и устранение всего, что создает
        препятствие в достижении комфорта.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Своим внешним видом создает впечатление о себе как о сильной,
        целеустремленной, прямолинейной личности.
      </UiText>

      <UiText>
        Не отступает перед трудностями, преодолевает их. В этом помогает его
        выдержка и способность к выживанию. Не обременяет других своими личными
        нуждами.
      </UiText>

      <UiText>
        Обладает чувством собственника — не позволяет, чтобы другие посягали на
        принадлежащие ему вещи или на его территорию, действовали без его
        ведома, диктовали свои условия.
      </UiText>

      <UiText preset="large" color="role">Он не занимает власть силой.</UiText>

      <UiText>
        Но умеет защищать и отстаивать занятую позицию, потому что для него
        важен статус.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
