<template>
  <div class="text g-page">
    <section>
      <UiText preset="large" color="role">
        Ваша сильная сторона — это умение подбирать себе занятие по душе,
        доставляющее радость, удовольствие, приятные ощущения.
      </UiText>

      <UiText>
        Вы — незаменимый человек для организации досуга и отдыха в кругу
        близких. Вкусная еда, красивая посуда, оформление интерьера, а также
        тëплая непринужденная атмосфера общения — вот сфера вашего творчества.
      </UiText>

      <UiText>
        Вы умеете получать от жизни радость, давать её другим. Деятельным видам
        отдыха вы, скорее, предпочитаете красивый природный ландшафт, созвучный
        внутреннему состоянию вашей души.
      </UiText>

      <UiText>
        Вы — человек миролюбивый и дипломатичный. Поэтому умеете избегать ссор и
        конфликтов. Терпимо относитесь к чужим недостаткам, мягки и приятны в
        общении, не любите оказывать грубое давление на людей.
      </UiText>

      <UiText>
        Своим поведением вы стремитесь вызывать у людей приятные эмоции. У вас
        неплохое чувство юмора, веселый и легкий нрав, вы умеете превратить в
        шутку разгорающийся конфликт.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Ваша основная проблема — отсутствие постоянной работоспособности,
        неумение и нежелание заставлять себя делать неинтересную, тяжелую, но
        необходимую работу.
      </UiText>

      <UiText>
        Вы не любите официальной обстановки, предпочитаете договариваться со
        сторонами частным путем, используя проверенные связи. Развивайте в себе
        более активную жизненную позицию.
      </UiText>

      <UiText preset="large" color="role">
        Руководствуйтесь формулой: делу время — а потехе час.
      </UiText>

      <UiText>
        Больше думайте об интересах других людей, помогайте им делом, а не
        словами. Добивайтесь, чтобы личные интересы совпадали с общими заботами,
        интересами общего дела.
      </UiText>

      <UiText>
        Преодолевайте в себе инертность, не бойтесь тратить свои силы на
        общественно полезные дела, не обещайте сиюминутной отдачи или пользы.
        Тогда люди будут относиться к вам с большим уважением, будут уважать вас
        как делового, надежного партнера.
      </UiText>
    </section>

    <section>
      <UiText>
        Еще одна из ваших проблем — недостаточная дальновидность. Вам не всегда
        удаëтся правильно оценить далекую перспективу сегодняшних начинаний,
        поэтому вы слишком часто занимаете выжидательную позицию, ориентируясь
        только на близкую гарантированную отдачу.
      </UiText>

      <UiText>
        Вы рискуете в этом случае выиграть в мелком, но упускаете крупные шансы.
      </UiText>

      <UiText>
        С другой стороны, будьте осторожны в своих обещаниях, не выдавайте
        желаемое за действительное. Не переоценивайте возможности дела, которым
        занимаетесь, не старайтесь его чрезмерно рекламировать и расхваливать,
        иначе вас могут принять за несерьезного человека.
      </UiText>

      <UiText preset="large" color="role">
        Избегайте излишней саморекламы.
      </UiText>

      <UiText>
        Будьте более последовательны в своих решениях, больше планируйте, не
        ограничивайтесь одним чутьем и импровизацией.
      </UiText>

      <UiText preset="large" color="role">
        Доводите начатые дела до конца, чтобы не подводить себя и других.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
