<template>
  <div class="text g-page">
    <section>
      <UiText preset="subtitle" color="accent">Сильные стороны</UiText>

      <UiText preset="large" color="role">
        Очень динамичный, подвижный, деятельный человек. Остро ощущает напор
        времени, считает недопустимым отставание в делах.
      </UiText>

      <UiText>
        Большой труженик, с удовольствием занимается делами, приносящими пользу.
        Любознателен, интересуется новшествами, которые можно применить на
        практике.
      </UiText>

      <UiText>
        Хорошо разбирается в вопросах деловой активности. Видит выгодность или
        невыгодность, перспективность или бесперспективность тех или иных
        предприятий. Предлагает неординарные пути увеличения эффективности,
        может пойти на деловой риск.
      </UiText>

      <UiText preset="large" color="role">
        Во всем стремится к деловой ясности и четкости. Не любит действовать
        вслепую, без подготовки.
      </UiText>

      <UiText>
        Планирует свои мероприятия заранее. Не любит хитрости и уловок,
        предпочитает договариваться на взаимовыгодных условиях.
      </UiText>

      <UiText>
        Часто проявляет себя как спонсор и меценат. Может жить без комфорта,
        если надо. Даже если ему придется трудно, ныть никогда не станет.
      </UiText>

      <UiText>
        Эмоционален, суетлив, неусидчив. Оптимист, постоянно излучает
        дружелюбие.
      </UiText>

      <UiText>Активный сторонник здорового образа жизни.</UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">Проблемы</UiText>

      <UiText>
        Не все могут выдержать его напряженный рабочий режим, который он к тому
        же склонен произвольно менять, навязывая свой ритм окружающим.
      </UiText>

      <UiText>
        Обычно забот у него оказывается так много, что он не может всюду успеть.
        Часто строит далеко идущие, хотя не до конца продуманные планы.
      </UiText>

      <UiText>
        Может чрезмерно рисковать, первым бросается во все сомнительные
        мероприятия. Очень говорлив, любит рассказывать и обсуждать прочитанное
        и услышанное.
      </UiText>

      <UiText>
        Может одеваться достаточно небрежно, не любит, когда на его внешность
        обращают пристальное внимание.
      </UiText>

      <UiText preset="large" color="role">
        Нетерпелив по натуре, поэтому часто допускает небрежность в оформлении
        деловой документации, в работе, требующей скрупулезности и тщательности,
        «творческий» беспорядок в быту и на рабочем месте.
      </UiText>

      <UiText>
        В принципиальных для него вопросах проявляет твердость и неуступчивость.
      </UiText>

      <UiText>
        Иногда допускает нетактичность, грубоватый юмор. Неохотно посещает
        врачей.
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Нельзя требовать и ожидать
      </UiText>

      <UiList iconName="chevron-right" iconColor="accent" iconSize="16">
        <UiListItem>
          Взвешенности и неторопливости в принятии решений.
        </UiListItem>

        <UiListItem>Тщательности в рутинных делах.</UiListItem>

        <UiListItem>Постоянного порядка в быту и на рабочем месте.</UiListItem>

        <UiListItem>
          Всегда одинаково ухоженного и опрятного внешнего вида.
        </UiListItem>

        <UiListItem>Тактичности и психологического чутья.</UiListItem>
      </UiList>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Подходящие виды деятельности
      </UiText>

      <UiText>
        Лучше всего Предприниматель реализует себя в инновационных областях, где
        требуется широкий кругозор, нестандартный подход к делу, умение
        адаптировать теоретические разработки к применению на практике.
      </UiText>

      <UiText>Он может быть неплохим изобретателем и рационализатором.</UiText>

      <UiText>
        Учитывая высокие темпы его работы и подвижность, можно рекомендовать ему
        динамичную работу, связанную с командировками.
      </UiText>

      <UiText>
        Предприниматели не боятся коммерческого риска, поэтому могут быть
        первопроходцами, зачинателями новых дел в бизнесе.
      </UiText>

      <UiText>
        Они могут заниматься разнообразной работой, если она интересна,
        перспективна, динамична и не требует особой тщательности.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
