<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <div class="warning">
      <UiText preset="small" color="accent">
        Если вы не умеет воспринимать юмор, обидчивы или зависимы от мнений
        незнакомцев, пожалуйста, не читайте все что ниже.
      </UiText>

      <UiText preset="small" color="accent">
        Ненормативная лексика и сексуальные темы, оскорбление чувств всех
        причастных. Но весело и остроумно. Соблюдена авторская орфография и
        пунктуация.
      </UiText>
    </div>

    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Люркмор"
          subtitle="2 минуты"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Селютин"
          subtitle="4 минуты"
          target-content-id="tab-2"
        />

        <VariousTab
          title="Эльвира Фея"
          subtitle="2 минуты"
          target-content-id="tab-3"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText color="accent">
            <i>
              небыдло, омега, СПГС, ОЯШ, ГК, ТП, ТКП, ОБВМ, хипстер, пейсатель,
              DJ
            </i>
          </UiText>

          <UiText preset="large" color="role">
            Образец, эталон ТП в вакууме. Безответственные и неловкие твари. А
            ещё они всегда куда-то спешат, и при этом постоянно опаздывают.
          </UiText>

          <UiText>
            Поскольку у Лирика всё валится из рук, наверное, единственный способ
            получения ПРОФИТа для них — сочинение стихов и песен или актёрство.
            Но часто они и это хорошо делать не могут.
          </UiText>

          <UiText preset="large" color="role">
            При этом очень любят присвоить себе звание героя, борца за гуманизм
            и справедливость. Вообще, среди героев процент Лириков и Наставников
            колеблется в районе 95%. Тащемто, Лириков считаются энергетическими
            вампирами.
          </UiText>

          <UiText>
            Казалось бы, бред, НО! При общении очень часто попросту грузят
            фактами, причём без видимой связи между ними, что сильно утомляет
            почти любого логика.
          </UiText>

          <UiText>
            По сути — нежные и романтичные люди, что, правда, не мешает им быть
            коварными сволочами по жизни. Вконтакте полно групп по соционике, на
            95% состоящих из девушек-Лириков.
          </UiText>

          <UiText>Интегральный тип России и Ирландии.</UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">Бочка меда</UiText>
          <UiText preset="large" color="role">
            Творческие личности же! И часто притом ещё и эрудированные. К тому
            же, душевные люди, если кому надо.
          </UiText>
          <UiText preset="small" color="accent">Ложка дегтя</UiText>
          <UiText preset="large" color="accent">
            Лирики — эталон желанной женщины в нашей, российской, культуре.
            Розовые сопли, хроническая безответственность и нерешительность!
            Короче, всё за них делают Лидеры. Что касается парней, то Лириков,
            попавших в армию, остаётся только пожалеть. Вообще наименее
            приспособленный после Гуманиста к реальной жизни тип.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="large" color="role">
            Увалень, витающий в облаках. Обидчивый до крайностей — не тронь его!
          </UiText>

          <UiText>Лицемерны. Мечтатель — «не здесь и не сейчас».</UiText>

          <UiText preset="large" color="role">
            Безнадежный романтик. Живет в розовом мире собственных грез. Очень
            болезненно переживает, когда его мир сталкивается с внешним миром.
          </UiText>

          <UiText>
            Любит разные фенечки и примочки. Не умеет обращаться с деньгами,
            часто бывает обманут. Рассеян, часто теряет вещи.
          </UiText>

          <UiText>
            Да чего про этих мокриц говорить, и взять с них нечего, кроме
            стихов. Уж вот кто мастера по влипанию в истории так это Лирики —
            получат пенделя от жизни и разведут скулёж на весь мир, жалости на
            них не напасёшься.
          </UiText>

          <UiText>
            Все замечательно, пока не приходится работать вместе с ним. Его
            дерганья по каждому пустяку вызывают жалость и раздражение
            одновременно, масса времени уходит на объяснения и этические
            экивоки, поддержание отношений как их видит Лирик и вытаскивание его
            в дельный мир.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Поднять молоток над гвоздем для него труднее, чем пойти в бой против
            врага.
          </UiText>

          <UiText>
            Храбрец и драчун. Пьяный Лирик — это туши свет и не отсвечивай —
            норовит подраться, сунуть тебе вилкой в живот или шилом в задницу;
            контролируется только волевым неотвязным взглядом: все вилки чудесно
            исчезают, следует лопотание о вечной любви и привязанности.
          </UiText>

          <UiText>
            Совсем уж неразвитые Лирики бесят постоянными рассказами об
            иллюзорных доказательствах того, как сильно их кто-то любит или
            уважает.
          </UiText>

          <UiText preset="large" color="role">
            Наивны невероятно, лентяи страшные в плане того, что им не
            интересно.
          </UiText>

          <UiText>
            Склонны к использованию друзей, зануды иногда, обидчивы, злопамятны,
            много хотят, при чём всё и сразу. Искажённо воспринимают себя и мир,
            ищут сильного друга и поддержку.
          </UiText>

          <UiText>
            Как правило, тех друзей, которые не помогают в трудную минуту,
            перестают считать за друзей.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Часто оторваны от реальности и болезненно воспринимают, когда
            стукаются головой о жестокий мир.
          </UiText>

          <UiText>
            Любят свои иллюзии. Удары судьбы делают их циниками. Корыстен.
            Ненавидит — страшно, любит — самозабвенно, человек крайностей, в
            котором долго бушует юношеский максимализм.
          </UiText>

          <UiText preset="large" color="role">
            Жутко ревнив. Выше всего ценит свои творческие порывы. За них
            перегрызёт горло любому.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Очень самолюбив и хочет, что бы его любили, замечали и оценивали.
          </UiText>

          <UiText color="role">
            Нервное несчастное существо, замкнутое в крошечном мирке, хотящее
            сказку и желающее лучше умереть, чем так жить.
          </UiText>

          <UiText>
            Лирики монотонны, занудны. Не всегда могут дать отпор. Слишком
            ранимы, легко поддаются внушению, из-за врожденной порядочности
            страдают сами, обидчивы.
          </UiText>

          <UiText>
            Постоянно выдумывают всякую чешую, оторванную от жизни и никому не
            нужную. Постоянно все роняют, ломают, но ничего не делают, а если
            сделают — то что-нибудь при этом испортят. Соображают медленно.
          </UiText>

          <UiText preset="large" color="role">
            Но внутренне очень агрессивны, диктаторы.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-3" class="tab">
        <section>
          <UiText preset="large" color="role">
            А Лирики — вечные нытики, считающие себя, сука, жутко гениальными.
            Попробуйте только не восхититься талантом Лирика – это все равно,
            что не вострепетать перед идеями Новатора.
          </UiText>

          <UiText>
            Мы, конечно, знаем, что в обоих случаях мы им, придуркам, сильно
            льстим. Творчество Лирика всегда отдает каким-то истеризмом и
            чернухой, причем поэт должен быть несчастным и голодным, чему Лирики
            наглядное подтверждение.
          </UiText>

          <UiText>
            У них вечно нет бабла, потому что за отсутствием мозга как класса
            они не способны удержать бабки в руках. Их приходится кормить,
            одевать, обустраивать, после чего они смотрят на вас свысока и
            разглагольствуют о вашей приземлености и непонимании их высоких
            нужд.
          </UiText>

          <UiText>
            Работать Лирики любят, как ни странно, но представление о «работе» у
            них необычное — мазня на подрамнике или муть в наушниках
            преподносится как выстраданное любимое творение, а пошлое
            отсиживание в офисе с 9 до 6 презирается, потому места официальной
            работы Лирик меняет, как перчатки.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Еще они пьют, помногу и с трагичным выражением на похмельной роже, и
            любят всяческие перевоплощения.
          </UiText>

          <UiText>
            Когда ваш Лирик придет домой с синим хохолком вместо блондинистой
            гривы и в тулупе на босу ногу, не удивляйтесь — это очередной
            творческий кризис.
          </UiText>

          <UiText>
            А кризис у него всегда. Блядки — тоже всегда, причем одновременно он
            непременно влюблен, и снова неудачно.
          </UiText>

          <UiText>
            Объект для страсти Лирик выбирает со всей тщательностью — нужна
            полная гарантия, что это злобное и жестокое существо никогда Лирика
            не полюбит и будет лишь пользоваться его юным и прекрасным телом;
            тогда он вновь будет несчастен, депрессивен, обласкан очередным
            наивным идиотом, и пойдет творить гениальное направо-налево.
          </UiText>

          <UiText>
            Пока не будут остановлены метким фингалом Лидера, которого вся эта
            блядская романтика и бардак порядком заебли.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
