<script lang="ts" setup>
import { SociotypesDuoByIntertypeWidget } from "@widgets/sociotypes";
import type { IntertypeIdType } from "@types";
import { UiText } from "@shared/ui";

const props = defineProps<{ intertypeId: IntertypeIdType }>();
</script>

<template>
  <div class="text">
    <UiText preset="large" color="accent">
      Нейтральные отношения, которые несимметричны по своей сути. Подзаказный
      решает задачи, которые ставит заказчик, при этом реализуя себя.
    </UiText>

    <UiText>
      Первый партнер в отношениях называется заказчиком, а второй — подзаказным.
    </UiText>

    <UiText color="dark-grey">
      Отношения социального заказа образуют закрытое кольцо в соционе. Каждый
      ТИМ имеет своего заказчика и своего подзаказного.
    </UiText>

    <UiText color="dark-grey">
      Именно отношения социального заказа являются основными для прогресса,
      поскольку в них раскрываются творческие возможности людей.
    </UiText>

    <UiText preset="large" color="accent">
      В отношениях социального заказа партнер-заказчик смотрит на
      партнера-подзаказного сверху вниз, недооценивая его возможности.
    </UiText>

    <UiText>
      Подзаказный, наоборот, восхищается заказчиком, переоценивая его
      положительные качества. Находясь в обществе заказчика, подзаказный
      начинает перед ним заискивать, пытается вызвать в заказчике интерес, ведет
      себя нестандартно относительно обычной жизни.
    </UiText>

    <UiText>
      Со стороны это выглядит так, будто подзаказный оправдывается перед
      заказчиком. На самом деле, комплимент подзаказному от заказчика намного
      ценней, чем комплимент от любого другого человека.
    </UiText>

    <UiText>
      Отношения социального заказа чаще всего инициирует заказчик. Подзаказный
      партнер видит, что заказчик к нему расположен, поэтому старается
      понравится, произвести впечатление.
    </UiText>

    <UiText>
      Когда ему удаëтся, заказчик поощряет подзаказного, поддерживает его.
    </UiText>

    <UiText>
      Но такая идиллия существует только в первые моменты отношений, а в
      дальнейшем заказчик перестает слышать подзаказного, из-за чего он
      расстраивается и старается в дальнейшем держаться на расстоянии.
    </UiText>

    <hr />

    <UiText preset="large" color="accent">
      Подзаказному сложно закончить отношения с заказчиком.
    </UiText>

    <UiText>
      Он чувствует в этом случае потерю важного источника информации,
      интересного собеседника и полезного человека.
    </UiText>

    <UiText>
      Поэтому, если заказчик желает продолжать отношения, велика вероятность,
      что подзаказный никуда не денется.
    </UiText>

    <UiText>
      Это можно заметить в браках, когда явно несчастливые люди живут вместе
      десятилетиями, не имея возможности развестись и строить каждый свою жизнь.
    </UiText>

    <UiText preset="large" color="accent">
      Нельзя сказать, что отношения заказа — это конфликтные отношения. Скорее,
      это отношения утомляющих ссор из-за ничего.
    </UiText>

    <UiText>
      В этих отношениях нет громких скандалов и желания уйти, но они окрашены
      перманентным недовольством друг другом, которое можно контролировать: в
      этом случае отношения будут стабильными и неплохими.
    </UiText>

    <UiText>
      Иначе же, в паре с отношениями заказа будут постоянные ссоры по мелочам.
    </UiText>

    <UiText preset="large" color="accent">
      Интересное наблюдение: пары, которые часто ссорятся на пустом месте,
      несколько раз расстаются, а потом опять начинают жить вместе, чаще всего
      собой иллюстрируют отношения социального заказа.
    </UiText>

    <hr />

    <UiText>
      Чтобы отношения социального заказа не приводили к постоянным упрекам,
      стоит соблюдать несколько правил.
    </UiText>

    <UiText preset="large" color="accent">Не подводите друг друга.</UiText>

    <UiText>
      Необходимо выполнять все обещания, соблюдать договоренности, предупреждать
      заранее о неординарных ситуациях.
    </UiText>

    <UiText preset="large" color="accent">Помогайте друг другу.</UiText>

    <UiText>
      Заказчик должен проявлять уважение к подзаказному, показывать своё хорошее
      отношение, говорить слова поддержки, а подзаказному не стоит
      драматизировать события и не высказывать все в лицо заказчику.
    </UiText>

    <UiText preset="large" color="accent">Сотрудничайте.</UiText>

    <UiText>
      В отношениях социального заказа партнëрам стоит обмениваться информацией,
      учиться друг у друга, благодарить друг друга за помощь. Такие отношения
      подходят для работы и для обмена опытом.
    </UiText>
  </div>
</template>

<style scoped lang="scss">
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 16px;
}
</style>
