<template>
  <div class="text">
    <section>
      <UiText preset="body" color="accent">
        Описания не должны обязательно совпадать со всеми чертами характера
        личности.
      </UiText>

      <UiText preset="small" color="accent">
        Идея как раз описать наблюдаемые у среднего представителя типа
        особенности поведения и обработки информации психикой.
      </UiText>

      <UiText preset="small" color="accent">
        Автор описания — Велта Микелсоне
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="role">
        Миссия — радоваться самому и радовать других.
      </UiText>

      <br />

      <UiText>
        Очень простой в общении человек, способный зарядить позитивом
        кого-угодно. Отличается жизнелюбием и стремлением во всем видеть только
        позитив. Своим присутствием способен передавать другим свою радость и
        позитивные эмоции, разряжая обстановку и поднимая настроение. Это
        объясняет, почему его воспринимают как энтузиаста.
      </UiText>

      <UiText>
        Общителен, подвижен, легко вступает в отношения и успешно их строит.
      </UiText>

      <UiText preset="large" color="role">
        Ему необходимо находиться в окружении людей, видеть в них только
        положительные стороны, исключая полностью отрицательные. Наблюдает и
        улавливает малейшие изменения в настроениях других людей.
      </UiText>

      <UiText>
        Выражение лица говорит о его самочувствии. Дружелюбный, праздничный
        взгляд, выразительные глаза, все что с ним происходит заметно всем.
      </UiText>
    </section>

    <section>
      <UiText>
        Самая большая амплитуда тонов голоса. Если он – актер или шоу-мэн, его
        громкий и лаконичный голос используется в рекламных клипах.
      </UiText>

      <UiText preset="large" color="role">
        Он знает и понимает, какой тон голоса, какие жесты и мимику следует
        применить в той или иной ситуации. Это ему удаëтся естественно.
      </UiText>

      <UiText>
        Знает, какой тон, мимику и жесты применить в ситуации. Делает это
        естественно.
      </UiText>

      <UiText>
        Везде, где появляется Энтузиаст, настроение компании меняется,
        начинается веселье, смех, шутки. Он избегает ситуаций, когда люди сидят
        с мраморными лицами, не шутят и не веселятся, а только жалуются и
        проклинают судьбу. Считает, что каждый может найти что-то радостное в
        жизни, нужно пытаться избегать негатива.
      </UiText>

      <UiText preset="large" color="role">
        Не стесняется показывать свои чувства — открыто выражает счастье,
        любовь, страх, удивление, восторг.
      </UiText>

      <UiText>
        Бывает, обижается из-за мелочей, даже на тех, кто хорошо к нему
        относится.
      </UiText>

      <UiText>
        Случается, что другой раз он плохо понимает причину оскорбления и может
        на серьезную обиду не отреагировать. Услышав что-то неприятное, может
        вспыхнуть, но обиду долго не держит.
      </UiText>

      <UiText>
        Для получения позитивных эмоций представители этого типа нуждаются в
        посещении культурных мероприятий – концерты, театр, вечера поэзии. Чтобы
        получить позитивный эмоциональный заряд, может просто погулять по
        городу, любуясь красотой.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Сильно выражено понимание красоты окружающего мира, сильно развиты
        способности ощущений.
      </UiText>

      <UiText>
        Очень важно опекать своих близких. В доме всегда уют и комфорт, даже по
        будням создается праздничная атмосфера.
      </UiText>

      <UiText>
        Он незаменимый организатор праздников, и не только дома. У него талант
        готовить изысканные блюда, а также со вкусом накрывать на стол.
      </UiText>

      <UiText>
        Все у него продумано, начиная с сюрприза для каждого гостя до застольных
        речей. Приятный собеседник, внимательный слушатель.
      </UiText>

      <UiText>
        Как традиционалист всегда находит время, чтобы найти для каждого члена
        семьи подарки, сувениры, никогда про это не забывает. При этом с любовью
        и выдумкой красиво оформляет каждый подарок, завязывает ленточками и
        каждому посвящает праздничные слова.
      </UiText>
    </section>

    <section>
      <UiText>
        Любимые темы разговоров — питание, культура, искусство, книги, одежда,
        семья. Он создатель высокой моды.
      </UiText>

      <UiText preset="large" color="role">
        Одевается со вкусом, но бывает преувеличение в роскоши, либо чрезмерные
        акценты.
      </UiText>

      <UiText>
        Особенно отличаются женщины, которые умело подбирают наряды, сочетая
        бижутерию. Выбирая одежду, не всегда учитывает тенденции моды,
        предпочитает то, что больше им подходит. Ему необходимо всегда выглядеть
        элегантно — естественно появляется желание освежить гардероб. Он часто
        выделяется в обществе своей изысканной внешностью.
      </UiText>

      <UiText>
        Как эстет и любитель красоты, оценивает внешность другого человека.
        Избегает резких замечаний, но если ему необходимо находиться долгое
        время в одном помещении с человеком (на рабочем месте), может дать
        рекомендации, как одеваться и что изменить во внешнем виде. Другой раз
        может что-то подарить или отдать из своих вещей.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Для него важно обеспеченность и материальное благосостояние, он
        нуждается в этом постоянно.
      </UiText>

      <UiText>
        Однажды насладившись жизнью в роскоши, вряд ли потом выберет жизнь «в
        шалаше».
      </UiText>

      <UiText>
        Преподносит себя как делового человека. Хотя он не достигает высоких
        вершин в бизнесе, но умеет постепенно продвигаться к выгодным позициям и
        хорошо зарабатывать. Успешно умеет «продать» свою работу.
      </UiText>

      <UiText>
        Услуги его обычно отличаются высокой ценой. Иногда выбирает ручную
        работу, которая ему хорошо дается.
      </UiText>

      <UiText>
        Однако он не экономный, не умеет просчитать, как на долго ему хватит
        денег. Поскольку он нуждается в роскошной жизни, деньги тратит быстро,
        не думая останется ли на завтра.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Умеет применять изученное на практике, однако в незнакомых ситуациях
        теряет уверенность в себе.
      </UiText>

      <UiText>
        Делая аналитическую работу, где требуется гибкое мышление, он
        запутывается в цифрах, терминологии и фактах. Едва ли способен исполнить
        качественно кропотливую работу. Часто делегирует её другим.
      </UiText>

      <UiText>
        Умело торгуется, определяет качество вещей. Выбирая покупки или когда
        под его руководством исполняются ручные работы (ремонт, строительство,
        шитье, услуги парикмахера) придирается к каждой мелочи.
      </UiText>

      <UiText>
        Если он не нашел счастья в семье, в работе, в нем копится напряженность.
      </UiText>

      <UiText preset="large" color="role">
        Он легко становится зависимым от алкоголя и наркотиков.
      </UiText>

      <UiText>
        В поисках разнообразия способен увлекаться азартными играми и впасть в
        зависимость от них.
      </UiText>

      <UiText preset="small" color="accent">
        Среди них встречаются талантливые актеры, которые приносят себя в жертву
        этой профессии, и как бы сжигая себя. Такое состояние усиливается в
        сложных ролях. В бытовой жизни он чувствуется свои силы полностью
        исчерпанными, и это заставляет его употреблять допинг.
      </UiText>

      <UiText preset="small" color="accent">
        Поскольку он — реалист, он не опустошит себя для роли, в которой не
        требуется глубокого погружения в образ.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Всегда торопится, ему всегда не хватает времени, потому что он неумело
        распоряжается им.
      </UiText>

      <UiText>
        Его ежедневный график часто перенасыщен делами. Он переходит от одного
        дела к другому, часто передвигает запланированное. Бывает перегружен
        недоделанной работой.
      </UiText>

      <UiText>
        Ожидание для него — тяжелая пытка. Чрезмерно полагается на свои силы,
        поэтому страдает его здоровье.
      </UiText>

      <UiText preset="large" color="role">
        Живет настоящим моментом. То, о чем мечтает и чего желает, ему
        необходимо получить здесь и сейчас.
      </UiText>

      <UiText>
        Он не представляет, как возможно свои желания перенести на будущее.
        Всегда в курсе обо всем происходящем в кругу своих людей. Легко делится
        информацией, может высказать своё мнение о других, но ни в коем случае
        не допускает вмешательства в свою личную жизнь.
      </UiText>

      <UiText>
        Если затронут болезненный для его вопрос, это можно сравнить с
        поговоркой: «В чужом глазу соринку видит, а в своем бревна не замечает.»
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Он легко воспринимает информацию, которая изложена логически понятно,
        ясно и конкретно.
      </UiText>

      <UiText>
        Его больше всего убеждают факты, примеры. С трудом определяет, насколько
        верную информацию ему предоставляют. Но он спокойно относится к своей
        неразвитой логике. Ему необходимо, чтобы окружающие его люди были
        справедливыми и честными, иначе он потеряет веру. Считает, что все
        сказанное должно быть истинным.
      </UiText>

      <UiText>
        Заимствует взгляды и мысли других, иногда цитирует их неуместно. Это
        объясняется тем, что некоторые их них не имеют способности
        самостоятельно добывать нужную информацию. В таких ситуациях сам не
        ищет, спрашивает у мудрых людей.
      </UiText>

      <UiText>
        Лишь некоторые отлично находят нужную информацию и знают, где её искать.
        У него часто возникают вопросы «почему», нуждается, чтобы ему был
        предоставлен исчерпывающий ответ.
      </UiText>

      <UiText preset="large" color="role">
        Ему необходимы новые идеи, перспективные изобретения, перемены.
      </UiText>
    </section>

    <section>
      <UiText>
        Как традиционалисту для него важны нормы поведения, принятые в обществе,
        и он следит за их соблюдением. Он считает нужным давать другим замечания
        по правилам поведения и манерам.
      </UiText>

      <UiText>
        Старается не портить отношения с людьми. Считает, что все люди заслужили
        равные права и возможности, только такое общество он готов принять.
      </UiText>

      <UiText>
        От него нельзя ожидать выражения собственного отношения. Ожидая такой
        ответ, приходиться убеждаться в его внезапной грубости.
      </UiText>

      <UiText preset="large" color="role">
        Требование предоставить мнение о других, если он сам не готов его
        выразить — это как покушение на его внутренний мир.
      </UiText>

      <UiText>
        При возникших недоразумениях способен первым идти на примирение. Может
        пристыдить людей, которые ведут себя непристойно и обижают других.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Защищая других, способен жертвовать и даже применить физическую силу. Не
        способен ударить первым.
      </UiText>

      <UiText>
        Бывает, что сам себя не берется защищать.Предприимчивый человек, в жизни
        много чего добивается сам. В работе самостоятелен, может постоять за
        свои интересы.
      </UiText>

      <UiText>
        Всегда выделяется своим естественным поведением и элегантностью, среди
        них не встречаются «серые мышки». Выбирает профессию, где возможен
        карьерный рост, достойная зарплата и получение высокого статуса.
      </UiText>

      <UiText>Не стремится к высоким позициям в управлении и бизнесе.</UiText>

      <UiText preset="small" color="accent">
        Редко встречаются среди них представители непрестижных профессий
        (грузчик, санитар, дворник).
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
