<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <div class="warning">
      <UiText preset="small" color="accent">
        Описания не должны обязательно совпадать со всеми чертами характера
        личности.
      </UiText>

      <UiText preset="small" color="accent">
        Идея как раз описать наблюдаемые у среднего представителя типа
        особенности поведения и обработки информации психикой.
      </UiText>
    </div>

    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Велта Микелсоне"
          subtitle="10 минут"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Вера Стратиевская"
          subtitle="27 минут"
          target-content-id="tab-2"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText preset="subtitle" color="role">
            Миссия — радоваться самому и радовать других.
          </UiText>

          <br />

          <UiText>
            Очень простой в общении человек, способный зарядить позитивом
            кого-угодно. Отличается жизнелюбием и стремлением во всем видеть
            только позитив. Своим присутствием способен передавать другим свою
            радость и позитивные эмоции, разряжая обстановку и поднимая
            настроение. Это объясняет, почему его воспринимают как энтузиаста.
          </UiText>

          <UiText>
            Общителен, подвижен, легко вступает в отношения и успешно их строит.
          </UiText>

          <UiText preset="large" color="role">
            Ему необходимо находиться в окружении людей, видеть в них только
            положительные стороны, исключая полностью отрицательные. Наблюдает и
            улавливает малейшие изменения в настроениях других людей.
          </UiText>

          <UiText>
            Выражение лица говорит о его самочувствии. Дружелюбный, праздничный
            взгляд, выразительные глаза, все что с ним происходит заметно всем.
          </UiText>
        </section>

        <section>
          <UiText>
            Самая большая амплитуда тонов голоса. Если он – актер или шоу-мэн,
            его громкий и лаконичный голос используется в рекламных клипах.
          </UiText>

          <UiText preset="large" color="role">
            Он знает и понимает, какой тон голоса, какие жесты и мимику следует
            применить в той или иной ситуации. Это ему удаëтся естественно.
          </UiText>

          <UiText>
            Знает, какой тон, мимику и жесты применить в ситуации. Делает это
            естественно.
          </UiText>

          <UiText>
            Везде, где появляется Энтузиаст, настроение компании меняется,
            начинается веселье, смех, шутки. Он избегает ситуаций, когда люди
            сидят с мраморными лицами, не шутят и не веселятся, а только
            жалуются и проклинают судьбу. Считает, что каждый может найти что-то
            радостное в жизни, нужно пытаться избегать негатива.
          </UiText>

          <UiText preset="large" color="role">
            Не стесняется показывать свои чувства — открыто выражает счастье,
            любовь, страх, удивление, восторг.
          </UiText>

          <UiText>
            Бывает, обижается из-за мелочей, даже на тех, кто хорошо к нему
            относится.
          </UiText>

          <UiText>
            Случается, что другой раз он плохо понимает причину оскорбления и
            может на серьезную обиду не отреагировать. Услышав что-то
            неприятное, может вспыхнуть, но обиду долго не держит.
          </UiText>

          <UiText>
            Для получения позитивных эмоций представители этого типа нуждаются в
            посещении культурных мероприятий – концерты, театр, вечера поэзии.
            Чтобы получить позитивный эмоциональный заряд, может просто погулять
            по городу, любуясь красотой.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Сильно выражено понимание красоты окружающего мира, сильно развиты
            способности ощущений.
          </UiText>

          <UiText>
            Очень важно опекать своих близких. В доме всегда уют и комфорт, даже
            по будням создается праздничная атмосфера.
          </UiText>

          <UiText>
            Он незаменимый организатор праздников, и не только дома. У него
            талант готовить изысканные блюда, а также со вкусом накрывать на
            стол.
          </UiText>

          <UiText>
            Все у него продумано, начиная с сюрприза для каждого гостя до
            застольных речей. Приятный собеседник, внимательный слушатель.
          </UiText>

          <UiText>
            Как традиционалист всегда находит время, чтобы найти для каждого
            члена семьи подарки, сувениры, никогда про это не забывает. При этом
            с любовью и выдумкой красиво оформляет каждый подарок, завязывает
            ленточками и каждому посвящает праздничные слова.
          </UiText>
        </section>

        <section>
          <UiText>
            Любимые темы разговоров — питание, культура, искусство, книги,
            одежда, семья. Он создатель высокой моды.
          </UiText>

          <UiText preset="large" color="role">
            Одевается со вкусом, но бывает преувеличение в роскоши, либо
            чрезмерные акценты.
          </UiText>

          <UiText>
            Особенно отличаются женщины, которые умело подбирают наряды, сочетая
            бижутерию. Выбирая одежду, не всегда учитывает тенденции моды,
            предпочитает то, что больше им подходит. Ему необходимо всегда
            выглядеть элегантно — естественно появляется желание освежить
            гардероб. Он часто выделяется в обществе своей изысканной
            внешностью.
          </UiText>

          <UiText>
            Как эстет и любитель красоты, оценивает внешность другого человека.
            Избегает резких замечаний, но если ему необходимо находиться долгое
            время в одном помещении с человеком (на рабочем месте), может дать
            рекомендации, как одеваться и что изменить во внешнем виде. Другой
            раз может что-то подарить или отдать из своих вещей.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Для него важно обеспеченность и материальное благосостояние, он
            нуждается в этом постоянно.
          </UiText>

          <UiText>
            Однажды насладившись жизнью в роскоши, вряд ли потом выберет жизнь
            «в шалаше».
          </UiText>

          <UiText>
            Преподносит себя как делового человека. Хотя он не достигает высоких
            вершин в бизнесе, но умеет постепенно продвигаться к выгодным
            позициям и хорошо зарабатывать. Успешно умеет «продать» свою работу.
          </UiText>

          <UiText>
            Услуги его обычно отличаются высокой ценой. Иногда выбирает ручную
            работу, которая ему хорошо дается.
          </UiText>

          <UiText>
            Однако он не экономный, не умеет просчитать, как на долго ему хватит
            денег. Поскольку он нуждается в роскошной жизни, деньги тратит
            быстро, не думая останется ли на завтра.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Умеет применять изученное на практике, однако в незнакомых ситуациях
            теряет уверенность в себе.
          </UiText>

          <UiText>
            Делая аналитическую работу, где требуется гибкое мышление, он
            запутывается в цифрах, терминологии и фактах. Едва ли способен
            исполнить качественно кропотливую работу. Часто делегирует её
            другим.
          </UiText>

          <UiText>
            Умело торгуется, определяет качество вещей. Выбирая покупки или
            когда под его руководством исполняются ручные работы (ремонт,
            строительство, шитье, услуги парикмахера) придирается к каждой
            мелочи.
          </UiText>

          <UiText>
            Если он не нашел счастья в семье, в работе, в нем копится
            напряженность.
          </UiText>

          <UiText preset="large" color="role">
            Он легко становится зависимым от алкоголя и наркотиков.
          </UiText>

          <UiText>
            В поисках разнообразия способен увлекаться азартными играми и впасть
            в зависимость от них.
          </UiText>

          <UiText preset="small" color="accent">
            Среди них встречаются талантливые актеры, которые приносят себя в
            жертву этой профессии, и как бы сжигая себя. Такое состояние
            усиливается в сложных ролях. В бытовой жизни он чувствуется свои
            силы полностью исчерпанными, и это заставляет его употреблять
            допинг.
          </UiText>

          <UiText preset="small" color="accent">
            Поскольку он — реалист, он не опустошит себя для роли, в которой не
            требуется глубокого погружения в образ.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Всегда торопится, ему всегда не хватает времени, потому что он
            неумело распоряжается им.
          </UiText>

          <UiText>
            Его ежедневный график часто перенасыщен делами. Он переходит от
            одного дела к другому, часто передвигает запланированное. Бывает
            перегружен недоделанной работой.
          </UiText>

          <UiText>
            Ожидание для него — тяжелая пытка. Чрезмерно полагается на свои
            силы, поэтому страдает его здоровье.
          </UiText>

          <UiText preset="large" color="role">
            Живет настоящим моментом. То, о чем мечтает и чего желает, ему
            необходимо получить здесь и сейчас.
          </UiText>

          <UiText>
            Он не представляет, как возможно свои желания перенести на будущее.
            Всегда в курсе обо всем происходящем в кругу своих людей. Легко
            делится информацией, может высказать своё мнение о других, но ни в
            коем случае не допускает вмешательства в свою личную жизнь.
          </UiText>

          <UiText>
            Если затронут болезненный для его вопрос, это можно сравнить с
            поговоркой: «В чужом глазу соринку видит, а в своем бревна не
            замечает.»
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Он легко воспринимает информацию, которая изложена логически
            понятно, ясно и конкретно.
          </UiText>

          <UiText>
            Его больше всего убеждают факты, примеры. С трудом определяет,
            насколько верную информацию ему предоставляют. Но он спокойно
            относится к своей неразвитой логике. Ему необходимо, чтобы
            окружающие его люди были справедливыми и честными, иначе он потеряет
            веру. Считает, что все сказанное должно быть истинным.
          </UiText>

          <UiText>
            Заимствует взгляды и мысли других, иногда цитирует их неуместно. Это
            объясняется тем, что некоторые их них не имеют способности
            самостоятельно добывать нужную информацию. В таких ситуациях сам не
            ищет, спрашивает у мудрых людей.
          </UiText>

          <UiText>
            Лишь некоторые отлично находят нужную информацию и знают, где её
            искать. У него часто возникают вопросы «почему», нуждается, чтобы
            ему был предоставлен исчерпывающий ответ.
          </UiText>

          <UiText preset="large" color="role">
            Ему необходимы новые идеи, перспективные изобретения, перемены.
          </UiText>
        </section>

        <section>
          <UiText>
            Как традиционалисту для него важны нормы поведения, принятые в
            обществе, и он следит за их соблюдением. Он считает нужным давать
            другим замечания по правилам поведения и манерам.
          </UiText>

          <UiText>
            Старается не портить отношения с людьми. Считает, что все люди
            заслужили равные права и возможности, только такое общество он готов
            принять.
          </UiText>

          <UiText>
            От него нельзя ожидать выражения собственного отношения. Ожидая
            такой ответ, приходиться убеждаться в его внезапной грубости.
          </UiText>

          <UiText preset="large" color="role">
            Требование предоставить мнение о других, если он сам не готов его
            выразить — это как покушение на его внутренний мир.
          </UiText>

          <UiText>
            При возникших недоразумениях способен первым идти на примирение.
            Может пристыдить людей, которые ведут себя непристойно и обижают
            других.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Защищая других, способен жертвовать и даже применить физическую
            силу. Не способен ударить первым.
          </UiText>

          <UiText>
            Бывает, что сам себя не берется защищать.Предприимчивый человек, в
            жизни много чего добивается сам. В работе самостоятелен, может
            постоять за свои интересы.
          </UiText>

          <UiText>
            Всегда выделяется своим естественным поведением и элегантностью,
            среди них не встречаются «серые мышки». Выбирает профессию, где
            возможен карьерный рост, достойная зарплата и получение высокого
            статуса.
          </UiText>

          <UiText>
            Не стремится к высоким позициям в управлении и бизнесе.
          </UiText>

          <UiText preset="small" color="accent">
            Редко встречаются среди них представители непрестижных профессий
            (грузчик, санитар, дворник).
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="small" color="accent">1 — Базовая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_emotions" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Желание</UiText>
              <UiText preset="body">Этика эмоций</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            «Жить, чтобы радоваться жизни» — целевое направление программной
            этики эмоций Энтузиаста.
          </UiText>

          <UiText>
            Представители этого типа не считают нужным скрывать ни своих эмоций,
            ни своих желаний: и то, и другое — естественно и выражается из
            благих побуждений, так что же в этом плохого?
          </UiText>

          <UiText color="role">
            Поэтому все лучшее и все худшее из того, что с ними происходит,
            моментально становится известно окружающим. Энтузиаст щедро делится
            как своими радостями, так и своими проблемами.
          </UiText>

          <UiText>
            Панически боится неприятностей — ведь жизнь создана для радости и
            удовольствий, и она так коротка!
          </UiText>

          <UiText>
            Энтузиаст активно и очень эмоционально не желает себе неприятностей.
            Остерегается людей, которые создают себе (а значит и ему) проблемы.
            Сам зарекается иметь с ними дело и других предостерегает, причем в
            очень эмоциональной форме: «Чтобы я еще когда-нибудь с ним
            связалась…»
          </UiText>

          <UiText preset="large" color="role">
            Если неприятности все-таки происходят, Энтузиаст не считает нужным
            их скрывать: ведь надо же как-то привлечь внимание к своим
            проблемам.
          </UiText>

          <UiText>
            Энтузиаст скорее продемонстрирует свою слабость совершенно
            постороннему человеку, чем тому, кто является действительным
            виновником его проблем.
          </UiText>

          <UiText>
            Отрицательным эмоциям Энтузиаст даст выход скорее, чем
            положительным: для него важно использовать все возможные средства —
            лишь бы побыстрее избавиться от неприятностей.
          </UiText>

          <UiText preset="large" color="role">
            Бывает, что незначительное ухудшение условий жизни воспринимает как
            неприятность и уже создает обстановку панической, истеричной суеты.
          </UiText>

          <UiText>
            Причем такое его поведение нечасто находит понимание у окружающих —
            то, что со стороны воспринимается как незначительное или
            несущественное, в рамках жизненных ценностей Энтузиаст
            воспринимается именно как существенное изменение к худшему, которое
            со временем, возможно, выльется в трудноразрешимую проблему.
          </UiText>

          <UiText color="role">
            Энтузиаст панически боится каких-то негативных тенденций как в своей
            личной жизни, так и в окружающей его действительности. Поэтому он
            всегда социально и политически активен. Старается максимально
            использовать свои гражданские права, с тем чтобы сделать свою жизнь
            и жизнь своего общества спокойной и благополучной.
          </UiText>

          <UiText preset="large" color="role">
            Сориентирован на самые естественные жизненные ценности: счастье и
            здоровье своих детей, благополучие своих близких, творческая
            реализация своих личных возможностей, свобода взглядов и суждений,
            мир и благополучие окружающих его людей.
          </UiText>

          <UiText>
            И именно эти ценности, идеи и взгляды Энтузиаст готов всегда и везде
            отстаивать, не жалея ни сил ни времени, со всем пылом и жаром своей
            глубоко эмоциональной души.
          </UiText>

          <UiText>
            Для Энтузиаста свойственно самое бурное проявление эмоций. Там, где
            появляется любой из представителей этого типа, начинается
            «эмоциональный взаимообмен», «круговорот эмоций в природе».
          </UiText>

          <UiText>
            Энтузиаст не переносит состояния пониженной эмоциональности.
            Обстановка, где все подавляют свое настроение, где мало общаются,
            мало высказываются, никак эмоционально себя не проявляют, явно не
            для него — не поймешь, что у людей на уме, не знаешь, чем они живут
            и что их волнует.
          </UiText>

          <UiText color="accent">
            «Он меня привез на курорт, да там и оставил! А что мне там делать?
            Там же никто друг с другом не разговаривает! Там же только со своими
            общаются… Он приехал, я его спрашиваю: «Ты куда меня привез?Тут же
            со мной никто не разговаривал! Это как же так можно отдыхать?»
          </UiText>

          <UiText color="role">
            C утра до вечера может говорить о своих проблемах, но терпеть не
            может, когда кто-то другой ему жалуется на свою жизнь.
          </UiText>

          <UiText>
            Очень не любит выслушивать истории про чужие неприятности, особенно,
            если их рассказывают совершенно посторонние ему люди, которых он
            мало знает и которым ничем помочь не может. А разве кому-то станет
            легче, если и у него испортится настроение? Обычно Энтузиаст не
            проявляет повышенного интереса к чужим проблемам: не желает портить
            себе настроение и не хочет ввязываться в чужие неприятности.
          </UiText>

          <UiText color="role">
            Всегда живо интересуется причиной приподнятого настроения у
            окружающих. «Если мало ли кому счастье привалило, так пусть
            расскажет, — может и мне повезет!»
          </UiText>

          <UiText preset="large" color="role">
            Обожает поднимать настроение всем, кто, по его мнению, в этом
            нуждается. Он часто что-то говорит или делает только для того, чтобы
            поднять настроение.
          </UiText>

          <UiText color="accent">
            Например, может, придя на работу, торжественно объявить, что готовит
            для всех своих сослуживиц подарки — каждой шьет передники к 8 Марта,
            и они уже даже раскроены. Это вовсе не значит, что сослуживцы
            когда-нибудь увидят эти передники.
          </UiText>

          <UiText>
            Это совсем не обязательно. Важно другое — создать приятное
            приподнятое настроение, создать атмосферу праздника, раз уж речь
            идет о подарках, создать условия для хороших отношений, получить
            общее одобрение, стать хотя бы ненадолго героем дня.
          </UiText>

          <UiText>
            Но самое главное — это именно задать настроение, а про передники все
            потом могут благополучно забыть. Энтузиаст не любит, когда ему
            напоминают о невыполненных обещаниях: ведь он далеко не всегда
            обещает для того, чтобы выполнять.
          </UiText>

          <UiText preset="large" color="role">
            Энтузиаст — это всегда сильные чувства, всегда ярко эмоциональный
            характер. Его чувства быстро переходят в страсть — в страстное
            желание или в страстную ненависть.
          </UiText>

          <UiText>
            Энтузиаста редко можно увидеть спокойным и уравновешенным. Обычно он
            расслабляется и успокаивается только при общении со своим дуалом
            Аналитиком, когда между ним и его дуалом происходит «эмоциональный
            взаимообмен» определенного характера и качества.
          </UiText>

          <UiText color="role">
            Энтузиаст — это всегда сильный и яркий темперамент. Не случайно
            роли, сыгранные актерами этого типа, — это всегда интересные
            персонажи, яркие и незабываемые характеры. Эпизоды, в которых
            участвуют актеры-Энтузиасты, — украшение любого спектакля и
            «изюминка» любого фильма.
          </UiText>

          <UiText preset="large" color="role">
            Эмоции часто развиваются в очень быстром темпе — это своего рода
            фейерверк эмоций.
          </UiText>

          <UiText>
            Именно поэтому характерный эпизод с ярко выраженным перепадом эмоций
            представителям этого типа сыграть гораздо легче, чем центральную
            роль с постепенным эмоциональным развитием образа. Хотя и
            центральные роли многие их них играют просто блестяще.
          </UiText>

          <UiText>
            Энтузиаст великолепно видит характер человека — именно через
            выражаемые им эмоции. Это позволяет ему быть прекрасным психологом:
            очень точно оценивать эмоциональное состояние человека и глубоко ему
            сопереживать.
          </UiText>

          <UiText>
            Этическая проницательность Энтузиаста целиком построена на умении
            понимать мотивы поступков людей через выражаемые ими эмоции.
          </UiText>

          <UiText color="role">
            Характер намерений человека Энтузиаст великолепно понимает по
            выражению его глаз, по характеру его улыбки. Великолепно видит в
            человеке его характер и его этический потенциал.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">2 — Творческая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_comfort" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Комфорт</UiText>
              <UiText preset="body">Сенсорика ощущений</UiText>
            </span>
          </div>

          <UiText>
            Эмоциональная активность Энтузиаста находит самое полное и самое
            яркое выражение именно в умении дарить радость окружающим его
            близким людям. В умении создавать им комфорт, уют, в умении опекать
            их.
          </UiText>

          <UiText>
            По радушию, по гостеприимству, по умению принять гостей и
            организовать застолье у Энтузиаста нет равных. Устраиваемое им
            застолье всегда отражает весь пыл его души, всю его радость от
            общения с друзьями.
          </UiText>

          <UiText preset="large" color="role">
            Никто не сравнится с Энтузиастом по умению создать атмосферу
            праздника в условиях самых обыденных будней. Он может, например,
            принести на работу огромное количество разнообразной снеди в
            кастрюльках и судочках и устроить для своих сослуживцев «пир на весь
            мир» — просто так, по случаю хорошего настроения.
          </UiText>

          <UiText preset="large" color="role">
            О праздниках на работе уже и говорить нечего: Энтузиаст из тех, кто
            их активно организовывает, причем с удовольствием берет на себя
            самую большую часть работы.
          </UiText>

          <UiText>
            В кратчайший срок Энтузиаст может приготовить праздничный стол на
            любое количество гостей. Готовит очень быстро — только успевай
            подносить чистую посуду.
          </UiText>

          <UiText preset="large" color="role">
            Обожает потчевать своих гостей. Нет гостей — угощает соседей.
          </UiText>

          <UiText>
            Энтузиаст очень любит общаться, особенно в пожилом возрасте, когда
            есть много свободного времени, и часто заходит к соседям с баночкой
            варенья или с пирожком собственного изготовления, ну и посидит с
            ними за чашкой чая, и пообщается.
          </UiText>

          <UiText>
            Обожает готовить, чтобы кого-то попотчевать. Будучи его гостем,
            можно пронаблюдать, как он готовит еду и приговаривает: «Ой, как это
            будет вкусно! М-м-м! Ой, что-то сейчас будет!.. Ой, это будет
            нечто!» И действительно получается «нечто».
          </UiText>

          <UiText preset="large" color="role">
            Все без исключения представители этого типа — великолепные кулинары
            независимо от рода занятий. А уж если Энтузиаст — профессиональный
            кулинар, быть его гостем — удовольствие, которое может запомниться
            на всю жизнь.
          </UiText>

          <UiText>
            Вопросы питания — тема, которую Энтузиаст охотнее всего обсуждает и
            которая имеет для него первостепеннейшее значение, особенно питание
            его детей. Если представитель этого типа узнает, что его ребенка в
            школе кормят однообразно и невкусно, он может пойти к директору и
            устроить настоящий скандал.
          </UiText>

          <UiText preset="large" color="role">
            Эстет от природы. Он про себя это знает и считает своим сильным
            качеством. Каждому человеку исключительно точно подберет одежду,
            прическу и макияж, соответствующие его внешности и характеру.
          </UiText>

          <UiText>
            Даже «сенсорикам» (не говоря уже об «интуитах») имеет смысл
            прислушиваться к советам Энтузиаста. Из представителей этого типа
            получаются великолепные дизайнеры.
          </UiText>

          <UiText>
            Так консультант по эстетике Энтузиаст вне конкуренции:
          </UiText>

          <UiText color="accent">
            «Я попросил свою сослуживицу-Энтузиаста помочь мне обновить
            гардероб. Что это было! Мы за полчаса обежали пять магазинов. И где
            бы ни появлялись — одежда буквально начинала летать по салону: «Так,
            дайте нам вот этот свитер, теперь еще этот шарфик и еще вот эту
            шапочку!» И все без примерки, и все на глаз! Я пришел домой,
            примерил — все замечательно! За полчаса она меня одела с головы до
            ног!»
          </UiText>

          <UiText color="role">
            Свой гардероб Энтузиаст меняет постоянно. Ему быстро надоедает то,
            что он купил. Он вечно что-то перешивает, переделывает,
            передаривает. Энтузиаст постоянно что-то меняет в своей одежде и
            прическе.
          </UiText>

          <UiText>
            Перед выходом на работу может в считанные минуты превратить платье в
            блузку, может сделать себе стрижку или перекрасить волосы, — и все
            это только потому, что его вчерашняя стрижка и вчерашний цвет волос
            не соответствуют его сегодняшнему настроению.
          </UiText>

          <UiText preset="large" color="role">
            Энтузиаст постоянно меняет интерьер в своем доме. Часто обновляет
            мебель, постоянно ее передвигает. Вечно у него какие-то новые чехлы,
            портьеры, новые самодельные абажуры.
          </UiText>

          <UiText>
            Придя в гости к друзьям или хорошим знакомым, Энтузиаст часто по
            собственной инициативе начинает что-то менять в интерьере их
            квартиры. Энтузиаст, в отличие от Дипломата, если видит какие-то
            эстетические несовершенства, всегда считает себя обязанным об этом
            сказать.
          </UiText>

          <UiText>
            Причем, чем ближе отношения, тем активнее он выступает со своими
            замечаниями: «Мне не нравится твоя прическа!», «Это платье надо
            ушить!», «Этому шкафу здесь не место!».
          </UiText>

          <UiText color="role">
            И это делается не потому, что он такой грубый или бесцеремонный:
            просто он действительно очень восприимчив к любому проявлению
            дисгармонии, которое его всегда настолько раздражает, что он не в
            силах это терпеть. Энтузиаст просто обязан обратить на это внимание
            — даже если его об этом не спрашивают, он не в состоянии смолчать.
          </UiText>

          <UiText>
            Энтузиаст обожает дарить подарки. Он может последние деньги
            потратить на подарок, казалось бы, совершенно постороннему человеку.
            Он может сделать подарок по поводу и без повода.
          </UiText>

          <UiText color="accent">
            Иногда — просто так, «в душевном порыве», а иногда потому, что ему
            встретилась какая-то вещь, которая кому-то из его близких очень
            подойдет: «Вот, я тебе купила новую помаду, а эту, оранжевую,
            выбрось, чтоб я ее у тебя больше не видела!».
          </UiText>

          <UiText>
            Энтузиаст всегда в курсе последних веяний моды, и хотя его дом
            буквально завален моднейшими каталогами, его собственный
            эстетический стиль всегда вне моды, всегда ярко индивидуален.
          </UiText>

          <UiText>
            Исключительную активность Энтузиаст развивает, когда дело касается
            здоровья его близких. Он штурмует кабинеты врачей, срывается с
            работы и бегает по аптекам, пробивается на прием к знаменитейшим
            специалистам.
          </UiText>

          <UiText color="role">
            Все его сослуживцы, друзья и знакомые регулярно выслушивают сводки о
            состоянии здоровья его заболевшего родственника.
          </UiText>

          <UiText>
            Энтузиаст буквально атакует болезнь, поскольку всегда боится, что
            она затянется или даст осложнение. Его активность начинает
            ослабевать только тогда, когда в состоянии больного наступает
            заметное улучшение.
          </UiText>

          <UiText>
            Состоянию своего здоровья Энтузиаст уделяет значительно меньше
            внимания. Редко жалуется на плохое самочувствие, обычно сам
            справляется с собственными недугами.
          </UiText>

          <UiText>
            Старается заниматься профилактикой своего здоровья, спортом. Следит
            за качеством питания, соблюдает диеты. Многие женщины этого типа
            сохраняют молодость и привлекательность до самого преклонного
            возраста.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">3 — Ролевая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_business" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Практика</UiText>
              <UiText preset="body">Деловая логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Блестящими деловыми качествами представители этого типа, к
            сожалению, не отличаются, сколько бы они ни старались их в себе
            развивать.
          </UiText>

          <UiText>
            Это объясняется тем, что поступки Энтузиаста в первую очередь
            подчиняются его настроению, его чувствам и его желаниям.
          </UiText>

          <UiText>
            Слишком много денежных трат Энтузиаста делает именно под влиянием
            минутного желания и в душевном порыве.
          </UiText>

          <UiText color="role">
            Если встречается какой-то свежий и аппетитный продукт, покупает в
            большом количестве, мало ли, захочется его съесть побольше. Готовит
            ежедневно свежую пищу, причем опять же в большом количестве,мало ли,
            захочется добавки.
          </UiText>

          <UiText>
            К пище, приготовленной накануне, интерес уже потерян. Энтузиаст, —
            большой специалист по «обновлению еды», что является предметом его
            особой гордости:
          </UiText>

          <UiText color="accent">
            «У меня оставалось вчерашнее отварное мясо, я его быстро-быстро
            перемолола и начинила блинчики. Ну не выбрасывать же!».
          </UiText>

          <UiText preset="large" color="role">
            Очень много покупок Энтузиаст делает именно «под настроение»:
          </UiText>

          <UiText color="accent">
            «Я увидела эти туфельки и влюбилась в них, я не могла их не купить!»
          </UiText>

          <UiText>
            Потом, когда «настроение» проходит, Энтузиаст постарается вернуть
            покупку в магазин. Если это не получается, попытается продать ее с
            рук либо кому-нибудь подарить. Ну а если уж совсем не удаëтся
            избавиться от неудачной покупки, переделает ее во что-нибудь
            «стоящее», перед тем как окончательно выбросить.
          </UiText>

          <UiText color="role">
            Деньги в понимании представителей этого типа существуют для того,
            чтобы их тратить на удовольствия, и именно на это они в первую
            очередь и расходуются.
          </UiText>

          <UiText>
            В результате у Энтузиаста накапливается огромное количество
            неоплаченных счетов и непокрытых кредитов. С другой стороны,
            Энтузиаст пытается как-то бороться с собственной непрактичностью и
            поэтому стремится быть очень расчетливым именно в вопросах денежных
            трат.
          </UiText>

          <UiText color="role">
            Отсюда и возникает тот контраст, который кажется таким странным и
            малопонятным в поведении представителей этого типа — сочетание
            душевной щедрости с мелочностью и расчетливостью; сочетание
            расточительности и крохоборства.
          </UiText>

          <UiText>
            Это объясняется тем, что при любых обстоятельствах Энтузиаст
            старается вести свои дела таким образом, чтобы и желания его были
            удовлетворены, и деньги были бы целы, и даже приумножались.
          </UiText>

          <UiText>
            Как же ему удаëтся примирить это противоречие? — Энтузиаст прекрасно
            умеет оценивать качество вещи и всегда знает, где можно сделать
            недорогую, но приличную покупку. Энтузиаст — постоянный посетитель
            рынков, «комиссионок» и дешевых распродаж.
          </UiText>

          <UiText>
            Кроме того, Энтузиаст — большой специалист в вопросах
            ценообразования: он знает, из чего складывается цена, знает, каким
            образом ее можно легально занизить.
          </UiText>

          <UiText preset="large" color="role">
            Умеет заставить продавца сбавить цену, умеет торговаться так, что
            мало у кого хватит сил, воли и характера ему противостоять.
          </UiText>

          <UiText color="accent">
            Явление, довольно распространенное на некоторых «восточных» базарах
            — продавец отгоняет представителя этого типа от прилавка с криком:
            «Пошел отсюда! Не надо мне ни тебя, ни твоих денег!»
          </UiText>

          <UiText>
            Зайдя в магазин, Энтузиаст интересуется не только ценой, но и
            процентом скидки. Оформляя крупную покупку, он постарается
            договориться с продавцом о возможности как-нибудь «обойти» налог на
            добавочную стоимость, а после этого еще может и потребовать общую
            скидку на покупку, а иногда и воспользуется случаем припугнуть и
            попрекнуть продавца «незаконно» оформленной сделкой.
          </UiText>

          <UiText>
            Заключение деловых сделок у Энтузиаста часто начинается с признания
            в симпатии и доверии, с предложения «чашечки кофе», но нередко
            заканчивается прямым волевым давлением, а в некоторых случаях
            угрозами, переходящими в шантаж.
          </UiText>

          <UiText>
            Занимаясь бизнесом, некоторые представители этого типа прекрасно
            используют систему налогообложения для своих манипуляций и для
            повышения собственных доходов.
          </UiText>

          <UiText>
            Как бы ни были высоки подоходные налоги, на процветании фирмы
            Энтузиаста они обычно не отражаются. Разумеется, если он не теряет
            при этом чувства меры.
          </UiText>

          <UiText>
            И тем не менее, как бы ни старался Энтузиаст разумно распределять
            свой личный бюджет, это у него часто получается по принципу: «То
            густо — то пусто». Вчера — пир горой, сегодня — «беден, как
            церковная мышь» и ищет, у кого бы денег занять.
          </UiText>

          <UiText color="role">
            Занимая деньги у друзей и близких, Энтузиаст непременно старается
            вовремя вернуть свой долг. Поскольку это касается его личных
            взаимоотношений.
          </UiText>

          <UiText>
            Но если деловые отношения выходят за рамки этических, Энтузиаст в
            случае финансовых затруднений может преспокойно оставить свои долги
            неоплаченными.
          </UiText>

          <UiText>
            Свои деловые отношения Энтузиаст часто строит на основании
            собственного представления об «этической справедливости» —
            своеобразной этической интерпретации «делового» принципа «Ты мне — я
            тебе», которая заключается в том, что Энтузиаст пытается «подороже
            продать» свое демонстративное прекраснодушие в расчете получить за
            это скидку или уступку: «Ты же видишь, что я к тебе всей душой — так
            почему бы нам не попробовать договориться?»
          </UiText>

          <UiText color="role">
            Работодатель-Энтузиаст, особенно в случае финансовых затруднений,
            тем больше задерживает выплату зарплаты своим служащим, чем больше
            демонстрирует им свою горячую любовь. Надо же хоть как-то
            компенсировать материальный ущерб!
          </UiText>

          <UiText>
            Бывает, что «любовь» Энтузиаста-работодателя разрастается до таких
            масштабов, что становится даже как-то неловко у столь горячо
            любящего человека требовать свою законную зарплату.
          </UiText>

          <UiText>
            Цену своим дешевым «этическим авансам» Энтузиаст особенно хорошо
            осознает только тогда, когда сам оказывается в положении
            пострадавшего делового партнера; тогда он начинает
            «по-робингудовски» мстить своему обидчику, используя далеко не самые
            этичные методы.
          </UiText>

          <UiText>
            Энтузиаст, так же как и Аналитик, считает, что распределение
            материальных благ должно быть справедливым. Но что делать, если
            справедливость — это не более, чем абстрактное понятие и
            недостижимая мечта? Как можно жить по справедливости на нашей
            грешной земле? И разве можно найти материальный (денежный)
            эквивалент душевному порыву? Энтузиаст прекрасно умеет
            манипулировать «деловыми» ценностями, подменяя их этическими,
            переводя деловые отношения в этические, и наоборот.
          </UiText>

          <UiText>
            Справедливому распределению материальных благ и разумному
            распределению бюджета Энтузиаст учится у своего дуала Аналитика.
            Именно в деловом партнерстве с Аналитиком «этические авансы»
            Энтузиаст получают самую высокую себестоимость. Энтузиаст и Аналитик
            быстро находят взаимопонимание в деловых отношениях, поскольку оба
            сориентированы на одинаковые этические и логические принципы.
          </UiText>

          <UiText>
            Кроме того, под воздействием Аналитика Энтузиаст становится более
            уравновешенным, более спокойным и рассудительным — сказывается
            благотворное дуальное влияние. И у него уже не возникает потребности
            глушить свои неутоленные желания непомерными денежными тратами.
          </UiText>

          <UiText preset="large" color="role">
            Умеет эффективно работать и добиваться хороших результатов, но своей
            квалификации обычно не переоценивает.
          </UiText>

          <UiText color="role">
            В глубине души часто сомневается в своих возможностях, хотя внешне
            может выглядеть достаточно самоуверенным. Для Энтузиаста очень важно
            получить высокую оценку своей работе.
          </UiText>

          <UiText>
            Работает в очень быстром темпе. С энтузиазмом начинает любое новое
            дело, но впоследствии может довольно быстро к нему охладеть.
            Особенно, если это работа не по призванию.
          </UiText>

          <UiText>
            Случается, что через силу заставляет себя закончить работу. Если
            очень торопится, может даже попросить, чтобы его работу закончили
            коллеги.
          </UiText>

          <UiText>
            Настроение Энтузиаста слишком сильно сказывается на результатах его
            работы: иногда ему вообще не удаëтся на ней сосредоточиться, и тогда
            он работает настолько бездумно, что впоследствии его работу
            приходится переделывать другим.
          </UiText>

          <UiText>
            В деловых вопросах Энтузиасты очень неплохо ориентируется. Обычно в
            курсе всех правил, инструкций и предписаний, относящихся к постоянно
            решаемым им вопросам. Поэтому часто находит выход из многих
            затруднительных положений, причем без особого ущерба для себя.
          </UiText>

          <UiText color="role">
            В деловых контактах хоть и старается действовать эффективно, но
            часто привносит в них слишком много суеты.
          </UiText>

          <UiText color="role">
            Качество работы Энтузиаста тем выше, чем больше он осознает
            значимость своей работы.
          </UiText>

          <UiText>
            При выполнении работы предпочитает пользоваться многократно
            проверенными методиками. Срок готовности работы для Энтузиаста
            определяется окончанием его рабочего дня. (А иногда и пораньше.)
            Засиживаться после работы, оставаться на сверхурочные Энтузиаст
            очень не любит, особенно если за это мало платят.
          </UiText>

          <UiText color="role">
            К выполнению особо важной работы старается подготовиться
            заблаговременно, и тем не менее ее своевременное окончание редко
            когда удаëтся без «штурмовщины».
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">4 — Болевая функция.</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_time" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чутьё</UiText>
              <UiText preset="body">Интуиция времени</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Под влиянием настроения у Энтузиаста постоянно возникают какие-то
            непредвиденные дела, постоянно появляется желание сделать что-то
            такое, чего он не планировал.
          </UiText>

          <UiText>
            Увлекаясь каким-то занятием, Энтузиаст часто игнорирует фактор
            времени — ему хочется остановить время или думать, что в этот момент
            оно останавливается, хотя он знает, что это не так, и очень
            нервничает по этому поводу.
          </UiText>

          <UiText>
            Энтузиаст постоянно испытывает желание сделать больше, чем может
            успеть, и, как следствие этого, постоянный страх перегрузок,
            перенапряжение, суета, нервозность и ощущение усталости.
          </UiText>

          <UiText preset="large" color="role">
            Ему очень трудно планировать свой день: график его дел постоянно
            сдвигается и уплотняется.
          </UiText>

          <UiText>
            Энтузиаст боится непредвиденного расхода времени. Поэтому любой
            перерасход времени его раздражает. Его раздражает и незваный гость,
            и нежданный телефонный звонок, и непрошеный посетитель.
          </UiText>

          <UiText>
            Раздражает необходимость переделывать свою работу, а значит, тратить
            на нее лишнее время. Раздражают ожидание транспорта, пробки на
            дорогах, очереди в магазинах. Не позавидуешь тому, кто перед носом
            Энтузиаста пытается проскочить без очереди.
          </UiText>

          <UiText color="role">
            Энтузиаст постоянно торопится и постоянно подгоняет других. Часто,
            когда он находится в неуравновешенном, перевозбужденном состоянии,
            для него свойственно какое-то лихорадочное нетерпение с нотками
            раздражения в голосе.
          </UiText>

          <UiText>
            Бывает очень неприятно наблюдать, когда Энтузиаст, едва успев прийти
            в гости, уже начинает куда-то спешить. Это очень мешает общению с
            ним — он как будто подгоняет хозяев: торопясь, выспрашивает все
            новости, быстро просматривает все обновки, потом устраивает суету
            вокруг застолья, а там уж и на часы поглядывает — домой пора!
          </UiText>

          <UiText preset="large" color="role">
            В людях его раздражают медлительность, неповоротливость,
            недостаточно быстрые реакции, недостаточно быстрая
            сообразительность.
          </UiText>

          <UiText>
            Энтузиаста раздражает, когда в разговоре возвращаются к теме,
            которую он считает для себя исчерпанной.
          </UiText>

          <UiText>
            Раздражает, когда «переливают из пустого в порожнее». Раздражает
            недостаточная информативность разговора — у него возникает ощущение
            пустой траты времени. Энтузиасту редко удаëтся выбрать время для
            чтения. Поэтому представители этого типа, в основном, читают в
            транспорте, в очередях, поздно ночью перед сном или рано утром перед
            тем, как встать. Энтузиаст не любит книг с медленным развитием
            сюжета и слишком подробным изложением.
          </UiText>

          <UiText preset="large" color="role">
            Мечтает о том времени, когда сможет жить не спеша и успевать делать
            все, что ему хочется. Но это желание так и остается несбыточной
            мечтой.
          </UiText>

          <UiText color="role">
            Энтузиаст не всегда может позволить себе спокойно посидеть за
            рукоделием — его постоянно мучает ощущение нерационально
            используемого времени.
          </UiText>

          <UiText>
            Поэтому представители этого типа стараются совмещать все те дела,
            которые можно делать одновременно: если он сидит и шьет, так у него
            уже одновременно и стирка прокручивается, и на плите что-то варится,
            и по телевизору он в это время что-то смотрит, да еще и по телефону
            успевает отвечать.
          </UiText>

          <UiText preset="large" color="role">
            Постоянно живя в режиме повышенной деловой активности, Энтузиаст не
            успевает (да и не позволяет себе) «сделать паузу», проанализировать
            ситуацию, увидеть ее в развитии и скорректировать свои планы на
            будущее.
          </UiText>

          <UiText>
            Не способен экономно расходовать свои силы. Очень болезненно
            переживает, когда критикуют несвоевременность его действий.
          </UiText>

          <UiText preset="large" color="role">
            Не переносит, когда его обвиняют в непродуктивном расходе времени.
          </UiText>

          <UiText>
            Раздражается, когда его ограничивают во времени: он и так старается
            предельно рационально его расходовать, а если это не всегда
            получается, то только потому, что Энтузиаст (как всякий сенсорик) по
            собственной инициативе берет на себя дополнительные обязанности.
            Поэтому у него постоянно возникают какие-то непредвиденные
            неотложные дела.
          </UiText>

          <UiText preset="large" color="role">
            Очень не любит опаздывать.
          </UiText>

          <UiText color="role">
            Свою неспособность рассчитывать время старается скрыть: например,
            если очень сильно опаздывает на какое-то мероприятие, то часто
            предпочитает вовсе не пойти. Переживает, когда его критикуют за
            недостаточную пунктуальность.
          </UiText>

          <UiText>
            Всегда нервничает, когда ему приходится координировать время: ему
            очень трудно ощутить течение времени, трудно рассчитать его расход —
            работа, связанная с координацией времени представителям этого типа
            явно противопоказана.
          </UiText>

          <UiText>
            Энтузиаст непременно желает быть в курсе всех новостей и всех
            событий, поскольку, как уже говорилось, его отличает активная
            гражданская позиция. Его всегда интересуют намечающиеся социальные и
            политические перспективы, новые постоянно возникающие возможности.
          </UiText>

          <UiText color="role">
            Постоянно надеется на перемены, которые откроют новые перспективы
            лично для него. Рассчитывает с помощью этих перемен решить какие-то
            свои личные проблемы.
          </UiText>

          <UiText preset="large" color="role">
            Оптимист, он ждет от жизни всего только самого лучшего.
          </UiText>

          <UiText>
            Поэтому непредвиденные осложнения и неприятности его страшно
            разочаровывают. Энтузиаста разочаровывают даже фильмы или книги,
            которые неожиданно плохо заканчиваются.
          </UiText>

          <UiText>
            Не любит скептиков, прогнозирующих ему неприятности. Даже если сам
            предчувствует опасность, предпочитает не советоваться с теми, кто
            видит будущее только в мрачном свете.
          </UiText>

          <UiText preset="large" color="role">
            Очень старается быть дальновидным и предусмотрительным, что у него,
            к сожалению, не всегда получается. Поэтому любую критику по этому
            поводу воспринимает исключительно болезненно.
          </UiText>

          <UiText>
            Положение коренным образом меняется, когда партнером Энтузиаста
            становится его дуал. Аналитик великолепно умеет распланировать время
            с таким расчетом, чтобы не создавалось никаких предпосылок для
            перегрузок и перенапряжения.
          </UiText>

          <UiText>
            Аналитик корректирует планы Энтузиаста, регулирует темпы его деловой
            активности, создает ему режим самой оптимальной жизнедеятельности —
            условия, при которых высокая продуктивность работы сочетается с
            самым рациональным расходом времени.
          </UiText>

          <UiText>
            В плане прогнозов, Аналитик также предпочтительнее всех других
            типов-«интуитов», поскольку он единственный, кто подсознательно
            настроен на интуитивные ощущения Энтузиаста. Кроме того, его
            прогнозы всегда имеют логическое обоснование, а потому кажутся
            Энтузиасту особенно убедительными, поскольку для Энтузиаста
            убедительно все, что логично.
          </UiText>

          <UiText>
            С помощью Аналитика Энтузиаст экономит время, необходимое на
            обдумывание и решение важных задач, поскольку любая мысль, которую
            Энтузиаст безуспешно пытался обдумать, обосновать и понять, в
            изложении Аналитика сразу становится простой, естественной и
            доступной для понимания.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">5 — Внушаемая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_logic" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Теория</UiText>
              <UiText preset="body">Структурная логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Уважает людей, умеющих рассуждать логически, умеющих высказываться
            по существу, способных четко и ясно излагать свою мысль.
          </UiText>

          <UiText>
            Старается сам быть рассудительным, хотя знает, что ему это
            несвойственно. Энтузиаст часто рассказывает а своих безрассудных
            поступках, как бы приглашая посмеяться над своим легкомыслием.
          </UiText>

          <UiText>
            Изучая какой-либо предмет, Энтузиаст старается увидеть в нем
            систему. Чем более систематизировано обучение, тем легче оно им
            усваивается.
          </UiText>

          <UiText>
            Его убеждают систематизированные доводы. Понятие «система взглядов»
            для Энтузиаста звучит очень убедительно. Человек с системой взглядов
            у Энтузиаст всегда вызывает истинное уважение. Особенно, если
            «система взглядов» того заслуживает.
          </UiText>

          <UiText color="role">
            Факты для Энтузиаста — самый убедительный аргумент. Обычно он
            собирает информацию по всем каналам одновременно: книги, друзья,
            знакомые, радио, телевидение.
          </UiText>

          <UiText>
            Вступая в спор, Энтузиаст часто ссылается на факты, известные ему из
            доступных источников. Причем, уже сославшись на какой-то
            общеизвестный факт, Энтузиаст отказывается воспринимать какие-либо
            возражения или опровержения, особенно если они бессистемны, сумбурны
            и хаотичны. В такой ситуации он способен выслушать только того, кто
            сумеет логично, наглядно и лаконично опровергнуть те доводы, которые
            он прежде считал неопровержимыми.
          </UiText>

          <UiText>
            Как правило, именно таким оппонентом оказывается его дуал Аналитик —
            единственный, кто способен собрать хаотично разбросанные мысли
            Энтузиаст «в одну точку».
          </UiText>

          <UiText>
            Аналитик не только наводит порядок в «интеллектуальном хаосе»
            Энтузиаста — он учит его мыслить логично; помогает ему
            сосредоточиться на каких-то важных проблемах, построить правильный
            ход рассуждений. Одним словом, он помогает Энтузиасту развить свой
            интеллектуальный потенциал.
          </UiText>

          <UiText>
            Под влиянием Аналитика Энтузиаст становится более собранным,
            сосредоточенным, рассудительным. Он уже не позволяет себе совершать
            необдуманные поступки, имеющие тяжелые последствия.
          </UiText>

          <UiText>
            Упорядоченные мысли открывают для Энтузиаста новое понимание
            окружающих его явлений, открывают новые перспективы и новые
            возможности.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">
            6 — Активационная функция
          </UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_ideas" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Мысль</UiText>
              <UiText preset="body">Интуиция возможностей</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Новые открывающиеся возможности пробуждают деловую активность
            Энтузиаста. С огромным энтузиазмом он поддерживает всякое начинание,
            загорается новыми идеями.
          </UiText>

          <UiText color="role">
            Живет в постоянном ожидании каких-то невероятных событий, которые
            самым неожиданным образом перевернут всю его жизнь. Живет в
            постоянном ожидании чуда.
          </UiText>

          <UiText>
            Часто говорит о своих предчувствиях перемен.Подсознательно готовится
            к этим переменам. У него появляется неожиданное желание сделать
            какую-то покупку из расчета возможных перемен.
          </UiText>

          <UiText color="accent">
            «Вот я сейчас выйду из дома и вдруг встречу своего «принца»! Кстати,
            а в чем я его встречу?»
          </UiText>

          <UiText preset="small" color="accent">
            Верит в судьбу, верит в перемены к лучшему. Затевая какое-то дело,
            часто рассчитывает на удачу и везение.
          </UiText>

          <UiText color="accent">
            «Другим везет, а чем я хуже?» Ему очень импонируют удачливые люди.
          </UiText>

          <UiText>
            Может на последние деньги купить лотерейный билет. Часто проводит
            аналогию между жизнью и лотереей: «Любовь — лотерея», «Судьба —
            лотерея».
          </UiText>

          <UiText preset="large" color="role">
            С интересом слушает всякие новости. Причем часто, исходя из этих
            новостей, делает какие-то свои логические и экономические расчеты.
          </UiText>

          <UiText color="accent">
            «Сейчас передавали по радио: с нового года повышают пособие для
            матерей-одиночек! Я посчитала — это полторы зарплаты! Теперь-то я
            наконец смогу себе новую мебель купить! Я ее как раз из этого
            пособия и выплачу!»
          </UiText>

          <UiText color="role">
            Много и охотно говорит о своих успехах, о возможностях и
            способностях. И даже там, где чувствует себя недостаточно уверенно,
            не позволяет усомниться в своих способностях.
          </UiText>

          <UiText>
            От него можно услышать изречение типа: «На свете нет ничего
            невозможного» или «Можно всего добиться, надо только очень
            захотеть».
          </UiText>

          <UiText>
            Если Энтузиаст чувствует, что в его возможностях все-таки
            сомневаются, он как бы сразу заводит разговор о каких-то своих
            достижениях и успехах.
          </UiText>

          <UiText>
            Причем для большей убедительности обязательно расскажет, как высоко
            оценивались его успехи и какие отзывы были о его работе.
          </UiText>

          <UiText>
            Собственные успехи и возможности — тема, на которую Энтузиаст охотно
            откликается. Рассказывая о своих способностях, Энтузиаст так активно
            и так эмоционально старается воздействовать на собеседника, как
            будто боится, что этот вопрос кто-то поставит под сомнение.
          </UiText>

          <UiText color="accent">
            Например, слушая детское пение, любой из них умиляется до слез,
            независимо от того, свой ребенок поет или чужой.
          </UiText>

          <UiText>
            В отличие от Дипломата, который не считается с затратами на
            образование детей, Энтузиаст старается своим детям дать максимум
            образования при минимальном расходе средств.
          </UiText>

          <UiText color="accent">
            Например, если Энтузиаст работает в художественно-керамической
            мастерской, он может приносить своему ребенку глину и краски. «Разве
            может такое быть, чтобы ничего нельзя было принести с работы?!»
          </UiText>

          <UiText color="accent">
            Может упросить начальство разрешить ему обжигать в производственных
            печах изделия своего отпрыска, а когда в этих просьбах начнут
            отказывать, может это делать тайком. За оплату частных уроков
            Энтузиаст торгуется как на рынке и всегда рад возможности получить
            побольше «пробных» бесплатных уроков.
          </UiText>

          <UiText preset="large" color="role">
            Энтузиаст часто видит корень своих проблем в том, что у него крадут
            его права, а следовательно, и возможности.
          </UiText>

          <UiText>
            Часто свои неудачи списывает на несправедливость, проявленную по
            отношению к нему. Энтузиаст всегда активно борется за свои права и
            за возможности, которые ему эти права предоставляют, поскольку ввиду
            некоторой ограниченности его интуиции считает, что возможности
            предоставляются именно правами:
          </UiText>

          <UiText color="role">
            «Если тебе не дано, так ты и взять не можешь». В противном случае
            нарушается правовое равенство, что в свою очередь может привести к
            хаосу, анархии и разрушению разумных и справедливых устоев общества.
          </UiText>

          <UiText>
            Неравенство возможностей всегда вызывает осуждение Энтузиаста и
            здесь он полностью сходится во мнении со своим дуалом Аналитиком.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">7 — Функция защиты</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_people" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чувство</UiText>
              <UiText preset="body">Этика отношений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Считает, что общество только тогда может называться справедливым,
            когда оно предоставляет всем своим гражданам равные права и равные
            возможности.
          </UiText>

          <UiText>
            И именно на этом принципе выстраивается этическая платформа диады
            Энтузиаст — Аналитик: соблюдение правовых установок при
            распределении возможностей «этика справедливости».
          </UiText>

          <UiText color="role">
            Из всех этических установок Энтузиаст в первую очередь рассматривает
            соотношение прав и возможностей, поскольку считает, что ущемление в
            правах ведет к ограничению возможностей, а это в свою очередь мешает
            человеку проявить себя самым лучшим образом, мешает ему занять свое
            заслуженное место под солнцем.
          </UiText>

          <UiText>
            Энтузиаст очень памятлив на любое проявление несправедливости и
            считает этичным и уместным об этом «своевременно» напомнить.
          </UiText>

          <UiText color="role">
            Доминирующий принцип этики Энтузиаста: справедливость — превыше
            всего. Если какие-то люди несправедливо воспользовались своими
            возможностями, можно без всяких угрызений совести бросить в них
            камень.
          </UiText>

          <UiText>
            Энтузиаст, по крайней мере лучшие представители этого типа и сами
            стараются следовать этому этическому принципу.
          </UiText>

          <UiText color="accent">
            Следуя заповеди «Зуб за зуб, око за око», Энтузиаст сосредотачивает
            свое внимание только на абстрактном уравнении этих понятий: за добро
            надо платить добром, за зло — злом. Но где сказано, что меры твоего
            и моего «добра» совпадают? И что зло, причиненное мне, эквивалентно
            злу, причиненному тебе?
          </UiText>

          <UiText preset="large" color="role">
            Самым естественным эквивалентом собственных этических ценностей для
            Энтузиаста всегда являются ценности материальные.
          </UiText>

          <UiText color="accent">
            Например, ему свойственно весьма оригинальным способом проверять
            предел щедрости своего партнера: «Когда я иду с новым другом в
            ресторан, я заказываю все сам-м-мое лучшее! Сам-мое дорогое! И все в
            огромных количествах — все! А если он не расплатится, у меня всегда
            есть деньги про запас…»
          </UiText>

          <UiText>
            Если в результате таких проверок Энтузиаст все-таки оказался в
            одиночестве, у него по крайней мере остаются и приятные
            воспоминания, и некоторая материальная компенсация: «Ну и что, что
            он вернулся к своей жене?! Зато все его деньги остались у меня. Все,
            какие были, все мои!»
          </UiText>

          <UiText>
            Только в партнерстве с Аналитиком у Энтузиаста не возникает никаких
            сомнений по поводу равенства во взаимоотношениях. Только в этом
            случае он чувствует, что получает не меньше, а даже больше, чем
            дает.
          </UiText>

          <UiText>
            Только в отношениях с Аналитиком, чьи достоинства имеют для
            Энтузиаста особенно высокую значимость, а недостатки кажутся
            совершенно незначительными, Энтузиаст перестает просчитывать,
            «сколько добра он сделал и чем ему за это отплатили».
          </UiText>

          <UiText>
            В общении с партнëрами других психологических типов Энтузиаст
            постоянно испытывает ощущение несправедливости взаимоотношений, ему
            всегда кажется, что он отдает гораздо больше, чем получает.
          </UiText>

          <UiText color="role">
            Он постоянно чувствует себя обделенным и у него в свою очередь
            возникает желание восстановить справедливость, причем далеко не
            самыми этичными методами.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">8 — Фоновая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_will" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Воля</UiText>
              <UiText preset="body">Волевая сенсорика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Свою этическую неудовлетворенность Энтузиаст обычно компенсирует
            приоритетом по волевой сенсорике, старается заполучить силовое
            превосходство там, где, по его мнению, уже нет и не может быть
            этического равенства.
          </UiText>

          <UiText>
            Для этого Энтузиаст стремится сосредоточить в своих руках все сферы
            влияния и все материальные ценности своего партнера, который к этому
            времени уже становится его противником, старается полностью
            парализовать его волю и активность.
          </UiText>

          <UiText color="accent">
            В условиях субъективно ощущаемого «этического неравенства» у
            некоторых представителей этого типа развивается опасение, что к его
            родным детям относятся хуже, чем к падчерице или пасынку.
          </UiText>

          <UiText>
            В этом случае Энтузиаст может «восстанавливать справедливость»,
            добиваясь огромного преимущества и явного перевеса своих интересов.
            Причем делает это с таким волевым напором и с такой эмоциональной
            атакой, чтобы больше ни у кого никогда не возникло желания их
            оспаривать.
          </UiText>

          <UiText>
            В партнерстве с Аналитиком у Энтузиаста не возникает этических
            предпосылок для такой ситуации, поскольку Аналитик с подчеркнутым,
            скрупулезнейшим педантизмом уравнивает в правах и обязанностях всех
            членов своей семьи, не делая ни для кого из них исключения.
          </UiText>

          <UiText>
            Энтузиаст постоянно и повсеместно демонстрирует готовность защищать
            свои интересы, независимо от того, покушаются на них или нет. Для
            него очень важно доказать свое силовое превосходство в качестве
            предупредительной профилактической меры защиты его интересов.
          </UiText>

          <UiText color="role">
            Любую форму собственной волевой защиты Энтузиаст рассматривает как
            необходимое ответное действие на чью-то несправедливость и чей-то
            произвол, которые он старается не допускать, поскольку опасается
            ущемления своих прав, равно как и других неприятных последствий.
          </UiText>

          <UiText preset="large" color="role">
            А неприятностей Энтузиаст старается не допускать. Поэтому изначально
            заявляет о себе как о человеке, который никому не позволит подавлять
            себя.
          </UiText>

          <UiText>
            Демонстрация силы и воли для Энтузиаста — естественное состояние.
            Проявление волевой инициативы для него также естественно, как
            проявление инициативы этической. Энтузиаст всегда свободен в
            проявлении своих чувств и желаний, но всегда настораживается, когда
            это себе позволяет кто-то другой.
          </UiText>

          <UiText>
            Сам боится проявить уступчивость, опасается, что это ущемит его
            интересы. Предпочитает, чтобы уступали те, кто «по другую сторону
            баррикады», в то время как «его команда» должна быть непреклонна и
            неуступчива.
          </UiText>

          <UiText preset="large" color="role">
            Часто демонстрирует свою решительность, настойчивость и
            целеустремленность, как бы предлагая свое поведение в качестве
            образца для подражания.
          </UiText>

          <UiText>
            Обычно очень подробно рассказывает, какие препятствия ему чинили и
            каким образом он их преодолевал, что ему на это сказали, что он на
            это ответил…
          </UiText>

          <UiText>
            Энтузиаста раздражают слабые (по его мнению) и пассивные люди. Но
            своего дуала Аналитика он к таковым не причисляет — если человек
            готов жертвовать собой во имя идей, он уже силен. Его только надо
            научить, каким образом можно отстоять идею без особого ущерба для
            себя.
          </UiText>

          <UiText preset="large" color="role">
            Энтузиаст способен довольно точно оценить силовой перевес
            противника, кроме того, достаточно предусмотрителен, чтобы не лезть
            на рожон.
          </UiText>

          <UiText>
            В альянсе с Аналитиком Энтузиаст умеет выждать время для того, чтобы
            самым рациональным образом применить свои волевые качества и в самый
            подходящий момент защитить свои права с наименьшими потерями для
            себя.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
