<template>
  <div class="text g-page">
    <section>
      <UiText preset="large" color="role">
        Вашей сильной стороной является аналитический ум, структурное мышление,
        умение уловить закономерности любого явления.
      </UiText>

      <UiText>
        Вы настроены на объективность и справедливость, при оценке людей
        руководствуетесь их вкладом в общее дело, а не личными симпатиями.
      </UiText>

      <UiText>
        В деле, которым вы занимаетесь, всегда выделяете главное, отбрасывая
        лишние, несущественные детали. Вы также умеете строго изложить материал,
        донести основную идею до слушателей.
      </UiText>

      <UiText>
        Проанализировав идею, установив её важность и перспективность, вы
        становитесь её активным сторонником. Ваша творческая интуиция питает её
        постоянно все новыми и новыми вспышками.
      </UiText>

      <UiText preset="large" color="role">
        Вы наделены также способностью бережного обращения с конкретными людьми.
        Вы умеете заметить человека в деле и помочь раскрыть его способности,
        вселить веру в собственные силы.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Основная проблема вашей жизни — это неумение активно отстаивать свои
        интересы и слабая уверенность в себе в конкретных жизненных делах.
      </UiText>

      <UiText>
        Вам свойственна нерешительность, у вас отсутствует мгновенная реакция на
        изменение ситуации. Неоперативность, отсутствие динамичности может вам
        повредить.
      </UiText>

      <UiText preset="large" color="role">
        Старайтесь смелее предъявлять свои права, если вы уверены в их
        обоснованности.
      </UiText>

      <UiText>
        Займитесь теми видами спорта, которые вырабатывают решительность и
        быстроту реакции — теннисом, горными лыжами, автомобилизмом, боксом.
      </UiText>

      <UiText preset="large" color="role">
        Обязательно чередуйте умственный труд с физическим.
      </UiText>

      <UiText>
        Вам рекомендуются упражнения на концентрацию внимания, а также занятия,
        которые развивают это качество, например сбор грибов, ягод, ловля рыбы.
      </UiText>

      <UiText>
        Вы нуждаетесь в моральной поддержке своих начинаний. В вашем окружении
        должны быть люди решительно и оптимистически настроенные, которые бы вас
        время от времени подталкивали, помогали преодолеть пессимизм и неверие в
        свои силы.
      </UiText>
    </section>

    <section>
      <UiText>
        Другая ваша проблема — неумение общаться с людьми, далекая
        психологическая дистанция, которая воспринимается окружающими как
        сухость, черствость, отчужденность.
      </UiText>

      <UiText>Иной раз вы сознательно обрекаете себя на одиночество.</UiText>

      <UiText preset="large" color="role">
        Не будьте мрачным и угрюмым. Чаще улыбайтесь, будьте приветливы, но не
        заходите слишком далеко — вам трудно отказать людям
      </UiText>

      <UiText>
        Осторожно выбирайте круг необходимых для вас контактов,чтобы избежать
        переутомления и ненужных вам этических проблем.
      </UiText>

      <UiText>
        Старайтесь не терять налаженных эмоциональных связей. Вы многим можете
        помочь своей рассудительностью и пониманием.
      </UiText>

      <UiText preset="large" color="role">
        Старайтесь воспитывать в себе нормы общепринятой этики и следуйте им
        повседневно.
      </UiText>

      <UiText>
        Учтите, что не все могут так же успешно анализировать события и
        абстрагироваться от эмоций, как вы.
      </UiText>

      <UiText preset="large" color="role">
        Считайтесь с интересами других людей.
      </UiText>

      <UiText>
        Старайтесь глубже вникать в проблемы каждого, если хотите, чтобы они с
        вами сотрудничали. Помните, что человека обижает поверхностное,
        невнимательное отношение к нему.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
