<template>
  <div class="text g-page">
    <section>
      <UiText preset="large" color="role">
        Ваша сильная сторона — развитое интуитивное предчувствие, которое
        позволяет вам извлекать уроки из ошибок прошлого, чтобы обезопасить своё
        будущее.
      </UiText>

      <UiText>
        Будущее вы представляете себе оптимистически. Вы — мечтательная,
        романтическая натура.
      </UiText>

      <UiText>
        Вам по душе красота в искусстве и в жизни. Ваша творческая натура не
        выносит серости и стандарта. В любое дело вы вносите элементы изящества
        и оригинальности.
      </UiText>

      <UiText>
        Вы хорошо разбираетесь в настроениях людей, обладаете тонким чувством
        юмора, умеете с его помощью улучшить настроение себе и своим близким.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Вы обладаете богатым миром разнообразных чувств и во многом зависите от
        нюансов своего душевного состояния.
      </UiText>

      <UiText>
        Вы способны на возвышенные чувства и склонны идеализировать людей. В
        окружающий мир вы вносите праздничность и возвышенность.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Ваша главная проблема состоит в том, что вам трудно постоянно заставлять
        себя заниматься повседневными, неинтересными делами, которые носят
        сугубо материальный характер.
      </UiText>

      <UiText>
        У вас не получается экономного ведения хозяйства, вам порой трудно
        устоять перед соблазном приобретения красивых вещей, стоимость которых
        выходит за рамки вашего бюджета.
      </UiText>

      <UiText preset="large" color="role">
        Следите за тем, чтобы не тратить деньги на ненужные безделушки: вы
        подвергаетесь риску пострадать в финансовом отношении.
      </UiText>

      <UiText>
        Проявляйте больше сдержанности в растратах, чтобы не поставить себя в
        унизительное положение, когда вам приходится рассчитываться с долгами
        самыми разными способами, вплоть до продажи вещей.
      </UiText>

      <UiText preset="large" color="role">
        Не идите на поводу у своих честолюбивых устремлений и иллюзий в
        отношении «легкой» жизни, не подчиняйте им соображения этики и морали,
        чтобы избавиться от повседневных забот.
      </UiText>

      <UiText>
        Пусть ваши искренние чувства подскажут вам правильный выбор между
        материальным и духовным аспектом жизни.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Другая ваша проблема состоит в том, что вы не склонны долго скрывать от
        окружающих свои переживания и физические недуги. Этим вы можете утомить
        людей и вызвать у них недоверие к искренности ваших переживаний.
      </UiText>

      <UiText>
        Проявляйте больше великодушия и деятельной заботы о людях.
      </UiText>

      <UiText>
        Преодолевайте в себе нежелание считаться с повседневными конкретными
        делами, в том числе домашними. Конкретнее формулируйте свои проблемы, не
        будьте навязчивыми по отношению к другим людям.
      </UiText>

      <UiText preset="large" color="role">
        Воздерживайтесь от излишних претензий к окружающим и жалоб на отсутствие
        должной заботы по отношению к вам.
      </UiText>

      <UiText>
        Чтобы заслужить внимание близких, старайтесь умерить некоторую
        капризность в вашем характере.
      </UiText>

      <UiText preset="large" color="role">
        Старайтесь заслужить хорошее отношение к себе трудолюбием и активным
        участием в общих делах и ни в коем случае не давайте пустых обещаний.
      </UiText>

      <UiText>
        Не проводите свободное время в мечтаниях, бесплодных эмоциональных
        беседах и тайных переживаниях.
      </UiText>

      <UiText>
        Если вы большую часть свободного времени посвятите реальному делу, то
        ваши шансы преуспеть в жизни значительно возрастут.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
