<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Велта Микелсоне"
          subtitle="12 минут"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Вера Стратиевская"
          subtitle="40 минут"
          target-content-id="tab-2"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText preset="body" color="accent">
            Описания не должны обязательно совпадать со всеми чертами характера
            личности.
          </UiText>

          <UiText preset="small" color="accent">
            Идея как раз описать наблюдаемые у среднего представителя типа
            особенности поведения и обработки информации психикой.
          </UiText>

          <UiText preset="small" color="accent">
            Автор описания — Велта Микелсоне
          </UiText>
        </section>

        <section>
          <UiText preset="subtitle" color="role">
            Самый безбашенный и веселый соционический тип во всем соционе.
          </UiText>

          <br />

          <UiText>
            Отлично улавливает силу и слабость любого человека, способен найти
            выход из любой сложной этической ситуации, эффективно в любой
            ситуации разведывает ему необходимую информацию и умело этим
            пользуется, и тем самым заслужил псевдоним «разведчика».
          </UiText>

          <UiText>
            Способен распознать мотивы поступков. Сильное воображение, видит
            перспективность или бесперспективность развивающихся отношений.
          </UiText>

          <UiText preset="large" color="role">
            Яркие фантазии часто обитают в его голове.
          </UiText>

          <UiText>
            Характерны быстрые смены интересов, спонтанное принятие решений.
            Наблюдательный и любознательный. Интересуется всем необычным и
            загадочным.
          </UiText>

          <UiText>
            Его увлекает все необычное, что на первый взгляд кажется
            захватывающим. Не нацелен на далекие перспективы. Мгновенно способен
            принять решение о серьезном изучении только услышанного.
          </UiText>

          <UiText>
            Бывает, что из-за широты интересов, он в течении жизни заканчивает
            несколько вузов, посещает разные многочисленные курсы и семинары.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Быстро улавливает суть вещей.
          </UiText>

          <UiText>
            Ему трудно определиться, что главное, а что второстепенное, и часто
            бывает, что он оставляет начатое на полпути.
          </UiText>

          <UiText>
            Благодаря перечисленным качествам, его можно считать лучшим
            журналистом, педагогом, рекламистом.
          </UiText>

          <UiText>
            В незнакомых ситуациях у него появляется блуждающий взгляд, он
            глазами как будто «бродит» вокруг, что то ищет, разведывает. Это
            создает впечатление рассеянного человека.
          </UiText>

          <UiText preset="large" color="role">
            Везде, где он находится, он как бы автоматически предугадывает ход
            событий.
          </UiText>

          <UiText>
            В его памяти «отпечатываются» как на пленке много разных кадров.
          </UiText>

          <UiText>
            Сперва он даже недооценивает важность этих кадров. Бывает, что в
            этой цепочке не хватает какого-то звена. Вдруг в какой-то момент
            говорит «У меня идея!».
          </UiText>

          <UiText>
            Вновь услышанная информация заполняет все ранее отсутствующие звенья
            в его цепочке, и Советчик завершает процесс своих наблюдений..
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            С рождения отличный знаток людей, быстро отгадывает их желания.
          </UiText>

          <UiText>
            Эта черта дает ему шанс стать хорошим психологом, поскольку он умеет
            и хочет быть с каждым в дружеских отношениях.
          </UiText>

          <UiText>
            Но, увы, он как бы притягивает к себе все неудачи и беды другого
            человека, и долго носит их в себе. Поэтому у него часто появляется
            ощущение, что потерял какую то часть себя.
          </UiText>

          <UiText>
            К сожалению, его советы чаще всего расплывчатые, неконкретные, не
            помогают другому принять правильное решение. На некоторое время он
            способен, беседуя с человеком, направить его на верный путь. Но ему
            не под силу дать точный совет, даже избегает таких ситуаций.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Он талантливый мечтатель и фантазер. Ярко выраженная творческая
            личность.
          </UiText>

          <UiText>
            Украшает свою жизнь выдумкой и изобретательностью. Способен
            талантливо воплотить свои фантазии и замыслы в реальную жизнь,
            создавая разные сценарии, например для праздников и пр.
          </UiText>

          <UiText>
            Выполняя обязанности в нетворческих отраслях, все равно ищет
            неординарные решения — во-первых, чтобы самому было интереснее и не
            надоела работа, во вторых, таким способом он вносит разнообразие,
            предоставляя индивидуальную точку зрения и необычные решения.
          </UiText>

          <UiText preset="large" color="role">
            Ему необходимо делиться своими знаниями, опытом, переживаниями и
            подтверждать свою уникальность.
          </UiText>

          <UiText>
            Это его качество бывает особенно необходимо для распространения
            новых достижений в науке и искусстве.
          </UiText>
        </section>

        <section>
          <UiText>
            Он желает везде достичь высоких результатов. Идеализирует все, в том
            числе свои способности. Как идеалист, он желает быть человеком без
            недостатков. Не любит открыто признавать свои поражения, чтобы не
            показаться неудачником.
          </UiText>

          <UiText preset="large" color="role">
            Умело находит выход из, казалось бы, безвыходных ситуаций.
          </UiText>

          <UiText>
            Обычно создает и поддерживает доброжелательную атмосферу в
            коллективе, приспосабливается к собеседнику, знает кому и что
            говорить. Способен уделить внимание, произнести успокаивающие слова,
            ненавязчиво подбодрить. Легко находит индивидуальный подход к
            каждому, иной раз извлекая из этого выгоду.
          </UiText>

          <UiText preset="large" color="role">
            Не имеет стабильной и устойчивой точки зрения.
          </UiText>

          <UiText>
            Поэтому обычно он легко соглашается с мнением большинства. А в
            другой ситуации может выразить поддержку противоположному мнению.
            Таким образом он регулирует отношения с нужными людьми.
          </UiText>

          <UiText preset="large" color="role">
            Избегает контакта с грубыми, невоспитанными людьми.
          </UiText>
        </section>

        <section>
          <UiText>
            Нетерпим к недостаткам других. Теряет свой интерес к тем, кто не
            выдержал его этической проверки. Предчувствуя, что действительно
            придется брать на себя ответственность за решения другого человека,
            он создает искусственную дистанцию.
          </UiText>

          <UiText preset="large" color="role">
            Часто демонстрирует свою игривость, особенно в словах.
          </UiText>

          <UiText>
            Такое поведение иногда производит впечатление поверхностного,
            беззаботного и легкомысленного человека. Однако общение с Советчиком
            может сложиться непредсказуемо, иногда даже для него самого.
          </UiText>

          <UiText preset="large" color="role">
            Душевная близость может оказаться мнимой и обманчивой, его
            дружелюбие никаким образом не связано с подлинным отношением к
            человеку.
          </UiText>

          <UiText>
            Если встречает душевно близкого человека, который чаще этический
            тип, образуется глубокая и длительная дружба. Ради такого друга
            способен пойти на жертвы, например, встать среди ночи, чтобы оказать
            помощь.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Ему необходимо быть принятым в обществе.
          </UiText>

          <UiText>
            Казалось бы, после удачно проведенных часов вместе, он может вдруг
            потерять интерес и необъяснимо исчезнуть. Если попадает в опасную
            ситуацию, в большинстве случаев он легко находит выход из нее, но
            иногда неприятности липнут к нему.
          </UiText>

          <UiText preset="large" color="role">
            Манипулируя людьми, ожидает ответной реакции.
          </UiText>

          <UiText>
            Часто анализирует свои действия, старается понять причины поведения.
            Ему трудно оценивать себя по достоинству. Хотя способен оценить
            других.
          </UiText>

          <UiText>
            В течении жизни у него меняется много друзей, но ни с одним из них
            он не прерывает отношений окончательно. Считает, что в определенный
            момент может вернуться и возобновить дружбу.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Работу начинает с большим энтузиазмом.
          </UiText>

          <UiText>
            Если её можно сделать за кратковременный срок, энтузиазм не
            теряется. Но при долгосрочной работе или в случае неудачи может не
            закончить начатое, или ему придется заставить себя довести дело до
            конца.
          </UiText>

          <UiText preset="large" color="role">
            Ему необходим комфорт, но сам его создать не умеет.
          </UiText>

          <UiText>
            Обычно в его квартире царит некий хаос. У него отсутствует понятие
            «всему своё место», по возможности избегает бытовых дел.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Считает себя волевым, целеустремленным и самоуверенным человеком.
          </UiText>

          <UiText>
            Бывает, что демонстративно отстаивает свои права, но свои волевые
            качества обсуждать не желает, часто считает себя сильным лидером.
          </UiText>

          <UiText>
            Именно поэтому он склонен выдвигаться в лидеры. Однако он не берет
            на себя лишнюю ответственность, поскольку ему не хватает выдержки и
            целеустремленности. Но однажды потерпев поражение, понимает, что
            может быть лидером лишь второго плана.
          </UiText>
        </section>

        <section>
          <UiText>
            Способен мобилизоваться, в непредвиденных ситуациях становится
            решительным, активным, проявляет смелость. Интуитивно находит
            решения и умело координирует работу людей в чрезвычайных ситуациях.
            Знает, что способен сделать сам и что нужно потребовать сделать от
            других.
          </UiText>

          <UiText preset="large" color="role">
            Сопротивляется всяческим ограничениям свободы.
          </UiText>

          <UiText>
            Плохо чувствует себя на работе, которая связывает определенным
            расписанием и ритмом. Тяжело соблюдает выдвинутые требования.
          </UiText>

          <UiText>
            Такие действия могут вызвать для него необратимые последствия.
            Способен отменить ранее принятые решения. Соблюдения правил,
            установленного порядка и прочее мешают ему жить. Избегает
            однообразия.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Свою работу совершенствует, делает её более интересной и
            захватывающей.
          </UiText>

          <UiText>
            Часто пытается выполнить задание в собственной манере, не так, как
            другие. Другие считают такое поведение недисциплинированностью.
            Работу превращает в игру и выполняет её непринужденно. Не признает
            формальностей.
          </UiText>

          <UiText>
            Даже серьезные отношения старается вести в свободной атмосфере. Это
            ему часто успешно удаëтся. Если задуманное не удалось реализовать,
            чувствует себя обеспокоенным. Ему не приятны замечания по поводу
            необдуманных действий и поступков. Ему тяжело понять сложные схемы
            или системы. Открыто не признает свои слабости, хотя внутри он
            самокритичен, знает свои недостатки.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Ему тяжело длительное время концентрироваться на чем-то одном, он
            становится невнимательным.
          </UiText>

          <UiText>
            Он не всегда вникает в детали. Выслушивает информацию поверхностно,
            и также передает её другим, запутываясь в терминологии и в фактах.
            Особенно это заметно, если он выбирает профессию, которая связана с
            точными науками.
          </UiText>

          <UiText>
            Не следует инструкциям и правилам, растолковывает их по-своему. С
            трудом составляет подробные и точные отчеты. Он пытается внести своё
            творчество, но не думает о её неуместности.
          </UiText>

          <UiText preset="large" color="role">
            Требовать от него четкую и сложную информацию не стоит.
          </UiText>

          <UiText>
            В наилучшем случае он делегирует это другим, в наихудшем — вам
            самому придется исправить многочисленные его ошибки и недочеты.
          </UiText>

          <UiText>
            Полностью расслабляется только в комфортной обстановке, где ему не
            надо заниматься бытовыми вопросами. У него слабое ощущение
            физической стороны жизни. Не способен регулярно следить за порядком
            вокруг себя.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Часто у него вещи разбросаны по всей квартире.
          </UiText>

          <UiText preset="small" color="accent">
            У женщин на кухне можно найти все ранее использованное и лишнее, в
            том числе продукты, срок годности которых просрочен. Уход за
            квартирой делается поверхностно и с усилием. Лучше всего заботу по
            быту переложит на других.
          </UiText>

          <UiText>
            Также у него возникают проблемы с одеждой. Он часто пытается
            подтвердить свою индивидуальность неординарным стилем одежды, но
            обижается на замечания по несоблюдению общепринятых норм.
          </UiText>

          <UiText>
            С трудом чувствует своё тело. Не может объяснить ощущения боли,
            усталости, резкой смены температуры.
          </UiText>

          <UiText preset="large" color="role">
            Не способен заботиться о здоровье и отдыхе постоянно. Он нуждается в
            человеке, который будет заботиться о нем и баловать.
          </UiText>

          <UiText>
            Длительное одиночество в рабочем кабинете забирает у него силы. Его
            работоспособность зависит тот настроения. Советчик предпочитает
            работу в коллективе. Ему необходима быстро выполняемая работа.
            Настроен на скорый результат, а не на длительные процессы.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Он умело регулирует темп психологического сближения или отдаления
            человека.
          </UiText>

          <UiText preset="small" color="accent">
            Хотя делает вид, что желает быть со всеми в хороших отношениях, как
            представитель аристократической квадры сохраняет соответствующую
            дистанцию.
          </UiText>

          <UiText>
            Предусмотрительный, наблюдает и делает свои выводы о грозящих
            опасностях в отношениях, и предупреждает об этом тех, кого считает
            нужными.
          </UiText>

          <UiText>
            Раздражает, если другие бестолково отнимают у него время и поступают
            непорядочно, он воспринимает это, как неуважение к себе. Если попал
            в жесткие обстоятельства, ему бывает жаль зря потраченного времени,
            а не потраченных сил.
          </UiText>
        </section>

        <section>
          <UiText>
            Болезненно переживает неудачи, несправедливость, замечания, ссоры.
            Когда он терпит поражения, получает отказы, приходит отчаяние и ему
            необходимо побыть в одиночестве, чтобы восстановить внутреннее
            равновесие.
          </UiText>

          <UiText preset="large" color="role">
            Его внутренний мир сложен и противоречив. Внешне развязан и игрив,
            но внутри сражается с переживаниями и грустными мыслями.
          </UiText>

          <UiText>
            Чтобы избавиться от них, может использовать опьяняющие средства.
            Может впасть в депрессию, что свойственно для представителей этого
            социотипа.
          </UiText>

          <UiText>
            Если не нашел подходящее место в жизни, как уже говорилось, он не
            признает свои неудачи. В связи с этим на рабочем месте становится
            человеком, провоцирующем гнев других. В таких ситуациях не способен
            сдержаться.
          </UiText>

          <UiText preset="large" color="role">
            Защищая себя, раздражается, повышает голос.
          </UiText>

          <UiText>
            Обладает талантом актера, он способен импровизировать, пародировать
            голоса и поведение других. Его привлекают талантливые и успешные
            личности.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="small" color="accent">1 — Базовая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_ideas" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Мысль</UiText>
              <UiText preset="body">Интуиция возможностей</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Представителям этого типа свойственна исключительная
            проницательность. Характер человека могут определить практически с
            одного взгляда, причем настолько точно, что почти сразу способны
            дать ему емкую и лаконичную характеристику.
          </UiText>

          <UiText>
            Великолепно предвидят развитие ситуации в ее этическом плане.
            Нередко способны довольно точно предсказывать развитие событий в
            будущем.
          </UiText>

          <UiText>
            Тонкие психологи, тонко чувствующие малейшее изменение настроения и
            отношений. Прекрасно чувствуют собеседника. Легко общаются.
            Прекрасно работают с людьми.
          </UiText>

          <UiText color="accent">
            Актеры-Советчики очень быстро находят контакт с публикой и
            великолепно его держат на протяжении всего своего выступления.
            Великолепно работают в шоу-бизнесе, причем на выступлениях обычно
            проявляют себя лучше, чем на репитициях. «Страх сцены» им не
            свойствен, наличие публики — только приятно возбуждает.
          </UiText>

          <UiText color="role">
            Представители этого типа прекрасно работают и в медицине — это, как
            правило, великолепные диагносты, способные определить заболевание на
            самой ранней стадии его развития и по самым отдаленным признакам.
          </UiText>

          <UiText>
            Благодаря умению выбрать для реализации своих планов наиболее
            удачную возможность, представители этого типа способны добиться
            огромных успехов, не прилагая для этого излишних усилий.
          </UiText>

          <UiText preset="large" color="role">
            Великолепно используют те возможности, которые предоставляет им
            случаи. Из каждой ситуации умеют извлечь для себя максимум пользы.
          </UiText>

          <UiText>
            Для представителей этого типа характерно постоянное и повсеместное
            испытание своих возможностей и сопоставление их с возможностями
            окружающих.
          </UiText>

          <UiText>
            Обожают создавать ситуацию соревнований для себя и импровизированных
            испытаний, проверок и экзаменов — для других.
          </UiText>

          <UiText color="role">
            Советчик обычно довольно ревниво относятся к чужим достижениям,
            неохотно признают чужое превосходство, и если кого-то хвалят, то
            только тех, чьей конкуренции не опасаются, или тех, чье расположение
            стремятся завоевать.
          </UiText>

          <UiText>
            Завышенное требование к собственным возможностям приводит к тому,
            что повышается и значимость такого фактора, как успех. Успех, в
            понимании Советчика, — это норма. Отсутствие успеха его
            настораживает, как нечто неблагополучное.
          </UiText>

          <UiText>
            Поэтому в любой ситуации и при любых обстоятельствах представители
            этого типа стараются держаться «на высоте» или по крайней мере
            производить такое впечатление у окружающих.
          </UiText>

          <UiText color="accent">
            «Как сам себя преподнесешь, так тебя и будут воспринимать».
          </UiText>

          <UiText>
            Более того, Советчик вообще довольно часто претендует на репутацию
            «человека без недостатков». Очень не любит, когда критикуют его
            поведение и, хоть теоретически понимает, «что все не без греха»,
            лично за собой никаких серьезных «грехов» не признает, поэтому
            иногда может полусерьезно сказать: «Если вы видите во мне какие-то
            недостатки, скажите мне об этом, и я исправлюсь».
          </UiText>

          <UiText color="role">
            Способы достижения успеха всегда волнуют и интересуют представителей
            этого типа. Многие из них являются авторами книг о том, как достичь
            успеха в той или иной сфере и как преуспеть на том или ином поприще.
          </UiText>

          <UiText>
            Потребность всегда и во всем быть на высоте заставляет их в любой
            ситуации и при любых обстоятельствах претендовать на приз или
            выигрыш.
          </UiText>

          <UiText color="role">
            Тупиковых и безвыходных ситуаций, по их мнению, просто не должно
            существовать. В неловкое положение невозможно поставить ни одного из
            них, поскольку они просто не признают за собой никакой вины и в
            любой ситуации поведут себя так, словно ничего особенного не
            произошло.
          </UiText>

          <UiText>
            У Советчика феноменальная способность не обнаруживать своей
            неловкости и не признавать себя побежденным ни при каких
            обстоятельствах.
          </UiText>

          <UiText>
            Перспектива достижения успеха ценой многолетнего и кропотливого
            труда кажется им малопривлекательной — слишком хорошо они знают, как
            бывает недолговечна популярность и как переменчивы интересы толпы.
            Так, стоит ли ради минутной славы много лет трудиться в поте лица и
            заниматься только одним делом, упуская другие возможности?
          </UiText>

          <UiText preset="large" color="role">
            Считают для себя необходимым завоевывать внимание окружающих и
            удерживать его любой ценой — это для них своего рода тренировка
            «интуиции успеха».
          </UiText>

          <UiText>
            Многие из них, особенно в детстве и в молодости, постоянно «тянут»
            внимание на себя. Раздражаются и нервничают, если их присутствие
            игнорируется. Собирая внимание окружающих, Советчик буквально
            «расцветает»: старается проявить себя как можно интереснее и
            оригинальнее, причем в этом с ним лучше не состязаться.
          </UiText>

          <UiText>
            А если все-таки не чувствуют к себе достаточного интереса,
            демонстративно игнорируют всех присутствующих, что одновременно
            является и вызовом обществу и еще одним средством привлечь к себе
            внимание.
          </UiText>

          <UiText preset="large" color="role">
            «Пользоваться успехом», «завоевать популярность», «удерживать
            популярность» — все это «подвиги» одного порядка, а для
            представителей этого типа — достижения, имеющие первостепенную
            значимость.
          </UiText>

          <UiText>
            Именно поэтому многие из них имеют склонность к дерзким и
            экстравагантным выходкам и смелым «этическим экспериментам». Многие
            из них даже в зрелом возрасте сохраняют способность высмеивать,
            дразнить, передразнивать и подшучивать. Что бывает не всегда
            деликатно и уместно.
          </UiText>

          <UiText>
            Очень любят прихвастнуть. Часто рассказывают о своих успехах у
            представителей противоположного пола или о том, как легко и
            оригинально им удалось найти выход из самого затруднительного
            положения.
          </UiText>

          <UiText>
            Создается впечатление, что Советчик как будто не задумывается о том,
            что подобные истории пробуждают у слушателей желание последовать его
            примеру, хотя на самом деле именно для этого они и рассказываются.
          </UiText>

          <UiText>
            Даже если «подвиги» Советчик от начала и до конца вымышленные, ему
            все равно интересно посмотреть, как другие сделают то, чего он, на
            самом деле, сделать не решился, но о чем очень красочно рассказал.
          </UiText>

          <UiText>
            Советчик постоянно «исследуют» потенциальные возможности людей в
            самых разных ситуациях, причем «лабораторией» им служит весь
            окружающий мир. Советчик прекрасно умеет прощупывать ситуацию
            «чужими руками», учиться на чужих ошибках и на чужом опыте.
          </UiText>

          <UiText preset="large" color="role">
            Каждый раз, когда представителя этого типа осеняет какая-нибудь
            «оригинальная идея», он довольно быстро представляет себе, кто из
            его окружения мог бы стать ее исполнителем и испытателем.
          </UiText>

          <UiText color="role">
            Советчик великолепно умеет находить тех, кто с интересом
            воспринимает его замыслы и соглашается их реализовывать. Он умеет
            убедить любого, даже самого осторожного и осмотрительного человека в
            том, что предлагаемая им затея делается именно в интересах
            «исполнителя», никаких неприятностей ему не сулит, а даже наоборот —
            большие и очевидные выгоды.
          </UiText>

          <UiText>
            Разумеется, Советчик всегда безошибочно точно определяет, на какую
            именно приманку и на какой аргумент «купится» человек, которого он
            наметил для своего «эксперимента». Если его замысел реализуется
            успешно или хоть с какой-то пользой, Советчик будет этому искренне
            рад, хотя и не упустит случая извлечь для себя определенную выгоду,
            например, намекнет человеку, что теперь он ему чем-то обязан.
          </UiText>

          <UiText>
            В случае неудачи «эксперимента» Советчик меньше всего думает о том,
            что кого-то «подставил» и является виновником чьих-то неприятностей.
          </UiText>

          <UiText preset="large" color="role">
            Советчик вообще старается поменьше думать о своих неудачах.
          </UiText>

          <UiText>
            Воодушевляя кого-либо своей новой идеей, он вовсе не исключает ее
            успешного завершения, хотя в любом случае ничем не рискует: если
            начинание завершается успешно, ему будут благодарны и обязаны.
          </UiText>

          <UiText>
            Даже если результат окажется неблагоприятным, по крайней мере
            приобретен опыт, причем лично для него — безболезненный.
          </UiText>

          <UiText color="role">
            Такие условия «эксперимента» объясняются тем, что Советчик по сути
            своей — пессимист. При всем кажущемся легкомыслии и бесшабашности он
            осторожен и осмотрителен, поэтому предпочитает идти по проторенным
            дорожкам, но при этом старается во что бы то ни стало приходить
            первым и получать приз.
          </UiText>

          <UiText>
            «Перехватить» приз он может и перед финишем, что в его глазах ничуть
            не умаляет цену победы, наоборот, только увеличивает.
          </UiText>

          <UiText>
            Поскольку чужие успехи, заслуги и достижения не оставляют
            равнодушными представителей этого типа, у Советчик часто возникает
            желание перепроверить чужие успехи.
          </UiText>

          <UiText color="accent">
            Например, если подружка похвасталась перспективами и возможностями
            на своей новой работе, Советчик не успокоится, пока не заставит
            кого-нибудь из своих знакомых «проверить», действительно ли эти
            перспективы так заманчивы.
          </UiText>

          <UiText>
            Любая информация о возможностях для представителей этого типа крайне
            важна, и если она им кажется неправдоподобной, они стараются ее
            лишний раз проверить. Причем сами в качестве «разведчиков» выступают
            крайне неохотно: при малейшей опасности для себя «раскалываются» и
            «по простоте душевной» подставляют тех, кто их подослал.
          </UiText>

          <UiText color="role">
            Посылать Советчика на ответственное поручение очень рискованно. Это
            только кажется, что в любой ситуации они ведут себя непредсказуемо —
            всегда есть нечто постоянное в их поведении: при любых
            обстоятельствах они стараются поступать с наименьшими потерями для
            себя.
          </UiText>

          <UiText>
            Советчик не упустит возможности испробовать все, что привлекательно
            и заманчиво выглядит. Великолепно умеет «держать нос по ветру».
          </UiText>

          <UiText>
            Умеет быть в курсе всех событий, мнений и веяний. Знает, какое
            мнение нужно поддержать и к какому направлению нужно примкнуть,
            причем всегда будет в числе первых. Многим вследствие этих качеств
            кажется пронырой.
          </UiText>

          <UiText preset="large" color="role">
            Умеет представить свои способности, возможности и квалификацию в
            самом выгодном свете, независимо от их реального уровня.
          </UiText>

          <UiText color="role">
            Часто «блефует», причем не боится быть уличенным в этом, поскольку
            рассматривает свои действия как эксперимент: оправдается его
            самореклама — хорошо, не оправдается — тоже не страшно.
            Приобретенный опыт может когда-нибудь пригодиться.
          </UiText>

          <UiText>
            Склонен переоценивать свои способности, как, впрочем, иногда
            недооценивает их у других. Часто берется за работу, значительно
            превышающую его компетентность, рассчитывая, что со временем он
            войдет в курс дела и будет работать не хуже других, или может быть
            ему представится какая-то возможность хорошо себя зарекомендовать.
          </UiText>

          <UiText color="role">
            Быть уличенным в некомпетентности не боится, поскольку великолепно
            умеет «себя подать», и, кроме того, как уже говорилось, никогда не
            признается в своих ошибках, даже если его откровенно разоблачают —
            поворачивается и уходит, не утруждая себя объяснениями и
            извинениями.
          </UiText>

          <UiText>
            Если все-таки решает себя оправдать, всегда с легкостью сумеет это
            сделать: «Допустим, у меня еще не все получается, но я готов
            учиться, и я не считаю себя безнадежным!»
          </UiText>

          <UiText>
            Если все-таки решает себя оправдать, всегда с легкостью сумеет это
            сделать: «Допустим, у меня еще не все получается, но я готов
            учиться, и я не считаю себя безнадежным!»
          </UiText>

          <UiText>
            Если все-таки решает себя оправдать, всегда с легкостью сумеет это
            сделать: «Допустим, у меня еще не все получается, но я готов
            учиться, и я не считаю себя безнадежным!»
          </UiText>

          <UiText>
            Если все-таки решает себя оправдать, всегда с легкостью сумеет это
            сделать: «Допустим, у меня еще не все получается, но я готов
            учиться, и я не считаю себя безнадежным!»
          </UiText>

          <UiText>
            Советчик в некоторых случаях не стесняется показаться
            некомпетентным, особенно перед человеком, который обожает объяснять
            и поучать, каковым, например, является его дуал Мастер.
          </UiText>

          <UiText>
            Такая легкость в признании ошибок объясняется тем, что Советчик, по
            большому счету, никогда и ни в чем не считает себя виноватым, но
            охотно создает видимость раскаяния и самокритики, когда считает
            нужным кому-либо «подыграть». Иногда «признание собственных ошибок»
            — для него выгодный этический трюк или тактическая уловка.
          </UiText>

          <UiText preset="large" color="role">
            Скромность не считается в его глазах добродетелью, хотя отсутствие
            скромности у других резко осуждает.
          </UiText>

          <UiText>Средство, помогающее ему притормозить чужую прыть.</UiText>

          <UiText>
            И хотя собственную индивидуальность старается проявлять при каждом
            удобном (и неудобном) случае, к любому проявлению индивидуальности у
            других относится критически. В сфере любой деятельности для себя
            всегда отмечает, кто ему конкурент, а кто — нет. Тех, в ком не видит
            соперника, и чьего расположения предполагает добиться, умеет
            подбодрить, поддержать, воодушевить. Но обязательно найдет способ
            «подрубить крылья… всякому, кто хоть в чем-то может встать на его
            пути.
          </UiText>

          <UiText>
            Качество, благодаря которому Советчик способен прекрасно утвердиться
            на новом месте или укрепить свой пошатнувшийся профессиональный
            авторитет.
          </UiText>

          <UiText>
            Любит поучать неудачников. Часто ставит в пример чужие успехи и
            достижения. Умеет и любит навязывать свои установки и ориентировать
            на свои ценности. Любое проявление равнодушия к славе, к карьере,
            успехам и достижениям других, любое нежелание включаться в
            соревнование или состязание осуждает, поскольку воспринимает как
            признак слабости, легкомыслия.
          </UiText>

          <UiText color="accent">
            Иногда считает это проявлением индивидуализма: «Всем это нужно, а
            тебе — почему-то нет!»
          </UiText>

          <UiText>
            Ничего лишнего Советчик стараются о себе не рассказывать, по крайней
            мере в широком кругу или малознакомым людям: опасаются, что эта
            информация может быть использована им во вред.
          </UiText>

          <UiText>
            Если кто-нибудь из близких сболтнет про них лишнее, всегда это
            осуждают. Правда, сами чужие секреты хранить не умеют, особенно,
            если их заранее об этом не попросить. Иногда, как бы не задумываясь,
            сболтнут что-нибудь «компрометирующее».
          </UiText>

          <UiText>
            Советчик любит создавать щекотливые ситуации, ведь ему так интересно
            их наблюдать. И уж с самым невинным видом может поставить кого-то в
            неловкое положение, недоумевая при этом, почему на него обижаются.
          </UiText>

          <UiText>
            Ведь для Советчик — это не более, чем игра: казалось бы, нет такой
            неловкости, из которой они не могли бы легко выйти.
          </UiText>

          <UiText>
            И тем не менее, Советчик стараются ни при каких обстоятельствах не
            подставлять себя под возможные неприятности и по этой причине не
            любят никого «прикрывать».
          </UiText>

          <UiText>
            Опасаются брать на себя лишнюю ответственность. Поэтому преспокойно
            могут отказаться от всех своих прежних обещаний, если это обязывает
            их к каким-то затруднительным или рискованным поступкам.
          </UiText>

          <UiText>
            Обожают водить дружбу со знаменитостями или хотя бы с членами их
            семьи. Не упускают случая рассказать о своих блистательных, или
            влиятельных, «друзьях».
          </UiText>

          <UiText preset="large" color="role">
            Непременные участники и завсегдатаи самых популярных тусовок. Всегда
            в поисках чего-нибудь «новенького и интересненького».
          </UiText>

          <UiText>
            Обожают водить дружбу со знаменитостями или хотя бы с членами их
            семьи. Не упускают случая рассказать о своих блистательных, или
            влиятельных, «друзьях».
          </UiText>

          <UiText>
            Интересы Советчик обширны и разнообразны, но весьма поверхностны и
            нестабильны. Все новое и неизведанное привлекает его, увы,
            ненадолго. Советчик быстро увлекается и быстро охладевает.
          </UiText>

          <UiText>
            Его интерес к новым знакомствам и новым отношениям столь же
            поверхностен и непродолжителен. Как ребенок, разбирающий новую
            игрушку заглядывает в ее устройство, а затем теряет к ней интерес,
            так и Советчик торопится разобраться в сути каждого человека:
            поверхностно, глубоко ли — не важно, — как только цель достигнута и
            любопытство удовлетворено, Советчик перестает им интересоваться, и
            судьба дальнейших с ним отношений ему совершенно безразлична.
          </UiText>

          <UiText>
            Советчик часто хвастается тем, что кого-то «послал», кому-то
            отказал, кого-то выгнал, кого-то «надинамил».
          </UiText>

          <UiText>
            Советчик часто хвастается тем, что кого-то «послал», кому-то
            отказал, кого-то выгнал, кого-то «надинамил».
          </UiText>

          <UiText>
            Советчик умеет быстро оценить людей соответственно их возможностям и
            способностям.
          </UiText>

          <UiText>
            Всегда знает, от кого чего ожидать, кого для чего использовать.
            Обладает способностью увидеть в каждом человеке его наиболее
            уязвимую точку, его «ахиллесову пяту».
          </UiText>

          <UiText color="role">
            Великолепно умеет играть на слабостях других и пользуется этой
            способностью для достижения своих целей, выстраивая собственный
            механизм отношений, который и будет рассмотрен в следующем разделе.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">2 — Творческая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_people" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чувство</UiText>
              <UiText preset="body">Этика отношений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Характерная черта этики отношений Советчика — умение
            приспосабливаться к собеседнику, умение «настроиться на его волну»:
            качество, помогающее ему добиться расположения практически любого,
            даже самого некоммуникабельного человека и позволяет «заглянуть в
            душу» настолько глубоко, насколько это нужно для удовлетворения его
            собственного интереса.
          </UiText>

          <UiText color="role">
            Советчик наделен свойством «подбирать отмычки» к каждому человеку и
            к каждой душе — даже самой закрытой и загадочной. И для этого у него
            есть масса средств и способов.
          </UiText>

          <UiText>
            Способность бурно восхищаться и очаровываться каждым
            заинтересовавшим его человеком. Узнавать все о его привычках,
            интересах, увлечениях и с готовностью перенимать его стиль поведения
            и образ жизни.
          </UiText>

          <UiText>
            Способность соглашаться с мнением большинства и «старшинства»,
            приспосабливать к различным обстоятельствам и веяниям свою точку
            зрения.
          </UiText>

          <UiText preset="large" color="role">
            Умение увидеть в каждом человеке степень его уверенности и
            неуверенности в себе — качество, позволяющее ему великолепно
            манипулировать людьми, играть на их амбициях и комплексах.
          </UiText>

          <UiText>
            Умение предложить свои услуги и умение навязать их: заинтересовать
            человека своими возможностями, влиянием и связями.
          </UiText>

          <UiText>
            Хотя на самом деле, Советчик никого к своим связям и близко не
            подпустит — очень боится, что кто-то другой перехватит его
            счастливый случай, его выигрышный билет.
          </UiText>

          <UiText>
            И все же было бы ошибкой представлять Советчик этаким коварным
            интриганом, ловко использующим свои способности в корыстных целях.
            Такая форма отношений всего лишь реализует его программу и
            обеспечивает успех задуманному им мероприятию.
          </UiText>

          <UiText>
            Может ли Советчик предложить свою помощь просто так, из добрых
            побуждений? — Может! И очень часто это делает. Причем предложение
            его помощи нужно понимать именно как демонстрацию симпатий и
            доброжелательности к человеку, как выражение сочувствия к его
            проблемам.
          </UiText>

          <UiText color="role">
            Но реальную помощь Советчику оказывать не спешит. Более того, он уже
            начинает нервничать, когда человек еще только соглашается принять
            его предложение.
          </UiText>

          <UiText>
            В этом случае Советчик сразу же пугается взятого на себя
            обязательства, он начинает задумываться о трудностях, с которыми оно
            будет сопряжено, начинает опасаться излишнего расхода времени и сил,
            он уже не рад, что предложил свою помощь и, в свою очередь,
            обижается на человека за то, что тот так буквально понял его
            предложение.
          </UiText>

          <UiText color="role">
            Теперь ему уже начинает казаться, что этот посторонний человек от
            него слишком многого хочет. Стараясь как-то исправить создавшуюся
            неловкость, Советчик часто ставит дистанцию между собой и этим
            человеком: напускает на себя высокомерный вид, чем особенно
            подчеркивает ценность будущей услуги и дает тем самым понять, что за
            эту услугу ему будут слишком обязаны — короче, ведет себя с таким
            расчетом, чтобы человеку стало неудобно пользоваться его
            предложением и он либо откажется от своей просьбы, либо никогда
            больше о ней не напомнит.
          </UiText>

          <UiText>
            Советчик же со своей стороны не забывает о предложенной услуге и
            выполняет ее при первом же удобном случае, тогда, когда ему удаëтся
            подгадать для этого подходящий момент, когда ему это не стоит ни
            малейшего труда и как бы получается само собой.
          </UiText>

          <UiText>
            Еще одно, характерное для представителей этого типа этическое
            свойство: Советчик — непревзойденный мастер «крутить динамо»,
            причем, опять же, никакого преднамеренного коварства в этом не
            следует усматривать — это не более, чем способ отрегулировать
            психологическую дистанцию в формируемых им отношениях с целью
            вызвать к себе стабильный интерес со стороны партнера и испытать
            глубину его чувств.
          </UiText>

          <UiText>
            Причем, необходимость такого этического подхода определяется тем,
            что Советчик сориентирован на такого дуала, как Мастер, зачастую
            слишком быстро переводящего отношения из области этической в область
            чувственных удовольствий, удовлетворив которые он довольно быстро
            теряет интерес к партнеру.
          </UiText>

          <UiText>
            Поэтому такая тактика нужна в первую очередь именно Мастеру,
            поскольку постоянно подпитывает его интерес и стабилизирует его
            отношения. В противном случае, Мастеру вообще рискует остаться без
            партнера. Только проницательный и дальновидный Советчик способен
            составить ему во всех отношениях достойную пару.
          </UiText>

          <UiText color="role">
            Не следует усматривать злого умысла в поведении Советчик еще и
            потому, что изначальная доброжелательность входит в систему его
            этических ценностей, как, впрочем, и всех представителей четвертой
            квадры.
          </UiText>

          <UiText>
            Советчик знакомится с человеком, общается и поддерживает отношения с
            ним постольку, поскольку этот человек ему интересен и привлекателен.
            Проблемы начинаются тогда, когда Советчик теряет интерес к своему
            партнеру, что иногда происходит почти в самом начале его
            взаимоотношений.
          </UiText>

          <UiText>
            Спрашивается, как же должен выйти из щекотливой ситуации
            дальновидный и предусмотрительный Советчик, стремящийся за версту
            обходить всякие скандалы, не желающий наживать себе врагов и
            навлекать на себя чей-то гнев?
          </UiText>

          <UiText>
            Первая и единственная цель, которую он сразу же себе ставит, — всеми
            возможными средствами смягчить создавшуюся неловкость, замять ее.
            Любым способом успокоить человека, развеять его подозрения,
            наобещать ему все, что только придет в голову, и постараться убедить
            его в самых лучших своих намерениях.
          </UiText>

          <UiText color="role">
            Любым путем избежать ссоры и отложить выяснение отношений на
            неопределенный срок, надеясь, что впоследствии необходимость в
            разборке отпадет сама собой или будущее внесет в эту ситуацию свои
            коррективы.
          </UiText>

          <UiText>
            Стремление Советчик смягчить эмоциональное напряжение подсознательно
            связано с ориентацией на слабую и уязвимую эмоциональность его дуала
            Мастера. Именно поэтому он обычно старается не доводить отношения до
            откровенных раздоров и конфликтов.
          </UiText>

          <UiText>
            Но на этом ситуация не исчерпывается: отсутствие — интереса к
            партнеру у Советчик тоже непостоянно. Поэтому он никогда и никому не
            позволяет «исчезнуть насовсем». Независимо от того, на какую бы
            далекую дистанцию ни отбросил Советчик своего партнера, он всегда
            найдет повод напомнить о себе и возобновить отношения в той форме, в
            какой именно ему это удобнее всего.
          </UiText>

          <UiText>
            Для него это еще один способ отрегулировать дистанцию. Аналогичным
            способом «регулирует дистанцию» и Мастер — ему это необходимо для
            того, чтобы сбалансировать эмоциональный напор своего партнера.
          </UiText>

          <UiText>
            Советчик старается ни при каких обстоятельствах не оставаться в
            одиночестве, одинокий человек выглядит неудачником, а это
            отталкивает от него всех окружающих, и, соответственно, лишает
            шансов на успех.
          </UiText>

          <UiText>
            В силу этих причин, а также ввиду своей исключительной
            коммуникабельности, Советчик предпочитает иметь запасные варианты
            партнеров для любой формы отношений.
          </UiText>

          <UiText>
            «Запасные варианты» партнеров в этической игре Советчик с его дуалом
            Мастером выполняют функцию «отвлекающего маневра»: Мастеру неудобен
            партнер, целиком и полностью зацикливающийся на нем. Такая форма
            отношений ему кажется слишком обременительной, в то время как
            отношения с «запасным вариантом« его, с одной стороны, несколько
            успокаивают, а с другой стороны — усыпляют его бдительность, чем и
            подготавливают его для новых этических уловок Советчика.
          </UiText>

          <UiText>
            По той же причине Советчик иногда создает миф о «запасном варианте»,
            создает «призрак соперника». Например, любит знакомить своих
            «поклонников» друг с другом «сталкивать их лбами», придя на свидание
            к одному, рассказывать про свои чувства и отношение к другому.
          </UiText>

          <UiText>
            Зачем? — затем, что опять же запрограммирован на взаимоотношения с
            Мастером, которого именно такая этическая «игра» приятно тонизирует,
            интригует и возбуждает; который к вопросам этики отношений иногда
            подходит еще и с таким рассуждением:
          </UiText>

          <UiText color="accent">
            «Если у этой женщины никого нет, значит, она никому не нужна, а раз
            так, зачем она мне?»
          </UiText>

          <UiText>
            И еще один повод, заставляющий Советчик заводить одновременно
            несколько поклонников: при любых обстоятельствах, Советчик старается
            не сосредотачивать все свое внимание на одном партнере. Вспомним,
            Мастер не любит, чтобы на нем зацикливались.
          </UiText>

          <UiText>
            Поэтому Советчик заводит несколько партнеров, чтобы каждый из них
            чувствовал себя немного «обделенным». Если, к примеру, Советчик
            удалось завести только одного партнера, остальные придумываются, но
            реальный партнер опять же должен чувствовать некоторый недостаток
            внимания.
          </UiText>

          <UiText preset="large" color="role">
            Представители этого типа часто производят впечатление крайне
            легкомысленных и непостоянных в своих привязанностях людей,
            провоцирующих сближение отношений, но в последний момент старающихся
            избежать физической близости.
          </UiText>

          <UiText color="role">
            Такая непоследовательность тоже объяснима: Советчик не задает четкую
            дистанцию своим отношениям - он как бы одновременно и близок и
            далек, создавая таким образом некоторую неопределенность и
            недосказанность в отношениях.
          </UiText>

          <UiText>
            Такая форма поведения создает удобный психологический режим его
            дуалу Мастеру, который не переносит жестких, ограниченных заданной
            дистанцией отношений.
          </UiText>

          <UiText>
            Кроме того, Советчик обожают рискованные приключения, любят
            усложнять этическую ситуацию до предела и выходить из нее самым
            неожиданным образом. Зачем им это нужно?
          </UiText>

          <UiText>
            Это одно из требований их программной функции, их интуитивной
            программы — поиск границ собственных этических возможностей, а также
            расширение этих границ. И это то, чем Советчик занимаются постоянно
            в любой этической (и не только этической) ситуации.
          </UiText>

          <UiText>
            Чем же объясняется стремление Советчик в некоторых случаях избегать
            физической близости? — Опять же подсознательной ориентацией на
            Мастера, довольно быстро пресыщающегося неумеренными чувственными
            отношениями (а, как известно, состояние пресыщенности вызывает у
            Мастера неприятные ощущения, которых он стремится всячески
            избегать).
          </UiText>

          <UiText>
            Кроме того, Советчик — интуит, дальновидный и предусмотрительный.
            Поэтому перспективное развитие отношений в нужном направлении для
            него важнее удовлетворения своих сегодняшних потребностей в
            ощущениях и чувствах.
          </UiText>

          <UiText>
            Отсюда и некоторые стереотипы его поведения: «Женщина должна быть
            загадочной и недоступной. Если она слишком быстро уступит мужчине,
            он потеряет к ней всякий интерес и она снова останется одна». А
            этого Советчик всегда боится.
          </UiText>

          <UiText>
            Этика отношений Советчика в любом случае и при любых обстоятельствах
            в первую очередь выполняет одно из основных требований его
            интуитивной программы — поиск новых лучших и перспективных
            возможностей, для чего ему очень важно не оставаться в одиночестве и
            не обрубать уже завязавшиеся контакты и отношения, а использовать их
            для поисков других вариантов и для новых возможностей.
          </UiText>

          <UiText>
            Это еще одна причина, по которой Советчик старается не доводить
            отношения до окончательного разрыва, а оставаться со своими бывшими
            партнëрами в «товарищеских» отношениях: обращаются к ним за помощью,
            если таковая потребуется, в момент осложнения отношений с очередным
            партнером — выплакиваются им в «жилетку», привлекают их к решению
            своих текущих проблем, пользуются их связями, общаются с их друзьями
            и знакомыми.
          </UiText>

          <UiText color="accent">
            Одного из представителей этого типа спросили: мог бы он отдать жизнь
            за ночь, проведенную с любимой женщиной? — Нет, не мог бы, — ответил
            он, — потому, что тогда бы я изменил своему главному принципу:
            оставаться с бывшими возлюбленными в дружеских отношениях. А какой
            же я буду друг, если я умру?
          </UiText>

          <UiText>
            Советчик не исключают «дружбы» между мужчиной и женщиной.
            Предложение своей «дружбы» для Советчика, на самом деле, очень
            тонкая и расчетливая «этическая игра», суть которой заключается
            опять же в том, чтобы установить нужную психологическую дистанцию с
            партнером.
          </UiText>

          <UiText preset="large" color="role">
            Под «дружбой» Советчик обычно подразумевают определенные этические
            перспективы, подавая в то же время намек на многообещающие и далеко
            идущие отношения.
          </UiText>

          <UiText>
            Такая этическая игра, как, впрочем, и вся этика Советчик, строится в
            подсознательном расчете на слабую и уязвимую этику его дуала
            Мастера, которого любая открытая и прямолинейная форма отношений
            пугает и отталкивает.
          </UiText>

          <UiText>
            Именно та «этическая паутина» которую плетет Советчик,
            представляется Мастеру наиболее привлекательной, заманчивой,
            интригующей и в то же время ни к чему не обязывающей формой
            отношений.
          </UiText>

          <UiText color="role">
            А то, что в эту «паутину» попадают представители других
            психологических типов, Советчик, конечно же, никоим образом не
            виноват.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">3 — Ролевая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_will" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Воля</UiText>
              <UiText preset="body">Волевая сенсорика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Представители этого типа обожают развивать у себя волевые качества.
            Часто разыгрывают роль волевых, деспотичных, настойчивых в
            достижении цели людей. Любят и умеют «показывать характер».
          </UiText>

          <UiText>
            Уступчивость и деликатность своей манипулятивной этики отношений,
            равно как и все связанные с эти потери, они компенсируют, развивая в
            себе способность к волевому воздействию и волевой защите, учатся
            отказывать и отказываться, учатся говорить «нет».
          </UiText>

          <UiText>
            По своей творческой, манипулятивной этики отношений представители
            этого типа очень боятся кого-нибудь обидеть своим отказом, навлечь
            на себя чей-то гнев, чью-то ненависть, нажить себе новых врагов,
            именно по этой причине им намного легче, обходя «острые углы»,
            морочить голову обещаниями, чем отказать напрямую.
          </UiText>

          <UiText>
            Говорить в категоричном тоне им довольно трудно, как и всё, что
            требует больших волевых затрат и большого расхода сил.
          </UiText>

          <UiText color="role">
            Поэтому любая попытка предъявить настойчивые требования в их
            интерпретации выглядит откровенным занудством: «Ну, сделай то, о чем
            я тебя прошу! Ну, пожалуйста, ну послушайся меня… ».
          </UiText>

          <UiText>
            Встречая отказ, становятся агрессивны, жестокими, неуступчивыми. При
            том, что осуждают агрессию, как и любую форму насилия, сами
            разумеется, из «добрых побуждений», используют насильственные методы
            воздействия там, где им не удаётся добиться желаемого мирными
            средствами.
          </UiText>

          <UiText preset="large" color="role">
            В вопросах самодисциплины и самоорганизации показывают далеко не
            лучших.
          </UiText>

          <UiText color="role">
            Им редко удаётся быть обязательными, ответственными, поэтому
            стараются избегать излишней нагрузки, предпочитают не брать на себя
            лишних обещаний, поскольку и взятые на себя часто выполняют с
            трудом, стараются уклоняться от ответственности, насколько это
            бывает возможно.
          </UiText>

          <UiText>
            Им трудно быть пунктуальными, просто потому, что бывает трудно
            своевременно сделать над собой волевое усилие, чтобы собраться и
            выйти в положенное время. Им трудно сделать над собой волевое
            усилие. Им приятнее жить в мягкой расслабленной обстановке, не
            требующей от них никаких усилий, холить и лелеять себя, предаваясь
            приятному созерцанию или размышлению.
          </UiText>

          <UiText>
            Но при этом наработка волевых качеств, процесс воспитания силы воли,
            целеустремленности, выносливости, физическое развитие — темы,
            постоянно занимающие их внимание, причем даже несколько
            демонстративно.
          </UiText>

          <UiText color="role">
            Разговоры, касающиеся этих тем, они, как правило, с удовольствием
            поддерживают. Любят рассказывать о своих достижениях в области
            физического развития, обмениваться сведениями и рекомендациями о
            всевозможных развивающих и укрепляющих гимнастиках.
          </UiText>

          <UiText preset="large" color="role">
            Советчик, нимало не смущаясь присутствием посторонних, могут делать
            «развивающие и общеукрепляющие» упражнения прямо на рабочем месте,
            не прекращая производственного процесса.
          </UiText>

          <UiText>
            Причем они обожают рекомендовать такой метод «физического развития»
            и окружающим: «Если ты работаешь за компьютером, ты должен каждые 15
            минут делать гимнастику для глазных мышц… »
          </UiText>

          <UiText>
            На возражение по поводу неспособности или нежелания совмещать работу
            с гимнастикой реагируют крайне обиженно, как если бы они предлагали
            нечто абсурдное. Впрочем, некоторые их предложения многими именно
            так и воспринимаются.
          </UiText>

          <UiText>
            Советчик обожают вычитывать в журналах рекомендации об эффективном
            физическом развитии ценой минимальной затраты времени и усилий и
            восторженно делятся своими познаниями с окружающими.
          </UiText>

          <UiText preset="large" color="role">
            Любят говорить о выносливости и жизнестойкости. Часто приводят в
            пример себя. С удовольствием поучают «искусству» отстаивать свои
            права и настаивать на своем. Причем, сами в бой с ветряными
            мельницами предпочитают не ходить.
          </UiText>

          <UiText>
            Нельзя сказать, что такое «преподавание» им дается легко. Напротив,
            требует огромного расхода сил и энергии. Сам Советчик в такую минуту
            очень напряжен, мысленно он уже воюет. Независимо от того, требует
            ли данная ситуация отстаивания своих прав или нет, Советчик уже
            мысленно «проигрывает» ее именно в боевом варианте и часто именно на
            такой ее развязке настаивает, хотя по своей природе довольно
            миролюбив.
          </UiText>

          <UiText>
            У представителей этого типа иногда возникает желание испытать свои
            бойцовские качества, но не в реальной ситуации, а как бы в чуть-чуть
            игрушечной. Поэтому они иногда неожиданно для себя могут
            спровоцировать чью-то ссору, могут начать дразнить, могут полушутя
            ударить, но при столкновении с настоящим задирой они безусловно
            проигрывают. Поэтому, чувствуя силовой перевес противника, не прочь
            заручиться поддержкой сильного и влиятельного союзника.
          </UiText>

          <UiText>
            Советчик очень уважает сильных людей, всегда мечтает о сильном и
            надежном партнере.
          </UiText>

          <UiText preset="large" color="role">
            Сам Советчик не всегда удачно выступает чьим-либо защитником: если
            видит, что его «подзащитный» имеет слишком влиятельных противников,
            постарается выйти из ситуации без ущерба для себя.
          </UiText>

          <UiText>
            При необходимости самому дать отпор чувствует себя неуютно.
            Защищаясь, суетится, раздражается, демонстративно обижается, ведет
            себя очень противоречиво и непредставительно.
          </UiText>

          <UiText>
            Любит строить свою защиту, ссылаясь на авторитеты. Всегда обижается,
            если его советами откровенно пренебрегают, а его собственный
            авторитет ни в грош не ставят.
          </UiText>

          <UiText>
            «Последнее слово» в споре Советчик стараются оставить за собой и
            очень переживают, если это не удаëтся.
          </UiText>

          <UiText>
            «Последнее слово» Советчик иногда выглядит откровенно неэтичным -
            иногда это то, что называется «запрещенный прием» или удар «ниже
            пояса». Но Советчик это обстоятельство не смущает: главное для него
            победить в споре, а какой ценой — не всегда важно.
          </UiText>

          <UiText preset="large" color="role">
            Часто напускают на себя надменный и высокомерный вид, не прочь
            поблефовать, намекая на свои влиятельные связи.
          </UiText>

          <UiText>
            Наличие дипломов, аттестатов, чинов и наград всегда производит на
            них неотразимое впечатление:
          </UiText>

          <UiText color="accent">
            «Я думала он приличный человек — все-таки имеет высшее образование…
            »
          </UiText>

          <UiText color="role">
            Любят, но не всегда умеют, брать на себя роль лидера. Готовят себя к
            экстремальной ситуации, иногда ее мысленно про себя проигрывают, но
            в условиях реальных трудностей долго сохранять хладнокровие и
            собранность не могут, часто распыляются на показную суету.
          </UiText>

          <UiText>
            Любят демонстрировать свою решительность и физическую силу. Часто с
            демонстративной готовностью берутся за непосильные нагрузки, но
            потом довольно быстро находят способ от них избавиться.
          </UiText>

          <UiText preset="large" color="role">
            Любят ощущать свою силу — это их приятно возбуждает и тонизирует.
          </UiText>

          <UiText>
            Будучи наделенными властью, склонны ею злоупотреблять. Любят
            демонстративно командовать. Иногда им нравится разыгрывать роль
            жестокого и неумолимого человека.
          </UiText>

          <UiText>
            Упрямы. При всей внешней мягкости и доброжелательности, становятся
            непримиримыми и неуступчивыми там, где что-либо угрожает их
            интересам.
          </UiText>

          <UiText>
            Очень снисходительны и недостаточно требовательны к себе. Не всегда
            любят отвечать за свои слова и поступки. Не признают свою вину даже
            там, где она очевидна. часто переносят свою вину на других.
          </UiText>

          <UiText color="role">
            Боятся боли и физических наказаний, и, вследствие этого, в рамках
            развития в себе выносливости и волевых качеств, стремятся воспитать
            в себе нечувствительность к боли, пытаются приучить себя к боли или
            даже найти в ней удовольствие, хотя чаще это выражается в
            пренебрежении к физическим страданиям других.
          </UiText>

          <UiText color="accent">
            Так, например, в одной семье, мать-Советчик, врач по профессии,
            запрещала своим детям и внукам пользоваться обезболивающими
            средствами, приучая их терпеть боль, какой бы сильной она ни была.
          </UiText>

          <UiText color="accent">
            Потом она запретила им принимать антибиотики, даже если их
            прописывали, потом запретила им пользоваться асептическими
            средствами, чем принесла огромный вред их здоровью. И даже сделав
            свою дочь и внука инвалидами, не признавала своей вины.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">4 — Болевая функция.</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_logic" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Теория</UiText>
              <UiText preset="body">Структурная логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Советчик теряет интерес к любому предмету, лишь только его
            любопытство хотя бы поверхностно удовлетворено.
          </UiText>

          <UiText color="role">
            Причем возбудить этот интерес или как-то углубить его уже
            невозможно: эта тема, по мнению Советчика, уже достаточно им изучена
            и он не собирается к ней возвращаться, тем более, что на свете есть
            так много нового и неизученного.
          </UiText>

          <UiText>
            Советчик очень боятся упустить какие-то новые возможности. Поэтому
            не позволяют себе «застревать» на том, что для них уже «пройденный
            этап».
          </UiText>

          <UiText>
            Единственный способ удержать интерес Советчик — это все время
            «подогревать» его любопытство: распалять воображение, интриговать,
            обнадеживать, постоянно что-то недосказывать. Словом, «держать на
            крючке», что, собственно, и делает его дуал Мастер.
          </UiText>

          <UiText>
            Советчик очень непоследователен в своих поступках и рассуждениях.
            Причем лично у себя не считает это недостатком — ему так удобно,
            поэтому он так и поступает, но ему неудобно, когда так поступают
            другие.
          </UiText>

          <UiText>
            Иногда у Советчик возникает непреодолимый интерес к анализу
            несущественных частностей, причем ему эти частности кажутся
            сверхзначимыми и необходимыми для глубокого и сиюминутного понимания
            сути. Вследствие чего он уводит объяснение в сторону, а иногда
            вообще разбивает его, задавая несвоевременные или неуместные вопросы
            и при этом настойчиво требуя ответа на них.
          </UiText>

          <UiText>
            Причем сама постановка вопроса иногда бывает настолько абсурдной и
            нелепой, что объясняющий даже не всегда знает, как на нее
            прореагировать.
          </UiText>

          <UiText color="role">
            Интуитивно постигая смысл многих логических понятий и категорий,
            Советчик часто имеет о них довольно поверхностное представление.
            Поэтому иногда ставит себя в неловкое положение, высказывая явно
            абсурдные вещи самым безаппеляционным тоном.
          </UiText>

          <UiText>
            Причем «нетривиальная» точка зрения Советчика способна поставить в
            тупик даже самого опытного и квалифицированного преподавателя, тем
            более, что для представителей этого типа очень характерна
            способность затевать диспут в самое неподходящее время.
          </UiText>

          <UiText>
            Часто испытывает трудность в объяснении каких-либо элементарных
            понятий. Но еще более затрудняется объяснить сложное явление
            простыми средствами.
          </UiText>

          <UiText color="accent">
            Вот пример того, как представитель этого типа объяснял
            четырехлетнему ребенку природу грома и молнии: «Плывет облако,
            допустим, со знаком «плюс», а навстречу ему другое - со знаком
            «минус», а потом они сталкиваются, и получаются гром и молния.»
          </UiText>

          <UiText color="role">
            Иногда Советчик начинает свое объяснение слишком подробно и
            обстоятельно, но впоследствии сам теряет к нему интерес и продолжает
            объяснять уже более обобщенно. Часто он запутывается в собственных
            объяснениях, нервничает и обижается на свою тугодумную аудиторию.
          </UiText>

          <UiText>
            И тем не менее представители этого типа очень любят «все объяснять».
            Например, попав в затруднительное положение, часто говорят: «Я вам
            сейчас все объясню!» И начинают объяснять по порядку.
          </UiText>

          <UiText>
            «По порядку» — это значит издалека. То есть: сначала подробно
            описываются какие-то побочные и малозначащие обстоятельства «моей
            племянницы мужа троюродного брата сослуживец», далее этим побочным
            «обстоятельствам» дается «интуитивная» характеристика «во всех
            отношениях неудачник».
          </UiText>

          <UiText color="role">
            Попытка подвести Советчика к самой сути изложения обычно ни к чему
            не приводит — он только раздражается, нервничает, просит дать ему
            высказаться «по порядку», а там начинается все сначала.
          </UiText>

          <UiText>
            Всегда интересно послушать Советчика, объясняющего месторасположение
            какого-нибудь объекта. Советчик обычно описывает расположение всех
            ближайших объектов и относительно их ориентирует: «Справа, в ста
            метрах увидишь обувной магазин, но туда не сворачивай — поворачивай
            налево… » Советчик может и карту нарисовать, но она будет слишком
            подробной и слишком запутанной.
          </UiText>

          <UiText preset="large" color="role">
            Очень боятся что-нибудь перепутать, но именно это чаще всего и
            происходит. Причем путаются они именно в тех вещах, которые им
            кажутся достаточно легкими для понимания и запоминания.
          </UiText>

          <UiText color="role">
            Советчик болезненно воспринимают любое обвинение в нелогичности и
            непоследовательности. Обижаются, когда критикуют их умственные
            способности.
          </UiText>

          <UiText>
            Многие из них с удовольствием работают на интеллектуальном поприще.
            Увлекаются философией и сами не прочь порассуждать на отвлеченные
            темы. Часто высказываются в форме изречений. Некоторые из
            представителей этого типа любят записывать свои изречения в тетрадь,
            цитировать их окружающим и опубликовывать в газете.
          </UiText>

          <UiText>
            Любят высказывать свои рассуждения с самым многозначительным видом:
            «Если женщина хочет показаться интересной, она должна быть
            непредсказуемой и непонятной.»
          </UiText>

          <UiText>
            Советчик любят производить впечатление своими высказываниями, причем
            им в этом очень помогает их обычный самоуверенный тон. Часто в их
            рассуждениях присутствует преувеличенная, ложная,
            многозначительность, способная придать «значимость» самым
            тривиальным и примитивным по смыслу высказываниям:
          </UiText>

          <UiText color="accent">
            «В жизни каждой женщины бывает нечто такое, о «чем она не может
            рассказать ни одному мужчине».
          </UiText>

          <UiText>
            Ложная многозначительность у представителей этого типа присутствует
            не только в интонациях, но и в выражении лица — в «многообещающем»
            взгляде и в «загадочной» улыбке.
          </UiText>

          <UiText>
            Но в том-то и проявляется «нелогичность» выражаемых ими эмоций, что
            ни взгляд, ни улыбка не отражают их истинных намерений, и вообще
            никоим образом с ними не связаны.
          </UiText>

          <UiText>
            Советчик великолепно наблюдает и анализирует чужие эмоции, но только
            не свои собственные. Он может сколько угодно откровенно и призывно
            смотреть на представителей противоположного пола, но при этом
            абсолютно не давать себе отчета в своем поведении, этика эмоций
            реализуется у него подсознательно.
          </UiText>

          <UiText>
            Поэтому для него будет искренней и полной неожиданностью обвинение в
            том, что своим поведением он дает повод для ревности.
          </UiText>

          <UiText>
            Один только Мастер — его дуал, воспринимает поведение Советчика
            адекватно. Любой намеренный или «нечаянный» намек он видит и
            воспринимает именно в том значении, в каком он подаëтся.
          </UiText>

          <UiText>
            Никакой нелогичности в поведении Советчика Мастер не наблюдает —
            видит только тонкую и красивую этическую игру. Даже тогда, когда
            Советчик с очаровательной непосредственностью пытается объяснить
            всякие премудрости, Мастера это только умиляет.
          </UiText>

          <UiText>
            Свойственная Советчик путаная манера изложения его приятно
            расслабляет и успокаивает: он прекрасно понимает, что логический
            аспект информации Советчика — это всего лишь второстепенный план
            отношений, главное - этический аспект, который за всем этим стоит.
            Поэтому логическую путаницу Советчика Мастер воспринимает как своего
            рода оформление его этической игры.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">5 — Внушаемая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_comfort" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Комфорт</UiText>
              <UiText preset="body">Сенсорика ощущений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Проявляет живейший интерес к любой информации по этому аспекту.
            Любые новости культуры, искусства, спорта и здоровья чрезвычайно
            занимают представителей этого типа.
          </UiText>

          <UiText>
            На свое самочувствие обычно не жалуются, но о предпринимаемых
            профилактических мерах говорят охотно и во всеуслышание.
          </UiText>

          <UiText color="role">
            Советы о здоровье воспринимают внимательнейшим образом, и однажды
            приняв для себя какую-то рекомендацию, стараются ей неукоснительно
            следовать.
          </UiText>

          <UiText>
            Со вкусом у представителей этого типа далеко не все обстоит
            благополучно, хотя они считают своим долгом внимательно следить за
            модой и тщательно выполнять все эстетические рекомендации.
          </UiText>

          <UiText>
            В вопросах эстетики очень внушаемы. Причем раз внушенное
            воспринимается ими как аксиома. Поэтому иногда Советчик отличаются
            некоторой консервативностью вкусов, которая самым неожиданным
            образом уживается с присущей им оригинальностью.
          </UiText>

          <UiText preset="large" color="role">
            В одежде стараются придерживаться «собственного стиля», который
            далеко не всегда бывает удачен.
          </UiText>

          <UiText color="role">
            Часто в их облике наблюдается явная нелогичность, как, например,
            фетровая шляпка и замшевые сапоги в 30-градусную жару.
          </UiText>

          <UiText>
            Такое «сочетание» вполне объяснимо с точки зрения Советчика,
            поскольку составилось в соответствии с требованием «цветовой гаммы»
            выбранного наряда, а то, что при этом испытываются не самые приятные
            ощущения, не важно: «красота требует жертв».
          </UiText>

          <UiText>
            У представительниц этого типа наблюдаются трудности с использованием
            косметики: они либо совсем ею не пользуются «естественность — лучшая
            красота», либо используют самым невыгодным для себя образом. Также и
            с окраской волос: могут красивый, естественный цвет поменять на
            какую-то ярко выраженную химию — только потому, что именно это
            сейчас «носят».
          </UiText>

          <UiText>
            Интерьер в их доме тоже организовывается далеко не лучшим образом:
            как правило, перегружен, часто захламлен. Иногда ему присущ этакий
            «цыганский», аляповатый стиль. Порядок в доме Советчик наводить не
            любит, часто делает это в силу привычных обязанностей, но внутренней
            потребности к эстетике и порядку не испытывает. За исключением
            самодуализированных представителей этого типа.
          </UiText>

          <UiText preset="large" color="role">
            В изобразительном искусстве также проявляют себя далеко не всегда
            удачно. Возникают проблемы с ощущением цвета, формы и линии. Часто
            используют сочетания слишком насыщенных цветов, или наоборот —
            однообразно тусклых.
          </UiText>

          <UiText color="accent">
            Любят использовать те цветовые сочетания, которые, по их мнению,
            считаются удачными: красное-белое-черное либо
            фиолетовое-синее-серое.
          </UiText>

          <UiText>
            В вопросах эстетики, рационального комфорта, в организации удобного
            неперегруженного интерьера, в вопросах кулинарии, основанной на
            полезных диетах, в организации быта, сочетающего разумный режим
            работы и отдыха, во всех этих вопросах у Советчика есть единственно
            подходящий советчик — его дуал Мастер.
          </UiText>

          <UiText>
            Потому что именно на его «программную» сенсорику Советчик
            подсознательно сориентирован. Мнение других сенсориков ему
            представляется неубедительным и малоавторитетным.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">
            6 — Активационная функция
          </UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_business" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Практика</UiText>
              <UiText preset="body">Деловая логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Увлекается любой возможностью проявить свою практичность. С
            интересом относится к практическим рекомендациям в журналах и
            телепередачах. Прежде чем выбросить вещь, подумает, нельзя ли
            переделать ее во что-нибудь нужное. Иногда может ее подарить
            кому-нибудь именно с этой целью.
          </UiText>

          <UiText color="role">
            Частый посетитель «комиссионок» и дешевых распродаж. Вещь,
            выставленная по дешевой цене, в глазах Советчик становится резко
            привлекательной, причем в эту минуту он совершенно не думает о ее
            заниженных эстетических качествах, а принимает во внимание только ее
            функциональные свойства, которые, впрочем, не всегда считает нужным
            проверить.
          </UiText>

          <UiText>
            Таким образом, у «практичного» Советчик иногда скапливается огромное
            количество дешевых и малопривлекательных вещей, к которым он почти
            сразу теряет интерес и настойчиво предлагает их в качестве подарка
            или «выгодной» покупки своему окружению. Причем Советчик не был бы
            «практичным» человеком, если бы не проверял, пользуются его подарком
            или нет. Если не пользуются, следует этот подарок ему вернуть: он
            будет передарен кому-нибудь другому.
          </UiText>

          <UiText preset="large" color="role">
            За новую работу берется с энтузиазмом, но быстро теряет к ней
            интерес. В работу предпочитает включаться без подготовки.
            Подготовительный процесс его расхолаживает.
          </UiText>

          <UiText color="role">
            Если подготовка к работе сопряжена с какими-то физическими усилиями,
            уборкой, перестановкой мебели и другими скучными или утомительными
            делами, начинает суетиться, раздражаться — словом, подсознательно
            ведет себя таким образом, чтобы эту часть работы сделал за него
            кто-то другой.
          </UiText>

          <UiText>
            Как уже говорилось, представителям этого типа трудно сделать над
            собой волевое усилие, трудно быть обязательным, трудно работать
            долгое время на одном месте в условиях жесткого рабочего графика.
          </UiText>

          <UiText>
            Утвердившись на новом месте, Советчик, как правило, обговаривает для
            себя более выгодные условия работы. Предпочитает гибкий график или
            ненормированный рабочий день. Вообще такое понятие, как трудовая
            дисциплина, очень усложняет его жизнь.
          </UiText>

          <UiText>
            В процессе работы Советчик может, и любит, часто отвлекаться,
            способен выполнять одновременно самые различные обязанности. И это
            не кажется ему обременительным.
          </UiText>

          <UiText color="role">
            Радуется случаю изобрести новую методику. Обожает инструктировать
            «по собственной методике». Причем очень обижается, если его метод
            вызывает критику или просто отвергается без видимой причины.
          </UiText>

          <UiText preset="large" color="role">
            В работе старается достичь высокого профессионализма, но только если
            это не требует слишком больших усилий.
          </UiText>

          <UiText>
            Не любит прорабатывать детали. Любая нудная и кропотливая работа его
            раздражает. Терпеть не может дорабатывать, переделывать и исправлять
            уже сделанную работу.
          </UiText>

          <UiText>
            Представители этого типа любят совмещать рабочий процесс со всякими
            мышечными и дыхательными гимнастиками. Иногда любят петь на рабочем
            месте, шутить, рассказывать анекдоты. Слишком молчаливое и серьезное
            окружение их обычно раздражает.
          </UiText>

          <UiText preset="large" color="role">
            Советчик трудно долгое время быть внимательным, собранным и
            сосредоточенным.
          </UiText>

          <UiText color="role">
            Уборку рабочего места делают только в силу необходимости. В конце
            рабочего дня Советчик обычно из последних сил расшвыривает по местам
            свои рабочие инструменты и то, если только профессия к этому
            обязывает.
          </UiText>

          <UiText>
            Столкнувшись с необходимостью сделать какую-либо неприятную или
            неинтересную работу, Советчик в первую очередь размышляет, кому бы
            можно было ее перепоручить.
          </UiText>

          <UiText>
            Для представителей этого типа свойственно запускать и запутывать
            свои дела таким образом, что они «вырастают» в, казалось бы,
            совершенно неразрешимую проблему.
          </UiText>

          <UiText>
            В этой ситуации Советчик очень выручает его дуал — спокойный и
            рассудительный Мастер, способный с завидным терпением и
            настойчивостью разобраться в самом сложном и запутанном деле.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">7 — Функция защиты</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_time" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чутьё</UiText>
              <UiText preset="body">Интуиция времени</UiText>
            </span>
          </div>
          <UiText preset="large" color="role">
            Советчик постоянно наблюдает, сколько времени требует достижение
            поставленной им задачи или реализация выбранной им возможности.
            Любая идея кажется ему бесперспективной, если ее реализация требует
            слишком большого расхода времени.
          </UiText>

          <UiText color="accent">
            Полгода здесь работаю, и хоть бы кто меня заметил!
          </UiText>

          <UiText>
            И именно за этим следит его «наблюдательная функция», именно с
            негативных позиций она подаëт информацию его «программной» интуиции
            потенциальных возможностей.
          </UiText>

          <UiText>
            Еще одна область наблюдения Советчика — темпы развития его
            взаимоотношений с людьми. Он всегда наблюдает за тем, насколько
            быстро ему удаëтся расположить к себе человека. Для Советчика это
            очень важный показатель.
          </UiText>

          <UiText preset="large" color="role">
            Советчик постоянно следит за тем, чтобы в интересующих его
            взаимоотношениях дистанция сокращалась именно в том темпе, в каком
            ему это нужно. Умеет сколько угодно долго создавать иллюзию близких
            отношений, оставаясь по сути на позициях стороннего наблюдателя.
          </UiText>

          <UiText>
            У Советчика есть свои способы регулирования темпов сокращения и
            увеличения психологической дистанции. Как, например, назначить
            свидание и не прийти на него; заставить партнера понапрасну себя
            дожидаться, а затем как ни в чем не бывало позвонить и уверять в
            своем горячем желании встретиться.
          </UiText>

          <UiText>
            Было бы ошибкой объяснять такое поведение обычной для Советчика
            нелогичностью. И еще ошибочнее думать, что Советчик игнорирует
            фактор времени — этого вообще не может быть, поскольку Советчик —
            интуит, и фактор времени входит в систему его ценностей.
          </UiText>

          <UiText>
            Поэтому в его поведении можно усматривать именно глубокий
            интуитивно-этический смысл — намерение охладить распаленные чувства
            партнера, затем подогреть их, если они поостыли, и так «охлаждать» и
            «подогревать» их до тех пор, пока не отрегулируется определенная,
            удобная ему дистанция взаимоотношений.
          </UiText>

          <UiText>
            Во взаимоотношениях с его дуалом Мастер этот метод оказывает
            решающее позитивное действие, поскольку Мастер «сокращает» дистанцию
            примерно аналогичным способом: с самым невозмутимым видом чередует
            сближение и отдаление.
          </UiText>

          <UiText color="role">
            Поэтому в результате такого своеобразного взаимодействия друг с
            другом оба партнера довольно быстро убеждаются в том, что во всех
            отношениях они друг друга достойны, после чего можно считать их
            дуализацию на первом этапе завершенной.
          </UiText>

          <UiText preset="large" color="role">
            Отношение к расходу времени у Советчика зависит от отношения к
            субъекту, это время расходующему. Если Советчик дорожит отношениями
            с человеком, он дорожит и его временем.
          </UiText>

          <UiText>
            Как правило, не любит ограничивать себя во времени, особенно, если
            оно расходуется на удовлетворение его собственных интересов и
            удовольствий.
          </UiText>

          <UiText color="accent">
            Например, если ему захотелось пообщаться именно тогда, когда
            интересующий его человек стеснен временем, о чем ему недвусмысленно
            намекается, это обстоятельство нисколько его не смутит, и общение
            будет продолжаться до тех пор, пока у Советчика не иссякнет интерес
            к собеседнику.
          </UiText>

          <UiText color="role">
            Другое дело, когда он сам куда-нибудь торопится, особенно, если это
            важная встреча: в этом случае он нервничает, неоднократно напоминает
            о том, что скоро должен уйти, — словом, приятного общения не
            получается.
          </UiText>

          <UiText>
            Не любит, когда его заставляют ждать, но не видит большой беды в
            том, чтобы заставить ждать других. Обычная ситуация: собравшиеся
            друзья ждут его за накрытым столом, а Советчик в этот момент звонит
            по телефону и сообщает, что вот он сейчас уже выходит.
          </UiText>

          <UiText>
            Обычно Советчик всегда планирует выйти вовремя, но в последнюю
            минуту обычно возникают различные обстоятельства, требующие от него
            непредвиденного расхода времени.
          </UiText>

          <UiText color="accent">
            Бывает и такая, очень характерная ситуация: студентка-Советчик
            приходит на лекцию с получасовым опозданием и через 15 минут просит
            разрешения уйти домой, поскольку, как ей кажется, оставила на плите
            чайник.
          </UiText>

          <UiText preset="large" color="role">
            Советчик не всегда отдает себе отчет о расходе собственного времени.
            Ему легче контролировать время, расходуемое не самым интересным и не
            самым приятным для себя образом.
          </UiText>

          <UiText>
            О продуктивности израсходованного времени вспоминает редко, и только
            тогда, когда отмечает для себя какие-то свои достижения: «Я сегодня
            за шесть часов работы выполнил полторы нормы!»
          </UiText>

          <UiText color="role">
            Старается не ставить себе далеких целей и не строить далеко идущих
            планов. Его собственные планы меняются в зависимости от
            обстоятельств, но их переменчивость и непоследовательность, как уже
            говорилось, его мало смущает.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">8 — Фоновая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_emotions" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Желание</UiText>
              <UiText preset="body">Этика эмоций</UiText>
            </span>
          </div>

          <UiText>
            Поскольку Советчик подсознательно сориентирован на болезненно
            восприимчивого к эмоциональному воздействию Мастера, он выражает
            свои эмоции в той форме, в какой всего удобнее воспринимать их его
            дуалу, как бы понарошку, как бы полусерьезно и слегка театрально.
          </UiText>

          <UiText>
            Причем такой характер эмоций у Советчика выражается именно
            подсознательно - обстоятельство, особенно мешающее представителям
            других психологических типов воспринимать чувства Советчика в той
            мере, в какой они значимы для него самого.
          </UiText>

          <UiText>
            У всех, кроме Мастера, создается впечатление, что эмоции Советчика
            неадекватны ситуации, на которую он реагирует. Многим он кажется
            притворщиком, кривлякой, подхалимом — кем угодно, только не самим
            собой. То, что Советчик как бы демонстрирует свои эмоции, — это всем
            видно и всем понятно.
          </UiText>

          <UiText color="role">
            Видно, что он как бы выносит их на обозрение, видно, что всегда
            наблюдает за производимым впечатлением. Но трудно себе представить,
            что все это он делает неосознанно. И в то же время именно это и
            происходит.
          </UiText>

          <UiText preset="large" color="role">
            У Советчика есть как бы подсознательный регулятор эмоций, который
            выносит их на определенный угол выражения, выражает как бы с
            искажением.
          </UiText>

          <UiText>
            Выражение глаз часто не совпадает с выражением остальной части лица:
            взгляд получается либо заискивающий, либо ускользающий, либо
            нарочито равнодушный; улыбка — часто многообещающая, двусмысленная.
          </UiText>

          <UiText>
            Часто создается впечатление, что Советчик не столько реагирует на
            собеседника, сколько именно «подыгрывает» ему. Старается попасть в
            тон создавшемуся настроению или старается создать видимость каких-то
            переживаний, чувств и настроений.
          </UiText>

          <UiText>
            Знакомясь с новым человеком, Советчик демонстративно выражает свое
            восхищение и очарование им. Особенно это заметно у
            журналистов-Советчиков, интервьюирующих кого-нибудь из популярных
            актеров или знаменитостей: Советчик не только с восторженным
            обожанием смотрит собеседнику в глаза, общаясь, Советчик постоянно
            заглядывает в глаза, создавая тем самым ощущение особой интимности
            общения — «близкий контакт», но и, что характерно, иногда часто
            повторяет губами движение его губ, как бы дублируя его слова.
          </UiText>

          <UiText>
            Иногда Советчик реагирует так, как ему кажется необходимым
            отреагировать в данной ситуации, — что особенно характерно для
            демонстративно выражаемых эмоций? которые, в свою очередь, всегда
            являются следствием проблематичной логики. То есть эмоции выражаются
            как бы по написанному сценарию, и Советчик вроде как сам себе и
            сценарист и режиссер.
          </UiText>

          <UiText preset="large" color="role">
            Советчик реагирует всерьез только в случае самых крайних
            переживаний, причем может сам себя «накрутить» и довести до
            истерики, опять же исходя из каких-то своих, логических стереотипов.
          </UiText>

          <UiText>
            Какова бы ни была ситуация, создается впечатление, что Советчик как
            будто отмеривает необходимое количество эмоций, для того чтобы
            воздействовать нужным образом; как будто у него стоит какой-то
            подсознательный «счетчик», координирующий его эмоции, относительно
            эмоций его партнера.
          </UiText>

          <UiText>
            И это действительно так — в противном случае, беспроблемные
            отношения с его дуалом Мастером для Советчика были бы просто
            невозможны.
          </UiText>

          <UiText color="role">
            В восприятии отрицательных эмоций Советчик всегда болезненно раним:
            если его откровенно обидеть, он будет искренне страдать, хотя может
            совершенно противоположным образом на это прореагировать.
          </UiText>

          <UiText>
            Но в плане выражения эмоций Советчик выбирает в первую очередь самые
            деликатные и тактичные средства эмоционального воздействия,
            поскольку подсознательно сориентирован на «труднопробиваемого»
            Мастера, отгораживающегося от всякого рода отрицательных эмоций
            непроницаемой броней.
          </UiText>

          <UiText>
            Воздействие в другом эмоциональном режиме Мастером либо вообще не
            воспринимается, либо требует от его партнера непомерной затраты сил
            и энергии, что обычно приводит психологически несовместимых с ним
            партнеров к физическому и эмоциональному перенапряжению.
          </UiText>

          <UiText>
            Только эмоциональный режим Советчик оптимален для Мастера и всегда
            адекватно им воспринимается.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
