<template>
  <div class="text g-page">
    <section>
      <UiText preset="body" color="accent">
        Описания не должны обязательно совпадать со всеми чертами характера
        личности.
      </UiText>

      <UiText preset="small" color="accent">
        Идея как раз описать наблюдаемые у среднего представителя типа
        особенности поведения и обработки информации психикой.
      </UiText>

      <UiText preset="small" color="accent">
        Автор описания — Велта Микелсоне
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="role">
        Самый безбашенный и веселый соционический тип во всем соционе.
      </UiText>

      <br />

      <UiText>
        Отлично улавливает силу и слабость любого человека, способен найти выход
        из любой сложной этической ситуации, эффективно в любой ситуации
        разведывает ему необходимую информацию и умело этим пользуется, и тем
        самым заслужил псевдоним «разведчика».
      </UiText>

      <UiText>
        Способен распознать мотивы поступков. Сильное воображение, видит
        перспективность или бесперспективность развивающихся отношений.
      </UiText>

      <UiText preset="large" color="role">
        Яркие фантазии часто обитают в его голове.
      </UiText>

      <UiText>
        Характерны быстрые смены интересов, спонтанное принятие решений.
        Наблюдательный и любознательный. Интересуется всем необычным и
        загадочным.
      </UiText>

      <UiText>
        Его увлекает все необычное, что на первый взгляд кажется захватывающим.
        Не нацелен на далекие перспективы. Мгновенно способен принять решение о
        серьезном изучении только услышанного.
      </UiText>

      <UiText>
        Бывает, что из-за широты интересов, он в течении жизни заканчивает
        несколько вузов, посещает разные многочисленные курсы и семинары.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">Быстро улавливает суть вещей.</UiText>

      <UiText>
        Ему трудно определиться, что главное, а что второстепенное, и часто
        бывает, что он оставляет начатое на полпути.
      </UiText>

      <UiText>
        Благодаря перечисленным качествам, его можно считать лучшим журналистом,
        педагогом, рекламистом.
      </UiText>

      <UiText>
        В незнакомых ситуациях у него появляется блуждающий взгляд, он глазами
        как будто «бродит» вокруг, что то ищет, разведывает. Это создает
        впечатление рассеянного человека.
      </UiText>

      <UiText preset="large" color="role">
        Везде, где он находится, он как бы автоматически предугадывает ход
        событий.
      </UiText>

      <UiText>
        В его памяти «отпечатываются» как на пленке много разных кадров.
      </UiText>

      <UiText>
        Сперва он даже недооценивает важность этих кадров. Бывает, что в этой
        цепочке не хватает какого-то звена. Вдруг в какой-то момент говорит «У
        меня идея!».
      </UiText>

      <UiText>
        Вновь услышанная информация заполняет все ранее отсутствующие звенья в
        его цепочке, и Советчик завершает процесс своих наблюдений..
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        С рождения отличный знаток людей, быстро отгадывает их желания.
      </UiText>

      <UiText>
        Эта черта дает ему шанс стать хорошим психологом, поскольку он умеет и
        хочет быть с каждым в дружеских отношениях.
      </UiText>

      <UiText>
        Но, увы, он как бы притягивает к себе все неудачи и беды другого
        человека, и долго носит их в себе. Поэтому у него часто появляется
        ощущение, что потерял какую то часть себя.
      </UiText>

      <UiText>
        К сожалению, его советы чаще всего расплывчатые, неконкретные, не
        помогают другому принять правильное решение. На некоторое время он
        способен, беседуя с человеком, направить его на верный путь. Но ему не
        под силу дать точный совет, даже избегает таких ситуаций.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Он талантливый мечтатель и фантазер. Ярко выраженная творческая
        личность.
      </UiText>

      <UiText>
        Украшает свою жизнь выдумкой и изобретательностью. Способен талантливо
        воплотить свои фантазии и замыслы в реальную жизнь, создавая разные
        сценарии, например для праздников и пр.
      </UiText>

      <UiText>
        Выполняя обязанности в нетворческих отраслях, все равно ищет
        неординарные решения — во-первых, чтобы самому было интереснее и не
        надоела работа, во вторых, таким способом он вносит разнообразие,
        предоставляя индивидуальную точку зрения и необычные решения.
      </UiText>

      <UiText preset="large" color="role">
        Ему необходимо делиться своими знаниями, опытом, переживаниями и
        подтверждать свою уникальность.
      </UiText>

      <UiText>
        Это его качество бывает особенно необходимо для распространения новых
        достижений в науке и искусстве.
      </UiText>
    </section>

    <section>
      <UiText>
        Он желает везде достичь высоких результатов. Идеализирует все, в том
        числе свои способности. Как идеалист, он желает быть человеком без
        недостатков. Не любит открыто признавать свои поражения, чтобы не
        показаться неудачником.
      </UiText>

      <UiText preset="large" color="role">
        Умело находит выход из, казалось бы, безвыходных ситуаций.
      </UiText>

      <UiText>
        Обычно создает и поддерживает доброжелательную атмосферу в коллективе,
        приспосабливается к собеседнику, знает кому и что говорить. Способен
        уделить внимание, произнести успокаивающие слова, ненавязчиво
        подбодрить. Легко находит индивидуальный подход к каждому, иной раз
        извлекая из этого выгоду.
      </UiText>

      <UiText preset="large" color="role">
        Не имеет стабильной и устойчивой точки зрения.
      </UiText>

      <UiText>
        Поэтому обычно он легко соглашается с мнением большинства. А в другой
        ситуации может выразить поддержку противоположному мнению. Таким образом
        он регулирует отношения с нужными людьми.
      </UiText>

      <UiText preset="large" color="role">
        Избегает контакта с грубыми, невоспитанными людьми.
      </UiText>
    </section>

    <section>
      <UiText>
        Нетерпим к недостаткам других. Теряет свой интерес к тем, кто не
        выдержал его этической проверки. Предчувствуя, что действительно
        придется брать на себя ответственность за решения другого человека, он
        создает искусственную дистанцию.
      </UiText>

      <UiText preset="large" color="role">
        Часто демонстрирует свою игривость, особенно в словах.
      </UiText>

      <UiText>
        Такое поведение иногда производит впечатление поверхностного,
        беззаботного и легкомысленного человека. Однако общение с Советчиком
        может сложиться непредсказуемо, иногда даже для него самого.
      </UiText>

      <UiText preset="large" color="role">
        Душевная близость может оказаться мнимой и обманчивой, его дружелюбие
        никаким образом не связано с подлинным отношением к человеку.
      </UiText>

      <UiText>
        Если встречает душевно близкого человека, который чаще этический тип,
        образуется глубокая и длительная дружба. Ради такого друга способен
        пойти на жертвы, например, встать среди ночи, чтобы оказать помощь.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Ему необходимо быть принятым в обществе.
      </UiText>

      <UiText>
        Казалось бы, после удачно проведенных часов вместе, он может вдруг
        потерять интерес и необъяснимо исчезнуть. Если попадает в опасную
        ситуацию, в большинстве случаев он легко находит выход из нее, но иногда
        неприятности липнут к нему.
      </UiText>

      <UiText preset="large" color="role">
        Манипулируя людьми, ожидает ответной реакции.
      </UiText>

      <UiText>
        Часто анализирует свои действия, старается понять причины поведения. Ему
        трудно оценивать себя по достоинству. Хотя способен оценить других.
      </UiText>

      <UiText>
        В течении жизни у него меняется много друзей, но ни с одним из них он не
        прерывает отношений окончательно. Считает, что в определенный момент
        может вернуться и возобновить дружбу.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Работу начинает с большим энтузиазмом.
      </UiText>

      <UiText>
        Если её можно сделать за кратковременный срок, энтузиазм не теряется. Но
        при долгосрочной работе или в случае неудачи может не закончить начатое,
        или ему придется заставить себя довести дело до конца.
      </UiText>

      <UiText preset="large" color="role">
        Ему необходим комфорт, но сам его создать не умеет.
      </UiText>

      <UiText>
        Обычно в его квартире царит некий хаос. У него отсутствует понятие
        «всему своё место», по возможности избегает бытовых дел.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Считает себя волевым, целеустремленным и самоуверенным человеком.
      </UiText>

      <UiText>
        Бывает, что демонстративно отстаивает свои права, но свои волевые
        качества обсуждать не желает, часто считает себя сильным лидером.
      </UiText>

      <UiText>
        Именно поэтому он склонен выдвигаться в лидеры. Однако он не берет на
        себя лишнюю ответственность, поскольку ему не хватает выдержки и
        целеустремленности. Но однажды потерпев поражение, понимает, что может
        быть лидером лишь второго плана.
      </UiText>
    </section>

    <section>
      <UiText>
        Способен мобилизоваться, в непредвиденных ситуациях становится
        решительным, активным, проявляет смелость. Интуитивно находит решения и
        умело координирует работу людей в чрезвычайных ситуациях. Знает, что
        способен сделать сам и что нужно потребовать сделать от других.
      </UiText>

      <UiText preset="large" color="role">
        Сопротивляется всяческим ограничениям свободы.
      </UiText>

      <UiText>
        Плохо чувствует себя на работе, которая связывает определенным
        расписанием и ритмом. Тяжело соблюдает выдвинутые требования.
      </UiText>

      <UiText>
        Такие действия могут вызвать для него необратимые последствия. Способен
        отменить ранее принятые решения. Соблюдения правил, установленного
        порядка и прочее мешают ему жить. Избегает однообразия.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Свою работу совершенствует, делает её более интересной и захватывающей.
      </UiText>

      <UiText>
        Часто пытается выполнить задание в собственной манере, не так, как
        другие. Другие считают такое поведение недисциплинированностью. Работу
        превращает в игру и выполняет её непринужденно. Не признает
        формальностей.
      </UiText>

      <UiText>
        Даже серьезные отношения старается вести в свободной атмосфере. Это ему
        часто успешно удаëтся. Если задуманное не удалось реализовать, чувствует
        себя обеспокоенным. Ему не приятны замечания по поводу необдуманных
        действий и поступков. Ему тяжело понять сложные схемы или системы.
        Открыто не признает свои слабости, хотя внутри он самокритичен, знает
        свои недостатки.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Ему тяжело длительное время концентрироваться на чем-то одном, он
        становится невнимательным.
      </UiText>

      <UiText>
        Он не всегда вникает в детали. Выслушивает информацию поверхностно, и
        также передает её другим, запутываясь в терминологии и в фактах.
        Особенно это заметно, если он выбирает профессию, которая связана с
        точными науками.
      </UiText>

      <UiText>
        Не следует инструкциям и правилам, растолковывает их по-своему. С трудом
        составляет подробные и точные отчеты. Он пытается внести своё
        творчество, но не думает о её неуместности.
      </UiText>

      <UiText preset="large" color="role">
        Требовать от него четкую и сложную информацию не стоит.
      </UiText>

      <UiText>
        В наилучшем случае он делегирует это другим, в наихудшем — вам самому
        придется исправить многочисленные его ошибки и недочеты.
      </UiText>

      <UiText>
        Полностью расслабляется только в комфортной обстановке, где ему не надо
        заниматься бытовыми вопросами. У него слабое ощущение физической стороны
        жизни. Не способен регулярно следить за порядком вокруг себя.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Часто у него вещи разбросаны по всей квартире.
      </UiText>

      <UiText preset="small" color="accent">
        У женщин на кухне можно найти все ранее использованное и лишнее, в том
        числе продукты, срок годности которых просрочен. Уход за квартирой
        делается поверхностно и с усилием. Лучше всего заботу по быту переложит
        на других.
      </UiText>

      <UiText>
        Также у него возникают проблемы с одеждой. Он часто пытается подтвердить
        свою индивидуальность неординарным стилем одежды, но обижается на
        замечания по несоблюдению общепринятых норм.
      </UiText>

      <UiText>
        С трудом чувствует своё тело. Не может объяснить ощущения боли,
        усталости, резкой смены температуры.
      </UiText>

      <UiText preset="large" color="role">
        Не способен заботиться о здоровье и отдыхе постоянно. Он нуждается в
        человеке, который будет заботиться о нем и баловать.
      </UiText>

      <UiText>
        Длительное одиночество в рабочем кабинете забирает у него силы. Его
        работоспособность зависит тот настроения. Советчик предпочитает работу в
        коллективе. Ему необходима быстро выполняемая работа. Настроен на скорый
        результат, а не на длительные процессы.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Он умело регулирует темп психологического сближения или отдаления
        человека.
      </UiText>

      <UiText preset="small" color="accent">
        Хотя делает вид, что желает быть со всеми в хороших отношениях, как
        представитель аристократической квадры сохраняет соответствующую
        дистанцию.
      </UiText>

      <UiText>
        Предусмотрительный, наблюдает и делает свои выводы о грозящих опасностях
        в отношениях, и предупреждает об этом тех, кого считает нужными.
      </UiText>

      <UiText>
        Раздражает, если другие бестолково отнимают у него время и поступают
        непорядочно, он воспринимает это, как неуважение к себе. Если попал в
        жесткие обстоятельства, ему бывает жаль зря потраченного времени, а не
        потраченных сил.
      </UiText>
    </section>

    <section>
      <UiText>
        Болезненно переживает неудачи, несправедливость, замечания, ссоры. Когда
        он терпит поражения, получает отказы, приходит отчаяние и ему необходимо
        побыть в одиночестве, чтобы восстановить внутреннее равновесие.
      </UiText>

      <UiText preset="large" color="role">
        Его внутренний мир сложен и противоречив. Внешне развязан и игрив, но
        внутри сражается с переживаниями и грустными мыслями.
      </UiText>

      <UiText>
        Чтобы избавиться от них, может использовать опьяняющие средства. Может
        впасть в депрессию, что свойственно для представителей этого социотипа.
      </UiText>

      <UiText>
        Если не нашел подходящее место в жизни, как уже говорилось, он не
        признает свои неудачи. В связи с этим на рабочем месте становится
        человеком, провоцирующем гнев других. В таких ситуациях не способен
        сдержаться.
      </UiText>

      <UiText preset="large" color="role">
        Защищая себя, раздражается, повышает голос.
      </UiText>

      <UiText>
        Обладает талантом актера, он способен импровизировать, пародировать
        голоса и поведение других. Его привлекают талантливые и успешные
        личности.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
