<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <div class="warning">
      <UiText preset="small" color="accent">
        Если вы не умеет воспринимать юмор, обидчивы или зависимы от мнений
        незнакомцев, пожалуйста, не читайте все что ниже.
      </UiText>

      <UiText preset="small" color="accent">
        Ненормативная лексика и сексуальные темы, оскорбление чувств всех
        причастных. Но весело и остроумно. Соблюдена авторская орфография и
        пунктуация.
      </UiText>
    </div>

    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Люркмор"
          subtitle="2 минуты"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Селютин"
          subtitle="4 минуты"
          target-content-id="tab-2"
        />

        <VariousTab
          title="Эльвира Фея"
          subtitle="2 минуты"
          target-content-id="tab-3"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText color="accent">
            <i>
              скинхэд, альфа-самец, говнарь, байкер, пират, быдло, дальнобойщик,
              нохча, гопник, колхозник, десантник, новый русский, ЧСВ, Свиборг,
              военком, жлоб
            </i>
          </UiText>

          <UiText preset="large" color="role">
            Властный, командование парадом всегда старается взять на себя. Воен,
            причём, в отличие от упячкоёбов, чаще всего воен ИРЛ. Хотя
            встречается и пацифистские особи, но крайне редко. Ибо даже будучи
            добряками всё рано будут командовать и всячески давить.
          </UiText>

          <UiText>
            Презрение к слабакам у него мирно сосуществует с любовью к тонким
            душевным натурам. Правда, не ко всем. Чаще всего отношения с людьми
            строятся по принципу подчинения, если человек не ломается — будут
            уважать, но обходить стороной. ЧСХ, самки тоже могут быть Лидерами,
            я гарантирую это!
          </UiText>

          <UiText preset="large" color="role">
            Повадками и манерой поведения, а точнее примитивностью и
            недалёкостью оных, напоминает гориллу.
          </UiText>

          <UiText>
            По большему счёту, срал на всех и вся, но если индивид поддерживает
            в борьбе, зачисляет его в союзники, и готов потчевать объедками с
            царского стола.
          </UiText>

          <UiText>
            Как и все белые логики, нихуя не понимает в объективном мире,
            который его окружает. Но в отличие от Аналитика, который за
            справедливость готов выпилить весь Земной шар, Лидер активно
            выпиливает только тех, кто мешает ему занять место под Солнцем. О
            добре и справедливости он обычно не думает.
          </UiText>

          <UiText>
            Своим продвижением по карьерной лестнице нередко вызывает рейдж у
            всяких Администраторов и Предпринимателей.
          </UiText>

          <UiText>
            А вообще если говорить о географии серьёзно, то фактически любая
            страна третьего мира с обилием таких явлений, как продажа в рабство,
            преступные группировки, делящие всё и вся на части и страшное,
            упёртое стремление к самоутверждению себя всеми средствами для
            подойдёт. Яркий пример — Сомали.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">Бочка меда</UiText>
          <UiText preset="large" color="role">
            Незаменим в качестве организатора в тех случаях, когда необходимо
            насрать на пресловутый человеческий фактор. Маршал же!
          </UiText>
          <UiText preset="small" color="accent">Ложка дегтя</UiText>
          <UiText preset="large" color="accent">
            Встанет не с той ноги — спасайтесь! Иногда включает режим няшки,
            которая виснет на всех и душит!
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="large" color="role">
            Жесткий и жестокий нападающий, предпочитающий игру без правил,
            страдающий словоблудием и этической нечистоплотностью. С ними не
            договоришься.
          </UiText>

          <UiText>
            Силовой лидер. Строит жизнь своими руками, а заодно строит всех
            вокруг. Завидует одаренным личностям, которые легко руководят
            настроениями масс.
          </UiText>

          <UiText preset="large" color="role">
            Клоун с бабьим голосом и мелкий хам. Тупой бездушный солдафон.
            Машина для убийства. Бульдозер, который прет напрямую через любые
            преграды.
          </UiText>

          <UiText>
            Лидеров мужиков надо сразу после типирования в тюрягу сажать: всё
            равно ведь или там окажутся, или прокурора купят. Так что лучше их
            превентивно туда. А дамы-Лидеры, похоже, просто не определились со
            своим полом.
          </UiText>

          <UiText preset="large" color="role">
            Давит массой. При помощи волевой сенсорики всем навяжет свою логику.
          </UiText>

          <UiText>
            Бессменный победитель в игре под названием «Купи слона».
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Отношения строить не умеет, и не старается. Во-первых, он и так
            самодостаточен, а во-вторых, твердо знает, что без него не
            обойдутся.
          </UiText>

          <UiText>
            Пользуется нелюбовью, но уважением окружающих. «Боится — значит
            уважает» — это фраза Лидера.
          </UiText>

          <UiText>
            Притесняет слабых, но не из корысти или садизма, а считая, что таким
            способом облагодетельствует их, заставляя учиться защищаться.
          </UiText>

          <UiText>
            На сильных не нападает, даже напротив, может помочь. Поклонник
            естественного отбора — «выживает сильнейший!».
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Слабых, но непокорных ломает через колено, в покое оставляет только
            в том случае, если найдется равный ему по силе покровитель.
          </UiText>

          <UiText>
            Ум Лидера тяжелый. Карьеру делает не столько головой, сколько лбом.
            Как правило, не обладает широкой эрудицией, часто бывает даже
            малограмотен, но упорства ему не занимать.
          </UiText>

          <UiText>
            По характеру, уму, и физическому развитию больше всего соответствует
            тяжелому танку.
          </UiText>

          <UiText>
            Быстро утомляет желанием расставить все и всех по местам и платить
            за каждую мелочь — или отрабатывать каждую мелочь.
          </UiText>

          <UiText>
            Как коллега часто вызывает недоумение сильным различием между
            собственными представлениями, декларациями об умениях и реальным
            положением дел.
          </UiText>
        </section>

        <section>
          <UiText>
            Склонны к перепадам настроения, страдают отсутствием чувства меры во
            всем, верные и преданные и требуют того же от других людей, забывая,
            что люди все разные и подчас не способны ответить тем же. Впадают в
            крайности. Вспыльчивы.
          </UiText>

          <UiText preset="large" color="role">
            Его нецензурная брань слышна за километры, лицо как из мрамора,
            белое, абсолютно неподвижное, скулы постоянно напряженны, сжатые
            кулаки весьма внушительных размеров.
          </UiText>

          <UiText>
            Набрасывается на всех прохожих, под громкий хохот и выкрики его
            команды, типа «Ого!», «Во даёт!».
          </UiText>

          <UiText>
            Интересно, что ответить за такое поведение хочется не ему, а той
            шушере, которая хихикает за его спиной. Как потом выясняется, вся
            эта «шушера« тайно ненавидит, но боится его...
          </UiText>

          <UiText>
            Твердолобый и убежденный вояка, грубый, бесцеремонный, по-хамски
            развязный, вспыльчивый и впадающий в крайности, не обременяющий себя
            этическими дилеммами, зачастую с очень узким кругозором и
            притупленным интеллектом.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Вожак стаи, без которой не может существовать, хитрый, превозносящий
            и насаждающий культ силы, презирающий любую слабость, не чувствующий
            ни в чем меры.
          </UiText>

          <UiText>
            Всегда нелюбим, но из-за внушенного им страха уважаем. Короче, его
            дом — тюрьма.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-3" class="tab">
        <section>
          <UiText preset="large" color="role">
            Лидеры – они, сука, как попрут, так ложись, воздушная тревога, все
            умерли. Не обманывайтесь их порой хрупким видом: любой Лидер
            способен устроить писец котенку, а размеры писеца зависят
            исключительно от его возможностей.
          </UiText>

          <UiText>
            Лидер всегда сверху, если сверху вы – см. начало предложения.
          </UiText>

          <UiText>
            Притом, суки, ранимые и нежные в душе, но пока до этой ранимости
            докопаешься, можешь и огрести несколько раз.
          </UiText>

          <UiText>
            Любят экшн всяческий, в самой кошмарной жопе чувствуют себя как рыба
            в воде и немедленно начинают командовать парадом.
          </UiText>

          <UiText>
            Лидера вообще хлебом не корми — дай покомандовать, притом что хлеб
            они едят не всякий, а только самый крутой, радеют, суки, о своем
            бесценном здоровье, и вас этим заебут по самое не могу; умрете вы
            здоровым, и не факт, что нескоро.
          </UiText>

          <UiText>
            Страшные интриганы, любят воображать себя тактиками, стратегами, и
            еще хрен знает кем; садисты редкие, и все с улыбкой, легко и
            непринужденно, прожигая вас строгим взглядом
            «ты-низшее-существо-а-ну-делай-что-я-скажу».
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Пафосны донельзя, мнят себя круче крутых яиц, крайне озабочены, что
            усердно скрывают и выдают за активность и сексапил.
          </UiText>

          <UiText>
            Себя несут по жизни вальяжно, как большой подарок миру, хотя, по
            сути, являют собой красиво упакованную бомбу с тепловым датчиком.
          </UiText>

          <UiText>
            Логики по идее, что удачно маскируют отсутствием проблеска мысли в
            глазах и прямым, как мозговая извилина, подходом к решению любой
            проблемы: рубануть с плеча и глянуть, что будет.
          </UiText>

          <UiText>
            Еще крайне бестактны и перманентно плюют в душу окружающим, выдавая
            это за отчаянную прямоту рубаха-парней, что роднит их с Аналитиками,
            которые тоже умеют ляпнуть глупость от души, как никто.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
