<template>
  <div class="text g-page">
    <section>
      <UiText preset="large" color="role">
        Вашей сильной стороной является строгая логика фактов, позволяющая вам
        точно просчитать практическую сторону любого дела.
      </UiText>

      <UiText>
        Вы — трезвый реалист, способный правильно оценить полезность и
        эффективность затеваемого мероприятия.
      </UiText>

      <UiText>
        У вас хорошая смекалка и отличная информированность в той области,
        которой вы занимаетесь. Вы — активный и деятельный человек, не любите
        попусту тратить время, всегда знаете, чего хотите, и умеете этого
        добиваться трудолюбием и упорством.
      </UiText>

      <UiText>
        Вы умеете рационально и экономно использовать материальные ресурсы. Для
        вас также характерно умение создавать себе и близким материальный
        достаток и комфорт.
      </UiText>

      <UiText>
        Вы стремитесь к обеспеченной, здоровой, гармоничной жизни и не жалеете
        для этого своих сил, а также стимулируете окружающих к различной
        полезной деятельности.
      </UiText>

      <UiText>
        Вы обладаете хорошими организаторскими способностями, так как умеете
        создать людям условия для работы, заинтересовать их и только потом
        потребовать отдачи.
      </UiText>

      <UiText>
        Вы очень цените качество работы и не переносите недисциплинированности и
        лени.
      </UiText>

      <UiText>
        Вы любите красивые, добротные вещи, вкусную и здоровую пищу. Вам
        нравится, когда окружающие оценивают вас по заслугам и не посягают на
        вашу независимость в выборе решений или методов работы.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Вашей слабой стороной является неумение планировать альтернативные
        мероприятия на длительные сроки.
      </UiText>

      <UiText>
        Вы часто оказываетесь перегруженным неизвестно откуда появляющейся
        работой, нуждаетесь в заблаговременной подготовке к важным мероприятиям.
        Вам иногда трудно предвидеть назревающую опасность или неудачу в деле.
        Неожиданные повороты событий, которые вы не смогли предусмотреть,
        раздражают вас и даже выводят из равновесия.
      </UiText>

      <UiText>
        Вам трудно долго ждать исхода затеваемого дела, особенно если нет
        уверенности в его успехе. Вам рекомендуется чаще пересматривать свои
        взгляды на те или иные стороны жизни, отказываться от изживших себя
        традиций и обычаев.
      </UiText>

      <UiText preset="large" color="role">
        Сухая логика фактов не должна подавлять в вас чутье к новому,
        необычному. Умерьте по возможности свой консерватизм и упрямство,
        сравнивайте чаще себя с другими, воспитывайте гибкость в конкурентной
        борьбе.
      </UiText>

      <UiText>
        Вы склонны полагаться на свою интуицию в отношении других людей и не
        подозреваете, что сильно переоцениваете это качество в себе, ведь и вы
        не застрахованы от ошибочных выводов и прогнозов.
      </UiText>

      <UiText>
        Следствием этого может оказаться ваша неуместная подозрительность или
        даже резкость в общении с людьми, что может поставить вас в неловкое
        положение.
      </UiText>

      <UiText>Проявляйте больше сдержанности и такта в этих вопросах.</UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Еще одной вашей проблемой является неумение сдерживать свои эмоции в
        отношении к близким людям, не подчиняющимся вашим указаниям и
        наставлениям, если их поступки противоречат вашей логике и здравому
        смыслу.
      </UiText>

      <UiText>
        Это тем более неприятно, что с посторонними вы ведете себя подчеркнуто
        сдержанно и корректно, демонстрируете воспитанность и хорошие манеры.
        Близкие могут быть в обиде на вас из-за этого качества.
      </UiText>

      <UiText preset="large" color="role">
        Своей несдержанностью вы можете оттолкнуть от себя близких людей. Будьте
        терпимей, не спешите сгоряча выкладывать правду в глаза.
      </UiText>

      <UiText>
        Излишняя прямота не идет вам на пользу. Сначала остыньте, затем
        обдумайте, что лучше сказать и в какой форме.
      </UiText>

      <UiText preset="large" color="role">
        Научитесь расслабляться, переключать своё внимание с работы на приятный
        отдых. Постарайтесь смотреть на конфликты с юмористической стороны. У
        вас неплохо развито чувство юмора, это успокоит вас, даст выход эмоциям
        в приемлемой форме.
      </UiText>

      <UiText color="role">
        Чаще читайте художественную литературу, ходите в театр — такой отдых
        размягчит ваш твердый характер и поможет воспитать благородство чувств.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
