<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <div class="warning">
      <UiText preset="small" color="accent">
        Если вы не умеет воспринимать юмор, обидчивы или зависимы от мнений
        незнакомцев, пожалуйста, не читайте все что ниже.
      </UiText>

      <UiText preset="small" color="accent">
        Ненормативная лексика и сексуальные темы, оскорбление чувств всех
        причастных. Но весело и остроумно. Соблюдена авторская орфография и
        пунктуация.
      </UiText>
    </div>

    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Люркмор"
          subtitle="2 минуты"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Селютин"
          subtitle="4 минуты"
          target-content-id="tab-2"
        />

        <VariousTab
          title="Эльвира Фея"
          subtitle="2 минуты"
          target-content-id="tab-3"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText color="accent">
            <i>
              быдло, пиздабол, ГСМ, ТП, ГК, хиппи, анальный клоун, школьник,
              халявщик, модник, феечка, смайлофаг
            </i>
          </UiText>

          <UiText preset="large" color="role">
            Ходячий ПаЗиТиФфФчИк, без умолку пиздящий на одни и те же темы, всё
            время повторяя одни и те же шутки. Подобное поведение активирует
            Аналитика и бесит Критика. Как и Дипломат, добивается успеха не
            работой и умом, а пиздежом.
          </UiText>

          <UiText>
            Сферическая блондинка в вакууме. Увидев на улице разодетую в одежду
            всех цветов радуги девицу, не сомневайтесь — перед вами
            представительница типа Энтузиаст.
          </UiText>

          <UiText>
            Решительно ни в чём не разбирается. Падок на тренды и может менять
            мнения по тому или иному поводу, как перчатки. Плохое настроение
            бывает у него не часто (счастье — привилегия дураков), но уж если
            такому суждено было случиться, отгребать будут все, кто попал под
            язык. Энтузиаст не успокоится, пока не утопит оказавшихся в зоне
            поражения несчастных в своих бессмысленных и беспощадных эмоциях.
            Облегчившись душевно за счёт окружающих, Энтузиаст, как ни в чём не
            бывало, побежит дальше продвигать куда-то какую-то хуету.
          </UiText>

          <UiText>Интегральный тип Бразилии и Азербайджана.</UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">Бочка меда</UiText>
          <UiText preset="large" color="role">
            Способны вытащить из болота уныния практически любую группу людей,
            кроме группы Критиков.
          </UiText>
          <UiText preset="small" color="accent">Ложка дегтя</UiText>
          <UiText preset="large" color="accent">
            Тащемта, из-за Энтузиаста хозяева вечеринки потом собирают осколки
            тарелок и вытягивают их спящих из-под стола.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="large" color="role">
            Пошлый торгаш, у которого жизнь — торжище, где продается и
            покупается все. Лишен интеллигентности и интеллектуальной грации. На
            язык — острый.
          </UiText>

          <UiText>Заботливый тараторщик. Больше говорит, чем делает.</UiText>

          <UiText>Не любит, когда его погоняют.</UiText>

          <UiText preset="large" color="role">
            Дура прилипчивая — иначе и не скажешь.
          </UiText>

          <UiText>
            Соглашается сразу, преданно заглядывая в глаза и радостно улыбаясь,
            но делает в результате черте что — в основном, только то, что
            выгодно лично ему.
          </UiText>

          <UiText>
            Если в каком-то деле нет ничего съедобного, вообще не понимает, о
            чем речь.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Главное орудие труда Энтузиаста — это задница. А еще ноги и язык.
            Потому что в голове у него — пусто.
          </UiText>

          <UiText>
            Энтузиаст и интеллект — вещи примерно настолько же совместимые, как
            Лирик и чемпионат мира по боям без правил.
          </UiText>

          <UiText>
            Неспособен даже на самое элементарное логическое построение, а
            какое-нибудь его высказывание относительно причинно-следственных
            связей способно довести любого логика до истерики.
          </UiText>

          <UiText>
            Однако нижней половиной своего туловища способен часто добиться куда
            большего, чем другие даже очень умной головой.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Иногда и другим кое-что перепадет, но собственную выгоду блюдет
            свято.
          </UiText>

          <UiText>
            Невыносимый болтун. Общаться с ним возможно только в том случае,
            если периодически затыкать ему рот.
          </UiText>

          <UiText preset="large" color="role">
            Самая невероятная картина, которую только можно себе представить —
            Энтузиаст, признающий собственную неправоту.
          </UiText>

          <UiText>
            Он не осведомлен о возможности испытывать чувство смущения, стыда
            или неловкости.
          </UiText>

          <UiText>
            Вообще-то трудолюбивы, вот бы еще кто им сказал, что и когда
            правильно делать!
          </UiText>

          <UiText>
            Если кто-то не сделал то, чего, как ему кажется, должно быть
            сделано, останется только переделывать.
          </UiText>

          <UiText>
            Дома полная разруха, беспорядок и маразм, потому что времени на все
            не хватает — оно утекает сквозь болтовню на всякие житейские темы.
          </UiText>

          <UiText>
            Хронофаги — могут без передышки болтать кряду 6 часов о житейских
            событиях в жизни других людей.
          </UiText>

          <UiText preset="large" color="role">
            Вмешивается везде и всюду — иногда кажется, что его нос торчит из
            каждой щели.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-3" class="tab">
        <section>
          <UiText preset="large" color="role">
            Потому что Энтузиасты — они, сука, оптимисты до мозга кости,
            массовики-затейники от бога.
          </UiText>

          <UiText>
            Они всегда в тонусе, вечно на подъеме, и нет, допинг тут не при чем
            – как трезвые, так и пьяные, Энтузиасты одинаково благожелательно
            настроены к неблагодарному человечеству.
          </UiText>

          <UiText>
            А оно, человечество это порой хочет просто посидеть за книжкой или
            там подумать о вечном, что Энтузиаст, находясь рядом, терпеть просто
            не может.
          </UiText>

          <UiText>
            Вас покормят, развеселят, расскажут десять анекдотов и страшно
            обидятся, если вы не оцените их усилий – ко всему прочему Энтузиасты
            обидчивы и тонки душой, если повода смертельно оскорбиться нет, то
            они с удовольствием высосут его из пальца.
          </UiText>

          <UiText>
            Потому, когда на вас из-за спины напрыгивает этакое нечто в
            карнавальном костюме и принимается громко петь футбольные кричалки,
            рекомендуется изображать безумную радость, а то будет хуже –
            обиженный Энтузиаст еще страшнее, чем расстроенный Гуманист.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Впрочем, в глубине души ему глубоко плевать на всех, кроме себя,
            может, оттого они по жизни любвеобильны, словно озабоченный павиан,
            значения таких глупых понятий, как верность или постоянство,
            искренне не понимают, и на вопрос о предпочтениях отвечают «всегда».
          </UiText>

          <UiText>
            Надо признать, это и к лучшему – энтузиазма слишком много, чтоб его
            напор мог выдержать один человек, не тронувшись маленько от вечного
            праздника жизни.
          </UiText>

          <UiText>
            Как ни странно, многих Энтузиасты своей неуемной активностью
            раздражают, и в этом трагизм — вреда от них мирозданию никакого, на
            жисть не жалуются, по мозгам не ездят, с собой не кончают по три
            раза на дню, а все туда же — вынести их дольше получаса и без
            выпивки сложновато.
          </UiText>

          <UiText>
            Зато кто их обожает — так это Советчики, которые им словно
            братья-близнецы.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
