<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <div class="warning">
      <UiText preset="small" color="accent">
        Если вы не умеет воспринимать юмор, обидчивы или зависимы от мнений
        незнакомцев, пожалуйста, не читайте все что ниже.
      </UiText>

      <UiText preset="small" color="accent">
        Ненормативная лексика и сексуальные темы, оскорбление чувств всех
        причастных. Но весело и остроумно. Соблюдена авторская орфография и
        пунктуация.
      </UiText>
    </div>

    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Люркмор"
          subtitle="2 минуты"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Селютин"
          subtitle="4 минуты"
          target-content-id="tab-2"
        />

        <VariousTab
          title="Эльвира Фея"
          subtitle="2 минуты"
          target-content-id="tab-3"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText color="accent">
            <i>небыдло, нерд, задрот, программист, гик, отаку, геймер, хикки</i>
          </UiText>

          <UiText preset="large" color="role">
            Стереотипный ботаник, фапающий на различные теории, таблицы и схемы.
            Засовывает логику во всё, что можно, чаще всего под соусом
            «справедливости».
          </UiText>

          <UiText>
            Паталогически неспособен признать в человеке не набор формул, а
            личность. Сильно заебывает окружающих выстраиванием сложных
            логических схем во второстепенных вопросах, на которые обычному
            человеку просто похуй. Не переносит довления.
          </UiText>

          <UiText>
            Может добиться хороших успехов в науке, но попытки податься в
            политику или в бизнес часто заканчиваются фэйлом. «Какая умная
            голова, и какому дураку досталась!» — это именно про Аналитика. Ради
            сферического коня в вакууме готов убить всех людей.
          </UiText>

          <UiText>
            Живёт в им же придуманном параллельном мире, пресекающемся с
            реальностью лишь тогда, когда надо чего-то пожрать или достать бабло
            на новую материнку.
          </UiText>

          <UiText>
            Такой поворот событий вызывает у него дичайшее раздражение, что,
            зачастую, лишь усугубляет его уединённость. Благо, наличие под рукой
            Энтузиаст может эту проблему исправить, и тогда довольный Аналитик,
            ни на что не отвлекаясь, полностью посвящает себя пересобиранию
            мира.
          </UiText>

          <UiText preset="large" color="role">
            Классический пример человека в футляре. Сферический задрот-геймер в
            вакууме.
          </UiText>

          <UiText>
            Социально ответственный подвид — вполне, и притом по делу выдаёт
            пиздюлей. Однако некоторые считают, что получается это пиздец как
            хуёво, ибо Роб не знает как кого пиздить, зато знает за что.
            Надрызгавшись в хлам — становится опасен, как и Аналитик.
          </UiText>

          <UiText preset="large" color="role">
            Давить Аналитика пиздюлями — ведёт к провалу. А просьбами —
            запросто. И полжизни проводит в исполнении чужих просьб.
          </UiText>

          <UiText>
            Математика, как и соционика, была придумана Аналитиками. И засрана
            ими же. Именно Аналитики придумали, что с хуяли функция стремится к
            0, если функция, которая больше её, стремится к 0, и которая меньше
            её, стремится к 0.
          </UiText>

          <UiText>
            Также считается интегральным типом Швеции. Вы всё ещё думаете, что
            отдавать больше половины зарплаты на налоги несправедливо?
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">Бочка меда</UiText>
          <UiText preset="large" color="role">
            Только Аналитик способен планомерно и целенаправленно (а главное —
            охотно) навести порядок в любом информационном или техническом
            бардаке и даже разобраться в лоскутном одеяле противоречий в голове
            Энтузиаста. Вроде как особенно чувствителен к несправедливости, и
            потому слывёт демократом. Короче, Аналитик — утопист. Что тоже
            забавно.
          </UiText>
          <UiText preset="small" color="accent">Ложка дегтя</UiText>
          <UiText preset="large" color="accent">
            Не дай Бог ляпнуть что-то лишнее или необдуманное! Аналитик начнёт
            выяснять смысл сказанного! Аще, цепляются как ебучий репей: так что
            лучше вообще молчать или пиздеть так, чтобы они не отличали
            отдельных слов. Что отлично умеет делать Энтузиаст.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="large" color="role">
            Мстительная натура и ужасно обидчивая, не умеет выделить главного из
            своих многочисленных очень часто дельных идей.
          </UiText>

          <UiText>
            Могут жизнь расписать в виде двухмерной таблицы, со списком
            исключений из правил внизу. Мастера служебных записок. Любое правило
            могут обойти по правилу.
          </UiText>

          <UiText preset="large" color="role">
            Страдает частенько манией величия.
          </UiText>

          <UiText>Честный и практичный карьерист.</UiText>

          <UiText>
            Теоретик вселенской справедливости. Изобретатель скучных схем,
            методов и инструкций.
          </UiText>

          <UiText>
            Плохо учитывает человеческий фактор. Его социальные идеи
            нежизнеспособны.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Не агрессивен, но зануден. Завидует лидерам.
          </UiText>

          <UiText>
            «Одна, но пламенная страсть» — эти кого угодно забодают! из-за
            любого фуфлеца, самой, что ни на есть мелочи, любой фигнёвой
            придирки готовы тормозить сколько угодно, и ведь те ещё
            перестраховщики.
          </UiText>

          <UiText preset="large" color="role">
            И мало того, что тормоза, так ещё и «без батареек», что компенсируют
            огромным самомнением.
          </UiText>

          <UiText>
            Продолжает отстаивать своё мнение, даже когда уже все перешли к
            десерту, разошлись по домам и уехали в отпуск на море.
          </UiText>

          <UiText>
            Логический в состоянии в пять минут задолбать всех, включая
            «научников», собственными построениями, причем в конце концов все
            равно со всеми поругается, и гордо уйдет, высоко неся голову и
            вытирая злые слезы.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Несгибаемый борец все равно за что и против чего. Поскольку не
            гнется, то ломается при любом оказанном на него давлении.
          </UiText>

          <UiText>
            Не терпит, когда ограничивают его свободу, выражают необоснованные
            требования.
          </UiText>

          <UiText preset="large" color="role">
            Скептик, старатель, трудоголик, ненавистник мэйн-стрима.
          </UiText>

          <UiText>
            Прежде чем ударить молотком, нарисует схему, вычертит план,
            разберется в свойствах стали гвоздей, подберет молоток специально
            под нужный гвоздь, рассчитает угол удара молотком по гвоздю… что
            займет не меньше пары лет.
          </UiText>

          <UiText>
            А гвоздь обязательно сломается, т.к. сталь окажется совсем не той
            марки, которой полагается быть, потому что подвыпивший сталевар
            бросил в плавку сигарету, а вороватый инженер спер положенную
            добавку вольфрама.
          </UiText>

          <UiText>
            Поэтому все бросят, хлопнут дверью и пойдут плакаться в жилетку
            Энтузиасту о том, как жизнь несправедливо устроена.
          </UiText>

          <UiText preset="large" color="role">
            Личность не в меру капризная.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-3" class="tab">
        <section>
          <UiText preset="large" color="role">
            Хотя по идее Аналитики — они, сука, умные. Но если Новатор умный от
            балды, и над его бредом иногда можно даже посмеяться — когда выйдешь
            из больницы — то Аналитики умные в натуре. И это в них так бесит!
          </UiText>

          <UiText>
            Рассуждающего и строящего логически цепочки Аналитика хочется
            прибить чем-нибудь тяжелым, возможно – тем же Лидером или Мастером.
          </UiText>

          <UiText preset="large" color="role">
            К тому же занудны до рвоты и упрямы как ослы. Вбив себе что-то в
            голову, они непременно донесут это до вас несколько раз; самое
            интересное, что их аргументы совершенно верны.
          </UiText>

          <UiText>
            Однако они ухитряются сделать из них неправильные на взгляд обычного
            человека — из тех, у кого в голове мозг, а не вычислительный центр с
            вибратором — выводы.
          </UiText>

          <UiText>
            Выдержать их гундеж без поллитры нереально, потому легче всего
            общаться с Аналитика в большой компании и недолго.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            В личной жизни Аналитики являют собой чмо с извращенными вкусами,
            уверенное, что с десяток знойных мулаток ждет не дождется их
            бесценного внимания.
          </UiText>

          <UiText>
            На деле внимания их обычно дожидается нечто аналогично унылое типа
            Критика или Гуманиста, потому что дуалы, полудуалы и иже с ними
            обходят их сторонкой — увлекательный рассказ о синхрофазатроне не
            всегда затронет сердце девушки, что неизменно их изумляет.
          </UiText>

          <UiText>
            В работе они, сука, успешны, ибо вгрызаются в нее, как
            хомяки-убийцы; чего не скажешь о прочих сторонах жизни, в которых
            Аналитики ведут себя, как белка в сексшопе.
          </UiText>

          <UiText>
            А еще им крайне повезло с дуалами Энтузиасты — те тоже выглядят со
            стороны, как ушибленный атомным взрывом танк, но, в отличие от
            Аналитиков, этим крайне гордятся.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
