<template>
  <div class="text g-page">
    <section>
      <UiText preset="subtitle" color="accent">Сильные стороны</UiText>

      <UiText preset="large" color="role">
        Развито познавательное мышление. Эрудирован, любознателен, много читает
        и запоминает. Обладает развитой интуицией, помогающей выбрать правильное
        решение.
      </UiText>

      <UiText>
        Хорошо видит перспективы идей и дел. Может найти неожиданное решение
        проблемы там, где не видят его другие, на основе анализа большого объема
        разнообразной информации и рассмотрения её как бы со стороны,
        интуитивно.
      </UiText>

      <UiText>
        Охотно советует, как выпутаться из сложных ситуаций. Расплывчатые идеи
        способен переработать в теорию, имеющую форму системы.
      </UiText>

      <UiText preset="large" color="role">
        Структуралист и классификатор, идущий от общего к частному.
      </UiText>

      <UiText>
        Довольно напорист, нередко обладает организаторскими способностями в
        области поиска принципиально новых подходов. Часто работу ставит выше
        семейных или личных отношений.
      </UiText>

      <UiText>Демократичен, не любит чинопочитания.</UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">Проблемы</UiText>

      <UiText>
        Не переносит строгую регламентацию и монотонный режим работы. Не может
        жить по строгому плану.
      </UiText>

      <UiText>
        Довольно неорганизован: отвлекаясь на интересные детали, иногда не
        успевает сделать главное к намеченному сроку.
      </UiText>

      <UiText>
        Может говорить не по теме, уходя в свои мысли. Ему с трудом удаëтся
        порядок в делах, на рабочем месте. Может допускать погрешности в
        оформлении деловой документации.
      </UiText>

      <UiText>
        Плохо рассчитывает время, с трудом отделяет главное от второстепенного,
        перегружая себя делами.
      </UiText>

      <UiText preset="large" color="role">
        Не всегда следит за внешним видом. Бывает наивным, слишком доверчивым.
      </UiText>

      <UiText>
        Из-за предприимчивости, с одной стороны, и неумения идти на компромиссы
        — с другой, ему с трудом удаются бесконфликтные отношения с людьми.
      </UiText>

      <UiText>
        Бывает неуступчивым, даже агрессивным, особенно если на него давить.
        Может с апломбом доказывать свою правоту, если убежден в ней.
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Нельзя требовать и ожидать
      </UiText>

      <UiList iconName="chevron-right" iconColor="accent" iconSize="16">
        <UiListItem>Практичности замыслов.</UiListItem>

        <UiListItem>Пунктуальности и исполнительности.</UiListItem>

        <UiListItem>Последовательности и завершенности.</UiListItem>

        <UiListItem>Постоянного порядка в быту и на рабочем месте.</UiListItem>

        <UiListItem>Качественного выполнения рутинной работы.</UiListItem>

        <UiListItem>Умения мягко подстраиваться к собеседнику.</UiListItem>
      </UiList>
    </section>

    <section>
      <UiText preset="subtitle" color="accent">
        Подходящие виды деятельности
      </UiText>

      <UiText>
        Если есть возможность, лучше всего предоставить Новатору свободный режим
        работы. При этом желательно, чтобы работа была интересной для него
        самого, обеспечивала разнообразными впечатлениями. Оптимальной для него
        будет деятельность, в которой он будет независим от других,
        самостоятелен.
      </UiText>

      <UiText preset="large" color="role">
        С удовольствием работает с большими объёмами разнообразной (желательно
        интересной для него) информации.
      </UiText>

      <UiText>
        Наилучшее применение его интеллект находит в научно-познавательной
        области. Он может осуществлять теоретические разработки в тех областях,
        которые являются стратегическими — влекут за собой коренные перемены.
      </UiText>

      <UiText>
        Подвижен, динамичен, любит смену впечатлений, поэтому такой сотрудник с
        удовольствием будет выполнять подвижную работу, ездить в командировки.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
