import type { MindsetDetailCardType } from "@types";

const DETAIL_MINDS: MindsetDetailCardType[] = [
  {
    type: "mindset",
    mindset: "causal",
    tags: [
      "Статик",
      "Позитивист",
      "Последовательная логика",
      "Дедукция",
      "Детерминизм",
    ],
    title: "Причинно-следственное",
    subtitle:
      "Самое жесткое мышление. Нет свободной воли. Все предопределено. Предписано.",
    content: [
      "Устойчивы и четки в своей мыслительной деятельности.",
      "Мыслят процессуально не пропуская деталей и промежуточных звеньев, строго идут к одному единственно верному решению.",
      "Этот тип мышления напоминает скорее дерево, ментальный процесс заключается в построении цепочек причин и следствий.",
      "Строя длинные цепочки причин и следствий, трудно избежать опасности зацикливания — порочный круг в доказательстве.",
      "Плохо защищены от дрессировки или, в крайних случаях, даже зомбирования.",
      "В научной сфере так мыслит Новатор, в технико-управленческой сфере — методичный Инспектор, в социальной сфере просчитывает цепочки материальных интересов Политик, в гуманитарной же сфере подчинен категорическому императиву Гуманист.",
    ],
  },
  {
    type: "mindset",
    mindset: "algorithmic",
    tags: ["Динамик", "Негативист", "Поиск противоречий", "Столкновение"],
    title: "Диалектико-алгоритмическое",
    subtitle:
      "Ассоциативный поток сталкивающихся мыслей. Борьба противоположных точек зрения. Самые большие спорщики.",
    content: [
      "Хорошо синтезируют целостные образы, они все больше усложняют их и работая с противоречиями и парадоксами.",
      "Отличительная черта — отражение мира как единства и борьбы противоположностей.",
      "Хорошо решает задачи на классификацию.",
      "Это мышление можно скорее сравнить с симфонией, потоком переплетающихся образов, чем четко отлаженным механизмом. Формула «если — то — иначе».",
      "Страдают из-за трудности сделать выбор, принять однозначное решение.",
      "Повышенная критичность, которая может быть высокой и вызывать саморазрушение, опасность полного отрыва от реальности, ведет к расстройствам психики.",
      "Наставник внушающе воздействует на людей. Критик, Администратор и Дипломат работают с движущимися структурами-алгоритмами.",
    ],
  },
  {
    type: "mindset",
    mindset: "holographic",
    tags: [
      "Статик",
      "Негативист",
      "Параллельная логика",
      "Фрактал",
      "Многоракурсность",
    ],
    title: "Голографическое",
    subtitle: "Периодический поворот объекта мысли разными гранями.",
    content: [
      "Многоракурсность, полнота описания, простота и четкость.",
      "Очень плотно упаковывают информацию — «подобное в подобном». ",
      "Достигают хорошей четкости мысли, поворачивают предмет мысли, скачкообразно меняют угол рассмотрения или критерий суждения.",
      "Имеет характерный скелетно-схватывающий, проницающий характер, расширяет имеющийся выбор.",
      "Соответствует устойчивая, незомбирующаяся психика.",
      "Лидер анализируя, упрощает ситуацию до двух-трех проекций. Аналитик поворачивает объект вокруг его смысловых осей. Советчик улавливает альтернативные побуждения человека. Хранитель прощупывает человека с разных сторон.",
    ],
  },
  {
    type: "mindset",
    mindset: "vortical",
    tags: ["Динамик", "Позитивист", "Случайные комбинации", "Перебор"],
    title: "Вихревое",
    subtitle:
      "Циркуляция мыслей вокруг волнующего вопроса, перебор вариантов, пробы и ошибки.",
    content: [
      "Мыслят подвижно, идут к одной точке притяжения, часто поворачивают вспять, перескакивают на предыдущий уровень, что сворачивает их поток мыслей в вихрь.",
      "Протекает как быстрый перебор вариантов, их апробация и последующий отсев тех, которые не дают результата.",
      "Испытательность — продвижение к цели через пробы и ошибки.",
      "Вера в успех, везучесть. Турбулентный поток — поведение такого потока нельзя предсказать.",
      "Это мышление труднее всего принимается.",
      "Энтузиаст инициирует социальные процессы. Лирик перебирает в голове образы и тестирует их. Предприниматель перебирает варианты и тестирует их на пригодность. Мастер прокручивая информацию, выделяет удачные варианты действий.",
    ],
  },
];

export default DETAIL_MINDS;
