<template>
  <div class="text g-page">
    <section>
      <UiText preset="large" color="role">
        Вашей сильной стороной является неистощимая любознательность к явлениям
        окружающего мира.
      </UiText>

      <UiText>
        Вы стремитесь к различным знаниям, охотно путешествуете, при этом не
        просто созерцая условия жизни, природу, архитектуру, но и стараясь
        пополнить свой запас знаний. У вас хорошо развит эстетический вкус.
      </UiText>

      <UiText>
        Глубинной целью вашей личности является комфорт, как в физическом смысле
        этого слова, так и в отношениях с людьми.
      </UiText>

      <UiText>
        Грубые манеры, бестактность, отсутствие душевной теплоты со стороны
        окружающих глубоко ранят вас. Вы стремитесь к гармонии, покою, здоровому
        образу жизни.
      </UiText>

      <UiText preset="large" color="role">
        Другой вашей сильной чертой является деловая логика, благодаря которой
        вы умеете рационально вести свои дела. В своих поступках вы
        руководствуетесь исключительно здравым смыслом и чувством реальной
        пользы.
      </UiText>

      <UiText>
        За бесполезные дела предпочитаете не браться. Но если дело вас
        интересует, вы можете развить большую работоспособность, действуя четко,
        размеренно и неуклонно.
      </UiText>

      <UiText>
        В таких случаях вы заранее предусматриваете все детали работы,
        подготавливаете все необходимое, проявляя при этом изобретательность,
        завидную практичность и расторопность.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Ваша слабая черта — неумение проявлять свои чувства к людям, из-за чего
        окружающим вы можете казаться холодным и равнодушным человеком.
      </UiText>

      <UiText>
        Присущая вам внутренняя напряженность провоцирует иногда вспышки гнева,
        когда вам трудно сдержать свои эмоции, хотя впоследствии вы сильно
        сожалеете об этом.
      </UiText>

      <UiText>
        Так как проявление оттенков чувств и эмоций дается вам с трудом, вы
        предпочитаете сентиментальности шутливую манеру разговора, из-за чего
        можете быть иногда неправильно поняты.
      </UiText>

      <UiText>
        Свои неудачи вы предпочитаете переживать молча, в одиночестве. Чтобы не
        было ситуаций непонимания, старайтесь доверять партнеру и говорить с ним
        серьезным тоном.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Другой вашей проблемой является значительный заряд скептицизма: это
        также определяет ваше пессимистическое отношение к будущему.
      </UiText>

      <UiText>
        Вы часто предаетесь меланхолии и унынию, у вас могут опуститься руки и
        пропасть желание действовать. Ваша апатия во многом мешает вам проявить
        размах и добиться в жизни большего, чем подсказывает вам личный опыт.
      </UiText>

      <UiText>
        Вам можно рекомендовать чаще путешествовать, менять хотя бы в мелочах
        привычный уклад жизни. Новые впечатления вызовут интерес к изучению
        истории.
      </UiText>

      <UiText preset="large" color="role">
        Постарайтесь найти дело по душе, которое наполнит вашу жизнь смыслом,
        устремит вас в будущее. Увлеченность работой — лучшее лекарство от
        скепсиса и апатии.
      </UiText>

      <UiText>Не позволяйте меланхолии овладеть вами.</UiText>

      <UiText>
        В такие минуты отправляйтесь к друзьям, на прогулку, в кино, театр.
        Больше времени проводите с веселыми людьми, заряжающими вас
        положительными эмоциями.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
