<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    С первого взгляда кажутся людьми уверенными в себе и пробивными.
  </UiText>

  <UiText class="description">
    Часто отпор бывает обидным для оппонента, но он не всегда способен сдержать себя и промолчать.
  </UiText>

  <UiText class="description">
    При этом с близкими людьми это мягкий и приятный человек, который никак не проявляет агрессию.
  </UiText>

  <br />
  
  <hr />

  <UiText class="description">
    Вовсе не желает быть самым сильным или волевым, а стремится только к соблюдению некоего норматива кинетической энергии.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Никогда не нападает первым; его воля и физическая сила проявляются только в самозащите.
  </UiText>

  <UiText class="description">
    Никогда не позволяет себе быть самым слабым или находиться на низшей ступени иерархической лестницы. Он вообще не любит подчиняться и на чужие волевые проявления может отреагировать крайне резко.
  </UiText>

  <UiText class="description">
    Если он — руководитель, он управляет подчиненными жестко, напористо и бескомпромиссно: его воля должна быть выполнена, а принятые решения воплощены в жизнь.
  </UiText>

  <UiText class="description">
    Слабых и безвольных людей презирает и старается изо всех сил не попасть в их число.
  </UiText>

</template>

<style lang="scss" scoped></style>
