<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    На первый взгляд кажется человеком веселым и радушным.
  </UiText>

  <UiText class="description">
    Он улыбается, дарит позитивные эмоции, много смеется. Любит дружеские компании, когда в приятной атмосфере можно поговорить, поспорить, обсудить что-то.
  </UiText>

  <UiText class="description">
    Часто может быть резким, не всегда способен контролировать эмоции.
  </UiText>

  <UiText class="description">
    Если его довести «до ручки», то он способен вспылить и накричать.
  </UiText>

  <br />
  
  <hr />

  <UiText class="description">
    Старается по мере возможности проявлять свою эмоциональность но ровно в тех пределах, которые негласно одобряются обществом.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Надо сказать, что эмоциональная палитра  довольно богата оттенками; он любит играть в театральном смысле этого слова и нередко считает себя неплохим актером.
  </UiText>

  <UiText class="description">
    Каждому показывает предназначенные для него одного эмоции, одаривает «эксклюзивными» чувствами, но выглядит это крайне неестественно, а точнее говоря, слишком правильно, шаблонно.
  </UiText>

  <UiText class="description">
    Его эмоциям при всем их разнообразии и динамичности трудно поверить, они лишены спонтанности и непосредственности.
  </UiText>

</template>

<style lang="scss" scoped></style>
