<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    С первого взгляда, выглядит человеком дисциплинированным, обязательным и исполнительным.
  </UiText>

  <UiText class="description">
    Представители этого типа умеют доводить дела до конца, работают, хоть и не очень быстро, но эффективно, достигая результата.
  </UiText>

  <UiText class="description">
    В любой ситуации старается отключить эмоции и разобраться с помощью логики и сопоставления фактов.
  </UiText>

  <UiText class="description">
    Очень терпелив, способен делать кропотливую работу.
  </UiText>

  <br />
  
  <hr />

  <UiText class="description">
    Пытается как можно лучше вписаться в существующую общественную иерархию, при этом вовсе не претендует на руководящие посты, а с радостью довольствуется средним положением. 
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Он гордится знанием правил поведения в крупных учреждениях и других системных общественных структурах.
  </UiText>

  <UiText class="description">
    Старается быть эрудированным, не хуже других разбираться в основных социально-экономических законах.
  </UiText>

  <UiText class="description">
    Иногда он даже излишне покорен и осторожен, слишком благоговеет перед вышестоящими.
  </UiText>

  <UiText class="attributes" preset="large" color="role">
    Может казаться чрезмерно педантичным, поскольку предполагает, что именно это качество ценится в обществе.
  </UiText>

</template>

<style lang="scss" scoped></style>
