<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Любят следить за собой, уделяют внимание выбору одежды, следят за модой. Умеют одеться стильно и красиво.
  </UiText>

  <UiText class="description">
    Хотят произвести впечатление ухоженных людей с прекрасным вкусом. Любят баловать себя: ходят на массаж, прислушиваются к желаниям своего тела, не перетруждают себя на работе.
  </UiText>

  <UiText class="description">
    Часто считают себя эстетами, стараются разбираться в дизайне, в модных течениях, в искусстве.
  </UiText>

  <UiText class="description">
    Ходят на выставки, любуются картинами художников, относят себя к творческим людям.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Тщательно приводит свой внешний вид в соответствие с требованиями социума.
  </UiText>

  <UiText class="description">
    Старается выглядеть здоровым и свободным от каких-либо неприятных ощущений, любит демонстрировать свою сексуальную независимость.
  </UiText>

</template>

<style lang="scss" scoped></style>
