<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Производит впечатления ухоженного человека, которого заботит его здоровье и комфорт.
  </UiText>

  <UiText class="description">
    Всегда старается быть опрятным, его вещи чисты и выглажены. Он любит покупать одежду и другие предметы для себя, часто неплохо готовит, бывает гурманом.
  </UiText>

  <UiText class="description">
    Ему приятно, если у него есть возможность питаться изысканными блюдами, но если такой возможности нет, то ему хватит и простой пищи.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Старается по мере сил обеспечить себе хотя бы минимум комфорта. 
  </UiText>

  <UiText class="description">
    Не стремится быть заметным, но тщательно приводит свой внешний облик (включая одежду, прическу, походку, аксессуары) в соответствие требованиям социума.
  </UiText>

  <UiText class="description">
    Не прочь пофантазировать на сексуальные темы, но внешне предпочитает оставаться в рамках общественных стандартов.
  </UiText>

</template>

<style lang="scss" scoped></style>
