<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    С первого взгляда выглядит человеком сухим, любителем формальностей.
  </UiText>

  <UiText class="description">
    Ему важно соблюдать законы, нормы поведения в обществе.
  </UiText>

  <UiText class="description">
    Очень болезненно воспринимают ситуации несправедливости. Представители этого типа стараются логически обосновывать свои чувства, анализировать проявления эмоций у себя и других людей.
  </UiText>

  <UiText class="description">
    Для ученика очень важно, чтобы информация была структурирована, хаотичную информацию ему воспринимать крайне сложно.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Изображает себя холодным, беспристрастным и объективным. 
  </UiText>

  <UiText class="description">
    Для него очень важно соблюдать общепринятые правила логических умозаключений и разбираться в основных закономерностях окружающего мира.
  </UiText>

  <UiText class="description">
    Хотел бы выглядеть эрудированным, но в то же время не выделяться среди окружающих своим интеллектом.
  </UiText>

  <UiText class="description">
    Главное для него — не оказаться в глазах общества «тупым и невежественным».
  </UiText>

</template>

<style lang="scss" scoped></style>
