<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    Производит впечатление человека улыбчивого, вежливого, доброго.
  </UiText>

  <UiText class="description">
    Он может легко начать общаться с человеком и также легко разойтись с ним спустя несколько часов.
  </UiText>

  <UiText class="description">
    Надежный человек как в работе, так и в личной жизни. Редко ходят «налево», считая измену недостойным настоящего мужчины поведением; также они практически никогда не предают друзей и близких.
  </UiText>

  <UiText class="description">
    При этом могут иногда позволить себе пофлиртовать просто ради самого процесса, не желая продолжения.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Очень хочет казаться вежливым, обходительным, безупречно этичным.
  </UiText>

  <UiText class="description">
    Неукоснительно следует общепринятым этическим нормам.
  </UiText>

  <UiText class="description">
    Для него очень важно общаться с людьми в строгом соответствии с их положением (социальным статусом), отношения с каждым из окружающих формируются не произвольно, а исходя из реалий общественной жизни.
  </UiText>

</template>

<style lang="scss" scoped></style>
