<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">
    На первый взгляд кажется человеком пунктуальным, старается приходить вовремя, правильно рассчитывать своё время на работу и отдых.
  </UiText>

  <UiText class="description">
    В ситуации, когда нет времени, но нужно действовать, не впадает в панику, а ищет способы решения проблемы, пытается выиграть время.
  </UiText>

  <UiText class="description">
    Очень не любит, когда ему навязывают временные графики, старается работать по удобному для себя расписанию.
  </UiText>

  <UiText class="description">
    Вовсе не желает быть самым сильным или волевым, а стремится только к соблюдению некоего норматива кинетической энергии.
  </UiText>

  <br />
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Считает нужным демонстрировать спокойное, непринужденное отношение ко времени и срокам выполнения работ.
  </UiText>

  <UiText class="description">
    Мастер подчеркнуто хладнокровен, даже в критических ситуациях не допускает спешки и суеты, отмахивается от каких-либо точных предсказаний, которые, с его точки зрения, нелепы и даже невозможны.
  </UiText>

  <UiText class="description">
    Для него очень важно свободно распоряжаться временем и не оказаться в цейтноте.
  </UiText>

  <UiText class="description">
    Он старается не опаздывать, но и приходить все время вовремя для него неприемлемо, так как это находится за пределами столь чтимых им социальных норм обращения со временем.
  </UiText>

</template>

<style lang="scss" scoped></style>
