<template>
  <div class="text g-page">
    <section>
      <UiText preset="large" color="role">
        Сильной стороной вашей личности является хорошо развитая интуиция,
        позволяющая вам безошибочно определять скрытые возможности и способности
        других людей.
      </UiText>

      <UiText>
        Ваша проницательность особенно остро отмечает отрицательные задатки в
        людях.
      </UiText>

      <UiText>
        Больше доверяйте своему первому впечатлению, так как ваша доброта и
        снисходительность могут заставить вас несколько идеализировать людей при
        более близком знакомстве.
      </UiText>

      <UiText>
        Вы умеете проявлять чуткость и внимание к окружающим, стараетесь помочь
        им разобраться в личных проблемах, сделать им приятное.
      </UiText>

      <UiText>
        Другой вашей сильной чертой является умение устанавливать с людьми
        теплые, доверительные отношения, что располагает их к откровенности.
      </UiText>

      <UiText>
        Эту откровенность вы стараетесь употребить им на благо — помочь своими
        дипломатическими советами выпутаться из трудных жизненных ситуаций,
        избежать насмешек и поспешных решений, о которых пришлось бы пожалеть в
        будущем.
      </UiText>

      <UiText>
        С другой стороны, если человек не оправдал вашего доверия или вызвал
        антипатию, вы воздвигаете между ним и собой невидимый барьер и
        стараетесь отдалиться от него.
      </UiText>

      <UiText>
        Ваши антипатии бывают так же сильны, как и симпатии. Но чаще всего вы
        умело поддерживаете с людьми гармоничные и ровные отношения. Вы —
        отличный дипломат.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Вашей слабой стороной является неумение заставить себя заниматься долгой
        кропотливой работой, следовать установленным правилам и регламенту,
        тщательно вести документацию, подробно прорабатывать детали, работать в
        тесноте, при большом скоплении людей, а также «уважать» иерархию
        независимо от индивидуальных качеств начальства.
      </UiText>

      <UiText>
        В жизни у вас возникают трудности из-за того, что в потоке дел, которыми
        вы занимаетесь, вам не всегда удаëтся отделить главное от
        второстепенного. Это ведет в конечном итоге к напрасной трате сил и
        переутомлению.
      </UiText>

      <UiText>
        Вам трудно дается беспристрастный логический анализ, отделение главного
        от второстепенного, из-за чего вы склонны утопать в бесконечных делах и
        смене увлечений.
      </UiText>

      <UiText>
        Вам также трудно правильно распределить мероприятия по времени, что
        ведет в конечном счете к физическому и нервному переутомлению и
        неудовлетворенности жизнью.
      </UiText>

      <UiText preset="large" color="role">
        Вам можно рекомендовать следующее: отработайте гибкий, но четкий
        распорядок дня и старайтесь его соблюдать.
      </UiText>

      <UiText>
        Планируя мероприятия на завтра, обязательно определяйте важность каждого
        из них.
      </UiText>

      <UiText>
        Доверяя своей наблюдательности, помните, что она у вас распространяется
        лишь на людей, а в деловой сфере прислушивайтесь к советам
        профессионалов, иначе неизбежны обвинения в верхоглядстве.
      </UiText>

      <UiText preset="large" color="role">
        Больше и вдумчивее читайте, записывайте наиболее важные правила и
        положения. Помните, на одной импровизации и общем представлении в эпоху
        НТР далеко не продвинешься.
      </UiText>
    </section>

    <section>
      <UiText>
        Другой вашей проблемой является недостаточно развитая сила воли,
        неумение держать себя в руках при любых обстоятельствах.
      </UiText>

      <UiText preset="large" color="role">
        Вы часто колеблетесь при принятии важных решений, а неожиданные вспышки
        агрессивности могут испортить ваши отношения с людьми.
      </UiText>

      <UiText>
        Хотя ваша смелость и решительность в экстремальных ситуациях часто
        выручает вас, но в спокойном состоянии вы периодически ощущаете апатию,
        ваш тонус падает.
      </UiText>

      <UiText>
        Воспитывайте в себе сдержанность и последовательность, заставляйте себя
        делать все более тщательно и старайтесь доводить начатую работу до
        конца.
      </UiText>

      <UiText>
        Не давите на окружающих без явного на то повода, предлагая навязчивые
        советы, требуя от них немедленного выполнения чего бы то ни было.
      </UiText>

      <UiText preset="large" color="role">
        Старайтесь управлять своими эмоциями. Вам очень полезны занятия
        аутотренингом.
      </UiText>

      <UiText>
        Если чувствуете, что конфликт неизбежен, старайтесь немедленно
        прекратить общение, чтобы не сожалеть впоследствии о сказанном или
        сделанном.
      </UiText>

      <UiText preset="large" color="role">Не нервничайте по пустякам.</UiText>

      <UiText>
        Не сосредоточивайтесь на своих переживаниях, так как это может
        отрицательно сказаться на вашем здоровье.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
