<template>
  <div class="text g-page">
    <section>
      <UiText preset="large" color="role">
        Ваша сильная сторона — умение давать справедливую моральную оценку
        поступкам человека.
      </UiText>

      <UiText>
        Вы нетерпимы к проявлениям зла и несправедливости в отношениях между
        людьми. Вы умеете ценить чувство долга и нравственные устои. Вы
        требовательны к себе и другим в вопросах совести и морали.
      </UiText>

      <UiText>
        Вы умеете войти в доверие к человеку, вникая в его проблемы, находя
        интересную для него тему разговора. Вы стараетесь понять человека,
        выслушать его, помочь советом.
      </UiText>

      <UiText>
        Вы редко ошибаетесь в оценке отношений к себе других людей.
      </UiText>

      <UiText>
        Вы — человек собранный, волевой и решительный, при необходимости можете
        постоять за себя и своих близких.
      </UiText>

      <UiText>
        Самоотверженный труженик, не жалеющий своих сил для поддержания чистоты
        и порядка в доме и на работе.
      </UiText>

      <UiText>
        К поставленной цели вы продвигаетесь настойчиво и последовательно. Вы
        прямы и бескомпромиссны в отстаивании своих взглядов и критике
        недостатков.
      </UiText>

      <UiText>
        За принципиальность, твердость и серьезность вас уважают и ценят люди.
      </UiText>

      <UiText>
        За принципиальность, твердость и серьезность вас уважают и ценят люди.
      </UiText>
    </section>

    <section>
      <UiText>
        В жизни вам приходится сталкиваться с необходимостью избегать
        неопределенных, непонятных ситуаций.
      </UiText>

      <UiText>
        В таких ситуациях вам бывает трудно проявить выдержку и терпение. Вы не
        любите долго ждать решения важного для вас вопроса — для вас очень важно
        обеспечить благоприятный исход вашего дела в краткий срок.
      </UiText>

      <UiText preset="large" color="role">
        Более терпимо относитесь к достоинствам и недостаткам окружающих вас
        людей.
      </UiText>

      <UiText>
        Больше читайте разнообразной литературы по различным отраслям знаний.
        Это поможет вам развить в себе навыки целостного представления о мире.
      </UiText>

      <UiText>
        Не замыкайтесь в своих рамках, контактируйте с большим количеством
        людей. Это вселит в вас большую уверенность в ваших способностях.
      </UiText>
    </section>

    <section>
      <UiText>
        Другой вашей проблемой является неумение создавать непринужденную
        атмосферу в общении с людьми.
      </UiText>

      <UiText preset="large" color="role">
        В работе, в коллективе вы предпочитаете индивидуальный труд.
      </UiText>

      <UiText>
        Присутствие большого количества людей утомляет вас. Не ставьте во главу
        угла общение только с нужными людьми, чтобы не вызывать ложного
        впечатления о себе как о расчетливом человеке.
      </UiText>

      <UiText preset="large" color="role">
        Будьте естественны в проявлении своих эмоций, преодолевайте свою
        внутреннюю скованность.
      </UiText>

      <UiText>
        Избегайте двух крайностей: излишней официальности, с одной стороны, и
        развязности и распущенности — с другой.
      </UiText>

      <UiText preset="large" color="role">
        Старайтесь не смотреть на собеседника в упор, так как это многих
        смущает. Чаще улыбайтесь людям, показывайте своё расположение к ним.
      </UiText>

      <UiText>
        Помните, что улыбкой и добрым словом вы можете снять напряжение и
        установить нужную вам дистанцию в общении, тем самым вы расположите
        людей к ответной любезности.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
