<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <div class="warning">
      <UiText preset="small" color="accent">
        Описания не должны обязательно совпадать со всеми чертами характера
        личности.
      </UiText>

      <UiText preset="small" color="accent">
        Идея как раз описать наблюдаемые у среднего представителя типа
        особенности поведения и обработки информации психикой.
      </UiText>
    </div>

    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Велта Микелсоне"
          subtitle="10 минут"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Вера Стратиевская"
          subtitle="35 минут"
          target-content-id="tab-2"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText preset="subtitle" color="role">
            Хозяйственный и уравновешенный человек, которого мало что может
            вывести из себя.
          </UiText>

          <br />

          <UiText>
            Тонкий ценитель красоты. У него всегда своё мнение о том, что
            красиво и гармонично. Он хорошо знает свои и чужие материальные и
            эстетические нужды. Разбирается в искусстве.
          </UiText>

          <UiText preset="large" color="role">
            Ярко выраженная физическая чувствительность к прикосновениям.
          </UiText>

          <UiText>
            Ему неприятны прикосновения чужих людей. Также хорошо развиты вкус,
            слух и обоняние. Его глаза быстро замечают все недостатки –
            халатность в работе, недочеты в строительстве, безвкусицу в одежде и
            прочее.
          </UiText>

          <UiText preset="large" color="role">
            С ранних лет учится закаляться и владеть своим телом.
          </UiText>

          <UiText>
            Редко болеет и не показывает свою слабость. Разбирается в причинах
            недомоганий и знает, как своевременно от них избавиться. Его походка
            равномерная и ритмичная. Движения сдержанные, без лишних усилий,
            создается впечатление, будто он бережет энергию и силы.
          </UiText>

          <UiText>
            Гигиена на первом месте. Одежда всегда продумана, хорошо прилегает к
            телу, всегда опрятная (даже рабочий костюм), тщательно следит за
            ней. В одежде предпочитает пастельные тона, все элементы одежды
            согласованы между собой.
          </UiText>

          <UiText>
            Ценит удобство и комфорт. С удовольствием наслаждается спокойным
            отдыхом в семейном кругу, в своем доме, а также на природе.
            Однообразный образ жизни наводит на него скуку, поскольку как
            мастеру ему нужны острые ощущения.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Не занудный и не капризный, не желает обременять других своими
            проблемами.
          </UiText>

          <UiText>
            Покупки делает своевременно и продумано, учитывая практичность и
            целесообразность, у него в доме нет ничего лишнего. Хотя он
            бережливый, но свои желания удовлетворяет полностью. Не экономит на
            питании, выбирает только качественные продукты.
          </UiText>

          <UiText preset="large" color="role">
            В некоторых ситуациях способен упрекать других в небережливости.
          </UiText>

          <UiText>
            Всегда находит подходящее время для своих иронических замечаний,
            чтобы упрекнуть в непрактичности, всегда сопоставляя положительный
            пример других людей.
          </UiText>

          <UiText>
            В сложных кризисных ситуациях умеет обходиться минимумом. Не
            откажется выпустить из рук то, что принадлежит ему по праву. Когда
            возникает угроза его материальному состоянию, для устранения
            неприятностей готов применить любые методы. Заботится о материальном
            состоянии своих близких. Следует отметить, что Мастер не всегда
            принимает своих родственников в кругу своих близких. Бывает, что
            даже его мать или отец не близкий ему человек. Это потому, что в
            дискомфортных отношениях он отдаляется от близких, и не желает
            углубляться в причины таких отношен.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Избегает конкуренцию, поскольку он борец-одиночка.
          </UiText>

          <UiText>
            Часто достигает успехов, настойчиво стремится к своей цели,
            рассчитывая на максимальный результат. Обычно выбирает одно узкое
            направление, и упрямо движется по нему, другой раз упуская
            возможности.
          </UiText>

          <UiText preset="large" color="role">
            Казалось бы, что получив плоды своей работы, сразу обдумывает, куда
            еще вложить чтобы приумножить.
          </UiText>

          <UiText>
            Это не всегда объясняется недостатком лишних денег, ему необходимо
            действовать. Однако, было отмечено, что каждое новое дело Мастера
            приносит деньги.
          </UiText>

          <UiText>
            На своем рабочем месте применяет все возможные средства для
            комфортной работы — удобные помещения, мебель, новейшая техника и
            оборудование.
          </UiText>

          <UiText>
            Под его руководством производство идет на самом высшем уровне —
            производится товар высокого качества, выдерживает конкуренцию. При
            этом он стремится упростить методы работы.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Прежде чем взяться за работу, заранее тщательно продумывает детали,
            чтобы излишне не тратить свои силы.
          </UiText>

          <UiText>
            Со стороны может казаться, что он малоподвижный и ленивый, но на
            самом деле везде, где приложит свои руки Мастер, работа идет быстро,
            красиво и качественно, и её никому не надо переделывать.
          </UiText>

          <UiText preset="large" color="role">
            Лучшая благодарность за работу — это достойная зарплата.
          </UiText>

          <UiText>
            Его жизнь течет как бы по плану, но одновременно гибко.
            Целесообразно использует время, быстро соображает, что необходимо на
            настоящий момент. Также из-за мелочей не задерживает других, у него
            все уже придумано.
          </UiText>

          <UiText>
            Его распорядок дня составлен в определенном ритме, который он с
            трудом меняет. Если обстоятельства заставляют, быстро
            приспосабливается. У него все распределено — когда работать, а когда
            отдыхать. Старается не нарушать порядок.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Интуиция его слабое место, он не в состоянии осознать, когда и где
            назревают опасности.
          </UiText>

          <UiText>
            Терпеть не может неконкретности и неопределенности – ни какие «может
            быть», «наверное», «возможно». Таких слов в общении с Мастером лучше
            не употреблять. Ему необходима конкретность, точное место, время и
            события, которые происходят.
          </UiText>

          <UiText>
            Внутренний мир другого человека интересует его лишь тогда, когда это
            непосредственно относится к нему. Нельзя сказать, что он
            бесчувственный человек, но ему не свойственно сопереживать чужим
            людям.
          </UiText>

          <UiText preset="large" color="role">
            К тому же, он неуверен, правильно ли понимает людей. Не умеет быть
            гибким в отношениях. Под своей искусственной улыбкой он прячет свою
            неловкость в общении.
          </UiText>
        </section>

        <section>
          <UiText>
            Он умеет налаживать отношения без психологического давления, редко
            поднимает голос. Он не применяет громкие крики, разъяснения
            отношений, сплетни.
          </UiText>

          <UiText preset="large" color="role">
            Его нельзя публично задеть, в таких случаях может быть резок и
            удалится.
          </UiText>

          <UiText>
            Хотел бы, чтобы его понимали без слов, ведь он сам часто не
            понимает, что с ним происходит. Он хочет знать, каких поступков
            стоит ожидать от другого, но он этого понять не в силах. Обычно
            оценивает людей по принципу – на сколько он нуждается в этом
            человеке как в профессионале, на что он способен.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Плохо разбирается в своих чувствах — любит или не любит.
          </UiText>

          <UiText>
            Иногда осознает любовь лишь тогда, когда её потерял. Влюбляется
            осторожно. Внутренние ощущения любви его пугают, поскольку не
            соображает, что с ним творится. Поэтому изначально старается как
            будто тормозить чувство любови, на время удаляясь от партнера.
            Погружаясь в любовь «с головой», способен полюбить на долгое время.
            Не переносит эмоциональных, ветреных и шумных людей.
          </UiText>

          <UiText>
            Ему интересны умные люди, которые умеют деликатно держаться и тонко
            выражать свои чувства.
          </UiText>

          <UiText preset="large" color="role">
            Заслужить его симпатию сложно, а потерять легко — прощает он с
            трудом.
          </UiText>
        </section>

        <section>
          <UiText>
            Близким открывается постепенно, сохраняя определенную
            таинственность.
          </UiText>

          <UiText preset="large" color="role">
            Чужим не открывается, но в кругу своих и близких людей он совершенно
            другой человек.
          </UiText>

          <UiText>
            Способен быть добродушным, веселым, ласковым, заботливым, взяв на
            себя почти все заботы.
          </UiText>

          <UiText>
            Он — хозяин своей жизни, при этом он чувствует себя зависимым от
            судьбы. Не поддается панике, полагается на свои ощущения и здравый
            смысл, ищет и находит выход из любой ситуации. Иногда озвученная им
            металлическим тоном фраза и небрежно брошенный холодный взгляд
            действуют лучше чем громкий крик.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Обладает хорошей памятью. В памяти держит только то, что разумно и
            необходимо и целесообразно.
          </UiText>

          <UiText>
            Способен открыто высказать замечание по поводу нелогичности поступка
            другого. Если Мастер замешан в бестолковой, на его взгляд сделке,
            способен повлиять, чтобы ситуация целом изменилась к лучшему.
          </UiText>

          <UiText>
            Не терпит бюрократию и проверки. Если в чем-то уверен — не отступит
            и будет упрямствовать. Он хороший организатор, может выполнить
            работу с меньшей затратой сил и с меньшим числом работников. В
            работе скрупулезен. Внимателен к новой информации.
          </UiText>

          <UiText preset="large" color="role">
            Врожденные изысканные манеры. Порой может упрекать родителей за то,
            что не получил достаточно хорошего воспитания и образования.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="small" color="accent">1 — Базовая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_comfort" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Комфорт</UiText>
              <UiText preset="body">Сенсорика ощущений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Для представителей этого типа характерно стремление оградить себя от
            неприятных ощущений.
          </UiText>

          <UiText color="role">
            Уйти в уютное, комфортное уединение, уйти в приятное общество, в
            «теплую компанию», допускающую легкие и ни к чему не обязывающие
            отношения; уйти в воспоминания, ярко и точно воссоздающие приятные
            впечатления, однажды пережитые и надолго запомнившиеся.
          </UiText>

          <UiText color="accent">
            «Я как сейчас помню запах свежескошенной травы футбольного поля, на
            которое я вышел первый раз в жизни… »
          </UiText>

          <UiText>
            Мастеры наделены исключительной памятью на приятные ощущения.
            Способны воссоздать и описать ощущение цвета, запаха, вкуса. Описать
            впечатление пережитого, увиденного и услышанного.
          </UiText>

          <UiText>
            Мастер умеет наблюдать ощущение, испытываемое другим человеком.
            Причем особенно хорошо замечает неприятные ощущения.
          </UiText>

          <UiText preset="large" color="role">
            Мастер — единственный из всех типов личности, кто совершенно
            безошибочно подмечает те самые сокровенные ощущения и потребности,
            которые не всякий человек в себе замечает и в которых не всегда себе
            признается.
          </UiText>

          <UiText>
            Более того, Мастер может подойти к незнакомому человеку и сказать
            ему об этом. Может подсказать, как избавиться от неприятных
            ощущений, может ему в этом помочь.
          </UiText>

          <UiText color="accent">
            Например, может по глазам человека определить, что тот голоден,
            может пригласить его к себе домой и накормить.
          </UiText>

          <UiText color="role">
            Физическую неудовлетворенность человека определяет безошибочно,
            более того, не может остаться к ней безучастным. Мастера раздражает
            даже невольное наблюдение чужих страданий.
          </UiText>

          <UiText>
            Мастер очень дорожит созданным им ощущением физического и душевного
            комфорта. Поэтому старается избегать раздражителей, разрушающих его
            внутреннюю гармонию.
          </UiText>

          <UiText>
            А раздражать его может и неэстетичность чьего-либо облика, и резкие
            запахи или звуки, и тусклое освещение, и перегруженный интерьер, и
            обшарпанные стены, и неприятные интонации в голосе. Любое проявление
            физического и эмоционального дискомфорта влияет на его настроение,
            иногда даже на потенцию, вызывает у него внутренний протест, желание
            срочно сменить обстановку.
          </UiText>

          <UiText>
            Мастер всегда старается изолировать себя от окружающих
            раздражителей.
          </UiText>

          <UiText color="accent">
            Например, находясь дома, может отключать телефон, чтобы ничто не
            мешало его приятному уединению.
          </UiText>

          <UiText>
            Следуя своей сенсорной системе взаимоотношений, Мастер предпочитает
            воспринимать гармонию ощущений в комплексе: объект одновременно
            должен быть и эстетичным на вид, и приятным на ощупь, на цвет, на
            вкус и на запах. Гармония воспринимаемых ощущений — основное
            требование, предъявляемое представителями этого типа к окружающей их
            действительности.
          </UiText>

          <UiText color="role">
            Представителям этого типа свойственна спокойная, размеренная
            пластика движений. Сочетание внешней мягкости и расслабленности с
            внутренней сдержанностью.
          </UiText>

          <UiText>
            Одеваются просто, удобно и со вкусом. Любят практичный, спортивный
            стиль. Любую, даже рабочую одежду умеют носить с непринужденным
            изяществом. Независимо от предназначения одежды Мастеры всегда уютно
            и удобно себя чувствуют в том, что на них надето.
          </UiText>

          <UiText color="role">
            Менее всего Мастер заинтересован гнаться за модой, поскольку во
            вкусах довольно консервативен. Предпочитает выглядеть аккуратным и
            ухоженным, хотя не стесняется и в рабочей одежде появляться всюду,
            где ему заблагорассудится.
          </UiText>

          <UiText preset="large" color="role">
            Мастер умеет прислушиваться к своим ощущениям, любит о них
            рассказывать, анализировать их.
          </UiText>

          <UiText>
            Ценит естественную красоту и остроту ощущений. Неполнота получаемых
            ощущений, равно как и пресыщение ими его раздражает, иногда вызывает
            отвращение.
          </UiText>

          <UiText>
            Стремление к удовольствиям для Мастера — это скорее норма жизни.
          </UiText>

          <UiText color="accent">
            «А кто не стремится к удовольствиям? А что, нужно жить и обязательно
            мучиться? Если бы у меня было десять жизней, я бы одну прожил так,
            как хочет мама, другую - как хочет жена... Но у меня одна жизнь и я
            ее проживаю так, как я хочу.»
          </UiText>

          <UiText>
            С мнением, что «за всякое удовольствие в этой жизни нужно платить»,
            категорически не согласен. Мастер вообще не принимает такой
            постановки вопроса.
          </UiText>

          <UiText preset="large" color="role">
            Удовольствие в его понимании — индивидуальный настрой субъективных
            ощущений. Умение настраиваться на получение удовольствия — это его
            субъективная способность, его индивидуальная заслуга. Так, зачем же
            нужно за это расплачиваться?
          </UiText>

          <UiText>
            Ни при каких обстоятельствах Мастер не подставит под удар свое
            личное благополучие, комфорт и покой.
          </UiText>

          <UiText>
            Более того, таких обстоятельств он старается не создавать, а если
            они уже сложились неблагоприятным для него образом, старается выйти
            из ситуации с наименьшими для себя потерями.
          </UiText>

          <UiText>
            Вследствие таких установок Мастер может показаться человеком
            эгоистичным и себялюбивым. И такое мнение окружающих действительно
            существенно усложняет жизнь представителям этого типа.
          </UiText>

          <UiText>
            Впрочем, Мастеры упорно отстаивают свое право жить так, как им
            хочется, мотивируя его тем, что не намерены никому доставлять
            неприятностей и действительно очень переживают, если их образ жизни
            заставляет кого-то страдать.
          </UiText>

          <UiText>
            Мастерам доставляет удовольствие в первую очередь ощущение
            собственных сил и собственного здоровья. Многие из них стараются
            вести здоровый образ жизни. Отдают предпочтение тому виду спорта,
            который более насыщен яркими впечатлениями и сильными ощущениями:
            альпинизм, туризм, подводное плавание.
          </UiText>

          <UiText preset="large" color="role">
            Спорт для Мастера — это не только испытание выносливости, это еще и
            ощущение полноты жизни, яркости и полноты впечатлений.
          </UiText>

          <UiText color="accent">
            Образ отважного путешественника-первопроходца необычайно привлекает
            представителей этого типа, поэтому некоторые из них в числе любимых
            писателей в первую очередь называют Джека Лондона.
          </UiText>

          <UiText>
            Многие Мастеры с удовольствием придерживаются здорового режима
            питания, увлекаются вегетарианской пищей или «сыроедением». Все без
            исключения представители этого типа великолепно умеют готовить,
            практически не учась этому. Ценят естественную красоту вкусовых
            ощущений. Поэтому могут спокойно придерживаться бессолевой диеты и
            обходиться без острых приправ.
          </UiText>

          <UiText>
            Серьезно занимаются профилактикой своего здоровья, диетами,
            гимнастиками. Некоторые из них в стремлении выйти на максимально
            эффективный биоэнергетический режим и добиться полной концентрации
            ощущений увлекаются йогой, занимаются медитацией, стремятся познать
            пределы своих сенсорных возможностей.
          </UiText>

          <UiText preset="large" color="role">
            Любят ходить пешком, причем в их походке чувствуются слаженность и
            размеренный автоматизм движений. На протяжении всей ходьбы Мастеры
            держат ровный, однажды заданный темп.
          </UiText>

          <UiText>
            Не любят останавливаться, дожидаясь отставших. Поэтому предпочитают
            ходить пешком в одиночестве. Ходьба для Мастеров — еще и способ
            сосредоточиться на своих мыслях. Процесс ходьбы для них иногда
            бывает важнее цели следования.
          </UiText>

          <UiText>
            Мастеры наделены тонким ощущением гармонии цвета, линии и формы.
            Тонко чувствуют цветовые сочетания, ощущают меру насыщенности цвета,
            динамику линии, легкость и незагромажденность форм.
          </UiText>

          <UiText color="role">
            Не любят подавляющей монументальности. Им нравятся простые формы,
            лишенные декоративных излишеств. Умеют рационально использовать
            пространство, даже в тесном помещении могут создать иллюзию простора
            и ощущение неперегруженного пространства.
          </UiText>

          <UiText>
            Образец эстетики Мастера точнее всего представлен эстетическими
            традициями Японии: сочетание гармонии и функциональности простых и
            естественных форм.
          </UiText>

          <UiText preset="large" color="role">
            В доме не терпят лишних вещей и без сожаления их выбрасывают. В быту
            умеют обходиться малым. Умеют организовать комфорт самыми
            минимальными средствами.
          </UiText>

          <UiText color="role">
            Умеют создать ощущение уюта и благоустроенности при любых условиях и
            обстоятельствах.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">2 — Творческая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_business" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Практика</UiText>
              <UiText preset="body">Деловая логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Представители этого типа наделены способностью действовать
            расчетливо, продуманно, целесообразно в любой, самой непредвиденной
            ситуации. Любую проблему, любую техническую задачу они решают
            методично и рационально.
          </UiText>

          <UiText color="role">
            Из любой работы стараются извлечь максимум пользы, любую идею
            разрабатывают так, чтобы она реализовалась с максимальной отдачей.
          </UiText>

          <UiText>
            Свое предназначение Мастер видит в том, чтобы разрабатывать новые
            методики и новые технологии. Любое научное открытие интересует его с
            точки зрения именно практического приложения.
          </UiText>

          <UiText>
            К любой работе применяет рациональный подход, причем его рационализм
            ставит в первую очередь своей целью повышение эффективности и
            облегчение условий труда.
          </UiText>

          <UiText preset="large" color="role">
            Любую работу выполняет качественно, методично, в размеренном темпе,
            тщательно прорабатывая детали.
          </UiText>

          <UiText>
            Рабочее место тщательно подготавливают, оборудуя всем необходимым.
            Рабочие инструменты у Мастера всегда аккуратно разложены — иногда
            даже на одинаковом расстоянии друг от друга. Процесс подготовки к
            работе для Мастера такое же священнодействие, как и сама работа.
          </UiText>

          <UiText color="role">
            Что бы ни делал Мастер, чем бы ни занимался, он все делает неспешно,
            обстоятельно, получая максимум удовольствия от самого процесса
            работы.
          </UiText>

          <UiText>
            С энтузиазмом может взяться за любое интересное дело, лишь бы оно
            приносило реальный, ощутимый результат. Может кропотливо и методично
            разбирать самые сложные и запутанные дела.
          </UiText>

          <UiText>
            Может успешно выполнять работу, которая другим кажется совершенно
            невыполнимой, например, починить безнадежно испорченный прибор,
            используя для этого самые неожиданные приспособления.
          </UiText>

          <UiText color="role">
            Но вот если Мастер откажется ремонтировать какую-либо вещь и
            посчитает, что она окончательно утратила свои функциональные
            свойства, ее можно смело выбрасывать.
          </UiText>

          <UiText>
            Любую сложную и трудноразрешимую проблему умеет разделить на
            несколько поэтапных, посильно разрешаемых задач.
          </UiText>

          <UiText color="accent">
            « …А ты представь, что твоя проблема — это как огромная земляная
            гора и разгрести ее можно, только если будешь по горстке разносить
            землю в сторону. Хотя бы каждый день по одной горстке… А там
            глядишь, проблема сама собой решится.»
          </UiText>

          <UiText>
            Для Мастера процесс решения проблемы — это такая же работа. Поэтому
            он старается решать ее планомерно, последовательно, целенаправленно,
            с удовольствием. Удовольствие доставляет сознание того, что дело,
            хоть и медленно, но продвигается.
          </UiText>

          <UiText preset="large" color="role">
            Мастер умеет и любит услужить делом. Конкретная помощь в решении
            деловых, технических и бытовых вопросов — в его понимании самый
            лучший способ доказать свою дружбу и добиться расположения.
          </UiText>

          <UiText>
            Никогда не будет заниматься делом, которое не приносит ему
            морального удовлетворения. Важно, чтобы его работа хорошо
            оплачивалась, но может сделать ее и бескорыстно, «в качестве
            подарка». Если работа его увлекает, с удовольствием занимается ею и
            в свое свободное время.
          </UiText>

          <UiText>
            Поэтому такая тактика нужна в первую очередь именно Мастеру,
            поскольку постоянно подпитывает его интерес и стабилизирует его
            отношения. В противном случае, Мастеру вообще рискует остаться без
            партнера. Только проницательный и дальновидный Советчик способен
            составить ему во всех отношениях достойную пару.
          </UiText>

          <UiText>
            Свое мнение в деловых вопросах предпочитает доказывать результатами
            работы. Доволен, когда его труд получает высокую оценку. В любом
            деле стремится достичь высокого профессионализма. К оценке любой
            работы — и своей и чужой, относится очень критично. Требователен и к
            себе и к другим. Его похвалу бывает нелегко заслужить.
          </UiText>

          <UiText color="role">
            Оценивая эстетическую сторону выполняемой работы, придает немалое
            значение и оригинальности общего замысла.
          </UiText>

          <UiText>
            Причем оригинальность иногда даже оценивает выше эстетики, поскольку
            Мастер очень внушаем этим аспектом. Поэтому работа, не отличающаяся
            оригинальностью, даже если она эстетически безукоризненна может не
            вызвать у него восторга. Так же им будет забракована и работа, не
            отвечающая его собственному представлению о заданной теме.
          </UiText>

          <UiText>
            Мастер обожает инструктировать, объясняет все четко и доходчиво.
            Умеет и любит обучать. И поучать. Ему приятно, когда по любому
            поводу к нему обращаются за советом или консультацией. Чем
            великолепно пользуется его дуал Советчик. Считает своим долгом
            обучать даже самым простым вещам.
          </UiText>

          <UiText color="accent">
            Например, подавая чай, тут же объясняет гостям, как он его
            заваривает.
          </UiText>

          <UiText preset="large" color="role">
            Любит в доступной и доходчивой форме объяснять последовательность
            выполняемой им работы.
          </UiText>

          <UiText color="role">
            Любит работать наглядно, в присутствии «зрителей».
          </UiText>

          <UiText color="accent">
            Например, чинит электроприбор и тут же объясняет, в чем причина его
            поломки и как надо его правильно эксплуатировать.
          </UiText>

          <UiText>
            Качество, высоко ценимое его дуалом Советчиком, в руках которого все
            очень быстро ломается, поскольку он обычно не утруждает себя чтением
            инструкций, но именно поэтому благодарен всякому, кто берется
            починить его вещь.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">3 — Ролевая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_time" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чутьё</UiText>
              <UiText preset="body">Интуиция времени</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Время Мастера затрачивается на то, что доставляет ему удовольствие,
            на то, что ему приятно, на то, что его увлекает, и на то, что ему
            интересно. А поскольку его интерес насыщается иногда довольно
            быстро, в распорядке Мастера периодически возникают непредвиденные
            пустоты, которые он спонтанно заполняет любимой работой, общением с
            друзьями, «самопознанием».
          </UiText>

          <UiText color="role">
            Любит неспешный, размеренный ритм жизни, хотя периодически у него
            возникает желание жить более интенсивно и деятельно.
          </UiText>

          <UiText>
            Представители этого типа предпочитают жить по гибкому и мобильному
            графику, стараясь заранее ничего не загадывать и не планировать.
          </UiText>

          <UiText color="accent">
            Например, Мастер может явиться на назначенную им встречу, но через
            15 минут ощутить скуку и желание «сменить обстановку».
          </UiText>

          <UiText color="role">
            А поскольку терпеть дискомфорт — выше его сил, он обычно ссылается
            на непредвиденные, «неотложные дела» и уходит туда, где, как ему
            кажется, он сможет провести время более приятно и интересно.
          </UiText>

          <UiText>
            Мастеру трудно быть пунктуальным, хоть он и старается везде
            успевать. Ему хочется выполнить все намеченные дела, хочется, чтобы
            работа была более продуктивной, а деятельность более плодотворной,
            поэтому он старается продуктивно расходовать время.
          </UiText>

          <UiText color="role">
            Иногда заставляет себя распланировать свой день и выполнить все
            намеченное, но потом замечает, что процесс работы с оглядкой на часы
            не доставляет ему никакого удовольствия.
          </UiText>

          <UiText>
            И кроме того, постоянно возникают какие-то соблазны, от которых ему
            не хочется отказываться в угоду своему распорядку.
          </UiText>

          <UiText color="accent">
            Например, если он рассчитывает зайти к соседям «на минутку», но
            застает там приятное общество, к которому его приглашают
            присоединиться, разве он сможет отказаться? Таким образом его
            «минутка» растягивается на несколько часов, а иногда может
            продлиться до утра.
          </UiText>

          <UiText>
            Мастеру трудно везде успеть, трудно быть обязательным. Хотя ему
            бывает очень неприятно расплачиваться за свою вынужденную
            необязательность, при том, что он вообще не любит доставлять
            кому-либо неудобства или создавать какие-то проблемы.
          </UiText>

          <UiText color="role">
            Именно поэтому Мастер старается не давать никаких определенных
            обещаний. Но то, что им обещано, как правило, выполняется — за
            исключением тех обещаний, которые даются им в принудительном
            порядке.
          </UiText>

          <UiText>
            И именно поэтому Мастеру удобен такой партнер, который не требует от
            него отчета о неизвестно где и с кем проведенном времени, не требует
            никаких гарантий на будущее и снисходительно относится к изменению
            его планов; партнер, который не заставляет его любой ценой
            придерживаться намеченного распорядка и не требует от него
            неукоснительного выполнения взятого на себя обязательства.
          </UiText>

          <UiText>
            Таким партнером для Мастера является его дуал Советчик, показывающий
            образец еще более расхлябанного графика, великолепно умеющий
            испытывать терпение Мастера, тем, что намеренно опаздывает на
            назначенную встречу или вообще на нее не приходит.
          </UiText>

          <UiText>
            С помощью такой тактики Советчик заставляет Мастера особенно сильно
            желать назначенной встречи и великолепно использует фактор времени
            как своего рода тактический прием, как инструмент своей этической
            игры. И именно так это Мастером и воспринимается, поэтому он с
            удовольствием втягивается в эту полуигру — полуотношения, где все
            требования предъявляются как бы не всерьез.
          </UiText>

          <UiText>
            Мастер не упустит случая продемонстрировать свою проницательность.
            Иногда на основании одной короткой встречи может рассказать о
            человеке много интересного — о его характере, о предполагаемых
            поступках, о его слабостях и комплексах.
          </UiText>

          <UiText preset="large" color="role">
            Тренирует свою интуицию: пытается прогнозировать развитие своих
            взаимоотношений с тем или иным человеком на самой ранней стадии
            своего знакомства с ним.
          </UiText>

          <UiText>
            Обычно навязывает свой темп развития отношений. Имеет обыкновение с
            самого начала резко сокращать психологическую дистанцию, задавая
            отношениям многообещающий тон. Может в первые же минуты знакомства
            претендовать на физическую близость и даже, если понадобится,
            сделать предложение «руки и сердца». Причем продолжения у таких
            отношений уже может и не быть. И Мастер, как правило, это хорошо
            предчувствует.
          </UiText>

          <UiText color="role">
            Часто разыгрывает роль стабильно преуспевающего человека, у которого
            нет никаких проблем. Свои неприятности обычно не афиширует.
          </UiText>

          <UiText>
            Имеет обыкновение часто заводить разговор о планах на будущее.
            Причем собственные перспективы представляет довольно оптимистично, в
            то время как о чужих планах высказывается в крайне скептической
            форме.
          </UiText>

          <UiText color="role">
            Иногда склонен отговаривать от слишком смелых начинаний. Или от тех
            планов, которые не совпадают с его собственными намерениями. Причем,
            если для необходимой убедительности не хватает фактических
            аргументов, не сочтет за грех и приврать — лишь бы только убедить и
            настоять на своем.
          </UiText>

          <UiText>
            Такое поведение опять же объясняется его ориентацией на интуицию
            Советчик - на характерное для Советчика свойство завышать
            собственные возможности.
          </UiText>

          <UiText>
            Скептицизм Мастера запрограммирован на то, чтобы избавить своего
            дуала от излишней самонадеянности и иллюзий, а показной
            самоуверенностью он предполагает поднять собственный престиж в
            глазах партнера, стараясь во всех отношениях его заинтересовать и
            скорейшим образом к себе расположить.
          </UiText>

          <UiText>
            Советчик, со свойственной ему проницательностью, обычно не поддается
            на тактические уловки Мастера, потому что прекрасно видит, что стоит
            за его самомнением, но с удовольствием «подыгрывает» ему, поскольку
            это является составной частью той интуитивно-этической игры, в
            процессе которой и происходит их дуализация.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">4 — Болевая функция.</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_emotions" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Желание</UiText>
              <UiText preset="body">Этика эмоций</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Свою сенсорную программу Мастер весьма своеобразно связывает с
            аспектом этики эмоций. Эмоции в его понимании должны находиться в
            подчиненном положении относительно его программной сенсорики:
            никакие чувства, никакие перепады настроений не должны разрушать
            гармонию его ощущений.
          </UiText>

          <UiText color="role">
            Чувственные удовольствия на фоне слишком, или недостаточно,
            выраженных эмоций перестают быть для Мастера приятными.
          </UiText>

          <UiText>
            Для него очень важно, чтобы эмоциональная окраска складывающихся
            отношений не мешала процессу восприятия сенсорных ощущений. Поэтому
            эмоциональный настрой партнера, а главное — качество выражаемых им
            эмоций, имеют для Мастера исключительно важное значение.
          </UiText>

          <UiText>
            Во многих случаях Мастер берет на себя роль «регулировщика» эмоций
            своего партнера.
          </UiText>

          <UiText color="accent">
            Например: если Мастеру кажется, что партнер недостаточно
            эмоционален, он убеждает его «раскрепоститься» и не стесняться
            выражения своих чувств. Но стоит только «раскрепощенному» партнеру
            выразить свои эмоции более откровенно, у Мастера возникает
            непреодолимое желание несколько охладить его чувства, поскольку
            такой эмоциональный пыл кажется ему слишком обременительным и как бы
            ко многому обязывающим.
          </UiText>

          <UiText>
            У Мастера есть свои способы «регулировки» эмоциональных порывов
            партнера — он то распаляет, то охлаждает его.
          </UiText>

          <UiText>
            Причем иногда это делается методом изменения психологической
            дистанции: Мастер то как будто прекращает свои отношения с ним, то
            как ни в чем не бывало снова возобновляет их.
          </UiText>

          <UiText>
            Причем ему и в голову не приходит, что, «регулируя» эмоции человека
            подобным образом, он иногда заставляет его очень сильно страдать. Но
            чаще всего таким поведением он именно себя подставляет под бурное и
            неприятное выяснение отношений, под скандалы и истерики. То есть
            именно то, чего он пытается избежать, регулируя чувства своего
            партнера, как воду из-под крана, именно это в конечном итоге он и
            получает — отсутствие душевного покоя и серьезные этические
            неприятности.
          </UiText>

          <UiText preset="large" color="role">
            Никакого эмоционального воздействия на себя Мастер старается не
            допускать. Более того, он потому и старается не выражать никаких
            эмоций, чтобы не давать повода к эмоциональному воздействию.
          </UiText>

          <UiText>
            Поэтому, как бы ни складывались этические условия его отношений,
            Мастер всегда старается создать впечатление невозмутимости,
            эмоциональной неприступности и непроницаемости.
          </UiText>

          <UiText>
            Мастера раздражают любое проявление грубости, хамства, резкий и
            скандальный тон. И хотя далеко не все представители этого типа
            отличаются безупречными манерами, их собственная грубость чаще всего
            проявляется как ответная реакция или как обида на чужую
            бестактность.
          </UiText>

          <UiText color="accent">
            Например, если какая-то инициатива Мастера не встретит ответного
            понимания, он может очень обидеться и даже нахамить.
          </UiText>

          <UiText>
            Критику собственного поведения переносит как мучительную пытку, но
            внешне ни за что этого не покажет. Любые попытки отчитать Мастера,
            отругать его, сделать ему внушение ни к чему не приведут.
          </UiText>

          <UiText>
            Он может с самым невозмутимым видом, иногда даже с улыбкой, все это
            выслушать и как ни в чем не бывало продолжать в том же духе. Но это
            отнюдь не значит, что полученное внушение прошло для него абсолютно
            безболезненно и совершенно незамеченным.
          </UiText>

          <UiText>
            Кажущаяся бесчувственность и непроницаемость Мастера — защитная
            реакция на любое эмоциональное давление. Чем сильнее на него
            воздействуют, тем меньше эмоций он выражает.
          </UiText>

          <UiText>
            Как бы ни реагировал Мастер на предъявляемые ему обвинения, не
            следует пытаться выводить его из состояния хотя бы показного
            душевного равновесия с целью проверить, насколько болезненно он
            воспринимает высказываемое.
          </UiText>

          <UiText>
            Поскольку это именно та ситуация, в которой Мастер абсолютно не
            заинтересован обнаруживать свою уязвимость и глубокую ранимость.
            Изначально доброжелательный и миролюбивый, он и сам страдает от
            причиненной обиды, но любая попытка разведать степень его
            эмоциональной восприимчивости возмущает его до глубины души, как
            исключительная низость, как проникновение в его «святая святых» с
            самыми подлыми намерениями.
          </UiText>

          <UiText color="accent">
            «Я не люблю, когда мне лезут в душу, и не люблю, когда в нее плюют»
          </UiText>

          <UiText>
            Область чувственных переживаний для Мастера — это святыня, это
            величайшее и непостижимое таинство, к которому он никогда никого не
            подпускает. Он скорее предпочтет выглядеть в чьих-то глазах
            бесчувственным истуканом, чем позволит кому-то обнаружить свое
            истинное душевное состояние.
          </UiText>

          <UiText>
            Он будет из последних сил стараться выглядеть сдержанным, спокойным,
            владеющим ситуацией, невозмутимо улыбающимся, лишь бы не выдать
            своих настоящих переживаний.
          </UiText>

          <UiText>
            Любая попытка сломать его «броню» усиленным эмоциональным
            воздействием, проще говоря, истериками и скандалами, воспринимается
            им как чудовищное деяние, не имеющее себе равных. И реагирует он на
            это соответственно — страшным эмоциональным взрывом, который его
            очень выматывает и о котором он впоследствии будет сожалеть.
          </UiText>

          <UiText color="role">
            Может возникнуть вопрос: как может человек, всеми силами оберегающий
            свои чувства и свой душевный покой, позволять себе дирижировать
            чужими эмоциями? Как может он регулировать силу чувств других людей,
            заставлять их из-за этого страдать и наблюдать их страдания с
            намеренным спокойствием?
          </UiText>

          <UiText>
            Такая ситуация действительно возникает в том случае, если рядом с
            Мастером оказывается человек, психологически с ним несовместимый.
          </UiText>

          <UiText>
            Но поскольку Мастер подсознательно сориентирован на гибкую
            эмоциональность своего дуала Советчика, он не видит ничего плохого в
            том, чтобы приспосабливать партнера под свой эмоциональный порог.
          </UiText>

          <UiText>
            Воспринимая каждого партнера как своего дуала, он, естественно,
            предполагает, что любой человек способен приспосабливаться к его
            эмоциям, не испытывая при этом никаких затруднений.
          </UiText>

          <UiText>
            И только после многократных столкновений с реальной
            действительностью Мастер начинает понимать свою ошибку и очень
            болезненно ее переживает.
          </UiText>

          <UiText>
            Вследствие этого разочарования Мастер как раз и предпочитает
            комфортное уединение дискомфортному общению. И тема одиночества,
            которая очень волнует Мастера, равно как и его дуала Советчика,
            является следствием этой причины.
          </UiText>

          <UiText>
            Разочаровавшийся и недуализированный Мастер пытается воспринимать
            свое одиночество позитивно, стараясь находить в нем приятные для
            себя стороны. Качество, также свойственное и его дуалу Советчику.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">5 — Внушаемая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_ideas" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Мысль</UiText>
              <UiText preset="body">Интуиция возможностей</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Как ни пытается Мастер развивать в себе интуицию и способности к
            прогнозированию и предвидению, у него в этом плане возникают
            определенные трудности.
          </UiText>

          <UiText color="accent">
            Например, характер человека ему иногда удаëтся понять только после
            того, как он с ним безнадежно поссорится, не говоря уже о понимании
            собственного характера, который часто для него самого остается
            непостижимой загадкой, даже при том, что он много и с удовольствием
            занимается «самоанализом».
          </UiText>

          <UiText>
            Мастер часто оценивает возможности человека через его этическую
            оценку. «… — хороший человек, способен многого добиться».
          </UiText>

          <UiText color="role">
            Способность дать точную и лаконичную характеристику любому человеку,
            равно как и умение предсказать развитие взаимоотношений, вызывает у
            Мастера самое искреннее уважение.
          </UiText>

          <UiText>
            Любая наука, любой научный метод, раздвигающий границы человеческих
            возможностей, воспринимается им с интересом и уважением.
          </UiText>

          <UiText preset="large" color="role">
            Очень считается с мнением людей, умеющих находить выход из самых
            затруднительных положений. С удовольствием выслушивает рекомендации
            о том, как следует себя вести в непредвиденной ситуации или в случае
            опасности.
          </UiText>

          <UiText color="role">
            Очень внушаем всякими аномальными явлениями. Иногда может с самым
            серьезным видом рассказывать про некое аномальное явление, которое
            якобы существует у него в доме. Может как таблицу умножения заучить
            «правила» защиты от «энергетических вампиров», а потом на полном
            серьезе их преподавать.
          </UiText>

          <UiText>
            В случае, если его собственная деятельность не получает должного
            признания, реагирует очень болезненно, поскольку сравнивает свои
            достижения с успехами других. Может ссылаться на свои звания и
            заслуги.
          </UiText>

          <UiText preset="large" color="role">
            Нуждается в людях, способных найти и оценить его творческие
            способности, раскрыть его таланты и помочь в их реализации.
          </UiText>

          <UiText>
            Очень уважает людей, которые умеют быстро схватить суть явлений и
            поделиться этим с другими. Не терпит уравниловки людей в чем-либо.
            Считает, что к каждому индивиду должен быть свой подход.
          </UiText>

          <UiText>
            Не любит, когда критикуют его способности и возможности — это
            вызывает у него внутренний протест, поскольку обычно старается
            всесторонне развивать свои таланты. Серьезно занимается
            самообразованием и самосовершенствованием.
          </UiText>

          <UiText>
            Пример чужих успехов и достижений для него убедителен только в той
            форме, в какой это высказывается его дуалом Советчик. Только
            Советчик способен воодушевить Мастера, подсказывая ему оригинальные
            и заманчивые идеи, увлекая его новыми, неизведанными возможностями.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">
            6 — Активационная функция
          </UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_people" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чувство</UiText>
              <UiText preset="body">Этика отношений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Мастер всегда радуется возможности завести добрые, хорошие
            отношения. Не прочь расширить круг новых знакомств. Счастлив, когда
            предоставляется случай оказать услугу друзьям.
          </UiText>

          <UiText color="role">
            С готовностью предлагает свою помощь. Очень любит, когда к нему
            обращаются за советом.
          </UiText>

          <UiText>
            Причем своих услуг Мастер не навязывает — он просто оказывает их,
            без лишних слов. Оказание услуг считает лучшим способом завязывать
            знакомства.
          </UiText>

          <UiText color="accent">
            Например, если Мастер завязывает знакомство с женщиной, то
            появившись впервые в ее доме, он часто сразу же начинает в нем
            что-нибудь ремонтировать, причем настолько увлекается этим занятием,
            что иногда, кажется, забывает о цели своего визита.
          </UiText>

          <UiText color="role">
            И вот тут можно проследить два направления в развитии ситуации:
            психологически несовместимая партнерша сочтет такое положение
            неудобным, постарается отвлечь его от этого занятия, предложит ему
            отдохнуть, расслабиться, что-нибудь выпить.
          </UiText>

          <UiText>
            И это будет серьезной стратегической ошибкой с ее стороны, поскольку
            Мастер посчитает такое поведение проявлением волевой инициативы в
            развитии отношений.
          </UiText>

          <UiText>
            Ему покажется, что ситуация слишком форсируется, что в нем слишком
            заинтересованы и партнерша слишком торопится сократить дистанцию. В
            таком случае он довольно быстро почувствует психологический
            дискомфорт, почувствует, что теряет интерес к партнерше и
            постарается побыстрее «сменить обстановку».
          </UiText>

          <UiText>
            Совершенно по-другому поступает психологически совместимая
            партнерша: она будет только поощрять его трудовой энтузиазм и
            подносить ему для починки все, что у нее есть в доме поломанного, а
            может, человек только за этим и пришел?
          </UiText>

          <UiText color="role">
            Причем будет занимать его работой до тех пор, пока Мастер сам не
            объявит о своем желании отдохнуть, предварительно пообещав, что все
            остальное он починит в следующий раз.
          </UiText>

          <UiText>
            Вот тут ситуация складывается именно так, как это удобно его дуалу
            Советчик, время свидания потрачено с пользой для хозяйства, кроме
            того, возникают какие-то полезные перспективы на будущее, да к тому
            же еще и отношения развиваются так, что дистанция при этом не
            сокращается.
          </UiText>

          <UiText>
            А для Советчика это очень важно потому, что это важно для Мастера.
            Советчик строит свои отношения как бы вне дистанции, потому что
            подсознательно знает, что так всего удобнее воспринимать их
            партнеру.
          </UiText>

          <UiText preset="large" color="role">
            Мастеру действительно очень неудобны отношения с жестко
            разграниченной дистанцией.
          </UiText>

          <UiText color="role">
            Потому что строго оговоренная дистанция предполагает и определенные
            ограничения в поведении, предполагает какие-то этические рамки и
            какие-то жесткие обязательства.
          </UiText>

          <UiText>
            А там, где начинаются рамки и обязательства, Мастер чувствует себя
            очень неуютно. Он чувствует себя лишенным права выбора характера
            отношений в каждой отдельно сложившейся ситуации.
          </UiText>

          <UiText>
            Например, Мастер, настроенный на гибкую этику Советчик,
            предполагает, что, когда говорят «мы можем быть с тобой хорошими
            товарищами» — это надо понимать как скрытый намек на то, что «мы
            можем быть с тобой физически и духовно близкими людьми».
          </UiText>

          <UiText>
            Но когда придерживаясь «товарищеских отношений», партнерша строго
            держит его на «пионерском расстоянии», Мастер чувствует себя явно
            озадаченным. С другой стороны, стоит только назвать вещи «своими
            именами», как Мастер начинает испытывать неловкость, и как следствие
            этого — псхологический дискомфорт.
          </UiText>

          <UiText>
            Мастеры очень не любят, когда об интимных вещах говорят открытым
            текстом - это для них все равно, что упомянуть имя Бога всуе.
            Поэтому Советчик об интимных отношениях говорит намеком,
            завуалированно. Внутренне Мастеры очень брезгливы и чувствительны к
            любому проявлению пошлости.
          </UiText>

          <UiText color="role">
            Мастер не любит, когда «вносят ясность» в отношения, не любит в них
            четких разграничений прав и обязанностей. Все время пытается
            «размыть границы» ограничений, сбить дистанцию отношений, сделать ее
            независимой от прав и обязанностей.
          </UiText>

          <UiText color="accent">
            «Какие могут быть обязанности? Если мне хорошо с человеком, я и так
            для него все сделаю… »
          </UiText>

          <UiText>
            Но вот если Мастеру «плохо с человеком», он выходит из ситуации с
            такой же легкостью, с какой выходят из комнаты, просто
            поворачивается и уходит, не говоря куда и не объясняя причин. О себе
            может напомнить очень нескоро, совершенно неожиданно и даже именно
            тогда, когда его меньше всего хотят видеть.
          </UiText>

          <UiText>
            И при этом может искренне недоумевать, почему его не желают
            принимать в прежнем качестве. Разве он сделал что-нибудь плохое? —
            он всего лишь отдохнул от психологического дискомфорта, чтобы с
            новыми силами вернуться к любимому человеку.
          </UiText>

          <UiText>
            А то, что на восстановление душевных сил ему понадобилось слишком
            много времени, — это его личное дело и касается только его
            субъективных ощущений.
          </UiText>

          <UiText>
            Хотя, конечно, в рамках «восстановления душевных сил», Мастер может
            развивать отношения с несколькими партнëрами одновременно либо
            попеременно чередовать их.
          </UiText>

          <UiText>
            Как уже говорилось, Мастер очень дорожит гармонией своих
            субъективных ощущений, равно как и своим душевным покоем, поэтому
            его этические отношения не всегда легко складываются.
          </UiText>

          <UiText>
            Меньше всего проблем доставляют Мастеру четко определенные дружеские
            отношения — для друзей у него всегда найдутся и время и желание
            что-то сделать. Дружба, в его понимании, отношения взаимные и
            добровольные.
          </UiText>

          <UiText>
            Отношения с детьми всегда очень хорошие. Мастеры обожают своих детей
            и внуков. Вообще легко находят контакт с детьми. Мастеры, как
            правило, великолепные учителя.
          </UiText>

          <UiText>
            Проблемы начинаются, когда в отношения привносится чувство долга.
            Мастер не любит никому и ничем быть обязан. Он будет навещать
            родственников только тогда, когда ему самому захочется с ними
            пообщаться: в противном случае общение с ними не доставит ему
            удовольствия.
          </UiText>

          <UiText>
            Мастер старается избегать отношений, которые целиком и полностью
            базируются на обязанностях и обязательствах. «Визиты вежливости» к
            родственникам, где ему приходится выслушивать упреки, наставления,
            либо, что еще хуже, подробный отчет о плохом самочувствии, для
            Мастера пытка третьей степени.
          </UiText>

          <UiText>
            Мастер терпеть не может нравоучений. Ему проще «стать хорошим»,
            когда его таковым считают.
          </UiText>

          <UiText preset="large" color="role">
            Не позволяет себя «наказывать». Отвечает добром только, если
            чувствует, что к нему искренне расположены. Не допускает никаких
            попыток себя перевоспитать — сразу отдаляется или замыкается в себе.
          </UiText>

          <UiText color="role">Склонен к сочувствию и состраданию.</UiText>

          <UiText>
            Своих симпатий и антипатии не демонстрирует. Разве что иногда
            намеренно не скрывает своих желаний.
          </UiText>

          <UiText>
            Своих заслуг не выпячивает, но с неблагодарными людьми старается
            дела не иметь. Не любит ни о чем просить — поскольку и без просьбы
            умеет добиваться того, что ему нужно.
          </UiText>

          <UiText color="role">
            Партнеру, с которым ему хорошо и с которым он себя приятно и
            спокойно чувствует, доверяет полностью и безоговорочно, позволяя ему
            даже некоторую фривольность в поведении.
          </UiText>

          <UiText preset="large" color="role">
            Партнеру, с которым нет полного взаимопонимания, не доверяет и
            ревнует по малейшему поводу.
          </UiText>

          <UiText>
            Считает себя слишком доверчивым, полагает, что его с легкостью можно
            обмануть. По этой причине мало кого подпускает к себе на близкую
            дистанцию.
          </UiText>

          <UiText>
            Близкая дистанция возникает у него из отношений «вне дистанции» — на
            основании очень чуткой, гибкой и мобильной этики отношений, именно
            такой, какая свойственна его дуалу Советчик.
          </UiText>

          <UiText>
            С представителями других психологических типов близкие отношения у
            Мастера складываются довольно трудно и проблематично.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">7 — Функция защиты</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_will" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Воля</UiText>
              <UiText preset="body">Волевая сенсорика</UiText>
            </span>
          </div>
          <UiText preset="large" color="role">
            Умеет оказывать сильнейшее волевое давление, причем никогда не
            использует для этого приказной тон.
          </UiText>

          <UiText color="role">
            В случае, когда Мастеру нужно подчинить человека своей воле, он это
            делает путем воздействия на его чувственную сенсорику — начинает
            выражать целую «гамму» неприятнейших ощущений: нетерпение,
            мучительное желание, раздражение, страдание, обиду, неприязнь.
          </UiText>

          <UiText>
            В результате такого воздействия создается нетерпимейший сенсорный
            дискомфорт, болезненно действующий на людей, сенсорика ощущений
            которых расположена на уязвимых или подсознательно регулируемых
            позициях.
          </UiText>

          <UiText>
            Действуя таким методом, Мастер сравнительно легко добивается
            удовлетворения многих своих желаний и требований.
          </UiText>

          <UiText preset="large" color="role">
            Этим же способом он пользуется для того, чтобы резко «сократить
            дистанцию» со своим вечно ускользающим дуалом Советчиком.
          </UiText>

          <UiText>
            Мастеры не имеют представления о силе своего волевого воздействия.
            Они ее не осознают, не ощущают, не отдают себе в ней отчета. Часто
            сами себе они кажутся мягкими, покладистыми людьми.
          </UiText>

          <UiText>
            Не всегда понимают, почему другие им так быстро уступают, и обычно
            относят эти «уступки» за счет «слабости человеческой натуры» или
            приписывают их вероятному совпадению желаний.
          </UiText>

          <UiText>
            Со своей стороны, Мастер внимательнейшим образом следит за тем,
            чтобы лично на него никакого волевого воздействия не оказывалось,
            причем это «наблюдение» у него реализуется подсознательно.
          </UiText>

          <UiText>
            Каждый раз, когда на Мастера производится попытка оказать давление,
            он начинает испытывать неприятные ощущения: страх, напряжение,
            волнение, раздражение. От этих ощущений он стремится как можно
            скорее избавиться, поэтому всегда самым простым и доступным способом
            выходит из ситуации — просто, поворачивается и уходит, ничего не
            говоря и ни на какие вопросы не отвечая.
          </UiText>

          <UiText color="role">
            Задержать его или вернуть — невозможно: под «волевое давление»
            Мастер не возвращается.
          </UiText>

          <UiText preset="large" color="role">
            Если это происходит в ситуации телефонного разговора, Мастер может
            прервать разговор и отключить телефон, а в дополнение ко всему может
            еще и уйти из дома, чтобы его уж точно никто не нашел.
          </UiText>

          <UiText>
            Любая попытка лишить Мастера возможности выхода из ситуации опять же
            ни к чему не приведет — он как партизан перетерпит любое испытание,
            но давлению не подчинится и слабости своей не проявит.
          </UiText>

          <UiText>
            В конфликтной ситуации иногда может создать видимость уступки, но
            это своего рода тактическая уловка.
          </UiText>

          <UiText color="role">
            Как любой представитель четвертой квадры, Мастер очень ценит свою
            внутреннюю свободу и независимость и никому не позволит на нее
            посягать: перед начальством не робеет, приказному тону не
            подчиняется, на команды не реагирует — в любой ситуации поступает
            только по собственному усмотрению.
          </UiText>

          <UiText>
            Добиться от Мастера какой-либо уступки можно только, если попросить
            его в мягкой, но настойчивой форме. Иногда даже достаточно в форме
            полунамеков. На прямое волевое давление нечего даже и рассчитывать.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">8 — Фоновая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_logic" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Теория</UiText>
              <UiText preset="body">Структурная логика</UiText>
            </span>
          </div>

          <UiText>
            В ситуации столкновения мнений Мастеру очень важно оставить за собой
            последнее слово. Очень важно, чтобы его точка зрения была признана.
          </UiText>

          <UiText>
            Аспекты «волевой сенсорики» и «логики соотношений» иногда включаются
            в работу одновременно, поскольку расположены на одном блоке.
          </UiText>

          <UiText>
            Включаясь в спор, Мастер иногда даже как будто забывает, чего ради
            он это делает. И часто спорит не из соображения поисков истины, а из
            стремления навязать свою точку зрения или из желания показать себя
            не глупее других. Причем, чем ниже уровень интеллекта Мастера, тем с
            большим апломбом он его демонстрирует.
          </UiText>

          <UiText color="role">
            Случается, что Мастер использует в споре явно недопустимые приемы:
            ссылается на какие-то малоизвестные, чуть ли не вымышленные
            авторитеты, цитирует какие-то сомнительные факты из малоавторитетных
            источников. И что характерно — всегда настаивает на неоспоримости
            своих «доводов».
          </UiText>

          <UiText preset="large" color="role">
            Спор с Мастером далеко не всегда доставляет интеллектуальное
            наслаждение его оппонентам. Собственные оригинальные мысли он, в
            силу своей слабой интуиции, как правило, не часто высказывает.
          </UiText>

          <UiText>
            Поэтому вся полемика обычно сводится к не всегда уместному
            цитированию, которое иногда только уводит в сторону от обсуждаемой
            темы, и, кроме того, теряя инициативу в споре, Мастер начинает либо
            давить, либо нервничать и раздражаться — и то, и другое наблюдать
            бывает очень неприятно.
          </UiText>

          <UiText>
            Мастер не упустит случая продемонстрировать свои познания в самых
            различных областях, причем предварительная подготовка ему для этого
            не требуется.
          </UiText>

          <UiText>
            Интересы его действительно довольно обширны, но в силу этого
            зачастую поверхностны. Поэтому каждый раз, когда предоставляется
            возможность высказаться на знакомую ему тему, Мастер это делает,
            практически не задумываясь и не слишком вдумываясь в смысл. По
            принципу, «что вижу, о том и говорю».
          </UiText>

          <UiText>
            Причем нелепость собственных высказываний его иногда вовсе не
            смущает: главное для него в этой ситуации — произвести впечатление
            «интересного» собеседника.
          </UiText>

          <UiText>
            Такое впечатление в первую очередь рассчитано на его дуала Советчик,
            обычно воспринимающего человека таким, каким он себя преподносит.
          </UiText>

          <UiText>
            Демонстративные рассуждения важны для Мастера еще и постольку,
            поскольку предполагают двойной психологический смысл.
          </UiText>

          <UiText>
            С одной стороны — это смысл его рассуждений, к которому он, казалось
            бы, даже не всегда прислушивается, с другой стороны — лукавая и
            многозначительная ирония, которую он в этот момент выражает взглядом
            — и слегка сдерживаемой улыбкой и которая не имеет никакого
            отношения к сути его рассуждений.
          </UiText>

          <UiText color="role">
            Вот именно эта многозначительная ирония и есть наиважнейший элемент
            его этической игры. Она переключает слушателя на совершенно другой
            план отношений, заставляя его воспринимать логические рассуждения
            Мастера всего лишь как фон или как повод для привлечения внимания.
          </UiText>

          <UiText>
            И Советчик со своей великолепной этической интуицией это сразу же
            безошибочно понимает. Понимает, что о чем бы сейчас ни рассуждалось,
            для Мастера это всего лишь повод выйти «на контакт», это только
            способ привлечь к себе внимание и удержать его.
          </UiText>

          <UiText>
            На фоне такой «логики» Советчик чувствует, что может совершенно
            спокойно высказываться на любую тему без опасения быть уличенным в
            логических противоречиях.
          </UiText>

          <UiText>
            Советчик понимает, что к логическому смыслу здесь прислушиваться не
            будут, поскольку здесь идет другая игра, к которой логика не имеет
            никакого отношения.
          </UiText>

          <UiText>
            Демонстративная логика Мастера — важнейший элемент «этической игры»,
            в процессе которой происходит его дуализация с Советчиком.
          </UiText>

          <UiText>
            Этим же объясняется и стремление Мастера произвести благоприятное
            впечатление по аспекту логики. Ему очень важно ни при каких
            обстоятельствах не уронить своего престижа перед аудиторией,
            поскольку Советчик не симпатизирует проигравшим.
          </UiText>

          <UiText>
            Кроме того, Мастер, подсознательно сориентированный на поверхностный
            и переменчивый интерес Советчика, знает, как трудно привлечь его
            внимание и как трудно будет его удержать.
          </UiText>

          <UiText>
            И все же было бы неверно утверждать, что всегда и при всех
            обстоятельствах демонстративная рассудительность Мастера — это
            только своего рода позерство.
          </UiText>

          <UiText>
            Вовсе нет! Ведь существуют же какие-то аспекты, действительно
            занимающие их внимание! И анализируя их, Мастеры уже не претендуют
            на демонстративность. Это относится, например, к области
            изобразительного искусства, где мало кто сравнится с представителями
            этого типа в умении дать сравнительный анализ цветовой гаммы или
            композиции того или иного художника.
          </UiText>

          <UiText>
            Аспект сенсорики ощущений — богатейшая тема для его логики. Мастер
            может усмотреть глубочайший философский смысл в композиционном
            расположении цветовых и тональных пятен.
          </UiText>

          <UiText color="accent">
            К примеру, любой из фильмов Андрея Тарковского в эстетическом плане
            является образцом философии Мастера. Здесь и строго симметричное
            построение кадра, и компоновка его в форме триптиха (трехчастной
            композиции), и игра цветовых и тональных пятен, и игра плоскостей;
            здесь и пространственные и фактурные эффекты — так, что их можно
            почувствовать как бы на ощупь; игра света и теней, игра звуков —
            символика звуков, символика ощущений. И вся эта сенсорная символика
            наполнена глубоким содержанием и философским смыслом. Через эти
            сенсорные символы выражаются и рассматриваются глубочайшие
            социальные, психологические, этические и философские аспекты.
          </UiText>

          <UiText>
            С помощью логических символов Мастер выражает мир своих тончайших
            чувственных ощущений, состояние своих глубочайших переживаний.
            «Сенсорная символика», в свою очередь, наполняет значением и смыслом
            его субъективные ощущения и делает их доступными пониманию
            окружающих его людей.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
