<template>
  <div class="text g-page">
    <section>
      <UiText preset="body" color="accent">
        Описания не должны обязательно совпадать со всеми чертами характера
        личности.
      </UiText>

      <UiText preset="small" color="accent">
        Идея как раз описать наблюдаемые у среднего представителя типа
        особенности поведения и обработки информации психикой.
      </UiText>

      <UiText preset="small" color="accent">
        Автор описания — Велта Микелсоне
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="role">
        Хозяйственный и уравновешенный человек, которого мало что может вывести
        из себя.
      </UiText>

      <br />

      <UiText>
        Тонкий ценитель красоты. У него всегда своё мнение о том, что красиво и
        гармонично. Он хорошо знает свои и чужие материальные и эстетические
        нужды. Разбирается в искусстве.
      </UiText>

      <UiText preset="large" color="role">
        Ярко выраженная физическая чувствительность к прикосновениям.
      </UiText>

      <UiText>
        Ему неприятны прикосновения чужих людей. Также хорошо развиты вкус, слух
        и обоняние. Его глаза быстро замечают все недостатки – халатность в
        работе, недочеты в строительстве, безвкусицу в одежде и прочее.
      </UiText>

      <UiText preset="large" color="role">
        С ранних лет учится закаляться и владеть своим телом.
      </UiText>

      <UiText>
        Редко болеет и не показывает свою слабость. Разбирается в причинах
        недомоганий и знает, как своевременно от них избавиться. Его походка
        равномерная и ритмичная. Движения сдержанные, без лишних усилий,
        создается впечатление, будто он бережет энергию и силы.
      </UiText>

      <UiText>
        Гигиена на первом месте. Одежда всегда продумана, хорошо прилегает к
        телу, всегда опрятная (даже рабочий костюм), тщательно следит за ней. В
        одежде предпочитает пастельные тона, все элементы одежды согласованы
        между собой.
      </UiText>

      <UiText>
        Ценит удобство и комфорт. С удовольствием наслаждается спокойным отдыхом
        в семейном кругу, в своем доме, а также на природе. Однообразный образ
        жизни наводит на него скуку, поскольку как мастеру ему нужны острые
        ощущения.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Не занудный и не капризный, не желает обременять других своими
        проблемами.
      </UiText>

      <UiText>
        Покупки делает своевременно и продумано, учитывая практичность и
        целесообразность, у него в доме нет ничего лишнего. Хотя он бережливый,
        но свои желания удовлетворяет полностью. Не экономит на питании,
        выбирает только качественные продукты.
      </UiText>

      <UiText preset="large" color="role">
        В некоторых ситуациях способен упрекать других в небережливости.
      </UiText>

      <UiText>
        Всегда находит подходящее время для своих иронических замечаний, чтобы
        упрекнуть в непрактичности, всегда сопоставляя положительный пример
        других людей.
      </UiText>

      <UiText>
        В сложных кризисных ситуациях умеет обходиться минимумом. Не откажется
        выпустить из рук то, что принадлежит ему по праву. Когда возникает
        угроза его материальному состоянию, для устранения неприятностей готов
        применить любые методы. Заботится о материальном состоянии своих
        близких. Следует отметить, что Мастер не всегда принимает своих
        родственников в кругу своих близких. Бывает, что даже его мать или отец
        не близкий ему человек. Это потому, что в дискомфортных отношениях он
        отдаляется от близких, и не желает углубляться в причины таких отношен.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Избегает конкуренцию, поскольку он борец-одиночка.
      </UiText>

      <UiText>
        Часто достигает успехов, настойчиво стремится к своей цели, рассчитывая
        на максимальный результат. Обычно выбирает одно узкое направление, и
        упрямо движется по нему, другой раз упуская возможности.
      </UiText>

      <UiText preset="large" color="role">
        Казалось бы, что получив плоды своей работы, сразу обдумывает, куда еще
        вложить чтобы приумножить.
      </UiText>

      <UiText>
        Это не всегда объясняется недостатком лишних денег, ему необходимо
        действовать. Однако, было отмечено, что каждое новое дело Мастера
        приносит деньги.
      </UiText>

      <UiText>
        На своем рабочем месте применяет все возможные средства для комфортной
        работы — удобные помещения, мебель, новейшая техника и оборудование.
      </UiText>

      <UiText>
        Под его руководством производство идет на самом высшем уровне —
        производится товар высокого качества, выдерживает конкуренцию. При этом
        он стремится упростить методы работы.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Прежде чем взяться за работу, заранее тщательно продумывает детали,
        чтобы излишне не тратить свои силы.
      </UiText>

      <UiText>
        Со стороны может казаться, что он малоподвижный и ленивый, но на самом
        деле везде, где приложит свои руки Мастер, работа идет быстро, красиво и
        качественно, и её никому не надо переделывать.
      </UiText>

      <UiText preset="large" color="role">
        Лучшая благодарность за работу — это достойная зарплата.
      </UiText>

      <UiText>
        Его жизнь течет как бы по плану, но одновременно гибко. Целесообразно
        использует время, быстро соображает, что необходимо на настоящий момент.
        Также из-за мелочей не задерживает других, у него все уже придумано.
      </UiText>

      <UiText>
        Его распорядок дня составлен в определенном ритме, который он с трудом
        меняет. Если обстоятельства заставляют, быстро приспосабливается. У него
        все распределено — когда работать, а когда отдыхать. Старается не
        нарушать порядок.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Интуиция его слабое место, он не в состоянии осознать, когда и где
        назревают опасности.
      </UiText>

      <UiText>
        Терпеть не может неконкретности и неопределенности – ни какие «может
        быть», «наверное», «возможно». Таких слов в общении с Мастером лучше не
        употреблять. Ему необходима конкретность, точное место, время и события,
        которые происходят.
      </UiText>

      <UiText>
        Внутренний мир другого человека интересует его лишь тогда, когда это
        непосредственно относится к нему. Нельзя сказать, что он бесчувственный
        человек, но ему не свойственно сопереживать чужим людям.
      </UiText>

      <UiText preset="large" color="role">
        К тому же, он неуверен, правильно ли понимает людей. Не умеет быть
        гибким в отношениях. Под своей искусственной улыбкой он прячет свою
        неловкость в общении.
      </UiText>
    </section>

    <section>
      <UiText>
        Он умеет налаживать отношения без психологического давления, редко
        поднимает голос. Он не применяет громкие крики, разъяснения отношений,
        сплетни.
      </UiText>

      <UiText preset="large" color="role">
        Его нельзя публично задеть, в таких случаях может быть резок и удалится.
      </UiText>

      <UiText>
        Хотел бы, чтобы его понимали без слов, ведь он сам часто не понимает,
        что с ним происходит. Он хочет знать, каких поступков стоит ожидать от
        другого, но он этого понять не в силах. Обычно оценивает людей по
        принципу – на сколько он нуждается в этом человеке как в профессионале,
        на что он способен.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Плохо разбирается в своих чувствах — любит или не любит.
      </UiText>

      <UiText>
        Иногда осознает любовь лишь тогда, когда её потерял. Влюбляется
        осторожно. Внутренние ощущения любви его пугают, поскольку не
        соображает, что с ним творится. Поэтому изначально старается как будто
        тормозить чувство любови, на время удаляясь от партнера. Погружаясь в
        любовь «с головой», способен полюбить на долгое время. Не переносит
        эмоциональных, ветреных и шумных людей.
      </UiText>

      <UiText>
        Ему интересны умные люди, которые умеют деликатно держаться и тонко
        выражать свои чувства.
      </UiText>

      <UiText preset="large" color="role">
        Заслужить его симпатию сложно, а потерять легко — прощает он с трудом.
      </UiText>
    </section>

    <section>
      <UiText>
        Близким открывается постепенно, сохраняя определенную таинственность.
      </UiText>

      <UiText preset="large" color="role">
        Чужим не открывается, но в кругу своих и близких людей он совершенно
        другой человек.
      </UiText>

      <UiText>
        Способен быть добродушным, веселым, ласковым, заботливым, взяв на себя
        почти все заботы.
      </UiText>

      <UiText>
        Он — хозяин своей жизни, при этом он чувствует себя зависимым от судьбы.
        Не поддается панике, полагается на свои ощущения и здравый смысл, ищет и
        находит выход из любой ситуации. Иногда озвученная им металлическим
        тоном фраза и небрежно брошенный холодный взгляд действуют лучше чем
        громкий крик.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Обладает хорошей памятью. В памяти держит только то, что разумно и
        необходимо и целесообразно.
      </UiText>

      <UiText>
        Способен открыто высказать замечание по поводу нелогичности поступка
        другого. Если Мастер замешан в бестолковой, на его взгляд сделке,
        способен повлиять, чтобы ситуация целом изменилась к лучшему.
      </UiText>

      <UiText>
        Не терпит бюрократию и проверки. Если в чем-то уверен — не отступит и
        будет упрямствовать. Он хороший организатор, может выполнить работу с
        меньшей затратой сил и с меньшим числом работников. В работе
        скрупулезен. Внимателен к новой информации.
      </UiText>

      <UiText preset="large" color="role">
        Врожденные изысканные манеры. Порой может упрекать родителей за то, что
        не получил достаточно хорошего воспитания и образования.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
