<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">Особенности</UiText>

  <UiText>
    Общительные, эмоциональные, открытые, легко находят контакт с новыми людьми.
  </UiText>

  <UiText>
    Всегда стремятся к новым впечатлениям, впитывают информацию, если в ней есть
    фантастика и необычность.
  </UiText>

  <UiText>Мечтательны, часто предаются иллюзиям и мечтам.</UiText>

  <UiText>Оптимистичны, не впадают в отчаяние, если что-то идет не так.</UiText>

  <UiText>
    Наоборот, умеют воодушевлять окружающих, особенно потерявших веру в себя.
  </UiText>

  <UiText>
    Не показывают переживания, чтобы не огорчать друзей и близких.
  </UiText>

  <UiText>
    Постоянно предлагают идеи, но не всегда реалистичные, из-за чего могут
    сталкиваться с критикой.
  </UiText>

  <UiText>
    Не теряются в сложных ситуациях, ищут выход там, где другие опускают руки.
  </UiText>

  <UiText>
    Их часто спрашивают о советах, особенно в конфликтах и сложных вопросах.
  </UiText>

  <UiText>Наблюдательны, видят скрытые возможности других людей.</UiText>

  <UiText>Неусидчивы, плохо переносят монотонную работу.</UiText>

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Сказочный персонаж
  </UiText>

  <UiText class="description" color="black">
    ❄ Герда — «Снежная королева»
    <i>(Ханс Кристиан Андерсен)</i>
    . Оптимистичная, бесстрашная, преданная своим целям.
  </UiText>

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Рекомендации по воспитанию
  </UiText>

  <UiText class="description" color="black">
    Помогите определить главную цель, которая долго удержит его внимание.
  </UiText>

  <UiText class="description" color="black">
    Поддерживайте морально, объясняйте, что его усилия приносят пользу.
  </UiText>

  <UiText class="description" color="black">
    Обещайте, что настойчивость даст уважение и признание – для него это важно.
  </UiText>

  <UiText class="description" color="black">
    Научите планировать время, чтобы не распыляться.
  </UiText>

  <UiText class="description" color="black">
    Хвалите за способности и таланты, говорите, что никто другой не сделает это
    так же хорошо.
  </UiText>

  <UiText class="description" color="black">
    Если не слушается – демонстрируйте разочарование, но не критикуйте резко.
  </UiText>

  <UiText class="description" color="black">
    Не оказывайте жесткого давления, не заставляйте делать что-то в грубой
    форме.
  </UiText>

  <UiText class="description" color="black">
    Занятия спортом помогут развить волю, выносливость и уверенность.
  </UiText>

  <UiText class="description" color="black">
    Будьте тактичны и успокаивайте, если он переживает – важно показывать
    относительность всех неприятностей.
  </UiText>

  <hr />

  <UiText class="description" color="black">
    Этот ребенок энергичный, вдохновляющий, но хаотичный. Ему важно направление
    и поддержка.
  </UiText>
</template>
