<script lang="ts" setup>
import { UiText } from "@shared/ui";
</script>

<template>

  <UiText class="attributes" preset="large" color="role">
    Особенности
  </UiText>

  <UiText>
    Постоянно чем-то увлечен, отдает делу всю энергию.
  </UiText>

  <UiText>
    С детства любит походы, путешествия, активные игры.
  </UiText>

  <UiText>
    Не жалуется на усталость, ушибы и царапины.
  </UiText>

  <UiText>
    Любит подробно рассказывать о своих приключениях, приукрашивая детали.
  </UiText>

  <UiText>
    Смелый первопроходец, испытывает себя в разных условиях.
  </UiText>

  <UiText>
    Постоянно занят, не остается времени на что-то, что ему неинтересно.
  </UiText>

  <UiText>
    Довольно уступчив, можно настойчиво уговорить, так как не хочет портить отношения.
  </UiText>

  <UiText>
    Может забывать обещания, потом находит убедительные оправдания.
  </UiText>

  <UiText>
    Склонен к бесстрашию и чрезмерной любознательности, из-за чего может вляпаться в неприятности.
  </UiText>
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Сказочный персонаж
  </UiText>

  <UiText class="description" color="black">
    🛠 Винтик и Шпунтик — «Незнайка» <i>(Николай Носов)</i>.
Деловые, энергичные, всегда чем-то заняты.
  </UiText>

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Рекомендации по воспитанию
  </UiText>

  <UiText class="description" color="black">
    Приучайте к дисциплине, порядку, аккуратности, но делайте это тактично и дипломатично.
  </UiText>

  <UiText class="description" color="black">
    Увлекайте делом, объясняйте его пользу, хвалите за результаты.
  </UiText>

  <UiText class="description" color="black">
    Учите доводить начатое до конца – иначе не достигнет того, чего хочет.
  </UiText>

  <UiText class="description" color="black">
    Развивайте выносливость – он должен понимать, что без самодисциплины не добиться уважения.
  </UiText>

  <UiText class="description" color="black">
    Переключайте внимание на развлечения – походы, юмор, новые впечатления.
  </UiText>

  <UiText class="description" color="black">
    Заставляйте следить за здоровьем, закаляться, чтобы хватало сил на достижения.
  </UiText>

  <UiText class="description" color="black">
    Объясняйте важность ухоженного внешнего вида – это помогает держаться уверенно.
  </UiText>

  <UiText class="description" color="black">
    Учите хорошим манерам, чтобы не терять друзей и уметь вовремя выйти из спора.
  </UiText>

  <hr />

  <UiText class="description" color="black">
    Этот ребенок энергичный, деловой, но импульсивный. Лучше давать ему направление, чем пытаться ограничивать.
  </UiText>

</template>