<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">Особенности</UiText>

  <UiText>
    Обладает неутомимой любознательностью, тянется ко всему новому, особенно к
    необычным вещам.
  </UiText>

  <UiText>
    Интересы разносторонние, но хаотичные и нестабильные, трудно долго
    сосредотачиваться на одном.
  </UiText>

  <UiText>
    Любит фантазировать, рассказывать истории, заражает других своими идеями.
    Иногда увлекается вымыслом, но делает это эмоционально и убедительно.
  </UiText>

  <UiText>
    Переменная мотивация: временами впадает в апатию и теряет интерес ко всему,
    но оживляется при смене обстановки.
  </UiText>

  <UiText>
    Охотно общается, легко заводит много знакомых, но не всегда поддерживает
    постоянные дружеские связи.
  </UiText>

  <UiText class="description" color="black">
    Интенсивная реакция на давление — не терпит принуждения. Давление вызывает
    сопротивление, может реагировать агрессивно или делать назло.
  </UiText>

  <UiText class="description" color="black">
    Легко берет вещи у других и так же легко отдает свои, но может забывать
    возвращать.
  </UiText>

  <UiText class="description" color="black">
    Не обидчив и не злопамятен, быстро переключается.
  </UiText>

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Сказочный персонаж
  </UiText>

  <UiText class="description" color="black">
    🃏 Алиса — «Алиса в стране чудес»
    <i>(Льюис Кэрролл)</i>
    . Вечно любопытная, исследующая, легко вовлекаемая в приключения.
  </UiText>

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Рекомендации по воспитанию
  </UiText>

  <UiText class="description" color="black">
    Не оказывайте грубого давления. Лучше убеждать мягко, через уважение и
    хорошие отношения.
  </UiText>

  <UiText class="description" color="black">
    Хвалите за находчивость и активность. Подчёркивайте его уникальность.
  </UiText>

  <UiText class="description" color="black">
    Апеллируйте к самолюбию. Деликатно намекайте, что он может не справиться —
    это его заденет и раззадорит.
  </UiText>

  <UiText class="description" color="black">
    Помогайте организовываться. Напоминайте о сроках, но с юмором и легкостью.
  </UiText>

  <hr />

  <UiText class="description" color="black">
    Главное — учитывать его природу. Этот ребенок неуправляем, но вдохновляем.
  </UiText>
</template>

<style lang="scss" scoped></style>
