<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">Особенности</UiText>

  <UiText>
    Динамичный, общительный, легко заводит массу друзей и знакомых.
  </UiText>

  <UiText>
    Любит подробно описывать события, но часто с негативным оттенком.
  </UiText>

  <UiText>
    Любознателен, все трогает руками, испытывает мир через ощущения.
  </UiText>

  <UiText>
    Обижчив, даже по пустякам, но быстро переключается и может прощать, даже не
    показывая обиду.
  </UiText>

  <UiText>Неусидчив, трудно сосредотачивается на чем-то одном.</UiText>

  <UiText>
    Скучает без компании, любит делиться информацией, особенно сенсационной («по
    секрету всему свету»).
  </UiText>

  <UiText>
    Ценит собеседников, которые помогают ему разбираться в сложных вещах.
  </UiText>

  <UiText>Обижается, если от него что-то скрывают.</UiText>

  <UiText>
    Часто заботится о других, делает приятные мелочи в виде подарков или помощи.
  </UiText>

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Сказочный персонаж
  </UiText>

  <UiText class="description" color="black">
    🩺 Доктор Айболит — «Айболит»
    <i>(Корней Чуковский)</i>
    . Доброжелательный, заботливый, активный, но эмоциональный.
  </UiText>

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Рекомендации по воспитанию
  </UiText>

  <UiText class="description" color="black">
    Объясняйте важность доведения дел до конца. Если бросит на полпути, всем от
    этого будет плохо.
  </UiText>

  <UiText class="description" color="black">
    Позволяйте небольшие переключения. Давайте отвлечься, но потом настойчиво
    возвращайте к задаче.
  </UiText>

  <UiText class="description" color="black">
    Держите эмоции под контролем. Спокойная требовательность работает лучше, чем
    резкие реакции.
  </UiText>

  <UiText class="description" color="black">
    Учите принимать ответственность. Объясняйте, что без дисциплины никто не
    будет делать за него то, что он хочет.
  </UiText>

  <UiText class="description" color="black">
    Показывайте последствия беспорядка и несправедливости. Это вызовет желание
    исправить ситуацию.
  </UiText>

  <UiText class="description" color="black">
    Игнорируйте, если он не реагирует на просьбы. Демонстративное равнодушие
    работает: долго без общения не выдержит и пойдет навстречу.
  </UiText>

  <hr />

  <UiText class="description" color="black">
    Главное — учитывать его эмоциональность и потребность в одобрении.
  </UiText>
</template>
