<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">Особенности</UiText>

  <UiText>Прямолинейные и резкие в словах и поступках.</UiText>

  <UiText>Не терпят уклончивости и лживости в поведении других.</UiText>

  <UiText>
    Серьезны и надежны в дружбе, выполняют обещания и требуют того же от других.
  </UiText>

  <UiText>
    Не любят пустые развлечения и болтовню, предпочитают конкретные дела.
  </UiText>

  <UiText>Рано находят свое дело и занимаются им основательно и долго.</UiText>

  <UiText>Защищают слабых и обиженных, отстаивают справедливость.</UiText>

  <UiText>Трудолюбивы, не могут сидеть без дела, болеют редко.</UiText>

  <UiText>Любят технику, ручной труд, всевозможные инструменты.</UiText>

  <UiText>
    Не переносят, когда кто-то мешает их планам – раздражаются, если отвлекают
    от дела.
  </UiText>

  <UiText>Следят за чистотой, любят порядок.</UiText>

  <UiText>
    Тянутся к сложной технике, схемам, специализированным журналам.
  </UiText>

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Сказочный персонаж
  </UiText>

  <UiText class="description" color="black">
    📚 Знайка — «Незнайка»
    <i>(Николай Носов)</i>
    . Умный, собранный, ответственный, но иногда заносчивый.
  </UiText>

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Рекомендации по воспитанию
  </UiText>

  <UiText class="description" color="black">
    Не оказывайте грубого давления, не критикуйте работу напрямую – только
    вызовете раздражение.
  </UiText>

  <UiText class="description" color="black">
    Объясняйте пользу дела, показывайте перспективы, связанные с порядком и
    безопасностью.
  </UiText>

  <UiText class="description" color="black">
    Общайтесь мягко и тактично, даже если он бывает резким.
  </UiText>

  <UiText class="description" color="black">
    Стимулируйте через ответственность – напомните, что вспыльчивость снижает
    уважение.
  </UiText>

  <UiText class="description" color="black">
    Если не слушается – наказывайте молчанием, дайте ему самому осознать
    последствия.
  </UiText>

  <UiText class="description" color="black">
    Используйте самолюбие – сомнение в его силах заставит его доказать обратное.
  </UiText>

  <UiText class="description" color="black">
    Учите делать главную часть работы сразу, чтобы не нервничать перед
    дедлайнами.
  </UiText>

  <UiText class="description" color="black">
    Давайте эмоциональную разрядку – походы на концерты, вечер юмора.
  </UiText>

  <UiText class="description" color="black">
    Чаще шутите, но не задевайте его личность – слишком резкие шутки он
    воспринимает болезненно.
  </UiText>

  <hr />

  <UiText class="description" color="black">
    Этот ребенок дисциплинированный, но жесткий, ему нужны четкие правила и
    уважение к его самостоятельности.
  </UiText>
</template>
