<script lang="ts" setup>
import { UiText } from "@shared/ui";
</script>

<template>

  <UiText class="attributes" preset="large" color="role">
    Особенности
  </UiText>

  <UiText>
    Мягкие, добрые, отзывчивые, никогда не отказывают в помощи.
  </UiText>

  <UiText>
    Сверстники часто пользуются этим, поручая им свои задания.
  </UiText>

  <UiText>
    Усидчивые, прилежные ученики, ответственно относятся к учебе.
  </UiText>

  <UiText>
    Скромные и застенчивые, не любят хвастаться успехами.
  </UiText>

  <UiText>
    Не стремятся командовать, готовы уступать в споре ради хороших отношений.
  </UiText>

  <UiText>
    В кругу близких часто играют роль миротворцев, тяжело переносят конфликты.
  </UiText>

  <UiText>
    Не занимают откровенно чью-то сторону, стараются быть объективными.
  </UiText>

  <UiText>
    Преданы друзьям, годами поддерживают одни и те же дружеские связи.
  </UiText>

  <UiText>
    Чутко реагируют на отношение окружающих, если их не ценят – уходят в тень.
  </UiText>
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Сказочный персонаж
  </UiText>

  <UiText class="description" color="black">
    👑 Золушка — «Золушка» <i>(Шарль Перро)</i>.
Добрая, терпеливая, скромная, но преданная.
  </UiText>

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Рекомендации по воспитанию
  </UiText>

  <UiText class="description" color="black">
    Контролируйте, чтобы занимался нужными делами, а не только помогал другим.
  </UiText>

  <UiText class="description" color="black">
    Говорите твердо и четко, что делать, а что можно отложить.
  </UiText>

  <UiText class="description" color="black">
    Следите за его здоровьем, стимулируйте к спорту и прогулкам.
  </UiText>

  <UiText class="description" color="black">
    Мотивируйте через эмоции – объясните, что вас расстроит его бездействие.
  </UiText>

  <UiText class="description" color="black">
    Хвалите за добро и заботу, но учите не позволять другим пользоваться им.
  </UiText>

  <UiText class="description" color="black">
    Развивайте чувство ответственности – пусть берет задания не только по интересу, но и по необходимости.
  </UiText>

  <UiText class="description" color="black">
    Отмечайте его способности – пусть не скрывает их из скромности.
  </UiText>

  <UiText class="description" color="black">
    Стимулируйте пунктуальность и исполнительность через собственный пример.
  </UiText>

  <UiText class="description" color="black">
    Мягко стыдите, если не сдержал обещание, объясняйте, что это подрывает доверие.
  </UiText>

  <hr />

  <UiText class="description" color="black">
    Этот ребенок чувствительный, преданный, но легко поддается чужим влияниям. Важно развивать в нем границы и уверенность.
  </UiText>

</template>