<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">Особенности</UiText>

  <UiText>
    Мягкий, уступчивый, легко поддается влиянию – как хорошему, так и плохому.
  </UiText>

  <UiText>
    Без направляющего контроля может попадать в сомнительные компании и истории.
  </UiText>

  <UiText>
    В учебе и увлечениях его интерес нестабилен, зависит от окружения
    (родителей, учителей, друзей).
  </UiText>

  <UiText>
    Легко располагает к себе людей ласковостью и добрым характером.
  </UiText>

  <UiText>
    Взрослые часто излишне балуют, что формирует капризность и эгоизм.
  </UiText>

  <UiText>
    В учебе больше тянется к гуманитарным предметам – литературе, истории,
    иностранным языкам.
  </UiText>

  <UiText>
    Мечтатель и созерцатель, склонен к созданию иллюзий и воображаемых идеалов.
  </UiText>

  <UiText>
    В сложных ситуациях прячет переживания за улыбкой и уверяет, что все в
    порядке.
  </UiText>

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Сказочный персонаж
  </UiText>

  <UiText class="description" color="black">
    🌿 Аленушка — русские народные сказки. Тонкая, мечтательная, легкоранимая,
    живущая чувствами.
  </UiText>

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Рекомендации по воспитанию
  </UiText>

  <UiText class="description" color="black">
    Будьте требовательны, но мягко – через заботу, внимание и уважение к его
    чувствам.
  </UiText>

  <UiText class="description" color="black">
    Мотивируйте через радости и удовольствия – объясняйте, что без выполнения
    заданий он их лишится.
  </UiText>

  <UiText class="description" color="black">
    Учите соблюдать порядок и аккуратность, иначе он потеряет уважение
    окружающих.
  </UiText>

  <UiText class="description" color="black">
    Если не слушается – демонстрируйте холодность и сдержанность. Долго так не
    выдержит, сам начнет идти навстречу.
  </UiText>

  <UiText class="description" color="black">
    Хвалите за хорошую работу, поощряйте подарками и доброжелательностью.
  </UiText>

  <UiText class="description" color="black">
    Объясняйте важность выполнения обещаний – если не сдерживает слова, люди не
    помогут ему в ответ.
  </UiText>

  <UiText class="description" color="black">
    Учите не жаловаться и не портить другим настроение, а быть приятным
    собеседником.
  </UiText>

  <hr />

  <UiText class="description" color="black">
    Этот ребенок чувствительный, но внушаемый – важно мягко направлять, но не
    позволять манипулировать собой.
  </UiText>
</template>
