<script lang="ts" setup>
import { UiText } from "@shared/ui";
</script>

<template>

  <UiText class="attributes" preset="large" color="role">
    Особенности
  </UiText>

  <UiText>
    В детстве послушный, серьезный, склонен к самостоятельным занятиям.
  </UiText>

  <UiText>
    Любит придумывать игры, особенно сложные, со множеством правил.
  </UiText>

  <UiText>
    Часами может возиться с конструкторами и головоломками, увлекая этим других детей.
  </UiText>

  <UiText>
    Сначала читает разное, потом выбирает одно направление и углубляется в него.
  </UiText>

  <UiText>
    В учебе чаще тянется к естественным наукам, реже – к гуманитарным предметам.
  </UiText>

  <UiText>
    Не проявляет инициативу в общении, но откликается, если его вовлекают.
  </UiText>

  <UiText>
    В увлечениях ценит элемент новизны, любит экспериментировать (например, придумывать новые виды техники или оружия).
  </UiText>

  <UiText>
    Сторонится девочек-сверстниц, если не чувствует себя свободно рядом с ними.
  </UiText>

  <UiText>
    Плохо запоминает имена людей, но отлично усваивает информацию познавательного характера.
  </UiText>

  <UiText>
    Не любит когда его перебивают и уводят от интересной для него темы.
  </UiText>

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Сказочный персонаж
  </UiText>

  <UiText class="description" color="black">
    🐰 Кролик — «Винни-Пух» <i>(Алан Милн)</i>.
    Рациональный, серьезный, порой чопорный, но рассудительный.
  </UiText>

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Рекомендации по воспитанию
  </UiText>

  <UiText class="description" color="black">
    Не заставляйте действовать против желания, избегайте командного тона.
  </UiText>

  <UiText class="description" color="black">
    Объясняйте пользу и смысл – это лучший способ вовлечь его в дело.
  </UiText>

  <UiText class="description" color="black">
    Хвалите за способности и проявление отзывчивости.
  </UiText>

  <UiText class="description" color="black">
    Вселите уверенность, подчеркивая, что разум и дисциплина помогут ему освоить все, чему он захочет научиться.
  </UiText>

  <UiText class="description" color="black">
    Говорите эмоционально и тепло, не забывайте хвалить за прошлые успехи.
  </UiText>

  <UiText class="description" color="black">
    Тренируйте терпение – например, через сбор ягод и грибов, требующих аккуратности.
  </UiText>

  <UiText class="description" color="black">
    Развивайте силу воли – например, через утреннюю гимнастику в игровой форме.
  </UiText>

  <hr />

  <UiText class="description" color="black">
    Этот ребенок мыслящий, но замкнутый, ему важна структура, ясность и логика.
  </UiText>
  
</template>



<style lang="scss" scoped></style>
