<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">Особенности</UiText>

  <UiText>
    Вдумчивые и рассудительные, предпочитают держаться особняком, избегают
    шумных компаний.
  </UiText>

  <UiText>
    В играх и занятиях временами инертны и ленивы, но внутри ведут богатую
    внутреннюю жизнь.
  </UiText>

  <UiText>
    Читают много, часто обладают высокой эрудированностью для своего возраста.
  </UiText>

  <UiText>
    Любят критиковать и отпускать колкости, часто имеют недовольное выражение
    лица.
  </UiText>

  <UiText>
    Сверстники иногда считают их слишком умными, потому что они приводят примеры
    из книг и не скрывают интеллектуального превосходства.
  </UiText>

  <UiText>Избегают конфликтов, стараются не участвовать в стычках.</UiText>

  <UiText>
    Могут подчиняться грубому давлению, если не находят способа избежать
    конфронтации.
  </UiText>

  <UiText>
    Неуверенно чувствуют себя в ситуациях, требующих быстрой реакции и
    эмоционального включения.
  </UiText>

  <UiText>
    Не любят выставляться, стараются держать свои способности при себе.
  </UiText>

  <UiText>Привязаны к вещам, особенно к старым и привычным.</UiText>

  <UiText>Домоседы, трудно вытянуть в компанию.</UiText>

  <UiText>Интересуются только тем, что логично, практично и безопасно.</UiText>

  <UiText>Часто сутулятся, могут втягивать голову в плечи.</UiText>

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Сказочный персонаж
  </UiText>

  <UiText class="description" color="black">
    🐴 Ослик Иа — «Винни-Пух»
    <i>(Алан Милн)</i>
    . Скептичный, задумчивый, пессимистичный, но наблюдательный.
  </UiText>

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Рекомендации по воспитанию
  </UiText>

  <UiText class="description" color="black">
    Приучайте к труду через логику – объясняйте, как это поможет заслужить
    уважение.
  </UiText>

  <UiText class="description" color="black">
    Стимулируйте подарками и приятным отдыхом – если знает, что после работы
    будет награда, сделает дело быстрее.
  </UiText>

  <UiText class="description" color="black">
    Устанавливайте четкие сроки – ему важно понимать, когда и что делать.
  </UiText>

  <UiText class="description" color="black">
    Развивайте активность через игры и прогулки – лучше всего работает
    совместное участие.
  </UiText>

  <UiText class="description" color="black">
    Внедряйте полезные привычки – например, ежедневную зарядку, но не через
    приказ, а через объяснение пользы.
  </UiText>

  <UiText class="description" color="black">
    Хвалите и демонстрируйте заботу – так он почувствует себя ценным.
  </UiText>

  <UiText class="description" color="black">
    Вселите уверенность в своих силах – иначе будет избегать сложных задач.
  </UiText>

  <UiText class="description" color="black">
    Если не слушается – демонстрируйте разочарование. Он постарается
    восстановить баланс.
  </UiText>

  <hr />

  <UiText class="description" color="black">
    Этот ребенок умный, но замкнутый, ему важны логика, структура и уважение к
    его личным границам.
  </UiText>
</template>
