<script lang="ts" setup>
import { UiText } from "@shared/ui";
</script>

<template>

  <UiText class="attributes" preset="large" color="role">
    Особенности
  </UiText>

  <UiText>
    Сдержанные, серьезные, не любят излишнего шума и хаоса.
  </UiText>

  <UiText>
    Усидчивые и старательные, но инициативу в учебе проявляют редко, чаще в тени более активных сверстников.
  </UiText>

  <UiText>
    Ранимы и чувствительны, могут иметь заниженную самооценку.
  </UiText>

  <UiText>
    Их легко задеть неосторожной шуткой или словом.
  </UiText>

  <UiText>
    Чутко чувствуют неискренность, улавливают обман и уловки других.
  </UiText>

  <UiText>
    Надежны и требовательны в дружбе, но если чувствуют пренебрежение – уходят первыми.
  </UiText>

  <UiText>
    Ревнительно относятся к своим вещам и территории.
  </UiText>

  <UiText>
    Закрыты в общении, долго присматриваются к незнакомцам.
  </UiText>

  <UiText>
    Не могут сидеть без дела – любят рукоделие, помощь по дому.
  </UiText>

  <UiText>
    Домоседы, не любят долго ждать и ходить по гостям.
  </UiText>

  <UiText>
    Защищают своих, могут быть строгими к «чужим».
  </UiText>
  
  <hr />

  <UiText class="attributes" preset="large" color="role">
    Сказочный персонаж
  </UiText>

  <UiText class="description" color="black">
    🩺 Доктор Пилюлькин — «Незнайка» <i>(Николай Носов)</i>.
Серьезный, ответственный, заботливый, но строгий.
  </UiText>

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Рекомендации по воспитанию
  </UiText>

  <UiText class="description" color="black">
    Стройте доверительные отношения, чаще хвалите за хорошие поступки.
  </UiText>

  <UiText class="description" color="black">
    Вселите уверенность в себе, о недостатках говорите мягко, в шутливой форме.
  </UiText>

  <UiText class="description" color="black">
    Научите планировать – это поможет избегать неожиданных ситуаций и конфликтов.
  </UiText>

  <UiText class="description" color="black">
    Объясняйте, что важно быть дружелюбным, иначе люди могут отвернуться.
  </UiText>

  <UiText class="description" color="black">
    Берегите его чувства, если он сердится, не давите – ему важно, чтобы его не обижали в ответ.
  </UiText>

  <UiText class="description" color="black">
    Развивайте умение анализировать, обсуждайте прочитанное, хвалите за осмысленные выводы.
  </UiText>

  <UiText class="description" color="black">
    Стимулируйте через чувство ответственности – можно мягко пристыдить, если нарушает обещания.
  </UiText>

  <UiText class="description" color="black">
    Учите быть терпимее к недостаткам окружающих – гибкость и дипломатичность помогут в жизни.
  </UiText>

  <hr />

  <UiText class="description" color="black">
    Этот ребенок ответственный, но ранимый. Ему нужно тепло, справедливость и предсказуемость.
  </UiText>

</template>