<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">Особенности</UiText>

  <UiText>По натуре спокойный, дружелюбный, легко ладит с окружающими.</UiText>

  <UiText>
    Не стремится доминировать, спокойно уступает в играх, может быть ведомым.
  </UiText>

  <UiText>
    Если его обижают, не жалуется взрослым, чтобы не выглядеть слабым и не
    портить отношения с ровесниками.
  </UiText>

  <UiText>Склонен к пассивности, любит покушать и долго поспать.</UiText>

  <UiText>
    Нужно регулярно подталкивать к действиям, иначе учеба и домашние дела
    отходят на второй план.
  </UiText>

  <UiText>
    Обожает слушать истории, если они красочно рассказаны, с эмоциями и живыми
    описаниями.
  </UiText>

  <UiText>
    Эмоции в целом положительные, любит веселить окружающих беззлобными шутками.
  </UiText>

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Сказочный персонаж
  </UiText>

  <UiText class="description" color="black">
    🧸 Винни-Пух — «Винни-Пух»
    <i>(Алан Милн)</i>
    . Беззаботный, добродушный, склонный к лени, но с теплым характером.
  </UiText>

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Рекомендации по воспитанию
  </UiText>

  <UiText class="description" color="black">
    Проявляйте требовательность. Напоминайте о последствиях, если не делать
    нужное вовремя.
  </UiText>

  <UiText class="description" color="black">
    Создавайте стимулы. Используйте поощрения или ограничения — любимые занятия,
    угощения.
  </UiText>

  <UiText class="description" color="black">
    Хвалите за аккуратность и эстетику. Ему важно, чтобы вещи были сделаны
    красиво и с душой.
  </UiText>

  <UiText class="description" color="black">
    Объясняйте важность дисциплины. Мир без порядка теряет свою красоту и
    гармонию.
  </UiText>

  <UiText class="description" color="black">
    Учите отвечать за слова. Если пообещал — должен выполнить, иначе потеряет
    доверие.
  </UiText>

  <UiText class="description" color="black">
    Сопровождайте рутину приятными ощущениями. Включайте музыку, предлагайте
    вкусную еду, создавайте уют.
  </UiText>

  <hr />

  <UiText class="description" color="black">
    Этот ребенок не любит давления, но мотивируется через комфорт и эстетику.
  </UiText>
</template>
