<script lang="ts" setup></script>

<template>
  <UiText class="attributes" preset="large" color="role">Особенности</UiText>

  <UiText>Сдержанные, недемонстративные, иногда даже замкнутые.</UiText>

  <UiText>
    Чувствительны к оценкам, как положительным, так и отрицательным.
  </UiText>

  <UiText>
    Плохо переносят неудачи, теряют уверенность в себе и своих способностях.
  </UiText>

  <UiText>Нуждаются в поддержке и позитивном отношении.</UiText>

  <UiText>
    По характеру чаще меланхоличны, нуждаются в дружеском участии.
  </UiText>

  <UiText>
    Надежны и сочувственны в дружбе, всегда готовы помочь тем, кто им
    симпатичен.
  </UiText>

  <UiText>
    Сильно зависят от настроения, что отражается на занятиях и общении.
  </UiText>

  <UiText>Информированы, начитаны, следят за событиями вокруг.</UiText>

  <UiText>Избегают больших компаний, тянутся к людям старше себя.</UiText>

  <UiText>
    В классе могут выглядеть отстраненными, их индивидуальность порой
    воспринимается как гордость.
  </UiText>

  <UiText>С детства любят ручной труд, помощь по дому, работу в саду.</UiText>

  <UiText>Плохо переносят критику.</UiText>

  <UiText>Из-за закрытости их могут считать холодными, хотя это не так.</UiText>

  <UiText>
    Стремятся к гармонии – в отношениях, делах, уровне мастерства.
  </UiText>

  <UiText>Любят природу и путешествия.</UiText>

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Сказочный персонаж
  </UiText>

  <UiText class="description" color="black">
    🤖 Железный дровосек — «Страна Оз»
    <i>(Лаймен Фрэнк Баум)</i>
    . Сдержанный, надежный, с добрым сердцем, но не всегда это показывает.
  </UiText>

  <hr />

  <UiText class="attributes" preset="large" color="role">
    Рекомендации по воспитанию
  </UiText>

  <UiText class="description" color="black">
    Проявляйте такт, мягкость и доброжелательность.
  </UiText>

  <UiText class="description" color="black">
    Хвалите за проделанную работу, это важно для самооценки.
  </UiText>

  <UiText class="description" color="black">
    Заинтересовывайте через конечный результат, а не через процесс.
  </UiText>

  <UiText class="description" color="black">
    Поднимайте настроение путешествиями, спортом, прогулками, театром, юмором.
  </UiText>

  <UiText class="description" color="black">
    Объясняйте, что дело нужно делать, чтобы не разочаровать других или для
    собственной выгоды.
  </UiText>

  <UiText class="description" color="black">
    Поощряйте оригинальными подарками, если добьется цели
  </UiText>

  <UiText class="description" color="black">
    Показывайте, что откладывание работы ведет к неприятностям.
  </UiText>

  <UiText class="description" color="black">
    Если ленится – можно слегка пристыдить, но не жестко.
  </UiText>

  <UiText class="description" color="black">
    Главное – не давить, а заставить задуматься, что усилия того стоят.
  </UiText>

  <hr />

  <UiText class="description" color="black">
    Этот ребенок самодостаточный, но эмоционально уязвимый. Ему нужна поддержка,
    а не давление.
  </UiText>
</template>
