<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <div class="warning">
      <UiText preset="small" color="accent">
        Если вы не умеет воспринимать юмор, обидчивы или зависимы от мнений
        незнакомцев, пожалуйста, не читайте все что ниже.
      </UiText>

      <UiText preset="small" color="accent">
        Ненормативная лексика и сексуальные темы, оскорбление чувств всех
        причастных. Но весело и остроумно. Соблюдена авторская орфография и
        пунктуация.
      </UiText>
    </div>

    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Люркмор"
          subtitle="2 минуты"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Селютин"
          subtitle="4 минуты"
          target-content-id="tab-2"
        />

        <VariousTab
          title="Эльвира Фея"
          subtitle="2 минуты"
          target-content-id="tab-3"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText color="accent">
            <i>
              небыдло, чиновник, позёр, гик, бард, буржуй, герой, школьник,
              трудоголик, автомобилист, пират, PROFIT
            </i>
          </UiText>

          <UiText preset="large" color="role">
            Умеют извлекать максимальный ПРОФИТ из любой ситуации. Стереотипные
            бизнесмены и искатели неприятностей на свою жопу. Очень работящи,
            могут часами заниматься тем, что им кажется правильным.
          </UiText>

          <UiText>
            Частенько ссать и срать хотели бы на чужую духовность, отчего в Этой
            стране часто терпят fail. Похуизм в отношении духовности с лихвой
            компенсируется тягой к душевности, ёба!
          </UiText>

          <UiText>
            Под душевностью подразумеваются ниочёмные разговоры за жЫзнь,
            прослушивание шансона и установка на торпеду своей тачки иконостаса,
            призванного защищать от аварий, штрафов и триппера.
          </UiText>

          <UiText>
            Глубокая и трепетная вера Предпринимателя не мешает ему бухать,
            воровать и объёбывать всех вокруг. Как и Аналитик любит
            справедливость, восстанавливает её всеми несправедливыми способами,
            при этом не гнушаясь даже покопаться в чужом грязном бельё.
          </UiText>

          <UiText preset="large" color="role">
            Обожает демонстрировать своё бесстрашие.
          </UiText>

          <UiText>
            Как и Администратор, несмотря на экстраверсию, общается только с
            небольшим кругом людей — как правило, это семейный круг и двое-трое
            друзей собутыльников. В итоге часто живут жизнью жлоба, держащего
            ларёк на остановке.
          </UiText>

          <UiText>
            Считается интегральным типом Пиндостана. И Изrаиля, лол.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">Бочка меда</UiText>
          <UiText preset="large" color="role">
            Тащемта, работяги и смельчаки.
          </UiText>
          <UiText preset="small" color="accent">Ложка дегтя</UiText>
          <UiText preset="large" color="accent">
            Бабы-Предприниматели это тот ещё ПаЗиТифФчИК — смесь Администратора
            и Советчика: бегает, пиздит и заставляет всех работать!
          </UiText>
          <UiText preset="large" color="accent">
            Готовят вообще отвратительно, колбасу хранят в одном пакете с
            шоколадом…
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="large" color="role">
            Абсолютно лишенный чести, совести, честности и такта проходимец. Все
            делает только для себя.
          </UiText>

          <UiText>
            Вот уж кто мерзавец, так это Предприниматель — беспринципный,
            безнравственный, продажный, да ещё и хамло озабоченое: только и
            может что про секс трепаться, самая распространённая у них тема.
          </UiText>

          <UiText>
            Конечно, все люди с болевой сенсорикой этим в той или иной мере
            страдают, но у них — это просто прёт из всех щелей. Девушки получше,
            конечно, но тоже те ещё б…
          </UiText>

          <UiText reset="large" color="role">
            Умеет делать деньги из воздуха и при этом оставаться наивным
            ребенком в душе.
          </UiText>

          <UiText>
            Завидует умным людям. Любит женщин на природе. Не любит тихушников и
            тех, кто себе на уме.
          </UiText>

          <UiText reset="large" color="role">Жмот, заядлый спорщик.</UiText>

          <UiText>
            Никогда не будет делать ничего, что не принесет ему материальной или
            моральной выгоды, причем моральная преобладает: если не оценить его
            работу в мимико-этической форме, больше по собственному почину для
            тебя и пальцем не пошевелит, либо будет стараться поднять цены до
            максимума.
          </UiText>
        </section>

        <section>
          <UiText>
            Кажется, что «время — деньги» написано у него на лбу, и это так —
            потраченное на других время считает счетом в банке, который должен
            вернутся с прибылью.
          </UiText>

          <UiText>
            Неряха и проглот — на халяву всегда готов есть, но будет ломаться и
            отнекиваться, пока у всех дым из ушей не пойдет.
          </UiText>

          <UiText>
            Вид подозрительной еды способен вызвать у него обморок, а
            предложившего несъедобный продукт обязательно запомнит, чтобы в
            другой раз с ним за стол не садиться.
          </UiText>

          <UiText preset="large" color="role">
            Антисоциал: суется во все учения и общества, декларирующие отречение
            от социума.
          </UiText>

          <UiText>
            Время — деньги! Но на самом деле время для него полная фигня:
            назначьте встречу ему на 15.00, и он появится в лучшем случае в
            16.15.
          </UiText>

          <UiText preset="large" color="role">
            Стало быть — только деньги, ничего кроме денег.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-3" class="tab">
        <section>
          <UiText preset="large" color="role">
            Предприниматели – они вообще, сука, прохвосты еще те, живчики, для
            которых на всем белом свете не существует никого, кроме них,
            любимых.
          </UiText>

          <UiText>
            Однако, в отличие от того же Политика, Предприниматель не будет
            никому пиздеть — он пойдет и сделает, а потом сделает еще раз, и
            еще, и затрахает вам мозг своей активностью и вечным оптимизмом, от
            которого хочется стошнить в кулечек.
          </UiText>

          <UiText>
            Предприниматель — это тот розовый заяц, который все бежит, сука, и
            бежит, пока голубые не воспылают нему острой и чистой ненавистью.
          </UiText>

          <UiText>
            Он все успевает, у него все работает – нет, не ломается, не горит,
            как у вас, а именно функционирует; он всегда весел, всегда в нужном
            месте и в нужное время, всегда готов, как пионер.
          </UiText>

          <UiText>
            От его мельтешения у нормального человека рябит в глазах и чешутся
            кулаки.
          </UiText>

          <UiText>
            Материалисты до мозга кости, прагматики от дьявола, уверены в себе
            донельзя и сияют, как начищенные монетки, в любое время дня и ночи.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Если за день в жизни Предприниматель не произошло минимум десяти
            крайне важных встреч и двух свиданий одновременно, то он чувствует
            скуку.
          </UiText>

          <UiText>
            К слову, эти электровеники из плоти и крови могут производить
            впечатление примерных семьянинов, но не верьте — где-то между
            третьим совещанием и корпоративом они уже запланировали грязное
            приключение с тремя секретаршами.
          </UiText>

          <UiText>
            А еще к этим мерзавцам липнут деньги, что крайне раздражает,
            особливо Новаторов, которые никак не могут понять, почему столь
            приземленные придурки зашибают столько бабла, когда такие
            непризнанные гении, как Новаторы, опять сидят по уши в дерьме.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
