<script setup lang="ts">
import {
  VariousContentContainer,
  VariousTab,
  VariousTabContent,
} from "@widgets/various-content";
</script>

<template>
  <div class="text g-page">
    <VariousContentContainer
      default-content-id="tab-1"
      sync-with-url
      switcher-on-top
    >
      <template #tabs>
        <VariousTab
          title="Велта Микелсоне"
          subtitle="13 минут"
          target-content-id="tab-1"
        />

        <VariousTab
          title="Вера Стратиевская"
          subtitle="32 минуты"
          target-content-id="tab-2"
        />
      </template>

      <VariousTabContent id="tab-1" class="tab">
        <section>
          <UiText preset="subtitle" color="role">
            Миссия — своим личным этическим поведением быть примером для других.
          </UiText>

          <UiText>
            Добрый человек, чувствующий людей и способный понять самого
            отъявленного злодея. По характеру он внимательный, не настойчивый и
            спокойный человек.
          </UiText>

          <UiText preset="large" color="role">
            Прирожденный знаток людей, распознающий отношения и атмосферу между
            ними. Он может найти общий язык даже с самыми неуживчивыми людьми.
          </UiText>

          <UiText preset="large" color="role">
            В неизвестной ситуации перед тем, как начать общение, наблюдает за
            интонациями голоса, жестами, нюансами поведения присутствующих.
          </UiText>

          <UiText>
            Может заслужить доверие и стать доверенной персоной для многих,
            сохраняя при этом своё собственное «Я». В общении не показывает
            отрицательного отношения к кому либо, со всеми старается
            поддерживать ровные и благожелательные отношения.
          </UiText>

          <UiText preset="large" color="role">
            Готов простить обидчика. В споры других не вмешивается, сам
            старается их избегать, беспристрастно успокаивает спорящих.
          </UiText>

          <UiText>
            Старается понять истинные причины недоразумений, вникнуть в
            ситуацию, взвесить сложившиеся обстоятельства.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Способен снимать с других напряжение.
          </UiText>

          <UiText>
            Люди с удовольствием с ним встречаются, ища у него поддержки и
            совета. Он, как никто другой обладает способностями к эмпатии –
            умению сочувствовать состоянию человека. Чувствует себя неловко,
            если не может успокоить или помочь другому.
          </UiText>

          <UiText preset="large" color="role">
            Близкие часто пользуются его бескорыстием.
          </UiText>

          <UiText>
            У Гуманиста бывают много знакомых, но настоящих друзей у него
            немного. Он осторожен в отношениях и не каждому позволяет
            приблизится близко. Того, кто однажды его обманул или предал,
            полностью не исключает из своего круга знакомых, но присваивает ему
            другой статус.
          </UiText>

          <UiText>
            Непритязательный и сдержанный. Влюбляется моментально, но не
            осознает важность отношений. Фактически, в первой фазе отношений,
            внутренне их отвергает, будто боится.
          </UiText>

          <UiText preset="large" color="role">
            У него утонченный и богатый внутренний мир переживаний и эмоций.
          </UiText>
        </section>

        <section>
          <UiText>
            Свои действия главным образом подчиняет голосу сердца, а не разуму.
            Ему присуще постоянное самосовершенствование. Приспосабливается к
            взглядам и привычкам партнера, если это не противоречит его
            мировоззрению и убеждениям. В противном случае он ловко уклоняется
            от отношений.
          </UiText>

          <UiText preset="large" color="role">
            Всегда у него на примете то, чем он будет заниматься.
          </UiText>

          <UiText>
            Никому не навязывает своего присутствия. Ненавязчивым замечанием
            может добиться желаемого, но если работа связана с большим числом
            людей чувствует свою энергию израсходованной.
          </UiText>
        </section>

        <section>
          <UiText>
            Близким дарит истинное сердечное тепло и любовь. Ему неприятны
            грубые, небрежные, безнравственные люди, он охотно пытается их
            воспитывать. Способен предчувствовать и догадываться о внутреннем
            смысле процессов.
          </UiText>

          <UiText>
            Он хорошо понимает отношение других людей к себе, способен
            предвидеть их поведение. У него врожденные способности воспитателя и
            психолога.
          </UiText>

          <UiText preset="large" color="role">
            Помогает другим развить их положительные качества. В его присутствии
            люди чувствуют себя непринужденно.
          </UiText>

          <UiText>
            Он идеалист. Для себя ставит высокие требования, но к поступкам
            других терпелив, замечает их, выслушивает и дает ценный совет.
          </UiText>

          <UiText preset="large" color="role">
            Один из самых тихих, терпеливых и снисходительных типов.
          </UiText>

          <UiText>
            Четко знает, что хорошо и что плохо, свои взгляды другим не
            навязывает. Однако в случаях, когда управляет процессами, способен
            вовлечь других в работу и выразить свои мнения. Считает, что детей
            своевременно следует приучить к порядку, но этого он добивается
            гуманными путями, без насилия.
          </UiText>

          <UiText>
            Он считает, что нужно заботится о развитии ребенка, способствуя его
            творческому и культурному развитию.
          </UiText>

          <UiText>
            Гуманист считает, что супружеская жизнь должна быть в согласие и
            сопровождаться взаимным пониманием и любовью, и в ней нет места
            вульгарности и диктату. Ему необходимо, чтобы вокруг него находились
            люди, обладающие сходными ценностями и моралью.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Ярко выражено самопознание.
          </UiText>

          <UiText>
            Его увлекает психология и философия, поскольку это дает возможность
            духовно совершенствоваться и освободиться от внутреннего напряжения.
          </UiText>

          <UiText>
            Он не может находиться в противоречии – исповедовать в словах одни
            ценности, а действовать по другим принципам.
          </UiText>

          <UiText preset="large" color="role">
            В юности его увлекают гуманитарные науки и необычные теории.
          </UiText>

          <UiText>
            Осознает свои сильные и слабые стороны, но от других это скрывает.
          </UiText>

          <UiText>
            Если чувствует обиду, ограждает себя психологическим барьером, может
            ходить угрюмым с мраморным выражением лица. Часто увлекается
            фотографией, даже на профессиональном уровне. Он умеет уловить
            интересные моменты, скрытые от глаз других.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Способен решать сложные задания, но не умеет объяснить их другим.
          </UiText>

          <UiText>
            Если ему удалось что-то сделать, может по-детски похвастаться.
            Ситуации, которые другие воспринимают спокойно, он иногда
            преувеличивает или слишком критически воспринимает их.
          </UiText>

          <UiText>
            Сложные ситуации предпочитает решать сам, и не осознает, что
            добиться результатов одному ему сложно. Он застревает в данном
            процессе, а освободится он может лишь с помощью других. Достоевского
            интересуют тайны мира и вселенной. Он собирает и обобщает
            информацию, в результате имеет своё устойчивое мнение по любому
            вопросу. С удовольствием изучает научно-популярную литературу,
            прочитанное обсуждает с другими. Достоевскому характерно
            нетрадиционное мышление, он генерирует необычные идеи.
          </UiText>

          <UiText preset="large" color="role">
            Смущается, если слышит публичные похвалы и выражения симпатии, в
            такие моменты желает незаметно исчезнуть.
          </UiText>

          <UiText>
            Не уверен в своей внешности. Ему необходимо слышать подтверждения,
            на сколько хорошо он выглядит — привлекательный, утонченный. Тогда
            он почувствует себя уверенным. Не умеет защищать свои материальные
            интересы.
          </UiText>

          <UiText>
            Ему необходимо осваивать новые навыки (может несколько раз в жизни
            кардинально менять профессии).
          </UiText>

          <UiText preset="large" color="role">
            Нерешительный, поэтому не настаивает на том, что точно не знает.
          </UiText>

          <UiText>
            Долго думает перед тем как принять решение, но поскольку желания у
            него непостоянны, часто их меняет.
          </UiText>

          <UiText>
            В течении жизни старается развить волю и выносливость. Не терпит
            насилия, поэтому не заставляет других делать то, чего они не хотят.
            Ему необходимо быть твердо уверенным в своей идее или цели, тогда
            способен быть настойчивым и даже упорным до конца, и требует этого
            от других.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">Плохо переносит стресс.</UiText>

          <UiText>
            В экстремальной обстановке становится нервным. Если близкие
            Гуманиста попали в беду, тогда он способен быстро реагировать. В
            такие моменты не чувствует страха. У Достоевского страх приходит как
            бы с опозданием, осознает происходящее только тогда, когда опасность
            уже миновала. Бывает, что это вызывает у других шок, а сам он
            испытывает удовлетворенность.
          </UiText>

          <UiText>Нуждается в самоутверждении.</UiText>

          <UiText preset="small" color="accent">
            Среди представителей данного социотипа много журналистов, которые
            рискуя своей жизни отправляются в самые горячие точки событий.
            Женщины, не получив семейного счастья, могут выбрать военную карьеру
            и демонстрировать примерное поведение, подобно мужчинам.
          </UiText>

          <UiText preset="large" color="role">
            Берет на себя слишком много обязанностей, поэтому часто
            переутомляется.
          </UiText>

          <UiText>
            Не умеет рассчитывать количество и трудоемкость работы, поэтому
            контролирует время после сделанного. Достоевскому сложно
            подстраиваться под ритм другого.
          </UiText>

          <UiText>
            Не обращает внимание на отдельные мелкие детали, их проработка
            наводит на него скуку. Желает, чтобы его работа была оценена по
            достоинству и не подвергалась критике. Переживает, если это не
            происходит, может даже заболеть. Гуманист нуждается в партнере,
            который может четко и однозначно объяснить, что делать.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Красота и удобство в окружение придают ему силы, нуждается в
            приятных ощущениях.
          </UiText>

          <UiText>
            Всегда сам может создать для себя уютную обстановку. С другой
            стороны необходимо заметить, что он не требователен к быту, может
            обходиться без лишнего комфорта.
          </UiText>

          <UiText>
            Осторожно выбирает себе одежду, не покупает ничего лишнего.
            Одевается неброско. Он не одевается в яркие и вызывающие тона.
            Болезненно переживает по поводу замечаний о его внешности.
          </UiText>

          <UiText preset="small" color="accent">
            Некоторым сегодняшним мужчинам-Гуманистам свойственен своеобразный
            стиль — волосы собранные в косу или в них вплетены искусственные
            тесемки, в любое время года надета шапка, на спине — рюкзак, который
            обычно заполнен, брюки в дырках, как правило больше по размеру, и
            ботинки на толстых подошвах. Довольно часто они предпочитают
            передвигаться на велосипеде. Он не спорит о чужих вкусах и свои
            никому не навязывает.
          </UiText>

          <UiText preset="large" color="role">
            Не пропустит регулярную спортивную тренировку для поддержания
            физической формы.
          </UiText>

          <UiText preset="small" color="accent">
            Особенно мужчины — считают, что его организм требует регулярное
            занятие сексом, и это нельзя пропустить. Искусно подбирает слова и
            интонацию речи. Он верит не столько словам, но и мимике, интонации
            голоса и личному отношению к нему.
          </UiText>

          <UiText>
            Умеет распознать серьезные отношения от кратковременного
            удовольствия. Он умеет выделить время для работы и развлечений.
            Пунктуальный, не опаздывает, выполняет свои обещания, побуждая
            окружающих действовать так же.
          </UiText>

          <UiText>
            Если время бесцельно проходит, поторапливает других. От общества
            ожидает того, в чем нуждается.
          </UiText>
        </section>

        <section>
          <UiText preset="large" color="role">
            Если личные интересы удовлетворены, способен быть правдивым и
            полезным обществу.
          </UiText>

          <UiText>
            В противном случае становится невыносимым демагогом, занудой и
            одиночкой.
          </UiText>

          <UiText preset="large" color="role">
            У него отличная память на цифры, схемы и структурированную
            информацию.
          </UiText>

          <UiText>
            Он умело собирает необходимое количество информации из верных
            источников, чтобы понять, с чем он имеет дело. Замечает
            противоречия, нелогичность и манипуляцию фактами.
          </UiText>

          <UiText>
            Не склонен спорить. Но при возникновении спора не позволит
            унизительно высказаться о его умственных способностях или опыте,
            отстаивает свою позицию до конца, ему необходимо доказать свою
            правоту.
          </UiText>

          <UiText preset="large" color="role">
            Ему важно подтвердить свою уникальность. Он быстро находит новые
            возможности.
          </UiText>

          <UiText>
            Исправляет и дополняет всё в быту, чтобы облегчить жизнь.
            Интересуется новинками, совершенствует и улучшает эффективность
            производства,чтобы ускорить процессы.
          </UiText>

          <UiText preset="large" color="role">
            Исправляет и дополняет всё в быту, чтобы облегчить жизнь.
            Интересуется новинками, совершенствует и улучшает эффективность
            производства,чтобы ускорить процессы.
          </UiText>

          <UiText>
            Умело выбирает лучшие по содержанию справочники, энциклопедии и
            другие книги. Его увлекает фантастика и приключения.
          </UiText>
        </section>
      </VariousTabContent>

      <VariousTabContent id="tab-2" class="tab">
        <section>
          <UiText preset="small" color="accent">1 — Базовая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_people" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чувство</UiText>
              <UiText preset="body">Этика отношений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Гуманист стремится создать самую гармоничную, самую гуманную, в его
            представлении, форму этических отношений, исключающую подавление
            одной личности другой, исключающую конфликты, раздор, недопонимание,
            взаимное недоверие.
          </UiText>

          <UiText>
            «Худой мир лучше доброй ссоры» — основная форма его этической
            стратегии.
          </UiText>

          <UiText>
            Вся его жизнь — это поиск средств и возможностей реализовать свою
            идеалистическую систему отношений, причем его собственное поведение
            должно служить позитивным этическим примером.
          </UiText>

          <UiText color="role">
            Следствием такой установки являются характерные для людей этого типа
            повышенный самоанализ, самокритичность и постоянное этическое
            самоусовершенствование.
          </UiText>

          <UiText preset="large" color="role">
            Высокая требовательность к себе у Гуманиста нередко сочетается с
            терпимостью к чужим слабостям.
          </UiText>

          <UiText>
            В таких случаях кризис отношений он «выправляет» за счет собственных
            уступок, считая, однако, что эти уступки должны быть партнером
            вовремя замечены и должным образом оценены. По сути говоря, его
            уступка — это своего рода этический прием, которым он предполагает
            убедить партнера в своей изначальной доброжелательности и готовности
            к компромиссам.
          </UiText>

          <UiText>
            На самом же деле, его уступчивость имеет разумные пределы. И если
            требования партнера переходят допустимые границы, Гуманист оказывает
            эмоциональное сопротивление, воздвигая между собой и разочаровавшим
            его субъектом непроницаемый психологический барьер.
          </UiText>

          <UiText color="role">
            Гуманист может поддерживать отношения с психологически несовместимым
            партнером, опираясь на чувство долга и ответственность перед
            сложившимися родственными и семейными связями, но в случае особо
            неблагоприятных отношений и, будучи абсолютно уверенным в
            невозможности что-либо в них исправить, бесповоротно и безоговорочно
            оставляет своего партнера.
          </UiText>

          <UiText>Качество, свойственное также и Хранителю.</UiText>

          <UiText color="role">
            Представитель этого типа, сам лично не испытавший разрыва
            взаимоотношений с партнером, как правило, старается не допускать
            разрыва семейных отношений и у своих близких.
          </UiText>

          <UiText>
            Он будет их мирить до тех пор, пока лично не убедится, что
            совместное проживание им действительно противопоказано.
          </UiText>

          <UiText>
            Разрыв собственных близких отношений Гуманист воспринимает очень
            болезненно, особенно, когда не видит реальной возможности их
            восстановить.
          </UiText>

          <UiText color="accent">
            Например, если кто-то из близких заставит его порвать отношения с
            другом, Гуманист попадает в ситуацию, противоречащую его системе
            взглядов: с одной стороны, он предает дружбу, с другой стороны — он
            не хочет огорчать своих близких.
          </UiText>

          <UiText>
            К заповеди «Не делай другому того, чего не пожелаешь себе» Гуманист
            относится с исключительной серьезностью: он принципиально не желает
            причинять кому-либо даже малейшую неприятность. Старается для
            каждого создать условия максимального психологического комфорта,
            каждого одарить хоть крупицей своего душевного тепла.
          </UiText>

          <UiText>
            Кротость, смирение, снисходительность к чужим слабостям, душевная
            чуткость, изначальная доброжелательность и миролюбие - вот основные
            ценности его этической программы.
          </UiText>

          <UiText color="role">
            Строя свои взаимоотношения, Гуманист старается быть предельно
            деликатным. Например, он не позволит себе категорически отказаться
            от предлагаемой помощи, даже если она не только очевидно
            неэффективна, но и очевидно вредна.
          </UiText>

          <UiText>
            Но нельзя же отталкивать человека, который от чистого сердца и из
            лучших побуждений предлагает свои услуги.
          </UiText>

          <UiText color="role">
            То же самое и с советами явно абсурдного характера — Гуманист
            постарается быть с советчиком предельно деликатным, внимательно
            выслушает, поблагодарит за сочувствие его проблемам, но поступит
            соответственно обстоятельствам и собственному усмотрению.
          </UiText>

          <UiText color="role">
            Если он поручил сделать задание в двух вариантах, а ты сделал в
            четырех — молодец, но в следующий раз — эти четыре варианта будут
            уже твоей нормой.
          </UiText>

          <UiText>
            «Почему бы и не послушать доброго совета?» — тем более, что далеко
            не каждый «доброжелатель» контролирует неукоснительное их
            выполнение.
          </UiText>

          <UiText color="role">
            Кроме того, Гуманист способен воспринимать чужие советы не только
            как руководство к действию, но и как форму выражения сочувствия его
            трудностям.
          </UiText>

          <UiText preset="large" color="role">
            Гуманист очень чувствителен к чужой беде, склонен к сопереживанию.
            Имеет способность буквально растворяться в чужих проблемах,
            особенно, если это проблемы близких ему людей.
          </UiText>

          <UiText>
            Если, например, кто-либо из его окружения заболевает, Гуманист
            выхаживает его с исключительной самоотверженностью, не считаясь ни
            со своими собственными силами, ни со своим здоровьем, ни с
            опасностью возможного заражения.
          </UiText>

          <UiText>
            Та семья, где есть родственник Гуманист, может быть совершенно
            спокойна за свое здоровье: стоит кому-нибудь захворать, Гуманист,
            как правило, тут же бросает все свои дела и выхаживает больного,
            причем дальность родства в данном случае для него значения не имеет.
          </UiText>

          <UiText>
            Способность сопереживать чужому горю — одна из базисных ценностей
            его системы отношений. В понимании Гуманиста, акт утешения сам по
            себе уже достаточно деятельный поступок.
          </UiText>

          <UiText>
            Такая точка зрения очень располагает к нему окружающих.
          </UiText>

          <UiText preset="large" color="role">
            Гуманист постоянно ищет и находит какие-то оригинальные формы
            выражения сочувствия и солидарности с эмоциональным состоянием
            своего партнера или своего окружения.
          </UiText>

          <UiText color="accent">
            Например, представительница этого типа по случаю окончания
            бракоразводного процесса своей подруги преподнесла ей букет цветов —
            в такой форме она ее поздравила с началом новой, «свободной» жизни.
          </UiText>

          <UiText>
            Для Гуманиста очень важно, чтобы этическая мотивация его поступков
            была правильно понята и соответствующим образом оценена. Для него
            любой подарок, любая услуга представляют огромную ценность, как
            форма выражения добрых намерений. В то время как реальная стоимость
            этой услуги для него значит гораздо меньше.
          </UiText>

          <UiText color="accent">
            Его дуал Администратор также придает подаркам чисто символическое
            значение, по крайней мере тем, которые дарит.
          </UiText>

          <UiText>
            Гуманист умеет хранить чужие тайны. Поэтому ему можно довериться без
            всякого опасения, и разумеется, без оговорки, что «это должно
            остаться между нами», поскольку в этом случае Гуманиста оскорбит
            само предположение, что он способен кому-то разболтать чужой секрет.
          </UiText>

          <UiText preset="large" color="role">
            Сам он также предполагает, что тайна «его исповеди» будет свято
            соблюдена. Поэтому всякий факт разглашения его собственных секретов
            для него является тяжелейшим разочарованием.
          </UiText>

          <UiText>
            Сам не способный на измену и предательство по отношению к ближнему
            Гуманист осуждает эти качества у других. Злоупотребления его
            доверием Гуманист никогда не прощает, хотя по природе своей и не
            злопамятен.
          </UiText>

          <UiText>
            Будучи вовлеченным в какую-то интригу или попадая в систему
            отношений, противоречащую его этическим установкам, Гуманист
            чувствует себя совершенно растерянным и дезориентированным, но в
            каждом отдельном случае старается вести себя так, чтобы его поступки
            не противоречили его этическим принципам.
          </UiText>

          <UiText color="role">
            Сам очень боится обидеть кого-либо недоверием. Считает недоверие
            оскорбительным для всех, в том числе и для себя. Благие намерения
            считает нормой человеческих взаимоотношений, поэтому изначально
            старается не предполагать в людях дурных умыслов.
          </UiText>

          <UiText>
            Изначальную подозрительность воспринимает как нечто неэтичное и
            негуманное. По этой же причине его бывает иногда невозможно убедить
            в чьей-либо вине, даже если она доказана и очевидна окружающим.
          </UiText>

          <UiText color="role">
            Поступки Гуманиста в немалой мере определяются его личными
            симпатиями и антипатиями. То есть, если он симпатизирует человеку,
            то старается игнорировать факт его вины.
          </UiText>

          <UiText preset="large" color="role">
            Гуманист способен к самопожертвованию во имя любви и дружбы,
            например, может взять на себя чужую вину, защищая друзей от
            возможных неприятностей, и из-за этого сам пострадать.
          </UiText>

          <UiText>
            Гуманист строит свои взаимоотношения с людьми на близкой дистанции,
            что иногда особенно располагает к нему окружающих, но иногда может
            показаться навязчивым.
          </UiText>

          <UiText color="accent">
            Всякий намек на навязчивость воспринимается Гуманистом чрезвычайно
            болезненно, поскольку он менее всего предполагает утомлять кого-то
            своим обществом.
          </UiText>

          <UiText>
            В случае неблагоприятного развития отношений — он увеличивает
            дистанцию.
          </UiText>

          <UiText>
            Гуманист в любой ситуации старается быть предельно вежливым и
            сдержанным, каких бы усилий ему это ни стоило. Он делает все
            возможное, и невозможное, чтобы никого не обидеть, чтобы не дай Бог
            не нажить себе врагов. Никакой откровенной вражды старается не
            допускать.
          </UiText>

          <UiText color="role">
            Воздвигаемый им «психологический барьер» рассматривает не как
            вражду, а как свое право «держать дистанцию» с несимпатичным ему
            человеком.
          </UiText>

          <UiText>
            Гуманист не злопамятен, быть злопамятным, в его понимании, неэтично,
            но первым восстанавливать испорченные отношения не решится, пока не
            будет уверен, что его обидчик осознал свою вину.
          </UiText>

          <UiText color="role">
            Чтобы получить «прощение» Гуманист, достаточно продемонстрировать
            ему свое расположение, причем извинения приносить необязательно. Мир
            его чувств настолько тонок и богат, что он не нуждается в словесных
            выражениях эмоций и переживаний для того, чтобы понять окружающие
            его взаимоотношения.
          </UiText>

          <UiText preset="large" color="role">
            Гуманист никогда не забывает добра, которое ему когда-либо сделали,
            а неблагодарность считает качеством, заслуживающим самой суровой
            критики.
          </UiText>

          <UiText>
            Доброта и сочувствие — стабильные ценности этики Гуманиста и он
            умеет проявить их как никто другой.
          </UiText>

          <UiText color="role">
            Представители этого типа склонны к глубокому этическому самоанализу.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">2 — Творческая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_ideas" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Мысль</UiText>
              <UiText preset="body">Интуиция возможностей</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Гуманисту весьма затруднительно реализовать свою «бесконфликтную»
            систему отношений в нашем противоречивом мире.
          </UiText>

          <UiText color="role">
            Свойства, которые выручают и обнадеживают его на этом благородном
            поприще, — природный оптимизм и сильная и гибкая интуиция
            возможностей.
          </UiText>

          <UiText>
            В каждом человеке Гуманист старается увидеть и выявить положительный
            этический потенциал — качество, благодаря которому представители
            этого типа великолепно работают в области педагогики.
          </UiText>

          <UiText>
            Гуманист не понимает и не принимает такого словосочетания, как
            «испорченные дети». В его понимании, нет таких «испорченных детей»,
            которые бы не внушались положительным этическим примером.
          </UiText>

          <UiText preset="large" color="role">
            Этико-интуитивное воздействие Гуманиста строится на умении
            разглядеть и развивать все самое лучшее, что есть в человеческой
            душе.
          </UiText>

          <UiText color="role">
            Само собой, это развитие требует затраты времени, душевных сил.
            Требует терпения. Поэтому, по мнению Гуманиста, воспитатель должен
            постоянно работать над собой, совершенствуя свою этику, воспитывая в
            себе чувство долга и ответственность за судьбу вверенного ему
            человека.
          </UiText>

          <UiText>
            Точно так же Гуманист считает, что нет таких, изначально
            бесперспективных этических отношений, которые невозможно было бы
            выправить, применив достаточную изобретательность, терпение, умение
            «переждать грозу», умение доказать чистоту своих помыслов, умение
            проявить лучшие черты своего характера в качестве личного примера.
          </UiText>

          <UiText>
            Гуманист искренне убежден, что в каждой этически сложной ситуации
            следует искать формы, сглаживающие возникшие противоречия. Например,
            если обе стороны пойдут на некоторые уступки, это уже даст какие-то
            результаты и проблема будет хоть частично, но решена.
          </UiText>

          <UiText>
            Творчески реализуемая интуиция возможностей позволяет ему быть
            дальновидным и предусмотрительным в своих поступках.
          </UiText>

          <UiText color="role">
            Причем цель его дальновидности — предвидеть возможные осложнения
            отношений и заранее их исключить.
          </UiText>

          <UiText color="accent">
            Например, представительница этого типа, устраивая детский праздник,
            раскладывала угощение равными порциями, поскольку опасалась, что
            если она этого не сделает, кто-нибудь из приглашенных детей съест
            больше других, и, следовательно, кто-то другой почувствует себя
            обиженным и обделенным, а этого ни в коем случае нельзя допустить!
            По той же причине она не позволяла своим внукам выносить сладости на
            улицу, так как считала, что это будет возбуждать обиду и зависть у
            других детей, а это нехорошо!
          </UiText>

          <UiText color="role">
            Удобства окружающих его людей Гуманист подчас ценит больше, чем свои
            собственные, и постоянно соотносит свои поступки с их мнением и их
            образом жизни.
          </UiText>

          <UiText>
            При всем своем оптимизме Гуманист способен предусмотрительно
            просчитать и наихудший ход событий и именно для того, чтобы лично у
            него и у его окружения все сложилось самым наилучшим образом.
          </UiText>

          <UiText>
            Вследствие такого интуитивного расчета Гуманисту свойственно
            перестраховываться в поступках, что, впрочем, иногда приводит к
            позитивным последствиям.
          </UiText>

          <UiText color="accent">
            Пример: семья репрессированного «врага народа» в ожидании близкой
            ссылки решила подарить соседской девочке пианино. Соседка-Гуманист
            категорически этому воспрепятствовала и потребовала, чтобы пианино
            отправили назад. В ее семье этот эпизод пересказывается как предание
            - считается, что этим поступком она спасла свою семью от репрессий.
          </UiText>

          <UiText>
            И тем не менее, какая бы сильная интуиция ни была у Гуманиста, его
            расчеты далеко не всегда оказываются верны: ведь всех обстоятельств
            дела он ни видеть, ни знать не может; тем более, что часто он
            принимает желаемое за действительное и просчитывает иногда
            воображаемый ход событий, а не реальный, полагаясь на уже
            сложившиеся в его представлении стереотипы.
          </UiText>

          <UiText color="accent">
            Например, в одном случае он будет мирить ссорящихся супругов,
            опасаясь, что если он не вмешается, его потом будут упрекать в
            разбитой личной жизни. В другом случае, он не будет встревать между
            ссорящимися, чтобы «не принимать бой на себя» и не наживать себе
            врагов.
          </UiText>

          <UiText color="role">
            В каждом конкретном случае правильность расчетов и поведения
            Гуманиста зависит от его собственного жизненного опыта и от того,
            насколько глубоко ему удалось понять ситуацию.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">3 — Ролевая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_logic" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Теория</UiText>
              <UiText preset="body">Структурная логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Стремясь выполнить свое жизненное предназначение по установлению
            идеальных отношений в мире реальных противоречий и конфликтов,
            Гуманист старается много и обстоятельно размышлять над теми
            обстоятельствами, которые мешают жизненному воплощению его этической
            программы.
          </UiText>

          <UiText color="role">
            Причем в своих размышлениях он иногда приходит к выводу, что
            реальные обстоятельства могут быть изменены под влиянием
            «правильных» этических установок, которые можно, по его мнению, и
            нужно задать.
          </UiText>

          <UiText>
            Примитивно эти размышления можно представить так: «В мире не будет
            вражды, если все люди будут хорошо друг к другу относиться, что, в
            принципе, возможно, поскольку в каждом человеке есть задатки добра,
            которые можно и нужно развить».
          </UiText>

          <UiText>
            Как любой человек, Гуманист считает, что все вокруг придерживаются
            его системы взглядов, просто некоторые, по своей душевной слабости,
            соблазняются дурными примерами и впадают в заблуждения, из которых
            их нужно вывести, или хотя бы попытаться это сделать.
          </UiText>

          <UiText color="role">
            Логика Гуманиста базируется на его интуиции возможностей, проще
            говоря — на его мечтах и фантазиях, и это обстоятельство придает ей
            очаровательную детскую наивность.
          </UiText>

          <UiText preset="large" color="role">
            Но за бесконфликтность отношений кто-то должен платить — такова
            объективная реальность, и Гуманист, как правило, очень неохотно это
            признает.
          </UiText>

          <UiText>
            Гуманисту трудно подчинять свои чувства рассудку. Ему трудно быть
            объективным еще и потому, что его система отношений предполагает
            изначальную доброжелательность ко всем людям без исключения.
          </UiText>

          <UiText>
            Вследствие этого качества он может составить о себе впечатление, как
            о человеке беспринципном, непоследовательном и самому себе
            противоречащем: со всеми-то он старается соглашаться, со всеми
            собирается дружить, всех намерен любить.
          </UiText>

          <UiText>
            Спрашивается, а может ли Гуманист вообще быть принципиальным? Может!
            И именно в своих этических принципах. А все остальное для него не
            имеет принципиальной значимости. Законами объективной реальности
            Гуманист не слишком интересуется.
          </UiText>

          <UiText color="accent">
            Тем более, если они оправдывают существующие в мире противоречия,
            которые, как известно, выливаются во вражду и насилие.
          </UiText>

          <UiText>
            Это вовсе не значит, что Гуманист отрицает законы диалектики, просто
            этот аспект он предпочитает игнорировать. И когда со свойственным
            ему оптимизмом приступает к поиску компромиссов, искренне считает,
            что они, возможно, сгладят если не диалектические, то хотя бы
            этические противоречия.
          </UiText>

          <UiText>
            В общении Гуманист старается произвести впечатление человека умного,
            рассудительного, логичного. Часто манипулирует заранее
            заготовленными аргументами.й, которые даются им в принудительном
            порядке.
          </UiText>

          <UiText>
            Гуманист готов манипулировать фактами хотя бы для того, чтобы
            сохранить нужную ему систему отношений. А иначе, как сгладить
            конфликты? Да и так ли уж важны сами факты, если весь смысл
            заключается именно в сути этических отношений. Если во избежание
            конфликта можно исказить факты, которые возможно и проверять-то
            никто не будет — значит, никакой беды в этом нет.
          </UiText>

          <UiText>
            Часто в споре Гуманист держится за чисто абстрактный смысл понятия,
            считая, что никакие конкретные условия не могут исказить или
            изменить его сущность.
          </UiText>

          <UiText>
            И это обстоятельство очень затрудняет дискуссию с представителями
            этого типа. Например: Гуманист не согласен с мнением, что «добро
            должно быть с кулаками». А зачем же с кулаками, если оно — «добро»?
            Добро, в его понимании, — это сама по себе уже сила, которая в любом
            случае должна победить, и поэтому в защите не нуждается. А с
            кулаками может быть только зло, потому что ему больше нечем
            защищаться.
          </UiText>

          <UiText>
            В процессе дуализации со Администратором Гуманист начинает придавать
            большее значение объективной реальности, тем более, что он, в
            принципе, не исключает влияния объективных диалектических законов на
            систему взаимоотношений между субъектами.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">4 — Болевая функция.</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_will" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Воля</UiText>
              <UiText preset="body">Волевая сенсорика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Необходимость постоять за себя требует от Гуманиста чрезмерных
            усилий и напряжения. Ему неимоверно трудно дать волевой отпор.
          </UiText>

          <UiText>
            Гуманист не способен на жесткую интонацию в голосе. Высказаться в
            категоричной форме - для него большая проблема. Его мягкость и
            уступчивость можно рассматривать и как следствие неспособности быть
            жестким и категоричным.
          </UiText>

          <UiText>
            Гуманист очень не любит, когда обсуждают его волевые качества. Ему
            неприятно слышать критические замечания по этому поводу.
          </UiText>

          <UiText>
            И тем не менее внедрение системы его этических ценностей
            предполагает определенное волевое давление. Уж коль скоро Гуманист
            декларирует систему взглядов, которой сам твердо и неукоснительно
            придерживается, это требует от него некоторых волевых усилий.
          </UiText>

          <UiText>
            В этом проявляется проблематичность и противоречивость его
            собственной теории — если Гуманист в принципе против насилия, то
            насаждать свои убеждения силой он просто не имеет права. Он вообще
            не имеет права к чему-либо принуждать.
          </UiText>

          <UiText color="role">
            Гуманист в любом случае старается логически обосновывать свое право
            на волевое давление. Если, например, он в качестве преподавателя
            отвечает за дисциплину и посещаемость своих учеников, он заставит
            себя быть строгим и требовательным. Другой вопрос, чего ему это
            будет стоить!
          </UiText>

          <UiText>
            Гуманисту трудно выговорить человеку что-либо в строгой форме,
            трудно и неприятно сделать замечание.
          </UiText>

          <UiText>
            Каждый раз, когда возникает необходимость постоять за себя, он
            разрывается между реальными обстоятельствами, требующими от него
            немедленных и решительных действий, и внутренней неспособностью,
            нежеланием и неподготовленностью к этим действиям.
          </UiText>

          <UiText>
            Гуманисту иногда нужен тщательно обоснованный и длительный настрой
            на «решительные действия». Часто он в первую очередь рассматривает
            целесообразность таковых действий, ищет какие-то другие варианты
            решения проблемы, на обдумывание которых уходит время, вследствие
            чего момент «решительных действий» бывает упущен, и они становятся
            неактуальными, а за Гуманистом закрепляется репутация человека,
            неспособного постоять за себя.
          </UiText>

          <UiText>
            Причем с этим мнением Гуманист категорически не желает соглашаться и
            пытается переубедить окружающих, стараясь объяснить свою
            нерешительность самыми благими намерениями, что, как правило, еще
            больше усугубляет его проблемы.
          </UiText>

          <UiText preset="large" color="role">
            К факту собственного безволия и бессилия Гуманист относится
            исключительно болезненно.
          </UiText>

          <UiText color="role">
            Ему самому трудно смириться с тем, что эти качества мешают
            реализации и жизненному воплощению его собственной системы взглядов.
            Гуманисту всегда неприятно осознавать факт собственного безволия.
          </UiText>

          <UiText>
            С другой стороны, совершенно невыносима для Гуманиста ситуация
            собственной зависимости от чьей-то воли и власти. И если физическую
            зависимость он еще какое-то время будет терпеть, хотя тоже, смотря
            по обстоятельствам, то моральному давлению не подчинится — «уйдет в
            себя», воздвигнет «психологический барьер», найдет способ сохранять
            только внешнюю видимость отношений, подготавливая себя для
            возможного разрыва с партнером.
          </UiText>

          <UiText>
            Гуманист старается не допускать злоупотребления его терпением,
            кротостью, уступчивостью, смирением. Понимает, что есть предел
            «усмирению собственной гордыни» и есть предел «всепрощению». У
            Гуманиста возникают проблемы с каждым, кто пытается испытать предел
            его уступчивости.
          </UiText>

          <UiText color="role">
            Для Гуманиста очень важно логически понимать: для кого можно и нужно
            делать уступки, и опять же, до какого предела. Логическое осознание
            этого момента ему совершенно необходимо для того, чтобы сохранить
            себя как личность.
          </UiText>

          <UiText>
            Пробивными способностями представители этого типа не обладают,
            «локтями работать» не умеют. Более того, любая рекомендация
            развивать в себе напористость и настойчивость приводит их в крайнее
            раздражение.
          </UiText>

          <UiText>
            Так же обстоит дело и с целеустремленностью. Разумеется, Гуманист
            строит какие-то определенные планы реализации своих возможностей, но
            так, чтобы поставить себе близкую цель, которую во что бы то ни
            стало следует взять, напрягая на это все свои силы и сминая всех и
            вся на своем пути. Этого он себе не позволит — такая
            целенаправленность не входит в систему ценностей Гуманиста.
          </UiText>

          <UiText color="role">
            Чужая целеустремленность может произвести впечатление на Гуманиста,
            но не настолько, чтобы служить примером для подражания: он слишком
            отчетливо понимает, что это не его путь.
          </UiText>

          <UiText preset="large" color="role">
            С другой стороны, Гуманисту приятно находиться рядом с влиятельным
            человеком, он уважает людей, преуспевших в жизни, и сам не упустит
            случая завязать полезные и нужные знакомства.
          </UiText>

          <UiText>
            Тем более, что для себя он очень четко разделяет людей на тех, кто
            соответствует его уровню и с кем стоит общаться всерьез, и тех, кто
            по своим внутренним качествам этого не за;служивает; хотя, следуя
            своей системе отношений, старается быть корректным и
            доброжелательным со всеми. Некоторые представители этого типа
            считают само собой разумеющимся, если при знакомстве человек
            ненавязчиво называет то, что его выгодно отличает от других,
            например: научную степень, должность, почетное звание…
          </UiText>

          <UiText>
            Гуманисту трудно привлечь внимание окружающих к своим проблемам, не
            выходя за рамки собственной теории. Периодически возникают тупиковые
            ситуации, когда даже демонстративное смирение и терпение его не
            выручают; когда простым сочувствием окружающих его проблемы уже не
            решаются, а собственной деловой активности явно не хватает.
          </UiText>

          <UiText>
            В такой ситуации Гуманисту крайне необходим партнер, способный
            активно взять на себя защиту его интересов, способный деятельно
            решить его проблемы, взять его под свое покровительство. Гуманист
            ищет покровительства, ему нужен защитник и он не считает зазорным
            пользоваться помощью, предложенной от чистого сердца.
          </UiText>

          <UiText>
            Гармоничнее всего в этом плане происходит взаимопонимание Гуманиста
            с его дуалом Администратором, который с готовностью «берет под свое
            крыло», очень любит опекать и делом, и советом.
          </UiText>

          <UiText>
            В проявлении заботы о Гуманисте демонстративная волевая сенсорика
            Администратора находит свое наилучшее применение.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">5 — Внушаемая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_business" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Практика</UiText>
              <UiText preset="body">Деловая логика</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Понятие «деловая логика» у Гуманиста в первую очередь сводится к
            аспекту деловых отношений.
          </UiText>

          <UiText>
            На вопрос, что и как нужно делать, он ответит примерно так: «Нужно
            делать то, что от тебя конкретно требуется, и так, чтобы тобой были
            довольны». Гуманист предпочитает, чтобы партнер выражал свое мнение
            не в форме размышлений, а четкими короткими формулировками, давал
            конкретные деловые предложения.
          </UiText>

          <UiText>
            Гуманист очень старателен, исполнителен. Неукоснительно следует
            заданным методикам: как его научили — так и будет делать.
          </UiText>

          <UiText color="role">
            Прорабатывая детали, Гуманист часто упускает момент, когда работа
            уже сделана достаточно качественно и пора остановиться. Хорошо, если
            есть надежный человек, на мнение которого в этой ситуации можно
            положиться. В противном случае, стремление довести работу до
            совершенства может привести к прямо противоположным результатам.
          </UiText>

          <UiText>
            Гуманист очень ценит хорошо организованные условия труда — одна из
            причин, по которой ему удобнее всего сотрудничать со Администратор.
          </UiText>

          <UiText>
            Обычно создающим для своих работников самые удобные условия для
            успешной и продуктивной деятельности
          </UiText>

          <UiText>
            Гуманист старается отдавать работе столько сил, сколько потребует ее
            самое тщательное и самое качественное выполнение. Поэтому может
            остаться и на сверхурочные — для того, чтобы закончить ее в срок.
          </UiText>

          <UiText>
            Иногда это единственный способ выполнить непомерный объем работы,
            задаваемый Администратором.
          </UiText>

          <UiText>
            Гуманисту обычно «неудобно» отказываться от дополнительных нагрузок,
            поэтому его нередко эксплуатируют.
          </UiText>

          <UiText>
            Гуманисту очень важно, чтобы его деловой энтузиазм был должным
            образом оценен. Руководителю, который демонстративно игнорирует его
            исключительное усердие, он никогда ни доверять, ни симпатизировать
            не будет. Более того, такие отношения со временем скажутся на
            результатах его работы и на его трудовой дисциплине.
          </UiText>

          <UiText preset="large" color="role">
            Чувство внутреннего протеста также вызывает работа, которую он
            считает слишком примитивной для своих способностей, интеллекта,
            положения. Поручение такой работы он воспринимает как личную обиду.
          </UiText>

          <UiText>
            Гуманист обычно не любит скрупулезно проверять результаты работы:
            пусть это лучше сделает компетентный и надежный партнер. Но если
            такого человека нет, приходится лично удостоверяться, что все
            сделано как надо.
          </UiText>

          <UiText>
            Отчитываясь за проделанную работу, акцентирует особое внимание на
            недостатках и нерешенных проблемах, тем самым давая понять, что он
            может сделать еще лучше.
          </UiText>

          <UiText>
            Для Гуманиста очень важно чувство солидарности в его деловых
            отношениях. Причем не только с сослуживцами, но и с руководством.
            Если его руководитель хотя бы даже «играет» в демократию, Гуманисту
            этого уже вполне достаточно.
          </UiText>

          <UiText>
            Гуманист о своих деловых качествах очень скромного мнения, поэтому
            всегда благодарен «за подсказку». Советами по деловой логике очень
            внушается. Иногда даже относится к ним некритично. Если, например,
            ему кто-то «подсказал», что нужно хранить почтовые квитанции, будет
            хранить, пока сам не сообразит, что это ему не нужно.
          </UiText>

          <UiText preset="large" color="role">
            Всегда очень внимателен к деловым рекомендациям. Если ему
            рекомендуют торговую фирму, товары которой дороги, но практичны, он
            будет покупать там.
          </UiText>

          <UiText color="role">
            Но Гуманиста можно иногда увидеть и на дешевой распродаже, и в
            «комиссионках», где он также ищет себе недорогие, но добротные вещи.
          </UiText>

          <UiText>
            Поддержание порядка в доме требует от него много сил, как хорошо,
            если бы этим занимался кто-нибудь другой, но если этого другого нет
            — вынужден все делать сам.
          </UiText>

          <UiText>
            Не терпит в доме лишних, ненужных вещей, и всего того, что с его
            точки зрения уже не обладает никакой ценностью — беспощадно их
            выбрасывает. Но то, что, с его точки зрения, представляет хоть
            какую-то ценность, бережно хранится в доме. Гуманист умеет быть
            экономным, умеет дорожить тем, что имеет.
          </UiText>

          <UiText>
            Гуманист не любит торговаться, но не упустит возможности робко
            поинтересоваться, нельзя ли снизить цену. И если можно, он очень
            деликатно об этом попросит.
          </UiText>

          <UiText>
            Брать деньги в долг Гуманист не любит, но сам с готовностью дает
            взаймы, если может. Довольно часто ему бывает трудно взыскать с
            должника. Если это мелкая сумма, он может даже смириться с ее
            потерей, но если это крупный долг, Гуманист найдет способ деликатно
            и ненавязчиво напомнить о нем: «Те триста долларов, что я тебе
            одолжил, можешь пока подержать до следующего месяца».
          </UiText>

          <UiText>
            Гуманист всегда благодарен партнеру, который способен подсказать
            ему, что нужно сделать и как следует поступить в каждой конкретной
            ситуации.
          </UiText>

          <UiText>
            Его не устроят общие фразы о том, как надо или как не надо жить.
            Черта, свойственная его конфликтеру Лидеру: такой подход к решению
            жизненных проблем Гуманиста только раздражает.
          </UiText>

          <UiText>
            Другое дело, когда по каждому конкретному поводу он получает четко
            выверенные, многократно проверенные и предельно ясно и методично
            изложенные рекомендации, которые он может с полной уверенностью
            применять как руководство к действию.
          </UiText>

          <UiText>
            Именно в таком ракурсе он получает информацию от своего дуала
            Администратора, и именно такого рода информация Гуманисту нужна
            постоянно и крайне для него важна.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">
            6 — Активационная функция
          </UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_comfort" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Комфорт</UiText>
              <UiText preset="body">Сенсорика ощущений</UiText>
            </span>
          </div>

          <UiText preset="large" color="role">
            Наблюдаются определенные трудности у представителей этого типа с
            благоустройством собственного быта, хотя, разумеется, Гуманиста
            можно приучить поддерживать порядок в доме и он добросовестнейшим
            образом будет относиться к этой своей новой обязанности.
          </UiText>

          <UiText color="role">
            В области эстетики у представителей этого типа также далеко не все
            обстоит благополучно, поэтому они с благодарностью принимают любую
            помощь и любую информацию по этому аспекту.
          </UiText>

          <UiText>
            Представитель этого типа может всю жизнь прожить бок о бок с
            партнером-сенсориком и все равно в области сенсорных ощущений он
            будет делать грубейшие ошибки, если его не научить, как их избегать.
          </UiText>

          <UiText>
            Представители этого типа часто бывают равнодушны к своему внешнему
            виду. Основное их требование к себе: не выделяться и не одеваться
            вызывающе.
          </UiText>

          <UiText color="role">
            Главное — не раздражать своим видом окружающих и ни у кого не
            возбуждать лишних эмоций, поэтому они стараются одеваться скромно,
            неброско, удобно и опрятно. Очень боятся ярких цветовых сочетаний,
            предпочитают спокойные, нейтральные тона.
          </UiText>

          <UiText preset="large" color="role">
            Женщины этого типа предпочитают выглядеть естественно и потому очень
            неохотно пользуются косметикой.
          </UiText>

          <UiText>
            Многие из них выглядят значительно старше своего возраста, поскольку
            редко прилагают какие-либо усилия для того, чтобы выглядеть моложе.
          </UiText>

          <UiText>
            Гуманист, который обычно не любит бегать по инстанциям и просить за
            себя, проекты Администратора пробивает с исключительной энергией.
          </UiText>

          <UiText color="role">
            С кулинарными изысканиями у представителей этого типа тоже возникают
            трудности. Очень часто в их изделиях ощущается «недовложение» или
            «перебор» некоторых ингредиентов.
          </UiText>

          <UiText>
            Бывает, что они готовят слишком постную пищу, потому что боятся
            высокой калорийности или экономят на продуктах. Бывает наоборот -
            готовят чрезмерно жирную пищу, потому что в противном случае у них
            все подгорает.
          </UiText>

          <UiText>
            Часто они доверяют не столько своему вкусу, сколько своим знаниям:
            «Я не знаю, сколько нужно соли на такое количество».
          </UiText>

          <UiText color="accent">
            «Я, конечно, могу посолить, ну а если это потом покажется кому-то
            слишком соленым? Впрочем, как правило, своими неудачами в этой
            области они особенно не смущаются и с готовностью выслушивают
            конструктивные замечания и советы, сделанные в деликатной и
            доброжелательной форме.»
          </UiText>

          <UiText color="role">
            Гуманист предпочитает вести здоровый образ жизни, заниматься
            спортом, следить за режимом питания, за своим самочувствием. И тем
            не менее ему всегда нужен кто-то, кого бы интересовало состояние его
            здоровья.
          </UiText>

          <UiText preset="large" color="role">
            Гуманист очень ценит, когда кто-то другой заботится о его комфорте,
            о его питании. Ему нужно, чтобы кто-то создавал ему уют и время от
            времени напоминал, что ему не мешает позаботиться и о себе.
          </UiText>

          <UiText>
            Именно таким партнером для него является Администратор, от природы
            наделенный прекрасным вкусом, умеющий создавать уют и заботиться о
            своих близких. Администратор великолепно решает бытовые и
            эстетические проблемы Гуманиста.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">7 — Функция защиты</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_emotions" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Желание</UiText>
              <UiText preset="body">Этика эмоций</UiText>
            </span>
          </div>
          <UiText preset="large" color="role">
            Сфера наблюдения Гуманиста — эмоции человека, его чувства, состояние
            его души.
          </UiText>

          <UiText>
            Гуманист всегда очень тонко подмечает настроение, душевное
            состояние, чувства и переживания человека. Смысл самих слов при этом
            для него никакого значения не имеет. Он убеждается только тем, что
            лично наблюдает, мимикой человека и его интонациями.
          </UiText>

          <UiText>
            Гуманист умеет приспосабливать свое эмоциональное состояние к
            эмоциям и переживаниям другого человека. Умеет снять раздражение,
            напряжение, умеет успокоить.
          </UiText>

          <UiText>
            Своих собственных эмоций в общении старается не навязывать,
            поскольку сопереживает в первую очередь эмоциональному состоянию
            других. С грустными он грустен, с веселыми — весел. Считает, что
            испортить человеку настроение — значит, обидеть его, поступить с ним
            неэтично.
          </UiText>

          <UiText preset="large" color="role">
            У Гуманиста вообще на этот счет своя теория.
          </UiText>

          <UiText color="accent">
            Например, если человек сделал неудачную покупку, ему об этом
            говорить не следует: все равно ведь уже ничего не поправишь, а
            настроение у человека может испортиться, а это нехорошо.
          </UiText>

          <UiText>
            Гуманист не позволит себе быть для кого-то источником неприятных
            эмоций: не любит никого намеренно раздражать или дразнить. Более
            того, не позволит никому из своих близких раздражать или дразнить
            других.
          </UiText>

          <UiText>
            Гуманист не злопамятен, не завистлив. Он искренне радуется чужим
            удачам и успехам.
          </UiText>

          <UiText>
            Не ревнив и очень доверчив. Но злоупотреблять его доверием — значит,
            жестоко оскорбить его. Очень тяжело переживает разочарование в
            людях.
          </UiText>

          <UiText preset="large" color="role">
            В любви и в дружбе отличается исключительной преданностью и
            самоотверженностью.
          </UiText>

          <UiText>
            Старается, чтобы его собственные неприятности не испортили
            сложившихся вокруг него отношений, поэтому в выражении своих
            отрицательных эмоций очень осторожен. Скорее пожалуется постороннему
            человеку, чем близкому. Точно так же свои глубинные страхи и
            проблемы скорее выскажет постороннему.
          </UiText>

          <UiText>
            Сочувствуя и сопереживая другому, проявляет максимум такта и
            терпения. Выражает соболезнование всегда в очень тактичной и
            деликатной форме, чтобы не разбередить чужую боль.
          </UiText>

          <UiText color="role">
            Плачущего человека всегда терпеливо успокоит, даст ему выплакаться,
            не призывая к сдержанности и не требуя «взять себя в руки».
          </UiText>

          <UiText preset="large" color="role">
            Собственное горе старается переносить мужественно и не афишировать.
          </UiText>

          <UiText>
            С возрастом представителям этого типа труднее сдерживать свои
            отрицательные эмоции.
          </UiText>

          <UiText>
            Гуманист обычно не ставит себе задачи развеселить кого-то или
            рассмешить, старается поддерживать ровное настроение у окружающих.
          </UiText>

          <UiText>
            Вспыльчивость и раздражение проявит только в самом исключительном
            случае — только будучи глубоко уязвленным. Как форму общения считает
            для себя недопустимым.
          </UiText>

          <UiText color="role">
            Всегда осуждает грубый тон и бесцеремонное поведение.
          </UiText>

          <UiText>
            Не терпит злословия, всегда старается его пресечь в мягкой,
            тактичной форме. Обычно не сплетничает и «косточки не перемывает»,
            даже для того, чтобы поддержать разговор. Осуждает это качество у
            других. Если и считает нужным что-то сказать про человека, всегда
            думает о последствиях своей информации.
          </UiText>

          <UiText color="role">
            Очень сентиментален. Мелодрама, в которой добро побеждает зло, — его
            излюбленный жанр. Очень любит многосерийные телесериалы, в которых
            действуют персонажи с ярко выраженными в этическом плане
            характерами.
          </UiText>
        </section>

        <section>
          <UiText preset="small" color="accent">8 — Фоновая функция</UiText>
          <div class="aspect-title">
            <UiSvg name="aspect_time" color="accent" size="80" />
            <span>
              <UiText preset="subtitle" color="accent">Чутьё</UiText>
              <UiText preset="body">Интуиция времени</UiText>
            </span>
          </div>

          <UiText>
            Обстоятельствам времени Гуманист придает особое значение, поскольку
            подсознательно он призван «обслуживать» слабую интуицию времени
            своего дуала Администратора.
          </UiText>

          <UiText>
            Назначая встречу, Гуманист старается как можно точнее обговорить все
            обстоятельства времени и места, чтобы не возникло никакой путаницы и
            чтобы никого не заставить ждать.
          </UiText>

          <UiText>
            Гуманист не любит заставлять ждать и не любит, когда его заставляют
            ждать.
          </UiText>

          <UiText color="role">
            Некоторые из представителей этого типа обладают феноменальной
            памятью и могут даже в преклонном возрасте подробно описать события,
            происходившие с ними в раннем детстве, последовательно
            восстанавливая в памяти все обстоятельства до мельчайших
            подробностей.
          </UiText>

          <UiText>
            К планированию своего и чужого времени Гуманист относится очень
            серьезно.
          </UiText>

          <UiText color="accent">
            Например, он может отказаться от выгодного, но долговременного
            контракта, опасаясь, что за такой срок в его планах могут произойти
            изменения и он не сможет выполнить взятые на себя обязательства.
          </UiText>

          <UiText preset="large" color="role">
            При всей своей мечтательности и отрешенности, никогда не забывает о
            назначенных встречах и запланированных делах. Более того, он
            постоянно напоминает другим о том, что и когда нужно сделать.
          </UiText>

          <UiText color="accent">
            Иногда создается впечатление, что это не человек, а «ходячие часы»:
            «Уже полдевятого, почему ты еще дома?!», «Сейчас уже семь часов,
            тебе же пора принимать лекарство!», «Не забудь, он просил
            перезвонить до полудня!», «Сегодня восьмое число, не забудь завтра
            заплатить за квартиру».
          </UiText>

          <UiText>
            Старается все делать своевременно, даже демонстративно своевременно:
            «Надо прийти пораньше, а то вдруг он придет раньше и будет
            волноваться, что нас еще нет!»
          </UiText>

          <UiText>
            Гуманист терпеть не может спешки, он старается предельно точно
            рассчитать время работы, с тем чтобы выполнить задание точно в срок.
            Если какие-то объективные обстоятельства вынуждают его вносить в
            свои планы коррективы, он мобилизует все силы для того, чтобы не
            «выбиться из графика».
          </UiText>

          <UiText>
            Отклониться от своего «графика» он может только, если это
            потребуется в интересах его личных отношений.
          </UiText>

          <UiText color="accent">
            Например, если его друзьям потребуются помощь и сочувствие именно в
            то время, когда он делает срочную работу, Гуманист окажется в крайне
            затруднительном положении.
          </UiText>

          <UiText color="role">
            Гуманист берет на себя заботу о распорядке дня своего партнера. Если
            партнер имеет обыкновение, увлекаясь работой, забывать об отдыхе,
            Гуманист, как заведенные часы, вовремя напомнит, что пора уже и
            отдохнуть и поесть.
          </UiText>

          <UiText>
            Если партнер не внушается его напоминаниями, Гуманист применяет
            решительные меры.
          </UiText>

          <UiText>
            Он применяет решительные меры и тогда, когда кто-то из его близких
            резко отклоняется от нормального и здорового режима дня:
          </UiText>

          <UiText color="accent">
            «Обычно во время школьных каникул бабушка нам позволяла просыпаться
            попозже, и нам нравилось ее испытывать, сколько она разрешит нам
            залеживаться в постели. И вот, когда наступало «критическое время»,
            бабушка, обычно уже рассерженная, врывалась в нашу спальню и
            «будила» нас самым решительным образом, хотя по природе была
            человеком очень мягким и деликатным».
          </UiText>

          <UiText>
            Гуманист всегда раздражается, если кто-то не считается с его личным
            временем. Сам он никогда не позволит себе чужим временем
            злоупотребить.
          </UiText>

          <UiText color="accent">
            Бабушка, из приведенного выше примера, особенно сердилась на своих
            внуков за то, что в ожидании их «пробуждения», ей приходилось по
            нескольку раз разогревать им завтрак, в то время, как у нее была еще
            масса других запланированных дел.
          </UiText>

          <UiText>
            Забота Гуманиста о времени окружающих его людей — это в первую
            очередь форма выражения своего отношения к ним, это непременное
            условие его этической программы, этической гармонии с партнером.
          </UiText>

          <UiText>
            Уделить время человеку для того, чтобы помочь ему, поддержать,
            утешить его, посочувствовать ему, - это, в понимании Гуманиста,
            большой и щедрый подарок, который уже сам говорит за себя. И именно
            этот подарок лучше всего оценивается его дуалом Администратора.
          </UiText>
        </section>
      </VariousTabContent>
    </VariousContentContainer>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  gap: 24px;

  .tab {
    display: flex;
    flex-direction: column;
    gap: 24px;

    .aspect-title {
      display: flex;
      flex-direction: row;
      align-items: center;
      gap: 0px;
      width: 100%;
      background-color: colors.$beige-tone;
      margin-bottom: 12px;
    }
  }

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
