<template>
  <div class="text">
    <section>
      <UiText preset="body" color="accent">
        Описания не должны обязательно совпадать со всеми чертами характера
        личности.
      </UiText>

      <UiText preset="small" color="accent">
        Идея как раз описать наблюдаемые у среднего представителя типа
        особенности поведения и обработки информации психикой.
      </UiText>

      <UiText preset="small" color="accent">
        Автор описания — Велта Микелсоне
      </UiText>
    </section>

    <section>
      <UiText preset="subtitle" color="role">
        Миссия — своим личным этическим поведением быть примером для других.
      </UiText>

      <br />

      <UiText>
        Добрый человек, чувствующий людей и способный понять самого отъявленного
        злодея. По характеру он внимательный, не настойчивый и спокойный
        человек.
      </UiText>

      <UiText preset="large" color="role">
        Прирожденный знаток людей, распознающий отношения и атмосферу между
        ними. Он может найти общий язык даже с самыми неуживчивыми людьми.
      </UiText>

      <UiText preset="large" color="role">
        В неизвестной ситуации перед тем, как начать общение, наблюдает за
        интонациями голоса, жестами, нюансами поведения присутствующих.
      </UiText>

      <UiText>
        Может заслужить доверие и стать доверенной персоной для многих, сохраняя
        при этом своё собственное «Я». В общении не показывает отрицательного
        отношения к кому либо, со всеми старается поддерживать ровные и
        благожелательные отношения.
      </UiText>

      <UiText preset="large" color="role">
        Готов простить обидчика. В споры других не вмешивается, сам старается их
        избегать, беспристрастно успокаивает спорящих.
      </UiText>

      <UiText>
        Старается понять истинные причины недоразумений, вникнуть в ситуацию,
        взвесить сложившиеся обстоятельства.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Способен снимать с других напряжение.
      </UiText>

      <UiText>
        Люди с удовольствием с ним встречаются, ища у него поддержки и совета.
        Он, как никто другой обладает способностями к эмпатии – умению
        сочувствовать состоянию человека. Чувствует себя неловко, если не может
        успокоить или помочь другому.
      </UiText>

      <UiText preset="large" color="role">
        Близкие часто пользуются его бескорыстием.
      </UiText>

      <UiText>
        У Гуманиста бывают много знакомых, но настоящих друзей у него немного.
        Он осторожен в отношениях и не каждому позволяет приблизится близко.
        Того, кто однажды его обманул или предал, полностью не исключает из
        своего круга знакомых, но присваивает ему другой статус.
      </UiText>

      <UiText>
        Непритязательный и сдержанный. Влюбляется моментально, но не осознает
        важность отношений. Фактически, в первой фазе отношений, внутренне их
        отвергает, будто боится.
      </UiText>

      <UiText preset="large" color="role">
        У него утонченный и богатый внутренний мир переживаний и эмоций.
      </UiText>
    </section>

    <section>
      <UiText>
        Свои действия главным образом подчиняет голосу сердца, а не разуму. Ему
        присуще постоянное самосовершенствование. Приспосабливается к взглядам и
        привычкам партнера, если это не противоречит его мировоззрению и
        убеждениям. В противном случае он ловко уклоняется от отношений.
      </UiText>

      <UiText preset="large" color="role">
        Всегда у него на примете то, чем он будет заниматься.
      </UiText>

      <UiText>
        Никому не навязывает своего присутствия. Ненавязчивым замечанием может
        добиться желаемого, но если работа связана с большим числом людей
        чувствует свою энергию израсходованной.
      </UiText>
    </section>

    <section>
      <UiText>
        Близким дарит истинное сердечное тепло и любовь. Ему неприятны грубые,
        небрежные, безнравственные люди, он охотно пытается их воспитывать.
        Способен предчувствовать и догадываться о внутреннем смысле процессов.
      </UiText>

      <UiText>
        Он хорошо понимает отношение других людей к себе, способен предвидеть их
        поведение. У него врожденные способности воспитателя и психолога.
      </UiText>

      <UiText preset="large" color="role">
        Помогает другим развить их положительные качества. В его присутствии
        люди чувствуют себя непринужденно.
      </UiText>

      <UiText>
        Он идеалист. Для себя ставит высокие требования, но к поступкам других
        терпелив, замечает их, выслушивает и дает ценный совет.
      </UiText>

      <UiText preset="large" color="role">
        Один из самых тихих, терпеливых и снисходительных типов.
      </UiText>

      <UiText>
        Четко знает, что хорошо и что плохо, свои взгляды другим не навязывает.
        Однако в случаях, когда управляет процессами, способен вовлечь других в
        работу и выразить свои мнения. Считает, что детей своевременно следует
        приучить к порядку, но этого он добивается гуманными путями, без
        насилия.
      </UiText>

      <UiText>
        Он считает, что нужно заботится о развитии ребенка, способствуя его
        творческому и культурному развитию.
      </UiText>

      <UiText>
        Гуманист считает, что супружеская жизнь должна быть в согласие и
        сопровождаться взаимным пониманием и любовью, и в ней нет места
        вульгарности и диктату. Ему необходимо, чтобы вокруг него находились
        люди, обладающие сходными ценностями и моралью.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">Ярко выражено самопознание.</UiText>

      <UiText>
        Его увлекает психология и философия, поскольку это дает возможность
        духовно совершенствоваться и освободиться от внутреннего напряжения.
      </UiText>

      <UiText>
        Он не может находиться в противоречии – исповедовать в словах одни
        ценности, а действовать по другим принципам.
      </UiText>

      <UiText preset="large" color="role">
        В юности его увлекают гуманитарные науки и необычные теории.
      </UiText>

      <UiText>
        Осознает свои сильные и слабые стороны, но от других это скрывает.
      </UiText>

      <UiText>
        Если чувствует обиду, ограждает себя психологическим барьером, может
        ходить угрюмым с мраморным выражением лица. Часто увлекается
        фотографией, даже на профессиональном уровне. Он умеет уловить
        интересные моменты, скрытые от глаз других.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Способен решать сложные задания, но не умеет объяснить их другим.
      </UiText>

      <UiText>
        Если ему удалось что-то сделать, может по-детски похвастаться. Ситуации,
        которые другие воспринимают спокойно, он иногда преувеличивает или
        слишком критически воспринимает их.
      </UiText>

      <UiText>
        Сложные ситуации предпочитает решать сам, и не осознает, что добиться
        результатов одному ему сложно. Он застревает в данном процессе, а
        освободится он может лишь с помощью других. Достоевского интересуют
        тайны мира и вселенной. Он собирает и обобщает информацию, в результате
        имеет своё устойчивое мнение по любому вопросу. С удовольствием изучает
        научно-популярную литературу, прочитанное обсуждает с другими.
        Достоевскому характерно нетрадиционное мышление, он генерирует необычные
        идеи.
      </UiText>

      <UiText preset="large" color="role">
        Смущается, если слышит публичные похвалы и выражения симпатии, в такие
        моменты желает незаметно исчезнуть.
      </UiText>

      <UiText>
        Не уверен в своей внешности. Ему необходимо слышать подтверждения, на
        сколько хорошо он выглядит — привлекательный, утонченный. Тогда он
        почувствует себя уверенным. Не умеет защищать свои материальные
        интересы.
      </UiText>

      <UiText>
        Ему необходимо осваивать новые навыки (может несколько раз в жизни
        кардинально менять профессии).
      </UiText>

      <UiText preset="large" color="role">
        Нерешительный, поэтому не настаивает на том, что точно не знает.
      </UiText>

      <UiText>
        Долго думает перед тем как принять решение, но поскольку желания у него
        непостоянны, часто их меняет.
      </UiText>

      <UiText>
        В течении жизни старается развить волю и выносливость. Не терпит
        насилия, поэтому не заставляет других делать то, чего они не хотят. Ему
        необходимо быть твердо уверенным в своей идее или цели, тогда способен
        быть настойчивым и даже упорным до конца, и требует этого от других.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">Плохо переносит стресс.</UiText>

      <UiText>
        В экстремальной обстановке становится нервным. Если близкие Гуманиста
        попали в беду, тогда он способен быстро реагировать. В такие моменты не
        чувствует страха. У Достоевского страх приходит как бы с опозданием,
        осознает происходящее только тогда, когда опасность уже миновала.
        Бывает, что это вызывает у других шок, а сам он испытывает
        удовлетворенность.
      </UiText>

      <UiText>Нуждается в самоутверждении.</UiText>

      <UiText preset="small" color="accent">
        Среди представителей данного социотипа много журналистов, которые рискуя
        своей жизни отправляются в самые горячие точки событий. Женщины, не
        получив семейного счастья, могут выбрать военную карьеру и
        демонстрировать примерное поведение, подобно мужчинам.
      </UiText>

      <UiText preset="large" color="role">
        Берет на себя слишком много обязанностей, поэтому часто переутомляется.
      </UiText>

      <UiText>
        Не умеет рассчитывать количество и трудоемкость работы, поэтому
        контролирует время после сделанного. Достоевскому сложно подстраиваться
        под ритм другого.
      </UiText>

      <UiText>
        Не обращает внимание на отдельные мелкие детали, их проработка наводит
        на него скуку. Желает, чтобы его работа была оценена по достоинству и не
        подвергалась критике. Переживает, если это не происходит, может даже
        заболеть. Гуманист нуждается в партнере, который может четко и
        однозначно объяснить, что делать.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Красота и удобство в окружение придают ему силы, нуждается в приятных
        ощущениях.
      </UiText>

      <UiText>
        Всегда сам может создать для себя уютную обстановку. С другой стороны
        необходимо заметить, что он не требователен к быту, может обходиться без
        лишнего комфорта.
      </UiText>

      <UiText>
        Осторожно выбирает себе одежду, не покупает ничего лишнего. Одевается
        неброско. Он не одевается в яркие и вызывающие тона. Болезненно
        переживает по поводу замечаний о его внешности.
      </UiText>

      <UiText preset="small" color="accent">
        Некоторым сегодняшним мужчинам-Гуманистам свойственен своеобразный стиль
        — волосы собранные в косу или в них вплетены искусственные тесемки, в
        любое время года надета шапка, на спине — рюкзак, который обычно
        заполнен, брюки в дырках, как правило больше по размеру, и ботинки на
        толстых подошвах. Довольно часто они предпочитают передвигаться на
        велосипеде. Он не спорит о чужих вкусах и свои никому не навязывает.
      </UiText>

      <UiText preset="large" color="role">
        Не пропустит регулярную спортивную тренировку для поддержания физической
        формы.
      </UiText>

      <UiText preset="small" color="accent">
        Особенно мужчины — считают, что его организм требует регулярное занятие
        сексом, и это нельзя пропустить. Искусно подбирает слова и интонацию
        речи. Он верит не столько словам, но и мимике, интонации голоса и
        личному отношению к нему.
      </UiText>

      <UiText>
        Умеет распознать серьезные отношения от кратковременного удовольствия.
        Он умеет выделить время для работы и развлечений. Пунктуальный, не
        опаздывает, выполняет свои обещания, побуждая окружающих действовать так
        же.
      </UiText>

      <UiText>
        Если время бесцельно проходит, поторапливает других. От общества ожидает
        того, в чем нуждается.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Если личные интересы удовлетворены, способен быть правдивым и полезным
        обществу.
      </UiText>

      <UiText>
        В противном случае становится невыносимым демагогом, занудой и
        одиночкой.
      </UiText>

      <UiText preset="large" color="role">
        У него отличная память на цифры, схемы и структурированную информацию.
      </UiText>

      <UiText>
        Он умело собирает необходимое количество информации из верных
        источников, чтобы понять, с чем он имеет дело. Замечает противоречия,
        нелогичность и манипуляцию фактами.
      </UiText>

      <UiText>
        Не склонен спорить. Но при возникновении спора не позволит унизительно
        высказаться о его умственных способностях или опыте, отстаивает свою
        позицию до конца, ему необходимо доказать свою правоту.
      </UiText>

      <UiText preset="large" color="role">
        Ему важно подтвердить свою уникальность. Он быстро находит новые
        возможности.
      </UiText>

      <UiText>
        Исправляет и дополняет всё в быту, чтобы облегчить жизнь. Интересуется
        новинками, совершенствует и улучшает эффективность производства,чтобы
        ускорить процессы.
      </UiText>

      <UiText preset="large" color="role">
        Исправляет и дополняет всё в быту, чтобы облегчить жизнь. Интересуется
        новинками, совершенствует и улучшает эффективность производства,чтобы
        ускорить процессы.
      </UiText>

      <UiText>
        Умело выбирает лучшие по содержанию справочники, энциклопедии и другие
        книги. Его увлекает фантастика и приключения.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
