<template>
  <div class="text g-page">
    <section>
      <UiText preset="large" color="role">
        Ваша сильная сторона — решительность и предприимчивость. У вашего типа
        личности часто присутствует склонность к лидерству.
      </UiText>

      <UiText>
        Вы не боитесь взять на себя инициативу руководства людьми для решения
        крупных задач. Вы всегда уверены в себе.
      </UiText>

      <UiText>
        Вы умеете постоять за себя, отстоять свой авторитет от несправедливых
        нападок. Вы активно заботитесь о насущных интересах своих близких, чтобы
        обеспечить им хороший уровень жизни.
      </UiText>

      <UiText>
        Своими деловыми, организаторскими способностями вы привлекаете внимание
        людей к себе. У вас большой круг знакомых, среди которых вы пользуетесь
        уважением и доверием. Хорошо чувствуя деловые качества людей, вы умеете
        правильно использовать их в интересах дела.
      </UiText>
    </section>

    <section>
      <UiText>
        В жизни у вас возникают трудности из-за того, что в потоке дел, которыми
        вы занимаетесь, вам не всегда удаëтся отделить главное от
        второстепенного. Это ведет в конечном итоге к напрасной трате сил и
        переутомлению.
      </UiText>

      <UiText preset="large" color="role">
        Вам нужно развивать в себе усидчивость и терпение. Старайтесь доводить
        начатое до конца, прежде чем браться за что-то новое.
      </UiText>

      <UiText>Не пытайтесь каждое дело решать немедленно, наскоком.</UiText>

      <UiText preset="large" color="role">
        Будьте последовательны, используйте разные пути и подходы к решению
        трудных проблем.
      </UiText>

      <UiText>
        Больше занимайтесь самообразованием, повышайте свою теоретическую
        подготовку. Это позволит вам избежать обвинений в некомпетентности и
        укрепит ваш авторитет.
      </UiText>

      <UiText>
        Концентрируйте своё внимание на крупных проблемах, не тратьте энергию на
        незначительные дела и споры по пустякам.
      </UiText>

      <UiText>
        Не принимайте поспешных решений, стремитесь проанализировать обстановку
        в целом, прежде чем действовать.
      </UiText>

      <UiText>
        Проявляйте больше объективности в оценке заслуг каждого человека.
        Субъективность ваших оценок может привести к нежелательным конфликтным
        ситуациям в коллективе.
      </UiText>
    </section>

    <section>
      <UiText preset="large" color="role">
        Другая ваша проблема связана с тем, что вы слишком болезненно
        воспринимаете критику в свой адрес.
      </UiText>

      <UiText>
        Будучи человеком ранимым и обидчивым, вы остро реагируете на безобидные
        замечания, что осложняет ваши отношения с людьми.
      </UiText>

      <UiText>
        Вы склонны к чрезмерно высокой оценке своих физических и
        интеллектуальных способностей. Более критически оценивайте свои
        потенциальные возможности, ведь переоценка сил может привести вас к
        нервному или физическому истощению.
      </UiText>

      <UiText>
        Проявляйте большую разборчивость в своих знакомствах с людьми, чтобы
        избежать опасности быть скомпрометированным.
      </UiText>

      <UiText preset="large" color="role">
        Воспитывайте умеренность в своих желаниях.
      </UiText>

      <UiText>Помните, что нельзя объять необъятное.</UiText>

      <UiText>
        Чтобы избежать угрызений совести, старайтесь не ронять своё достоинство
        даже в интересах дела.
      </UiText>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@use "@shared/styles/variables/colors";

.text {
  display: flex;
  flex-direction: column;
  gap: 24px;

  section {
    display: flex;
    flex-direction: column;
    gap: 12px;
    padding-bottom: 16px;
    border-bottom: solid 1px colors.$grey;
  }
}
</style>
